{"App Title": "The Key", "App description": "***Winner Tribeca Film Festival  Storyscapes Award *** \n** Winner Grand Jury Prize for Best VR Venice Film Festival**\n*Narrated by Alia Shawkat*\n\nMeet Anna. Anna doesnt remember her past, but she has vivid dreams about it. In every one of her dreams, there is a mysterious Key. Will you be able to unlock the mystery behind The Key without sacrificing too much?\n\nThe Key is a magical realism experience that will take you on a journey through dreams, facing challenges and difficult decisions, leading to a shocking reveal. The Key is NOT a video game. So relax, and let the story guide you.\n\n(20-minute, standing interactive theatrical VR experience) \n\n10' x 10' play area recommended - Touch things to interact - hold the trigger to teleport\n\nOne of Tribeca's breakout successes - CNET\n\nOf particular note are the superbly executed virtual reality technical details, including character design, use of color, and sound design.\nJury - Tribeca Film Festival", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Adventure, Documentary & History, Narrative", "Languages": "English", "Version": "1.0.0-99112", "Developer": "Lucid Dreams Productions", "Publisher": "Lucid Dreams Productions", "Website": "http://www.luciddreamsprod.com/", "Release Date": "April 16, 2020", "Developer Privacy Policy": "None", "Developer Terms of Service": "END USER LICENSE AGREEMENT\n\nEND USER LICENSE AGREEMENT\n\nLast Updated: February 14th, 2020\n\nBy installing, copying, or otherwiseusing a software product(a Software Product) developed by Lucid Dreams Productions, LLC (Developer, we, or us), you are accepting the terms of this End User License Agreement (this EULA or these Terms) in connection with that Software Product. We are delighted to provide you access to the Software Product you downloaded for your personal use. Before installing a Software Product, please make sure that your computer meets the minimum technical specifications for the proper operation of the Software Product.\n\nYour use of a Software Product is also subject to the applicable terms of use and privacy policies for the platform or store where you downloaded the Software Product (the Software Platform), whichcould include, without limitation, any of the followingagreements:\n\nThe Oculus Terms of Service:https://www.oculus.com/legal/terms-of-service/;\n\nThe Steam Subscriber Agreement:http://store.steampowered.com/subscriber_agreement/;\n\nThe Google Terms of Service:https://www.google.com/intl/en/policies/terms/; and\n\nThe Samsung VR Terms of Service:https://samsungvr.com/portal/content/tos.\n\nThis EULA does not modify the applicable terms and conditions of using the Software Platform.\n\nBY ACCEPTING THIS EULA, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THIS EULA IN ITS ENTIRETY.\n\nTHIS EULA CONTAINS IMPORTANT TERMS AND CONDITIONS THAT AFFECT YOU AND YOUR USE OF THE SOFTWARE PRODUCT, INCLUDING, UNLESS YOU CHOOSE TO OPT OUT, A PROVISION REGARDING BINDING ARBITRATION OF DISPUTES (OTHER THAN CERTAIN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) AND A WAIVER OF CERTAIN RIGHTS TO JURY TRIALS AND/OR CLASS ACTIONS.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF13AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SOFTWARE PRODUCT WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THIS EULA. MAKE SURE TO REVIEW THIS EULA WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nWe reserve the right to change or modify this EULA on a going-forward basis at any time and in our sole discretion. If we make changes to this EULA, we will provide notice of such changes as appropriate, such as by sending an email notification to the address youve provided, providing notice through the Software Product and/or updating the Last Updated date at the top of these Terms. Your continued use of the Software Product will confirm your acceptance of the revised EULA. If you do not agree to the revised EULA, you must stop using the Software Product. We encourage you to review this EULA from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Software Product.\n\nThis agreement was written in English (US). To the extent any translated version of this agreement conflicts with the English version, the English version controls.\n\n1. Your Use of the Software Product\n\n1.1Software Product License. We hereby grant you a limited, non-exclusive, non-sublicensable license to access, install, and use the Software Product solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software, except as expressly permitted by Developer or as permitted under applicable law. Any unauthorized use of the Software Product is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n1.2Third-Party Content. Your use of services, applications, or content provided by third parties made available through the Software Product (Third Party Content) may be subject to additional end user agreements. Developer has no responsibility or liability with respect to your access to or use of the Third Party Content, or any content or functionality contained in such Third Party Content, your rights to which are solely provided pursuant to a license between you and the provider of such Third Party Content. In no event shall Developer or the applicable Software Platform be considered the licensor of the Third Party Content, to have granted any rights to use the Third Party Content, to have assumed any obligations with respect to the Third Party Content, or to have made any representations or warranties with respect to the Third Party Content.\n\nIf you are not presented with an end user license agreement when you acquire access to Third Party Content, the following license terms apply to your use of such Third Party Content: (a) the third party providing the Third Party Content (and not Developer or the Software Platform) is the licensor of such Third Party Content; (b) such party grants you a limited, nontransferable license to access and use the Third Party Content only for your personal and noncommercial purposes; and (c) you may not modify, reproduce, decompile or disassemble the Third Party Content in whole or in part, or create any derivative works from or sublicense any rights in or to the Third Party Content, unless otherwise expressly authorized by the third party or as permitted under applicable law.\n\n1.3Trial Access to Software Product. We may offer free trials or other limited versions of the Software Product so you can preview the Software Product before you purchase the full version. These versions may have limited features, restrict permitted time of use and contain other limitations.\n\n1.4Availability of Software Product after Purchase; Updates. The Software Product may rely on services provided by third parties for some or all of its functionality. The Software Product may not function properly or may become inoperable if these third parties discontinue their services.\n\n1.5Support. The Software Platform, and not Developer, will be responsible for all billing questions related to the purchase of the Software Product and for support with respect to the Software Platform. Developer, and the not the Software Platform, will be responsible for all support obligations relating to the Software Product, including but not limited to customer support, bug fixes, live operations support, and general technical support. Neither Developer nor the Software Platform is obligated to provide support for Third Party Content. You acknowledge that we are under no obligation to update or patch a Software Product.\n\n1.6Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Software Product, and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\n2. Software Product Purchases\n\n2.1Purchasing Software Product from Software Platform. If the Software Product is a paid product, the license granted to you under this EULA is conditioned upon your valid purchase of the Software Product pursuant to the applicable Software Platform terms and conditions of purchase.\n\n2.2Content Transactions. You may have the ability to purchase digital content through the Software Product. You also may have the ability to purchase additional or enhanced functionality or media content within a Software Product (collectively, In-App Purchases). Any content developed by us that we provide through In-App Purchases is subject to the licenses, terms, and conditions stated in this EULA. Except as described in these Terms, we have no responsibility for any transactions you enter into with a third party for Third Party Content and assume no liability for Third Party Content.\n\n2.3Virtual Items. Your purchase of a virtual item or in-game currency within the Software Product is a payment for a limited, non-assignable license to access and use such content or functionality in the Software Product. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Software Product can only be used in connection with the Software Product where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Software Product for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n3. Acceptable Use\n\nBy accessing or using the Software Product, you agree that you will not: (a) access or use the Software Product in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Software Product, including, but not limited to, defamatory, harassing, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content; (b) damage, disable, overburden or impair the functionality of the Software Product in any manner; (c) access or use the Software Product for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates these Terms, community standards or any other terms or policies provided in connection with the Software Product; (d) use or attempt to use another users account without authorization from such user; (e) modify, adapt, hack or emulate the Software Product; (f) use any robot, spider, crawler, scraper or other automated means or interface not provided or authorized by us to access the Software Product or to extract data; (g) circumvent or attempt to circumvent any filtering, security measures or other features designed to protect the Software Product, or third parties; and (h) infringe upon or violate the rights of Developer, our users, or any third party.Notwithstanding the foregoing, we reserve the right to revoke or reduce your access to any multiplayer functionality in our Software Products at any time, with or without cause.\n\n4. User Content\n\nOur Software Product may include interactive features and areas where you may submit, post, upload, publish, email, send, or otherwise transmit content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, User Content). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. By submitting User Content through the Software Product, you grant Developer a worldwide, irrevocable, perpetual (i.e. lasting forever), non-exclusive, transferable, royalty-free and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform and distribute such User Content in connection with the Software Product. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content.\n\nYou are solely responsible for the User Content you make available through the Software Product and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Developer the rights specified in this section; and (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations.\n\nDeveloper does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Developer has no responsibility or liability for User Content made available through the Software Product, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\n5. Privacy Policy\n\nOur Privacy Policy, which is available at https://www.luciddreamsprod.com/legals/is incorporated into these Terms and sets forth how we treat data, including how we collect, use and disclose information.\n\nIn addition, certain third parties (such as the applicable Software Platform, developers of Third Party Content, and the manufacturers of your computer, mobile phone or other devices) may collect information about you when you use the Software Product. These third parties have their own privacy policies and will treat the information they collect about you according to these policies. We encourage you to review these privacy policies before providing any information to third parties. We are not responsible for the accuracy of any third partys privacy policy or for ensuring that third parties comply with their privacy policies.\n\n6. Ownership and Intellectual Property\n\nUnless otherwise indicated, the Software Product is the property of Developer or its licensors and is protected by copyright, trademark and other laws of the United States and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark, or other proprietary rights notices incorporated in or accompanying the Software Product.\n\nLucid Dreams Productions and the Lucid Dreams Productions logo (the Developer Marks) are trademarks or registered trademarks of Lucid Dreams Productions, LLC. The Developer Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, including as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder.\n\n7. Feedback\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials, or other information about Developer and our Software Products (collectively, Feedback). You agree that Developer and its affiliates shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n8.Copyright Complaints\n\nIn accordance with the Digital Millennium Copyright Act (DMCA) and other applicable laws, we have adopted a policy of terminating, in appropriate circumstances and in our sole discretion, accounts of users who are deemed to be repeat infringers. We may also, in our sole discretion, limit access to the Software Product and/or terminate the accounts of any users who infringe any intellectual property rights of others, whether or not there is any repeat infringement.\n\nPlease see 17 U.S.C. 512(c)(3) (available athttp://www.copyright.gov/title17/92chap5.html#512) for the requirements of a proper notification. If you knowingly misrepresent in your notification that the material or activity is infringing, you will be liable for any damages, including costs and attorneys fees, incurred by us or the alleged infringer as the result of our relying upon such misrepresentation in removing or disabling access to the material or activity claimed to be infringing.\n\n9. Disclaimers\n\n15.1 WE MAY PROVIDE HEALTH AND SAFETY WARNINGS IN CONNECTION WITH A SOFTWARE PRODUCT. YOU REPRESENT AND WARRANT THAT YOU WILL READ ALL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS WE PROVIDE BEFORE USING THE SOFTWARE PRODUCT.\n\n15.2 YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SOFTWARE PRODUCT IS AT YOUR SOLE RISK. AS BETWEEN YOU AND DEVELOPER, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN AS IS AND AS AVAILABLE BASIS AND DEVELOPER EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES, AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, DEVELOPER DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS; (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY DEVELOPER WILL CREATE A WARRANTY. THE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\n10. Indemnification\n\nYou agree to defend, indemnify and hold harmless Developer and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, Developer Parties) from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Software Product; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Developer, the Software Platform, or a third party in relation to the Software Product, (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\n11. Limitation of Liability\n\nTHE DEVELOPER PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SOFTWARE PRODUCT, EVEN IF A DEVELOPER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE DEVELOPER PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SOFTWARE PRODUCT EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SOFTWARE PRODUCT. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU. NOTWITHSTANDING ANYTHING TO THE CONTRARY IN THESE TERMS, NOTHING IN THESE TERMS EXCLUDES OR LIMITS OUR LIABILITY FOR FRAUD OR FOR DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE.\n\n12. Dispute Resolution\n\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO SUBMIT TO BINDING ARBITRATION (JURY TRIAL WAIVER) OF ANY AND ALL DISPUTES (OTHER THAN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) WITH DEVELOPER AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM DEVELOPER (NO CLASS ARBITRATIONS, CLASS ACTIONS OR REPRESENTATIVE ACTIONS OR ARBITRATIONS).\n\n12.1Binding Arbitration; Disputes; Small Claims.You and Developer agree to waive any right to a jury trial, or the right to have any Dispute resolved in any court, and instead accept the use of binding arbitration (which is the referral of a Dispute to one or more impartial persons for a final and binding determination); provided, however, that you have the right to litigate any Dispute in small claims court, if all the requirements of the small claims court, including any limitations on jurisdiction and the amount at issue in the Dispute, are satisfied. You agree to bring a Dispute in small claims court in Los Angeles County, California. Dispute as used in thisSection 12means any dispute, cause of action, claim, or controversy arising out of or in any way related to Developer, these Terms, the subject matter of these Terms, or access to and use of the Software Product, including but not limited to contract, personal injury, tort, warranty, statute or regulation, or other legal or equitable basis and disputes that involve third parties (such as developers of Third Party Content), except any dispute, cause of action, claim, or controversy relating to Developers intellectual property (such as trademarks, trade dress, domain names, trade secrets, copyrights, and/or patents). You and Developer empower the arbitrator with the exclusive authority to resolve any dispute relating to the interpretation, applicability or enforceability of these terms or formation of this contract, including the arbitrability of any dispute and any claim that all or any part of these terms are void or voidable.\n\n12.2No Class Arbitrations, Class Actions or Representative Actions.You and Developer agree that any Dispute is personal to you and Developer, and that any Dispute shall only be resolved by an individual arbitration and shall not be brought as a class arbitration, a class action, or any other representative proceeding. Neither party agrees to class arbitration, or an arbitration where a person brings a Dispute as a representative of any other person or persons. Neither you nor Developer agree that a Dispute can be brought as a class or representative action whether inside or outside of arbitration, or on behalf of any other person or persons.\n\n12.3Federal Arbitration Act. You and Developer agree that these Terms affect interstate commerce and that the enforceability of thisSection 12shall be governed by, construed, and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (FAA) to the maximum extent permitted by applicable law.\n\n12.4Confidentiality. The arbitrator, Developer, and you shall maintain the confidentiality of any proceedings, including but not limited to, any and all information gathered, prepared, and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator shall have the authority to make appropriate rulings to safeguard that confidentiality, unless the law provides to the contrary.\n\n12.5Process. Our goal is to resolve claims fairly and quickly. Accordingly, for any Dispute that you have against Developer, you agree to first contact Developer and attempt to resolve the claim informally by sending a written notice of your claim (Notice) to Developer. The Notice to Developer must be sent by certified mail addressed to: 1800 N NEW HAMPSHIRE AVE #404 LOS ANGELES, CA 90027. The Notice must (a) include your name, residence address, and the email address and/or mobile telephone number associated with your account; (b) describe the nature and basis of the claim; and (c) set forth the specific relief sought. If you and Developer cannot reach an agreement to resolve the claim within 30 days after such Notice is received, then either party may, as appropriate in accordance with thisSection 12, commence an arbitration proceeding or file a claim in court. You and Developer agree that any Dispute must be commenced or filed within one (1) year after such claim arose; otherwise, the Dispute is permanently barred.\n\nIn the event that you and Developer cannot resolve a Dispute and you do not pursue your claims through small claims court, you or Developer shall promptly submit the Dispute to binding arbitration at the office of the American Arbitration Association (AAA). In the event AAA declines or is unable to administer the arbitration, you and Developer agree to use an arbitration forum or arbitrator that you and Developer mutually agree upon. If, after making a reasonable effort, you and Developer are not able to agree upon an arbitration forum or arbitrator, AAA or a court having proper jurisdiction will appoint an arbitration forum or arbitrator. The arbitration will be conducted in accordance with the AAA Consumer Arbitration Rules (AAA Rules) then in effect. The AAA Rules and other information about AAA and arbitration are readily available athttp://www.adr.org, by calling 1-800-778-7879, or by mail at 120 Broadway, Floor 21, New York, NY 10271. By entering into these Terms, you either (1) acknowledge that you have read and understand the AAA Rules or (2) waive reading the AAA Rules and waive any claim that the AAA Rules are unfair in any way. You and Developer agree that these Terms govern the arbitration, and that the applicable AAA Rules shall be subject to changes in procedures that AAA may make from time to time.\n\nAs limited by the FAA, these Terms, and the applicable AAA Rules, the arbitrator will have the exclusive power and jurisdiction to make all procedural and substantive decisions concerning the Dispute; provided, however, that this power does not include the power to conduct a class arbitration or a representative action, which is prohibited by these Terms (as stated above). The arbitrator may only conduct an individual arbitration, and may not consolidate more than one persons claims and may not preside over any form of representative or class proceeding, or any proceeding on behalf of or involving more than one person or persons.\n\nUnless the arbitrator finds the arbitration was frivolous or brought for an improper purpose, you and Developer will equally share in all filing, AAA, and arbitrators fees and expenses.\n\n12.6Right to Opt Out. You may opt out of this agreement to arbitrate. If you do so, neither you nor Developer can require the other to participate in an arbitration proceeding. To opt out, you must notify us in writing within thirty (30) days of the date that you first became subject to this arbitration provision, and must include your name and residence address, and a clear statement that you want to opt out of this arbitration agreement. Any requests to opt out must be sent to:1800 N NEW HAMPSHIRE AVE #404 LOS ANGELES, CA 90027\n\nUnless you choose to opt out, this dispute resolution provision inSection 12shall survive termination of these Terms.\n\n13. Governing Law\n\n13.1 Developer is based in the United States and our Software Products are subject to U.S. law. We make no representations or warranties that the Software Product is appropriate or available for use in other locations.\n\n13.2 The laws of the State of California, excluding its conflicts of law rules, govern your access to and use of the Software Product. Your access to and use of the Software Product may also be subject to other local, state, national or international laws.\n\n13.3 To the extent the provisions inSection 12do not apply, you further agree that all disputes, causes of action, claims, or controversies arising under these Terms that cannot be settled through informal negotiation will be resolved exclusively in the state and federal courts located in Los Angeles County, and you agree to submit to the personal jurisdiction of such courts for the purposes of litigating all such claims.\n\n14. Modifications to the Software Product\n\nDeveloper reserves the right to change, suspend, remove, discontinue or disable access to the Software Product or particular portions thereof, at any time and without notice. In no event will Developer be liable for the removal of or disabling of access to any portion or feature of the Software Product.\n\n15. Termination\n\nWe reserve the right to terminate your right to access and use the Software Product if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\n16. Severability\n\nIf any provision of these Terms shall be deemed unlawful, void or for any reason unenforceable, then that provision shall be deemed severable from these Terms and shall not affect the validity and enforceability of any remaining provisions.\n\n17. Assignment\n\nYou may not assign these Terms or any of the rights granted hereunder without the prior written consent of Developer, and any attempted assignment without such consent shall be void. Subject to the foregoing restriction, these Terms will be fully binding upon, inure to the benefit of, and be enforceable by us and our respective successors and assigns.\n\n18. Nonwaiver\n\nAny failure by Developer to insist upon or enforce performance by you of any of the provisions of these Terms or to exercise any rights or remedies under these Terms or otherwise by law will not be construed as a waiver or relinquishment of any right to assert or rely upon the provision, right or remedy in that or any other instance; rather, the provision, right or remedy will be and remain in full force and effect.\n\nLos Angeles - Paris\ncontact@luciddreamsprod.com\n CONTACT US \n 2019 all rights reserved", "Space Required": "1.95 GB"}



["5 stars\n63%\n4 stars\n9%\n3 stars\n5%\n2 stars\n5%\n1 star\n17%", "StephenGdBaker19 days ago\nInteresting\n\nFor all the complainers, it LITERALLY says documentary on the title page. It was intriguing. I didn't find it so sad but maybe because it's not new info for me. It was very well done and visually interesting. I'm going to have to ask someone about their keys.\n\nHelpful | 13", "Alex994May 30 at 5:06 PM\nThis Experience left me in Tears !!\n\nI was so curious to find out about the story of this key, and then when I reached the end I couldn't hold my tears ...\nI am a Syrian refugee, and I still have my home key, even though I know I will never be able to go back\nwhen I finished it I cried so much , I had no clue that this experience would be that much related to me, during the whole experience I was trying to do something but I wasn't able to , I didn't have a choice , just like in real life , I couldn't save my friends , I couldn't stay home , I had to leave , but I survived .\nthis is the best experience I've had in VR and even though I cried a lot , it really made me happy to know that there are people who know how I feel , know the struggle I've been through , know the story of the Key.\n\nHelpful | 168", "tempistraven5 days ago\nLiked it, but too preachy at the end\n\nI would of given it a 3.5 If the system allowed it. I love the graphics and the slow mechanics through the game as you look at how memories are seen through someone trying to remember. The end unfortunately was too slow with dramatic pauses that did not show how to trigger the next line or if the lines where meant to be that way. Could not wait and killed it before all the facts where done.\n\nHelpful | 1", "TailgunJul 11 at 12:29 PM\nJust an Empty Polemic on Refugees\n\nWhat's meant to be a moving VR story is really nothing more than a bait-and-switch, manipulative, preachy polemic on refugees and how it's our First World responsibility to house all of them (because of course, it is). Save yourself the storage space on your Quest, there are many better experiences, like Notes on Blindness and the Anne Frank House.\n\nHelpful | 9", "BxnScxrth8Apr 16 at 11:20 AM\nWow\n\nWow...\nI am genuinely lost for words this was a phenomenal experience I teared up a lot at this story and when I knew the deeper meaning wow its so true that this does happen all around the world and we dont even realise 1/2 of the time all I can say is try this experience please its amazing.\n\nHelpful | 171", "P4tr0ll3rApr 16 at 9:39 AM\nThis is no game. Its an experiance\n\nWords cant describe how beautiful this is. From the morals to the visuals the key made me see be different. It made me cry my eyes out and I want everybody to try this.\n\nHelpful | 212", "Bongman79Apr 18 at 11:24 AM\nUnplayable for me :( wheelchair user\n\nI can't play it as I'm paraplegic and can't stand up.. Please devs can you add a seated mode with smooth or step turning to make it accessible for all, thanks\nI wish Oculus would add some accessibility options within their software like in steam vr advanced settings, that would be very helpful, oculus if you listening, please do this x\n\nHelpful | 119\nDeveloper ResponseApr 22 at 11:17 AM\n\nHi there. I'm the creator of The Key and I take your feedback very seriously. I apologize for not delivering an experience that works for everyone... In the Rift version of the app, we have implemented a \"snap turn\" to make it compatible with seated mode. We received feedbacks from Quest users that this was making them disoriented so we removed it from the Quest version of the app. Please know that Oculus specifically requested the seated mode for Rift and they are very concerned about making as many experiences as possible available to everyone. This is 100% on me and I hope you'll accept my apology.", "Chris.Becca11Apr 16 at 5:30 PM\nLove love love\n\nThis game is awesome.. I love it, I cried so much. I try to contain it but it was really hard. This is the most saddest VR game I have ever experience. But in a good way. It awesome to learn what we don't know about what going on , in other countries. It really sad that this countries have to go thru this kind of stuff. We all need to take the time to pray for these countries that don't have a say so or a voice to be heard. We take to much for granted and don't realize how good we have it in the United States. This VR game is my favorite out of all the VR games out there.. Thank you for sharing your experience with everyone around the world.. we need to see more of these types of games. Please everyone take the time to place this game. I promise you will not be disappointed.. And you have to pay attention to the narrator to experience what this woman went thru just like if it was you.\n\nHelpful | 26", "GiftedKennyladJun 13 at 6:00 AM\nGets you in the End\n\nNot really a game... some interaction but you are heading in the same direction... its short but thats a good thing as the ending is what its all about!!! I could totally relate I too have a key but Im not an refugee!\n\nHelpful | 3", "TheSpyHunt3rMay 29 at 3:06 PM\nA Unique, Eye-Opening Experience\n\nIt is easy for us to become complacent in our own lives and in our own understandings, but the perspectives and opinions we develop through our lives are limited by what we experience first-hand. That is the beauty of virtual reality. In the right person's hands, we can be taken on a journey that give us new perspectives that we can not garner on our own. I won't spoil the topic that comes from this, but download it and experience it.\n\nHelpful | 3", "scotty341Jul 7 at 3:25 AM\nAnother boring VR experience.\n\nJust because the message is good doesn't mean I enjoy the game. Personally I don't believe VR is the place for these short and rather boring experiences. These things are the reason many people are turned away from VR as they expect most games will be like this. All I'm saying is that a black and white text screen at the end of a beatsaber level would have a larger impact that this 'experience' ever will.\n\nHelpful | 2", "Its_stephenJun 17 at 4:51 PM\nHow do I get a refund?\n\n.. On the 20 minutes wasted watching an interactive refugee ad? Also the fact they make it look like some weird stuff with aliens and then it literally does end in you looking at pictures and being told about refugees exactly like one of the adverts you see on TV. All it needed was a \"Go to blahblah.com and donate 5 to save a refugee today\" at the end\n\nOther than that, one star for the alien part. I recommend closing the app once you hear the words \"now I remember everything\" or something like that\n\nHelpful | 19", "Golden_MindMay 14 at 4:12 AM\nAliens?,... no.\n\nSaw a trailer and thought, Aliens, another adventure.\n\nSadly, no, what I thought would be an adventure of discover with 'Aliens' (because i didn't read the description), turned out to be a story about refugees.\n\nExpecting a game about searching for a key to free an alien, and found a documentary.\n\nI can see why it's free, but it's just something that should appear on the History Channel instead.\n\nAfter reading the description... Will you be able to unlock the mystery behind the key without sacrificing too much?, no. You actually do nothing to interact. The key does nothing. In my opinion, it doesn't belong on VR.\n\nHelpful | 16", "Cat_ManJun 6 at 9:15 PM\nStop reading reviews, just get it\n\nYOU DO NOT WANT SPOILERS, this is a wonderful little experience with a great message. Its free, just get it.\n\nHelpful | 8", "VetkinJul 1 at 9:46 PM\nNot worth the download\n\nThe description and introduction leads you to believe you're going to experience some fantasy adventure, or at the very least something interesting to look at. The narrator tells you that you'll have to make choices. There's none of that here. Visuals are poor, the pacing is so slow that I often mistakenly thought it was waiting for me to do something. There's not really much of a story at all, and it felt like this weak narrative was thrown together as a bait and switch for a short advertisement at the end about supporting refugees, with an environment that looked to have been pulled straight out of google earth. This is not even worth the time it takes to download for free.\n\nHelpful | 1", "HauntedFalconMay 21 at 2:19 PM\nJust a commercial of how refugees suffer\n\n(SPOILERS)\n\nThis is just propaganda meant to make you feel bad for refugees. It goes into a speech about the estimated number of refugees that suffer and have to leave their homes as you, the captive audience stand there in a blown up building. Its just a political and ideological messages and speech thinly wrapped in a couple of pretty images. At first, you think its a visual experience and that its a mystery. Then it just transports you into a place and tells you how many refugees have to leave their homes and lose loved ones and how they have to suffer though an agonizing wait before they can be let into the United States and provided food and shelter here. I came here from another country and I dont want anyone talking about me like Im some poor victim. Most refugees dont want to be seen as victims. The only people pushing this are pearl clutching Karens and virtue signaling Beckys. Shouldnt be surprised. After all, oculus is sadly owned by Fakebook\n\nHelpful | 16", "obviousjimMay 7 at 6:07 PM\nPowerful story, beautifully told\n\nThe Key is a delicately poetic take on a difficult and important issue. I didnt read any reviews before experiencing it and glad I didnt. I was so moved as the metaphor gave way to the underlying narrative. Such an artfully done experience with the right balance of interaction, story and design. There needs to be more experiences like this on Quest!\n\nHelpful | 4", "Pixie402 days ago\nA must see experience\n\nIt's not a game. But what it is, is profound and moving. Intellectually you might know the hardships refugees experience. But that means nothing since it's so hard to actually put yourself in their shoes, to understand what it's like. This experience... It's moving. It brings home what refugees go through, the hardships and heartbreak they suffer in a way no thirty second ad on TV can ever do.\n\nHelpful | 0", "Derpy_ManateeApr 17 at 5:12 PM\nIts ok I guess\n\nI wouldve been happier if this was an actual game, but it is just a movie that plays around you and you get to interact with a few things but the outcome is the same, and its just in general very short, took about 10-15 minutes. It started off great because I thought it was an actual game, but its just something to raise awareness about refugees. I suppose that you get what you pay for.\n\nHelpful | 13", "RobertLSVRApr 16 at 4:22 PM\nOn Par with Dear Angelica\n\nFabulous piece of cinematic VR that makes amazing use of the surrounding space with a powerful message. On par with Dear Angelica and one of the finest pieces of work in the medium to date.\n\nHelpful | 23", "jbvrdodaJul 1 at 8:27 AM\nNice start but becomes to political\n\nThis short story started nice and looked great....until the end when you see ruins of some Middle Eastern country and it becomes big political about refugees. The idea is nice for school to teach young kids in a simple way about refugees....but not for VR.\n\nHelpful | 0", "Sunzilla16 days ago\n\nPowerful\n\nHelpful | 0", "TheKraigeMay 3 at 11:38 AM\nAn important experience.\n\nIf I were to rate this purely on the gaming elements I would give it a three or maybe four. It's short pretty but limits your opportunities to interact with the world as it pushes you through the linear experience.\nHowever as so many reviews review it on the \"political\" message I give it 5 stars. If you are one of the easily offended right wing then leave this alone safe in your bubble that you don't owe anyone anything. If you are not it tells an important message that has been said before but is often ignored and it says the message in an interactive manner that may help you connect in a way that is needed.\nTLDR right wing snowflakes avoid everyone else enjoy a short well presented humanitarian experience.\n\nHelpful | 8", "RoBudMay 8 at 7:21 PM\n20 minute time waste, 1 minute of agenda\n\nHave you seen those UNICEF ads where a child is dying and they ask you for money? This is the same thing for refugees. And they make you stand, go through a fair bit of meaningless roads to reach one photo of a bombed home. Watch a documentary on the TV instead if thats what you want to watch.\n\nHelpful | 27", "ChipylunaMay 25 at 5:33 AM\nBeautiful\n\nI wasn't sure what I expected from this experience, but I certainly wasn't prepared for how emotional I felt and even from the start. Beautifully done, defo one to make you take stock and think.\n\nHelpful | 3", "mikehendrApr 16 at 2:07 PM\nEveryone should take a look.\n\nWhen I read the review that made the viewer cry, I had to roll my eyes. However after experiencing it I completely understand. Very moving.\n\nHelpful | 25", "Marioboy1Apr 29 at 5:31 PM\nSends an important message\n\nIf you are looking for a free game to play around with, this isnt it. You cant really interact with it, and it isnt technically a game, but it is really well done, and sends an important message and really shows you how hard it is for refugees in todays world. Its really only good the first time around, but it is a good thing to show to others, like family or friends who are new to the oculus, or someone who really likes just being in the moment.\n\nIt has a lot of good art concept, and really lets you appreciate the oculus more.\n\nHelpful | 1", "MonsieurWinstonJun 18 at 8:13 PM\nBeautiful experience !\n\nThe graphics are beautiful, the story tellers voice gives you chill and the whole experience is wonderful ! Highly recommended \n\nHelpful | 1", "celestie81Jun 17 at 6:32 PM\nWell done mildly interactive narrative\n\nI enjoyed this 15-20 minute narrative jaunt. Its worth it. The graphics are good, there is a definite purpose to it youll discover at the end.\n\nHelpful | 1", "rasor22Apr 18 at 11:55 PM\nPatch to a wound\n\nTHE KEY is to be proactive to prevent war and other man-made disasters from happening in the first place, not to risk infiltration of terrorists and gangs capitalizing on the few who really needs help. Any sovereign nation can choose to help the ones who really needs the help...it is their sovereign right as a nation to filter out questionable ones. Embracing all refugees is just a patch to a wound for \"selfie\" purposes, with dire consequences for a nation's citizens...while the real heroes/helping are the ones who risk their lives and their family to thwart the onset of war, genocide, environmental catastrophe, and other man-made disasters. Be proactive instead.\n\nHelpful | 26", "Ralf_TMay 11 at 5:24 PM\nA short, but meaningful experience\n\nThe Key is not a game, but a VR experience that tells you a meaningful story of loss and despair. With about 20 minutes it's a short experience, but one with an important message. Please note that you need some space to move.\n\nHelpful | 1", "mattamatesMay 14 at 10:01 PM\nNot a game\n\nI get that its oh look at these people they're sad but the thing is they probably spent a lot of money to make this game they could've just put out an advertisement instead of a vr game and spent the rest helping them get homes and resources and the game looked really good using what looked like real images to make a house that looked really good just for a game that chances are people won't play\n\nHelpful | 3", "berickphilipApr 29 at 2:09 AM\nPretentious and boring\n\nYeah, the premise, or the matter, is a serious/touching issue (I will not spoil it). That being said..\n\nAs a VR experience this is pointless and boring. Waste of time, unfortunately.\n\nOh and the \"interaction\" and \"teleportation\" are useless. More like a tacked on afterthought.\n\nHelpful | 8", "richbaxterApr 28 at 4:41 AM\nAbsolutely Dreadful Nonsense\n\nThis is hands down one of the worst VR experiences I have ever encountered. Its not a game, but that also isn't my issue. To use VR as a platform to get this message across is bizarre to say the least plus it seems wheoever came up with the platform was on some kind of magic muchroom trip. Boring, pointless and serves no purpose to what the actual message is.\n\nHelpful | 12", "Edgetr22May 22 at 7:23 PM\nThanks for the psa\n\nCould have been a long game with fun adventures and puzzles but instead of getting add time you wasted all that time and money for a interactive beg for money\n\nHelpful | 4", "kevink808Apr 30 at 7:23 AM\nUnderwhelming.\n\nI tried this app without any idea of what it was and no expectations. I have to say, it seems to have an identity crisis. There is nothing in the first 15 minutes the hints at what this is about. I thought I was playing a puzzle or escape room game. It seemed like The Under Presents art style. But then for the last 5 minutes it abruptly reveals itself and becomes kind of like a documentary or NY Times VR short story. Really rushed and kind of a disappointment. I would have much rather had a VR story experience about this social issue to begin with instead of the masquerade of a game in the beginning.\n\nAs for the social issue, I agree with the creator for the most part, but the delivery undercut the message, which is really what is most important here if youre trying to foster awareness and empathy of a very important issue.\n\nHelpful | 3", "jake.piacenti44Apr 22 at 11:24 AM\nNot worth it\n\nThe art and graphics look cool but the story was barely a story. It just said a few facts about refugees that you can just google. If it had actual gameplay through the story it probably would be better.\n\nHelpful | 13", "shashking404Apr 18 at 11:59 AM\n(spoilers)\n\n+ The narration was gripping. The ending was impressive\n+ i absolutely liked walking in the photogrammetry model of the house.\ni wish there were some Official app with cleaned up photogrammetry models of caves, tunnels, attics, vintage car interiors\n\n\n- Not much interaction as per today's standards.\n- the interactions with the said \"friends\" turns out to be a one time action thus less replaybility for me.\n- maybe i am not too smart but i couldn't grab the keys around the maps. i could see them but can't grab, touch, point laser, teleport or gaze to get a response.\n- there is no chapter selection so replaybility is really an issue\n\n\n= fair experience\n\nHelpful | 2", "HdzFamApr 28 at 2:30 PM\nWasted experience\n\nThis is in no way shape or form a beautiful experience, it's a story with an agenda and one I'm not particularly interested in. I don't need my VR experience to be ruined by liberal propaganda.\n\nHelpful | 14", "ShadowProgrammerMay 2 at 5:48 AM\nStop Hating PLEASE!\n\nI like it. Nice graphics too. Only problem is that its a kind of short and a little confusing at first, but it makes more sense later on, like Harry Potter\n\nHelpful | 1", "trent.hayApr 17 at 7:52 PM\nAmazing\n\nThis is a wonderful experience that everyone should try. The story is amazing and it conveys a brilliant message that applies to today. Everyone should see this and uncover the truth about the world that we live in. Best VR experience I have ever played.\n\nHelpful | 2", "novaks47May 2 at 9:21 PM\nVR Virtue Signaling\n\nNothing more than open borders/refugee virtue signaling in VR format. Wish I had read the one star reviews so that I wouldn't have wasted my time on this contrived nonsense.\n\nHelpful | 6", "CalebinBinaryApr 23 at 11:30 PM\nRefugee story\n\nBrilliant experience, not a game its a narrative in VR with great graphics. Free, download, experience, and learn. Its only 15 minutes.\n\nThere was no code for me at the end, mustve messed up somewhere.\n\nHelpful | 2", "vafromvaJun 17 at 7:59 PM\nExcellent Allegorical VR\n\nA wonderful story, in each scene I felt the loss of each unique piece of myself in a way that resonated personally. Each action, each choice made me more invested in wanting to know why this was happening, how can I fix myself, what precisely AM I feeling?\n\nThis is a must-see experience!\n\nHelpful | 1", "renewsoulessmotorsApr 19 at 6:55 PM\nNot a game or experience\n\nThis is not a game the art was basic and the \"meaning\" of this should have been understood by an adult in seconds wasted my time dont let it waste yours.\n\nHelpful | 14", "jeffkasApr 20 at 7:13 AM\nDidn't Do Much For Me\n\nI love most of the titles on the Oculus. This one seemed rather boring. You'e in the middle of a story and just watch it unfold. Very little interaction and super short (was it even 10 minutes?). The animations were decent but nothing amazing. The ending to the story was underwhelming. Just wasn't my cup of tea but... hey, it was free, so if you're bored, nothing to lose!\n\nHelpful | 2", "JimZMApr 26 at 11:27 AM\n\nBeautiful story. Beautiful presentation. Lasts about 20 minutes. Locomotion a little finicky if you don't have a large space. This is not just a stereoscopic video, but a fully 6dof 3D semi-interactive short film, therefore much more comfortable and immersive.\n\nHelpful | 0", "DemonicXanimalMay 3 at 12:20 AM\nDeep,,\n\nI am lost for words of how meaningful this short game is, the meaning behind it is truly horrible. However its not just a narrative where you sit there the whole time, you can interact a bit.\n\nVery well made!\n\nHelpful | 1", "MizKarenApr 22 at 1:28 PM\nFABULOUS!!!\n\nWhat a fabulous experience! I dont understand the negative reviews.\n\nGod bless the people who did this. Simply wonderful.\n\nHelpful | 4", "yourivdbeekMay 5 at 12:36 PM\nPolitical\n\nDo not play this game if you don't want to be mislead.\n\n\nThe game starts really atmospheric and has good story telling, but after 20 min. It turns out it was all a coping mechanism for a refugee.\n\nHelpful | 3", "bradtshortridgeApr 17 at 9:10 AM\nBeautiful pro open boarder political msg\n\nIt is what it is. Boarder agents are giant monsters who kill children and we need open boarders so that all refugees can live in peace. It is well done visually, the message is clear in its bias.\n\nHelpful | 58", "SwagStar59May 11 at 11:26 AM\n\nOpened it and 5 seconds later I uninstalled iT\n\n\n\n\n\nIf ur retarded that means its a bad game\n\nHelpful | 5", "Kaiboom1May 19 at 3:27 PM\nIt was boring.\n\nI understood the whole meaning however this was so boring and was not really a full experience. I had to rate it badly so that others wouldnt have the same bad experience as me.\n\nHelpful | 1", "calforbApr 17 at 4:47 PM\nAmazing experience\n\nDidnt really know where it was going until the end and then it was like wow. Great experience worth trying. I dont want to give anything away so please download it and try it.\n\nHelpful | 2", "MailePenguinoJul 16 at 9:07 PM\nThis was a sad but amazing experience\n\nI loved this so much! I ended up crying in the end, at my old school we talked about refugees and we did our own experience going on a hike as refugees. I hope that the other people that played this (who arent refugees) now know what they went through. This gives you a great experience on what refugees had to go through. Any refugees that have survived I love you and I think you are amazing!\n\nHelpful | 0", "PitofApr 18 at 5:16 PM\nSo Beautiful!!!\n\nWhat an amazing experience! Very emotional, very smart. I lived the experience twice, first when I did it and second right after, when I was thinking of what I went through doing it! Thank you Lucid Dreams, we need more of this kind of journey!\n\nHelpful | 1", "BeNnNnNnN_423Apr 19 at 8:14 AM\nWhat a new perspective\n\nFelt for the characters throughout the play, and then was dropped into reality. Everyone should experience this.\n\nHelpful | 3", "k666hrhMay 13 at 8:01 AM\nEmotional Adventure\n\nThank you so much for bringing this incredibly moving and inspiring piece of art and education to the quest platform\n\nHelpful | 0", "PieandMonkeyFamilyMay 7 at 5:31 PM\nBest experience I have had so far\n\nThis was amazing I got it without knowing anything about it and I was blown away I almost cried it is amazing you must experience this\n\nHelpful | 0", "mohammadagwaMay 11 at 4:22 PM\nIts amazing\n\nI had a great experience with this tour, mix of emotions and feelings cant describe what I felt I just love it.\n\nHelpful | 1", "dz1000Jun 9 at 8:26 PM\nLeft wing propaganda\n\nIt's left wing propaganda.\n\nHelpful | 2", "AuldstockApr 23 at 5:52 PM\nCan't believe it's free\n\nA powerful and well made experience, an absolute must try for vr users\n\nHelpful | 3", "BenJoeBen117Apr 27 at 6:18 PM\nBreath Taking\n\nThank you for the experience, it was very moving and breath taking pretty much the whole way. I am looking forward to allowing others to experience it too. Great job\n\nHelpful | 1", "Aaronb3434Apr 16 at 12:32 PM\nCool\n\nNice!\n\nHelpful | 7", "guy.talmorApr 19 at 3:22 AM\nLike a short movie\n\nNot really more than a short movie, the interaction is very minimal, you basically stand and watch. I am also not a big fan of simplistic moral stories shoved in your face, but for this price it is worth your 5 mins.\n\nHelpful | 1", "threatactorMay 17 at 4:28 PM\nAgenda\n\nSucked\n\nHelpful | 4", "MichganChrisMay 1 at 4:35 AM\nMoving experience\n\nI really enjoyed this on multiple levels... The deeper meaning has truly had an impact on me.\nGratitude to the developers and writers\n\nHelpful | 1", "Bauer-MalanMay 21 at 5:36 AM\n\nThis game is to slow and very boring as you can't do much.\n\nHelpful | 2", "nick.spoons.58Apr 23 at 10:04 AM\nPolitical garbage\n\nWhat started as a promising mystery game, turned quickly to a left winged politics.\n\nHelpful | 12", "jonlumgairJul 27 at 8:14 AM\nYawnnnn\n\nMore political preaching.. Spoiler alert it's refugees. Cause we don't know about them you see. What with us all being racists in all\n\nHelpful | 38", "ACEmanbookMay 15 at 5:52 AM\nnot what i got vr for\n\nnot what i got vr for\n\nHelpful | 3", "Rickm952Apr 19 at 7:11 AM\nThe Key\n\nCute experience could have been more.... who knows maybe?\n\nHelpful | 1", "balazs.szetiMay 5 at 9:16 PM\nSomething special\n\nShort artsy emotional experience. Its only a couple of minutes, like a short animation.\n\nHelpful | 0", "TVL1977May 2 at 3:20 AM\nBeautiful mssg\n\nNice to see VR is also more then just playing games! Little story with a big mssg.\n\nHelpful | 1", "ArmisisApr 20 at 10:00 PM\nMisguided\n\nMisguided propaganda garbage.\n\nHelpful | 17", "TeonisApr 24 at 4:37 AM\nGreat experience\n\nNot bad, not bad, but way too short.\nBut yeah, it's free, and not really a game, but yeah, it was good. Touching.\n\nHelpful | 1", "alex.dombroski.90Jul 30 at 11:42 AM\nAmazing!!!\n\nThis was such an amazing experience! The story was so beautifully told and I truly felt like I was there. Highly recommend.\n\nHelpful | 0", "smartass1379Apr 21 at 10:37 AM\nBeautiful experience\n\nThe people giving it one star because they dont like the message need to look inside themselves. This was extremely moving.\n\nHelpful | 1", "LUCIFER0Apr 20 at 9:08 AM\nBoring\n\nBoring and pointless\n\nHelpful | 10", "AlienHandsApr 20 at 5:54 PM\nThought provoking\n\nThe ending was powerful and made me consider seeing my own situation in a better perspective compare to the plight of others.\n\nHelpful | 1", "TylerDurdenskidsMay 10 at 2:08 PM\nI can admit that I cried\n\nI can admit that I cried\n\nHelpful | 1", "rockinandroidApr 18 at 11:13 AM\nFantastic experience!\n\nIts a heartfelt experience, the less you know going in the better. I enjoyed the unique look and feel of it. Great job devs!\n\nHelpful | 1", "PBRcrazyb0yApr 18 at 4:54 PM\nAmazing\n\nThis is such an amazing experience I 100% recommend it. Plus it is free so it is so much better. But the story is so thrilling\n\nHelpful | 1", "AndrewRyanHAJMay 3 at 1:47 PM\nWow!\n\nAn amazong experience you should not miss \n\nHelpful | 1", "ray.bradshaw1Apr 19 at 11:38 PM\nA must try\n\nCan't believe how good this is it's not a game but s very good you need to try it and the best thing it's free\n\nHelpful | 1", "astromattmattApr 19 at 10:58 AM\nNicely produced but a bit twee\n\nI enjoy the experience but wasn't moved by it. Made be I'm just old and cynical but it didn't seem to offer any new insights.\n\nHelpful | 1", "DrakfyreMay 4 at 4:20 PM\nHit me like a truck\n\nBe prepared, this one hurts.\n\nHelpful | 1", "nioan7Apr 16 at 10:58 AM\nPolitical and social message\n\nIt shows different scenes with nice graphics and later a message about refugees.\n\nHelpful | 39", "AlphaEchoDelta56Apr 16 at 11:47 AM\nBeautiful experience\n\nBe careful of the negative reviews from conservatives\n\nYou know..\n\nTo them\n\nrefugee are not humans...\n\nHelpful | 29", "KP_VANApr 18 at 3:55 PM\nWell done!\n\nExtremely well done. Very immersive experience with a great message. Worth your time!\n\nHelpful | 1", "MrWeatleyApr 19 at 9:31 AM\nThis is an amzing experience.\n\nThis experience is so emotional and so good, I highly recommend everyone to try it.\n\nHelpful | 1", "BossbeastApr 18 at 5:49 AM\ntear to my eye\n\nan experience which will stay with you after the credits have rolled. Just try it.\n\nHelpful | 1", "Banja78May 20 at 9:09 AM\nTouching\n\nAs mentioned in the description this is not a game but an interactive story. Although my personal preferences goes to video and more personal story for similar topics, this is touching, well realised and a good use of VR as there is some interaction in it. I do recommend watching it. Not recommended for kids though. One moment with a monster can impress more sensible people.\n\nHelpful | 0", "teziApr 20 at 12:29 PM\nBeautiful\n\nThought this was a good story which needs to be told, told in a way that felt beautifully done\n\nHelpful | 1", "QueQusApr 17 at 6:34 PM\nAn adventure a story\n\nLoved it and will play it again just because it is so good it tells a story\n\nHelpful | 1", "Dragon19802Jun 17 at 3:17 PM\nGood experience\n\nAt 1st I was a little confused but with in this 30mins experience I really enjoyed the story and felt sad at times. I really recommend this to anyone.\n\nHelpful | 0", "habs68May 16 at 3:34 PM\n\nNot a game and too short\n\nHelpful | 0", "Capt_Quint620Apr 17 at 8:03 PM\n20 Min Cinema\n\nIt is free and worth a view. The scenes are nicely played out. Hardly any interaction is required, suggesting interaction wasn't even needed.\n\nAfter the \"reveal\", I can say it was a little moving, but also borderline preachy. It could've spoken for itself without getting hit by information from the narrator.\n\nIt is a good storyline, but the interaction could've worked better to build a better connection with the orb things. I can't complain about length because it is free, but I can suggest that it could've been longer to allow a better connection.\n\nHelpful | 4", "BowlingTrackerApr 18 at 6:13 PM\nKind of boring.\n\nCreative, but falls short of being an adventure. No real choices, just a very short story, told slowly. Unless I'm missing something big.\n\nHelpful | 1", "Tyso3600Apr 22 at 10:54 AM\nEh\n\nIt wad a good game but felt that there was no big story or interaction\n\nHelpful | 0", "thoeriApr 18 at 12:17 PM\nBeutiful !\n\nVery nice little sad but beautiful.\nThank you\n\nHelpful | 1", "steve.fuller.71619Apr 21 at 2:09 PM\nStuck on title screen\n\nInstalled onto my quest a couple of days ago but it got stuck on the title screen,pressed everything but couldnt get off it\n\nHelpful | 1\nDeveloper ResponseApr 22 at 11:11 AM\n\nHi there! If you look around in the title screen, you should see a flashing \"START\" button. Walk to it (or teleport next to it by holding the trigger button), reach out and touch it. This would start the experience! I hope it helps!", "khairih100Apr 18 at 9:32 PM\nNice :(\n\nNice and sad\n\nHelpful | 0", "Ericnguyen1812Jul 9 at 11:53 AM\nIts great but short\n\nIts tragic how we all lost we have and now feeling alone.\n\nHelpful | 0", "belambaMay 18 at 1:47 PM\nShort but poignant\n\nEnjoyed the experience albeit 5 to 10 minutes in length. Seeing the area refugees live in with their homes destroyed is mind blowing for those of us that have never experienced it.\nA few bits had no bearing on the tale being told, but nevertheless its free and worth a few minutes of ones time to be educated! Thank you...\n\nHelpful | 0", "delqn.cekovApr 22 at 3:17 PM\nNice story\n\nI like the idea how the story is given to the audience. It makes you think a bit more. However, it wont be enough for all, especially that it can be told as a movie. I just want to know why it is 2 gigs? The room, which has a lot of content is 2.3, with 7+ hours of play and this is more of an immersive video. Note on blindness is 1.1 and has more story in it. Anyway, a good one.\n\nHelpful | 0", "thomas.zeusJul 4 at 1:53 AM\nAmazing\n\nReally, really well done. Thank you!\n\nHelpful | 0", "Fletcher2020Jun 5 at 10:47 AM\nSimple but stunning\n\nVery simple. Not very interactive. But tells a beautiful story\n\nHelpful | 0", "KenondpMay 3 at 9:24 AM\nGood Short Experience, but\n\nTook a star away cause the mermaid didn't take me for a swim & no shooting gallery in the semi demolished house, overall thanks for the experience & hope to see some games from you in the future. Cheers\n\nHelpful | 0", "felixableJun 14 at 12:46 PM\nThis experience gave me goosebumps\n\nA nice, short experience for anyone who's looking for a great story and be educated the same time.\n\nHelpful | 0", "evandaganApr 17 at 7:09 PM\n10 m. short film w/ light interactivity\n\nShort and sweet, with a great \"twist\" message at the end. Well worth checking out as an example of how VR can be used as an immersive storytelling tool. Similar to \"Notes on Blindness\" in the use of the technology to put yourself in someone else's shoes for a few minutes....\n\nHelpful | 0", "matEhickeyJun 7 at 1:32 PM\nPlay this before reading any spoilers\n\nBeautiful experience, really well told.\nAlmost cried when I realise what it is about.\nJust play it please\n\nHelpful | 0", "ThornBrierMay 17 at 8:30 AM\nPlease, experience this story.\n\nThe story is quite short, but before you start, make sure you have extra time to deal with the emotions. It took me about 20 minutes to be functional again. Everyone with access to VR should experience this.\n\nHelpful | 0", "MitchMaestroMay 1 at 2:54 AM\nAmazing, best experience so far in VR.\n\nThis is amazing, best experience so far in VR. The game ended with me in tears. Thanks, I needed this. People giving low stars don't want to be confronted with the harsh reality and only care about their own lives, living their luxury lives with their expensive headsets.\n\nHelpful | 0", "BitterMcLungieMay 26 at 7:02 AM\nA surreal nightmare\n\nVery touching story of the life of refugees. The architect of this VR experience makes full use of this medium. It is like an endless nightmare.\n\nHelpful | 0", "BerserkerClawsApr 30 at 5:32 PM\nA Beautifully crafted VR experience\n\nThis took me by surprise. I was chilling playing some VR and I saw this game so I downloaded it. I was not ready for this at all.\nI won't say anything else about it except that this is an experience worth having.\n\nThank you for creating this, I will not forget it.\n\nHelpful | 0", "SimketApr 22 at 12:36 PM\nSee the world from different eyes\n\nVirtual reality is a powerful tool to tell stories. When you look at a person you sometime ask yourself, how does he feel? What does he think? How does he see the world?\n\nIn this \"game\" you can step and \"feel\" a life as a different person, making you understand something you maybe never experienced. It helps you to understand and feel what other people like them may feel. I don't want to say more and ruin the experience for you. You should go and experience it yourself. Go and experience someone elses story.\n\nHelpful | 0", "Hellish1953Apr 18 at 10:05 AM\nWell worth 20 minutes of your time\n\nThe graphics are great and its certainly immersive. I would say that the best interaction is so limited you in fact dont even really need it. But apart from that very well made.\n\nGive it a go !!!\n\nHelpful | 1", "dannyjk360Apr 22 at 4:12 PM\nBeautiful\n\nBeautiful and heartbreaking. Ultimately, not political at all. Acknowledging problems, acknowledging pain, acknowledging suffering, is not political. The reactions, or inactions, to suffering can get political. This film, and I'm calling it a film, was not political. Thank you for it.\n\nHelpful | 1", "mcwhorterbryanApr 19 at 6:18 AM\nAmazing Experience!\n\nI can not think of any other VR experience I have had that compares with the key. It provides a setting like out of a dream world with limited interaction but full emersion. it is powerful visually and emotionally. It also makes a strong point about empathy and caring for those that are less fortunate.\n\nHelpful | 0", "emptygalaxiesApr 19 at 3:24 AM\nUnexpected\n\nTo be honest, I didn't know what kind of experience I would be going into, other than the fact that other viewers had found it emotionally touching. It's meant to take you out of where you are in the world and drop you into the life of another.. it helps to connect you to the emotional trauma that many refugees have to experience themselves. It was a wonderful story and it was wonderfully narrated. I recommend everyone to give it a play through.\n\nHelpful | 0", "RealMadridCFApr 19 at 2:16 PM\nThe future of school\n\nThis, Anne Franks house etc is how some education should be presented in school, in VR. Im sure having some moments like this in different classes would make a lot of children/kids like school/education a lot more. The immersion and dynamics of VR should have a standard place in every school.\n\nHelpful | 0", "havensoleApr 18 at 2:44 PM\nGreat, but short\n\nOne can get through this visual experience fairly quickly, but it is still worth it. Beautifully created and inspiring as it progresses. I just wish it was longer with more to do and explore.\n\nHelpful | 0", "Bender_2112Apr 18 at 2:15 PM\nSomber yet beautiful.\n\nAs a reminder this is not a game. Its basically a ten minute VR film. Recommended for people who can appreciate the arts. I dont want to say much more because itll ruin the story.\n\nPersonally, I was deeply moved. All Ill say is that The Key is a simple allegory about humanity. It was a humbling, enriching experience.\n\nHelpful | 1", "J4bberwockApr 18 at 12:12 AM\nStays with you\n\nThis experience / interactive movie is a simple, short piece with an important message. The life of the protagonist gets progressively worse and unfair as the story goes on, and I found myself wondering why it was happening, and why it was so unfair that whatever happened happened. And thats the point. I felt genuinely moved and a little upset by the end, and that is also the point. Interesting, poignant and very beautifully done.\n\nHelpful | 1", "Chambro12Apr 19 at 5:14 PM\nA total roller coster\n\nNobody never told me what was this all about. But Im not gonna say it because its totally an expirience you have to try on your own. It made me say at first, wtf is this? But then, it all made sense. It was a total rollercoaster. Its pretty short too, so you must definitly try it.\n\nHelpful | 0", "ProfIntoshApr 19 at 2:09 PM\n\nBeautiful and thought-provoking story from a team who clearly understand the power of this medium to place us in the middle of an alternate, mysterious and sometimes foreboding world. Sensitive and clever combination of art styles married perfectly to the unfolding narrative.\n\nHelpful | 0", "robert.dodge.378May 4 at 2:37 AM\nThe Key - To real emotions x\n\n\"THE KEY\" wow oh wow what a wonderful and moving VR Experience.\nand well deserving of the awards it received.\n\nShort and sweet but such a moving experience for every VR Headset owner with a heart. x\n\nHelpful | 0", "YC2020Apr 22 at 5:46 AM\nRecommend\n\nI had goose bumps in the virtual world, its a sad story , makes me unforgettable about what I saw . Recommend for all to try.\n\nHelpful | 0", "King_Of_EgyptApr 16 at 10:34 AM\nGreat\n\nIt's amazing experience \nThank you so much for the great job \n\nHelpful | 3", "Vararo7Apr 22 at 8:09 AM\nJust amazing\n\nIt's just amazing. This is an amazing experience. It shows a reality through animated pictures. It made me cry. Just try it. It's free. There's any reason to not try this.\n\nHelpful | 0", "MissAzaarApr 18 at 1:21 PM\nGoose Bumps\n\nI had no idea where this was going and what it was about, when I started. In the end I was standing there, arms limp, goose bumps everywhere. This is an experience you won't easily forget.\n\nHelpful | 0", "amsobhyMay 6 at 8:36 PM\nHeart touching experience\n\nScarry and then enlightening. God bless all refugees all over the planet.\n\nHelpful | 0", "tuismApr 17 at 1:32 PM\nFantastic\n\nVery glad for the spoiler-free reviews already here, it's a great experience, brief and punchy, and keeps you wondering in a great way. Can't go wrong with this!\n\nHelpful | 1", "Bruce_the_SpruceApr 19 at 3:24 AM\nJudged on game alone not politics\n\nSo this is basically a visually enjoyable environment with fairly good graphics. It's free so no doubt you will download anyway so enjoy but dont expect too much.\n\nHelpful | 0", "martin.schalk.bayMay 11 at 12:07 PM\n5 Stars!! Amazing experience!!\n\nJust get it and let surprise you!\n\nHelpful | 0"]