{"App Title": "The Curious Tale of the Stolen Pets", "App description": "*Now playable with Hand Tracking!*\n\nHelp your grandfather solve the mystery of the stolen pets by exploring wonderful miniature worlds crafted from the ground up for VR. Every world is unique, full of interactions and colorful life.\n\nA HEART-WARMING TALE\nGuided by the voice of your grandfather, travel back to the imaginative adventures of your childhood and the worlds you created together. Revisit a joyful past and the troubled relationship with your sister. \n\nPEACEFUL PUZZLING\nProceed through the game by solving light puzzles using your hands; Grip, push, drop and spin the numerous interactive elements. Every world is full of vibrant life. \n\nWORLDS OF HIDDEN WONDER\nPeek behind a glowing volcano in the prehistoric setting or lean in to investigate your old summer cottage. Explore incredibly detailed and handcrafted worlds while enjoying gameplay tailor-made for VR.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch, Hand Tracking", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Casual, Puzzle", "Languages": "English, Chinese (China), French (France), German, Italian, Japanese, Korean, Portuguese (Brazil), Russian, Spanish (Mexico), Spanish (Spain)", "Version + Release Notes": "1.04", "Developer": "Fast Travel Games", "Publisher": "Fast Travel Games", "Website": "https://www.fasttravelgames.com/thecurioustaleofthestolenpets/", "Release Date": "November 14, 2019", "Developer Privacy Policy": "None", "Space Required": "815.9 MB"}



["5 stars\n59%\n4 stars\n28%\n3 stars\n7%\n2 stars\n2%\n1 star\n3%", "awarth2217 days ago\nFamily  (yes, ignore hand tracking)\n\nGreat game for EVERYONE! My 10 year old son plays this game all the time and my 55 year old husband enjoyed it too! Its fun and even has some depth to the story. Feels very immersive and theres ZERO rush to get thru each level. I love that. Thanks from the whole family!\n\nHelpful | 9", "devinka.wa.59 days ago\nFun and charming game!\n\nSuch a cute game with a nice storyline narrated by 'your' grandfather. Finding the pets is somewhat easy... however, I'm a grown woman and still struggled in the Prehistoric level and had to look up a walkthrough video to find out how to rescue the last two pets!  Very quick game with no replayability but that's fine. Would be great for kids too.\n\nHelpful | 0", "mjg298May 23 at 12:49 AM\nCute tale let down by hand tracking\n\nThis is an incredibly cute title to play with very detailed and fun little world's to explore. Not the longest game so take your time to enjoy the detail here. The introduction of the hand tracking is a disappointment though - after 10 minutes of frustration with the hand tracking not registering actions or over compensating, such as moving the diorama every time I got close to it, I abandoned using them and returned to the controller's which give much better precision and feedback. The hand tracking still feels like a gimmick that at present ruins this experience rather than enhances it\n\nHelpful | 82", "RobsatoMay 25 at 12:43 PM\nVery nice, but ignore the handtracking\n\nThe story is nice, the world is cute and I love the Wintergatan music. As all VR puzzle/story games I find it a bit short for the money, but that seems kind of standard in VR so lets not deduct points for that.\n\nI was hyped for the handtracking, but got really disappointed by that. The tracking is lost if you have you hands high or low which makes some puzzles a pain to solve (e.g. the mountain). Things get stuck to your hands regularly, sometimes items, sometimes the world which makes navigation really hard. And sometimes the game/world went \"glitching\" and starting to draw black squares which required a restart of the Quest to get fixed.\n\nSo.... after the first 2 worlds I decided to give up on handtracking and switch to the controllers and then the game was amazing. The control is really nice, there is really no need for handtracking. I prefer the controllers over handtracking even when it was working ok.\n\nTo conclude, 5 stars without taking handtracking into account, 2-ish when including it.\n\nHelpful | 17", "hiddenjade24 days ago\nThe curious tales of the stolen pets\n\nI love this game. The graphic is so adorable. The puzzle took me several tries to solve. I failed the hand tracking, so used controllers instead. Otherwise this should get 5 stars.\n\nHelpful | 0", "damc34Apr 17 at 10:01 PM\nFun Puzzles + Touching Story\n\nTook me about 2 hours to 'beat' the game with 87% completion. I had fun trying to figure out how to rescue all the animals. The adorable story got me choked up a couple times. I can't wait for my kids to try it now.\nThe only reason I gave it 4 instead of 5 stars is the shortness. I would have loved one more puzzle at least.\n\nHelpful | 29\nDeveloper ResponseApr 21 at 1:21 AM\n\nThanks for sharing, hope your kids enjoy it as much as you did:-)", "808NMagzJun 11 at 1:13 AM\nReally Fun and Great Experience\n\nAlthough the hand tracking was really frustrating, the controls work way better! Thats the reason for the 4 stars. But once you switch to the controllers, it will be a 5 star experience.\n\nIt may seem like a game for children, but dont let the cuteness fool you! So much fun and very interactive!\n\nI love the graphics! It just brings out the inner child in you!\n\nHelpful | 2", "DoctorMikeReddyMay 31 at 7:22 AM\nShort :-( Sweet :-) but too expensive D:\n\nThe presentation, performance (audio-wise) and polish are excellent. What you get are (too few) wonderful little worlds/memories to explore, but the internal logic of the puzzles is inconsistent, being mainly press/push everything or I have a thing now what can I do with it? type challenges. For a younger audience - probably unable to safely wear VR headsets - this lack of depth is probably fine. I did enjoy the experience, but it seemed a little shallow, and quick for the money. There are cheaper, and longer, experiences out there. If it had, say, 3-4 more worlds to explore, or it was half the cost, Id have 5 * ed it\n\nHelpful | 3", "dellenerdsquadJul 12 at 6:30 PM\nCharming game!\n\nMy family loves this game. The story is cute, the worlds are impressive, and the music is soothing. We definitely recommend this game. The only complaint is that it ended.\n\nHelpful | 2", "CongratulationsMay 25 at 5:39 AM\nHand tracking.\n\nFirst to let you know I played this on hand tracking, its a enjoyable game graphics ok etc. just the hand tracking can be frustrating sometimes what I mean you try to move the island and not always move as you pinch. also if you get you move you hand out of the way its moves the island. Is it for anyone this app I would say no more like for new people in VR.\n\nHelpful | 3", "GavinLeon18 days ago\nAddicting fun\n\nOur whole family loved this game. Definitely recommend for a fun puzzle game.\n\nHelpful | 1", "loganbhardy19 days ago\nSuper cute\n\nJust a really cute game, you and your kids will love it.\n\nHelpful | 0", "kristyprcJun 5 at 4:13 PM\nWonderful, a little short though\n\nIts a beautiful game with several different scenes. You solve the puzzles with clues and find the pets. Theres also coins to discover in each scene, so that helps extend the gameplay. I would buy it agin just to enjoy those graphics.\n\nHelpful | 2", "kimbiecookieJun 10 at 1:02 PM\nCute but very short\n\nVery cute game and I enjoyed playing but it is very short. There is only 5 little worlds and an adult can finish it in an hour or less. Great for younger ones to enjoy VR though while sharpening their critical thinking skills. The graphics are adorable but very little replay value IMO.\n\nHelpful | 1", "ltdavid88May 10 at 7:55 AM\nShort and sweet \n\nA lovely immersive adventure. Game is short however really enjoyed making my way around the worlds solving fun little puzzles.\n\nThe story is well written and keeps you entertained from start to finish. Ideal for all ages and makes a good family game when streaming.\n\nThe visuals of the game are very smooth and it runs well, I found myself looking around and through the doors, tunnels and obstacles enjoying the experience.\n\nHelpful | 5", "FORTY4VRJun 29 at 1:30 PM\nGreat little story!\n\nGreat story and very cute. Hand tracking feels like it is still in development but I found your hand movements need to slow down and be very deliberate and that helps.\n\nHelpful | 1", "ParadiseDecayMay 23 at 7:02 AM\nHand Tracking is HERE!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=4bt-mksG_rc\n\nMy Initial Thoughts:\nI have always been a big fan of this cute puzzle game on the Oculus Quest, so I was really curious (no pun intended) to try out the NEW HAND TRACKING mode.\nFor the majority of the experience everything seems to be working fine, it can feel a bit janky, but it is new tech and I have confidence everything will be smoothed out over time.\nYou will need to remember to take your time playing this game with HAND TRACKING so be sure to take slow and deliberate movements.\n\nHelpful | 1", "chronictiaJun 4 at 6:20 PM\nHandtracking is frustrating\n\nThis was a cute game with excellent detailed worlds, where you had to solve puzzles to progress. I don't understand why you would shoehorn hand tracking into it. It just isn't worth it. Create a NEw game that has hand tracking designed to work with it from the beginning. The challenge has been posted and the gauntlet thrown down! You can do this!!! I look forward to watching it happen.\n\nHelpful | 4", "BerserkerClawsJul 19 at 5:55 AM\nI like it BUT...\n\nThere is a massive bug while playing with hand-tracking which cover every moving part with some flickering black squares after 10 or 15 minutes.\nPlus the hand tracking need a little adjustment, especially on the rotation.\n\nThank you.\n\nHelpful | 1", "remarkablMay 23 at 9:11 PM\nhand tracking wasnt tested properly\n\nHand tracking control on Quest does not work more than %50 of the time. (It works well for the few features like pressing buttons and interacting with certain objects)but after 2 hours struggling, it seems they didnt even test this feature, simply rushed it out as fast as possible to keep up with the other hand tracking experiences. it is impossible to spin the island (wouldnt be a problem if I could at least set it up so I could physically walk around it, instead the island teleports to the far side of my space whenever I resented) and there is at least one mechanic that moves way too fast for hand tracking to grab, much less three times. these two issues show a lack of thought put into implementating this admittedly experimental feature. When you push an update that fixes the glaring issues with handtracking Ill gladly update my rating to 5 stars. That said Im otherwise satisfied ($15 could be a bit steep for a game this short, but Im very happy to support a company that wants to bring cool stuff such as hand tracking to their games, and its an indie title so I understand ) and what you get is a very charming and surprisingly immersive experience that really shines as a prime example the things VR is capable of.\n\nHelpful | 5", "Crownofthorns9 days ago\nBug\n\nBlack flickering pixelation in center of screen.\n\nHelpful | 2", "dennis.semsey.7Apr 25 at 5:57 AM\nFun, easy, stress relieving\n\nThis game is simply great. The puzzles are on average pretty easy although there were times I found myself stuck and racking my brain on what to do.\nThe story is emotional and has a good lesson to go with it. The narrator also did a great job.\nThe worlds were beautifully done and really engaging.\nA fun game for all ages!! A great way to take a few hours to relax especially during these stressful times.\n\nI think the main complaint is that the game is short. Yes, it is pretty short. It took my about 2 hours to complete. The only reason why I was bummed about this was because I wanted to play more, not that I felt gypped or anything. The game is 14.99 and you are guaranteed to have at least 2 hours of a ton of fun. The last time I went to the movies I spent 13+ dollars to see an hour and a half movie. This game is worth way more than the price of a movie ticket.\n\nHelpful | 4", "nixon118Jun 22 at 3:13 PM\nGame-breaking Glitch\n\nSometimes when Im playing this game, I get a random glitch where everything is covered in blinking black squares, it makes the game impossible to play and really hurts my eyes, closing and restarting the game doesnt fix it\n\nHelpful | 3", "cuervosunJun 25 at 5:22 PM\nSurprisingly Fun\n\nQuick and fun puzzle game that's surprisingly relaxing. Great graphics. Hand tracking was hit or miss. Great buy\n\nHelpful | 1", "NubianMijaMay 24 at 5:21 PM\nCute game\n\nPurchased this for my six year old grand daughter and I ended up play it myself. I dont like using my hands because its not precise and harder to pick up, and manipulate island; so using the controllers works for me. I like that it makes her think and strategize\n\nHelpful | 0", "chucklasMay 23 at 7:03 PM\nGreat game, hand tracking not so much\n\nHad to drop this to 4 stars after the addition of hand tracking. Great game overall, but hand tracking is clunky and not intuitive. As a whole, the game is great, just do t expect anything from the new update.\n\nHelpful | 0", "RyanGZB16 days ago\nAmazing game - Just really short\n\nThis game is beautiful. Its a nice little story and some great worlds.\nI didnt try the handtracking as most people seemed to have a problem with it, but the controllers worked perfectly throughout - they didnt make the game feel uncomfortable or any less real.\n\nIt took me less than an hour to finish all the puzzles and collect all the coins. I wish there were more levels, and some way harder levels too, but I thoroughly enjoyed it! Every level/world was so well crafted and enjoyable.\n\nIf you manage to catch it at a decent price, its definitely worth a go! A nice little chill out game.\n\nHelpful | 0", "frances.esplinJun 28 at 6:11 AM\nExcellent\n\nMy grandson has played this and he said it was perfect.\n\nHelpful | 1", "SorallinMar 9 at 9:08 PM\nStress-free and fun!\n\nI absolutely love this game!! Like other reviews have mentioned, it's about a 2-3 hour experience (depending on how good you are at puzzles), but for me, it was worth it. I liked being able to sit while rotating and raising/lowering each island with the toggles... It made it a lot easier to explore each island without moving too much. The graphics were beautiful and I wish I could take home all the cute pets I found! I got stumped here and there on puzzles, but never felt stressed at all, which is nice for a game.\n\nQuestion for the devs: Why is there a Game 1, Game 2, and Game 3 when each game is the exact same?? I finished Game 1 and was excited to play Game 2, thinking that the story line continued, only to be disappointed that everything was the same. Just curious. =)\n\nHelpful | 16\nDeveloper ResponseMar 17 at 8:42 AM\n\nHi! We're happy you like the game :) The different \"games\" you can choose are save slots, so more people can enjoy the game without taking away any progress from one another. Cheers!", "thecuriouspixelMay 30 at 12:21 PM\nCute game with terrible performance\n\nThis game is very cute. I played it while my daughter helping and watching me via casting.\n\nWhile a bit short, the puzzles are not too hard yet entertaining and the interactions are well made.\n\nThe one thing that really detracts from this game is the frame rate. The animation of the pets is of a very slow frame rate. You can see a lot of ghosting and jitter. One of the worst performing games on the quest. It doesnt help that I often play this game after moss, which runs beautifully.\n\nEven with that, the game was fun and was almost worth the purchase.\n\nHelpful | 0", "pepeR0Ni21 days ago\nYes but no\n\nI will start with the bad stuff, one is not related to game, its the un-evolved hand tracking in quest, with it could be better, make sure to be with well lighten room and keep hands seen. Another problem that there's some technical problems, pitching is weird and picking up too, idk how to explain it without to show it.\n\nThe good stuff; the game is cute and if you love stories and exploring your own story as someone its your game, its full of sounds and movement and its just nice to do one level from time to time, its not a game that you would want to complete by one gameplay its long demo with easy levels but its nice playing it and good vr experience.\n\n\nWARNING: If you do get frustrated quickly its not for you, hand tracking is not the best yet and tend to glitch out some time, not just in this game but in any game.\n\nHelpful | 0", "Tott_DonettaMay 19 at 1:06 AM\nFun but very short.\n\nThis is a very pretty game, the puzzles are very easy, it took me a little over an hour to complete it and then another half an hour to go back and get 2 coins that i missed.\nits charming and well made, but with just 5 short puzzles and zero replayablility this is probably the quickest experience ive had so far on the Oculus. at 15 Euro its very expensive for such a brief experience.\n\nHelpful | 2", "jaybee101509Jun 10 at 3:20 AM\nAmazing\n\nGreat game very fun even my 4 year old plays this game very nice game for the whole family hand tracking works great\n\nHelpful | 1", "Stroud12Apr 23 at 6:41 PM\nFun but really short + very easy\n\nThe puzzles were cute and clever but very easy to solve once you distinguish what youre able to grab. The coins can be somewhat hard to see because graphically its not too defined but thats just the style. I could see this game being good for younger kids due to its difficulty. It does have a cute story and theme of cherishing your time with family, so if that sounds interesting then this is your cup of tea.\nI did get this with a bundle with keep talking and nobody explodes, otherwise I personally wouldnt have gotten this, but it is a good game for its price.\n\nHelpful | 0", "topchiyevJun 24 at 4:06 AM\nPerfect\n\nNice game for courious ones\n\nHelpful | 1", "MaelwolfApr 19 at 11:13 PM\nA solid, simple puzzle game\n\nAn enjoyable and cute little puzzle game. I quite liked the diverse stages, and really only had an issue with collecting coins which could be kind of tedious on certain levels. I cant say there is a ton of replayability, but I dont regret my time spent with this puzzler.\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:19 AM\n\nThank you so much for sharing, happy to hear you liked it!", "Twissy-87Jun 24 at 12:29 PM\nGorgeous and cute but short and easy\n\nDefinitely beautiful and fun but the puzzles are quite easy and the game is too short.\n\nHelpful | 1", "emvoncooperJun 1 at 4:48 AM\nBeautiful Peaceful Absorbing\n\nI love puzzle games and this is just gorgeous - love love love it!\n\nHelpful | 1", "bdevineFeb 6 at 1:42 AM\nFun to work through\n\nThis was a fun and interesting puzzle game. It is a short play through but would be great for kids to solve. I enjoyed the interactive aspects of being able to move the scene around and up and down as well while seated. It is probably better enjoyed in a standing position but I am unable to stand for extended periods.\n\nHelpful | 24\nDeveloper ResponseFeb 11 at 1:35 AM\n\nThanks for sharing, great to hear you enjoyed it!", "Tummie555Apr 19 at 3:15 PM\nLovable\n\nVery well executed puzzle game. Find all the animals in 5 beautiful 3d mini worlds. Collect all the hidden cookies along the way. Felt satisfying and happy. Begins easy, sometimes get hard. Only 1 animal was frustrating: the pre historic waterfall buttons. Had to keep pressing the rocks randomly after system behind it wasn't clear. Frantically dumb pressing the rocks solved the puzzle instead of thinking my way through. Unintuitive lay-out of that particular puzzle. But all the rest (99%) was awesome.\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:20 AM\n\nThank you for sharing your impressions, we are very happy to hear you liked it!", "erikingpinMar 23 at 10:21 AM\nIts so heart warming\n\nIdk why, your game makes me cry, it tugs at my heart for some reason, the music and the art is so beautiful, I know it's supposed to be a child's game, but somehow, for me, it's a safe place, it's like the corner where I used to hide, but here, it's nice and warm, thank you.\n\nHelpful | 3\nDeveloper ResponseMar 30 at 8:19 AM\n\nWow, reading this warms our hearts - thank you for sharing!", "Rade0nFighterFeb 7 at 4:49 PM\nDelightfully wholesome\n\nWhat a wonderful game! Not the longest at an hour or two but fair for the price especially considering its not one of the biggest titles.\n\nOverall a very pleasant experience indeed. Would definitely buy again and thank you to the devs.\n\nOnly suggestion would be more memories but hey we always want more of something we like!\n\nHelpful | 11\nDeveloper ResponseFeb 11 at 1:35 AM\n\nFantastic to hear you liked it, thanks for sharing!", "JuJuSonJun 13 at 8:30 PM\nOk game gets boring quick\n\nThis game is ok but it is boring, the hand tracking is hard to use though.\n\nHelpful | 1", "EwebechaMar 3 at 9:12 AM\nBeautiful!\n\nGorgeous graphics and simple gameplay. Very easy puzzles- definitely a great game for kids. I hope to see more games like this on the Quest geared for adults: harder puzzles but with the same beautiful graphics, unique concepts, crisp mechanics! I dont play zombie shooters, space wars, military fighting themed games. So this was a nice add from the slim selection in the oculus store.\n\nHelpful | 4", "gricesJun 1 at 1:21 PM\nNice little game. Bit short.\n\nCompleted in no time. Very short.\n\nBut fun while it lasted. Hand tracking is off but controllers worked great.\n\nHelpful | 1", "svupsMay 11 at 8:05 PM\nLove this game.\n\nNew to VR. First game I played that kept me interested. Would love to play more levels.\n\nHelpful | 1", "LittleMsSamMay 7 at 3:08 AM\nShort but very cute Game!\n\nI really enjoyed playing this Game. It is short but very cute! Only the last Chapter was a bit too easy ;)\n\nHelpful | 0", "Mr.PBHApr 10 at 3:53 PM\nGreat game. VERY GLITCHY!!\n\nThe game itself is beautiful and fun. Its great to play and runs smoothly. Then it will either appear to have black rectangle shapes covering half of the screen or the image will freeze on the screen and it will force close.\nI hope this gets fixed in future updates because as it stands, I can barely get through a level without one of the glitches forcing me to restart the game.\nIve played for about an hour and its happened five times.\nOculus Quest with full battery.\n\nHelpful | 2", "AngryDutchDanMay 9 at 2:34 AM\nVery funny game\n\nVery funmy to play we want more levels please\n\nHelpful | 0", "agirlnamedkirsten17 days ago\nWhy did I wait to buy this??\n\nAnother game that I wish wasnt short and could be much longer!!! So much fun\n\nHelpful | 0", "MrEDate80Apr 14 at 5:16 PM\nLots of fun, a little short\n\nFun game, in about 2 hours, Ive got all the pets except two. Love that it has different save slots so much kids can play without overwriting my game\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:21 AM\n\nHope your kids enjoy it!", "rowee270Feb 3 at 6:46 PM\nBeautifully imagined game\n\nThe music, graphics and touching story really makes this a wonderful experience. I only take off one star due to it being relatively short and reasonably easy to solve. I know the quality /quantity argument, but 5 levels is still a little short for what i expected. It's certainly a quality built product but after completing, there's not much reason to go back.\n\nHelpful | 4\nDeveloper ResponseFeb 11 at 1:39 AM\n\nThanks for sharing, happy to hear you liked it!", "GenericKiwiApr 20 at 7:33 PM\n\nBeautifully made game with tiny worlds to explore. The controls were very easy for my family to get used to.\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:19 AM\n\nWe're so happy to hear, thanks for sharing!", "rhianelise95Apr 9 at 9:12 AM\nWay too short\n\nThe puzzles were fun and enjoyable, however it was very very short and could have the potential to be so much better\n\nHelpful | 0", "SimJooMay 30 at 2:52 PM\nNot for me\n\nRather short (under an hour) and gets boring quickly\n\nHelpful | 1", "GamersEvilMar 19 at 1:28 PM\nGorgeous game\n\nWow this game is beautiful. The art style is fantastic. The narration adds a lot of feelings to the game. The levels are unique with lots of interactions. Thank you for making such a masterpiece.\n\nHelpful | 0\nDeveloper ResponseMar 30 at 8:19 AM\n\nThank you for sharing your impressions!", "jonathanoberFeb 18 at 3:58 AM\nCute game, over too quickly\n\nThe game has a playful cheerful appeal though it tells a serious story of reconciliation and family. The visual style is great and imaginative. Standing in the worlds and looking over the dioramas made you feel like a giant playing in a storybook. Very well made game. Fun for all ages.\n\nHelpful | 1\nDeveloper ResponseFeb 19 at 12:24 AM\n\nThank you so much, happy to hear you liked it!", "Craftymum66Feb 22 at 2:26 PM\nFun and interactive\n\nLoved playing this game but my only wish was that it was longer, more memories to solve.\nI was able to play this game whilst sitting, thanks to being able to rotate the island memories around and up & down.\nWhich my body was grateful for and the graphics are stunning and the puzzles we fun to solve.\nThank you for a good game \n\nHelpful | 1\nDeveloper ResponseFeb 24 at 4:20 AM\n\nThank YOU for sharing your impression, glad you liked it so much!", "youkilledmydogFeb 17 at 2:11 AM\nPeaceful\n\nSimple intuitive controls. After experimenting with several types of games, this is THE intro game for a young kid imo. No pressure, comforting narrator, relaxing colorful backgrounds, and magnificent floating island world puzzles. A child can have a rich, rewarding experience in 15 minutes, before the weight of the Quest on their head gets too uncomfortable. An adult can appreciate the cleverness of the puzzles and relaxing, no stress chill break from light sabers and zombies.\nMy preferred way to play is in an 8x8 roomscale boundary, while sitting in a gaming/office chair on casters to roll around the environment, but it is comfortable to play standing as well.\nAccidentally discovered rotating/raising/lowering island with joysticks but not til second world. Helps a lot for sitting play.\nExperienced one instance of background circling clouds turning to flickering black squares. This black-squaring crash has occurred in multiple games for me, intense combat games, narratives, etc.\nIts not a game-specific issue, its a Quest firmware issue. Just power-cycle Quest and hold on for firmware updates.\n3/5 paintings in and thoroughly satisfied with purchase. More please\n\nHelpful | 1\nDeveloper ResponseFeb 19 at 12:22 AM\n\nWow, thank you so much for sharing your impressions, we are super happy to hear how much you like it!", "NukemarineFeb 4 at 5:08 AM\nBeautiful game, but really short\n\nI love 3rd person games. Even better are miniature 3rd person games like BlazeRush, Witchblood, Moss, etc. The Curious Tale fills that enjoyment though it's less third person and more model puzzle solving. If you ever seen the VR short-story of The Rose or The Matchstick Girl, TCToSP has those visuals including The Matchstick Girl's stop-motion like framerate for characters moving around. On top of that, there's a nice narration by the grandfather figure throughout the games five puzzle levels and intermissions.\n\nGameplay is pretty straight forward. You have five miniature asteroid worlds (shades of The Little Prince) you can control through rotation and elevation with thumbsticks or grabbing (use the thumbsticks). It may even be fun if you have the room to walk around the model instead of moving it. You can grab small items or click on them for interaction to complete the simple puzzles and find hidden items if you consider the glowing stars pointing to the locations as hidden.\n\nThat said, this is a very short game. If you buy it, expect to beat it in under an hour. The puzzles are not that mind-bending and you might find it harder to find the various coins than the hidden pets (not sure if stolen ever came into play). Given its simplicity and warm hearted story you might just want to show this off to other people. You're given 3 save spots so that's easy enough.\n\nFour stars just for the short play length. With more levels, this could be a five star game at the given price. I wouldn't mind being able to look at the levels at human scale in first person as well (perhaps clicking on the human characters or pets for their POV).\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 1:39 AM\n\nThanks for sharing and for your suggestions:-)", "ArnookieNov 14 at 11:39 AM\nBeautiful and charming and such a treat.\n\nThe Curious Tale of the Stolen pets is a charming and beautiful game that puts you in a magical world full of delight!\nExperience an interactive tale of childlike wonder! Such a delightful experience to behold in VR with great visuals that really stand out! The music and sound is really fitting to the atmosphere of the game and really adds to its charm. Your task is to help your grandfather solve the mystery of the stolen pets by exploring wonderful miniature worlds crafted from the ground up for VR. Use a hairdryer to melt snow in a wintery landscape search the wreck of a pirate ship and much more! Find solutions to the puzzles and interactions to help locate your stolen pets that are cleverly hidden throughout the game. Every world is unique, full of interactions and colorful life. With a charm of its own the Curious Tale of the lost pets is something you need to experience in VR to enjoy to fullest.\nThe game can be enjoyed by anyone no matter what age. With a delightful story and beautiful crafting this game really stands out, it would be easy to loose a good couple of hours in this game.\nI highly recommend this to anyone who enjoys interactive puzzle games.\nA huge thumbs up from me. \nReviewed by ArnookieVR\n\nHelpful | 80\nDeveloper ResponseNov 14 at 11:51 AM\n\nThank you so much for sharing this, it makes us extremely happy that you like the game so much!", "Mixer1207Feb 1 at 6:59 PM\nCute Game. Well worth a look.\n\nI have only play the first level and I can tell you that this game is certainly worth a look. I have read other reviews and seen videos on YouTube. The biggest complaint seems to be that the game is too short. That's why I'm giving it 4 stars. If DLC were to be released for this game I could easily up it to a 5-star review as this game is a game that, like Moss and Fisherman's Take before it, every VR owner should play.\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 1:36 AM\n\nThanks for sharing!", "DoktorAstroFeb 17 at 9:31 AM\nVery nice nostalgic game\n\nIf you are a puzzle lover and a nostalgic person than that is made for you. Im definitely that and i can't stop thinking about those pretty worlds and the memories i get. It's just amazing and just beautiful but very sadly: the gameplay is kind of short.\n\nHelpful | 0\nDeveloper ResponseFeb 19 at 12:23 AM\n\nSo happy to hear we were able to strike that nostalgic chord, thanks for sharing!:-)", "MadMacMayMay 23 at 3:12 AM\nLovely little puzzle game\n\nBrought this game for my daughter. Hand tracking is still early days yet but using the control wont deduct from the enjoyment. It will keep her occupied for ages worth the money and the peace and quiet.... absolutely\n\nHelpful | 0", "timhobbs610Apr 5 at 1:38 PM\nCute game but short\n\nSuper cute game, very creative puzzles, but beat it in a about an hour, not worth the money. Create more levels!!!\n\nHelpful | 1", "HelloAlice2019Nov 14 at 10:58 AM\nBeautiful puzzle game\n\nWith magical fairytale dollhouse-mode worlds, filled with adorable little characters and Amelie-style background music this puzzle game is beautiful, nostalgic and a little sad. Maybe it just is for me, a mid-30's lady who loved fairytales when she was a kid. Almost feels like the narrator is my grandfather talking about my Summers when I was little :)\n\nPS. Always awesome to hear a few words from developers! Can't wait to show this game to my kids, I know they are going to love it.\n\nHelpful | 41\nDeveloper ResponseNov 14 at 8:36 AM\n\nWow, such amazing feedback and it makes us very happy to hear how much you enjoyed the game!", "kewldosJan 25 at 10:17 AM\nGreat fun but needs a floor option!\n\nMy 5 year daughter and I were fascinated and thrilled by this game, the amazingly cute graphics and fun storyline and enchanting gameplay. But when playing standing up you are floating in the sky and this just scares my daughter so much she doesnt want to play! It really needs an option for a floor or a magic carpet and I think this will allow her enjoy the game without freaking out so much!\n\nAlso as she is about 1m in height, we found she had trouble interacting with some of the higher items on the islands. We couldnt find an option to lower the islands so she could reach all the items. We found we had to keep swapping the headset, readjusting the straps, etc which detracted from the gameplay.\n\nOverall a great cutesy game with some fun puzzles that keep us guessing and thinking tighter that I hope my daughter will be able to enjoy if you can add a floor option and a way to adjust the view so she can reach the tops of the islands !\n\nHelpful | 0\nDeveloper ResponseJan 29 at 11:12 AM\n\nHi! Happy to hear you liked the game, and a good idea about the \"floor\":-) As for raising and lowering the worlds, this can be done by pushing the stick on the Touch controller up or down - please give that a try!", "anthonshFeb 4 at 5:30 AM\nShort but very immersive\n\nHaving an interactive tiny world right in front of you is extremely immersive. The gameplay is simple and the game is very fun and relaxing. Great for roomscale where you can physically walk around the islands, although you can play sitting too.\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 1:40 AM\n\nAwesome to hear, thanks for sharing!", "kiirstinleighMar 7 at 1:05 AM\nSuper cute and a lot of fun!\n\nI really loved this game!!!\nBut I beat it in about 3 hours total playing time. Wish there were more levels! Maybe updates later?\n\nHelpful | 0", "olga.m.lozaFeb 16 at 8:24 AM\nBeautiful game but GLITCHES on Quest\n\nVery beautiful game, we had fun getting through level 1. Then the islands started turning black and getting pixelated. This way you cant play it at all. Reinstalling doesnt help. Were on Quest. Seems this has been an issue for months and still no fix.\n\nHelpful | 3\nDeveloper ResponseFeb 19 at 12:21 AM\n\nHi, this is an issue for some players on different games - what sometimes work is to restart or re-install the headset. Please give it a try, fingers crossed it fixes the problem!", "Williams_NestJan 31 at 4:10 AM\nCrashing every 20 minutes\n\nVery nice gameplay - extremely nice scenery - but .\n\nI crashes with graphic distortions and exits. The abrupt exit corrupts the state of the game - and when there is no other way of saving than the builtin way.\n\nI have uninstalled and reinstalled several times. I have factory reset my Oculus Quest more than once. Other games and apps are running perfectly - but not this one.\n\nThere is definitely a glitch in the matrix!\n\nHelpful | 6\nDeveloper ResponseFeb 1 at 2:20 PM\n\nHi, very sorry about your issues - it's the first time we hear about this. We will investigate, but if you have the time and opportunity it would be very helpful if you could send an email to support@fasttravelgames.com with as many details as possible (when the crashes happens etc) and we will keep you updated on what we find!", "Adrian.CarrieresJul 13 at 11:27 AM\nShort and hand tracking not that good\n\nNice game but a bit short and the hand tracking is way too bad to play only with it (sadly)\n\nHelpful | 0", "SkywalkezFeb 15 at 8:00 AM\nNice game oveall\n\nThe game is beautiful, but puzzles are too simple for adults. Kids will for sure love it though. Also the story is short and you will finish it in a couple of hours max. Not a game to play more than once...\n\nHelpful | 0\nDeveloper ResponseFeb 19 at 12:18 AM\n\nThanks for sharing!", "Neva2L8Feb 2 at 6:15 PM\nLot's of Fun..but keeps crashing!\n\nEnjoyed playing and very entertaining but keeps crashing every 20-30 min. Hope an update can fix it as it's well worth the price. The graphics turn into black squares but the menus are fine and allows you to quit.\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 1:38 AM\n\nHi, this is an issue that some players experience with different games and an investigation is currently ongoing why this is. Sometimes restarting or re-installing the headset seems to get rid of the issue, maybe you can give that a try. If it does not help, please send an email to support@fasttravelgames.com and we will try to help you out.", "laurak123Jan 26 at 7:23 AM\nFantastic\n\nI thought this game would be for children but when I read the other reviews, i bought it. Best decision ever! What an experience! This is why I Love VR! The most beautiful levels / locations with cute original puzzles to solve while playing seated or standing. The visuals in The different levels of The game are so beautiful. And The storyline is amazing. I was in tears at The end of The game: both from Happines from The plot, as well as sad that The game was over. Comparable to The game Moss. Please tell me there is more of this.\n\nHelpful | 0\nDeveloper ResponseJan 29 at 10:30 AM\n\nWow, thank you very much for sharing your impressions! So happy you liked it!", "SankyuFeb 9 at 6:57 PM\nSuch a beautiful game \n\nThis game is very sweet and cute. I had a fun time solving all the puzzles and collecting all the coins. The story is really beautiful. I hope there will be more games such as this one. One of my favorite games \n\nHelpful | 1\nDeveloper ResponseFeb 11 at 1:33 AM\n\nThank you for sharing, we are so happy hear how much you like it!", "Gromit4uMar 7 at 5:11 PM\nAdorable!\n\nA magical and engaging world you will not want to leave. The characters are adorable!!\n\nHelpful | 0", "quocminh9Mar 16 at 9:14 AM\nBeautiful and enjoyable gameplay\n\nVery enjoyable! I wish the game is longer.\n\nHelpful | 0", "RockLoiMay 22 at 9:13 PM\nMissing hand tracking feature\n\nThe game itself is a cute, well-made diorama, but whilst the hand tracking works well enough given the inherent limitations, the world rotation is the reason I'll be putting this down for now in the hopes of an update. It constantly registers that I'm trying to rotate the map whenever my hands are closed, and even sometimes when my hands are by my sides.\n\nThis is a perfect untethered experence where you can walk around and examine all the nice little details up close, so if there was a setting to disable map rotation completely for room-scale users it would make it a considerably more playable experience.\n\nHelpful | 1", "tonyhaydarDec 21 at 11:31 PM\nGlitches???\n\nI purchased this game after reading all the nice reviews but there are glitches and all the writings, pictures blackened! I uninstalled it and installed again, twice, its not corrected. I am returning it back only to purchase again if you could tell me how to correct it. Thank you and Happy Holidays! (P.S.: I am giving it 4 starts without even playing because I dont want to bring games ratings down, I am sure its a beautiful game and looking forward to playing it with my kids).\n\nHelpful | 10\nDeveloper ResponseJan 2 at 2:26 AM\n\nHi, this is apparently a rare issue for some Quest players on multiple games at the moment. We know that Oculus is looking into this and hopefully a firmware update will resolve it soon.", "wreichNov 14 at 12:14 PM\nWhimsical and super-cute\n\nI've always believed in small-scale VR experiences, and this game really pulls it off. You are in front of various miniature floating islands, full of magic and little trinkets and knobs and levers, trying to figure out how to \"save\" (meaning: find) cute little pets. The worlds feel very interactive and alive. Best of all, they are filled with childhood nostalgia that many grown-ups can relate to. Seriously, who doesn't want to have a reason to play with miniature trains again? ^^\n\nHelpful | 22\nDeveloper ResponseNov 14 at 12:16 PM\n\nThis is exactly the kind of emotions we hoped to evoke when making this title, so thank you so much for sharing!", "DelorNov 14 at 10:19 AM\nBeautiful, but really short\n\nAn amazing game, with a perfect narrator voice.\nOnly problem, it is a way too short experience for 15 euro. Solved everything within 90 minutes, including all catchable coins.\nA nice game to show vr to the family, but not a game for a whole day.\n\nHelpful | 19\nDeveloper ResponseNov 14 at 10:53 AM\n\nGreat to hear you found the game amazing! We also believe its a perfect game to let friends and family play, and have really tried to focus on quality over quantity to deliver something with a lot of heart and immersion:-)", "kristin.sherwood5Jan 9 at 8:49 PM\n\nVery sweet and immersive game. It's fairly short, but I enjoyed every moment! The graphics are beautiful and the puzzles clever. Unlike many games, it can be played in a small space sitting down. There are five unique and charming environments to explore, each with their own adorable animals. Thank you for making this game!\n\nHelpful | 2\nDeveloper ResponseJan 29 at 11:13 AM\n\nThank YOU for sharing your impressions!", "BossbeastNov 14 at 11:38 AM\nbeautiful\n\nits pretty short but a beautiful looking game. Full of charm. Got me off of pistol whip for a few hours! I have no issues paying for a short game if its this well made. Thoroughly enjoyed it. Some may rate it lower due to its length but Im rating it on the enjoyment I had in that time do it gets 5 stars from me.\n\nHelpful | 18\nDeveloper ResponseNov 14 at 11:51 AM\n\nThank you so much for sharing your impressions, we are happy we could help you relax from being John Wick for a while!", "VocusFeb 2 at 7:59 AM\nVery entertaining\n\nI bought it for my niece but I was caught up with it, Ive been looking for the pets and coins helping my niece and Ive been spending really good time with her, really good and fun.. \n\nHelpful | 0\nDeveloper ResponseFeb 11 at 1:36 AM\n\nThanks for sharing, it makes us very happy to hear that you got some quality fun time with your niece!:-)", "davekelly6Feb 20 at 11:28 PM\nIssues\n\nWhen I got to the 3rd level it went all glitchy and blurry and so I couldn't play any further please sort out or tell me how to I have only left it on a review because I didn't know how to contact support thanks\n\nHelpful | 0\nDeveloper ResponseFeb 24 at 4:20 AM\n\nHi, sorry to hear about your issue. This is something that seem to appear for a limited amount of users in different games, sometimes re-starting or re-installing the headset helps. Please give that a try, if the problem remains please send an email to support@fasttravelgames.com and we will connect with you there!", "brian.braddock.395Feb 15 at 4:18 PM\nFun little game\n\nShort but interesting, great idea for a puzzle game, needed a little more\n\nHelpful | 0\nDeveloper ResponseFeb 19 at 12:19 AM\n\nThanks for sharing your impressions!", "HaneyfambamMar 14 at 12:10 PM\nGreat graphics\n\nNeed to add a hint option. Im stuck on a level and need a hint or clue to find the last pet\n\nHelpful | 0\nDeveloper ResponseMar 17 at 8:40 AM\n\nHi! Drop us a line on support@fasttravelgames.com & maybe we can help you out :)", "nr6542May 23 at 8:47 AM\nYou had me at Wintergatan\n\nLovely, gorgeous, fun to explore and figure things out - I hope we'll see more games like this in VR.\n\nHelpful | 0", "MrKappaApr 9 at 10:07 PM\nBeautiful game / must get title\n\nGreat and absolutely adorable story game for the entire family. Wonderful graphics and scenery and immersion ... plus its a stand in place game which means no VR sickness ... the pets were absolutely adorable and I loved petting them after I found them. It was short but seemed like the perfect length without being exhaustive. I hope they make other games similar to this .. really cool indeed.\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:22 AM\n\nWow, thank you so much for sharing! We love this game as well:-)", "craig.stephenFeb 9 at 10:47 AM\nCute but wait for a sale\n\nEnjoyed this game but it's extremely short (~1hr) with little replayability. Having said that, the graphics and story are extremely engaging and I personally am looking forward to what this. Studio puts out in the future.\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 1:34 AM\n\nThanks for sharing! We have more games for the Quest coming...:-)", "vrabbitsNov 14 at 5:20 PM\nWow\n\nWhat a cute little game. Pretty short hopefully more to come but I like what I got. So funny to just walk around these little islands and look and figure out puzzles. Took of a star because I've had to reinstall it twice due to way to much stuttering. Aka all the bright colors go black with little squares so agrevating to have to restart but it's sort so I don't mind. Also another great feature is multiple accounts making it fun for kids thx developers.\n\nHelpful | 4", "W0nderStiviDec 12 at 4:55 AM\nFantastic experience!\n\nI just played through the game, and I loved the experience. Level art and layout was interesting and well-made and had good balance of difficulty and available hints. Solving the puzzles sparked laughs and cheer and we adored all the lovable pets.\n\nI wish there were more levels or challenges, either as DLC or a sequel.\n\nRecommended!\n\nHelpful | 3\nDeveloper ResponseJan 2 at 2:30 AM\n\nWow, thank you so much! We would love to make more content for the game (we have currently updated it with a minor \"Christmas Treasure Hunt\" until Jan 13), so hopefully it becomes a success!:-)", "lucasdidthisDec 12 at 2:38 AM\nBeautiful little gem\n\nAbsolutely adorable experience! If you're looking for an action packed, loud game this is not for you, but if you are in for a charming interactive adventure you are going to be pleased. The soundtrack is beautiful, too, so the only little downside is the rather short playtime. And I really wish ther'd be german voice acting!\n\nHelpful | 1\nDeveloper ResponseJan 2 at 2:30 AM\n\nThank you so much for sharing!", "RanulorNov 18 at 5:15 AM\nBeautiful game great for VR discovery\n\nAs many already said, the game is charming, cute, and beautiful. So are the dialogs and the music. It is a soothing and relaxing experience, and can also be a great introduction to VR. It remains fairly short and should be completed within ~90 minutes.\n\nA \"quality of life\" improvement would be to have a \"reset\" button for levels. Right now if I want my friend to play the 4th level, I have to start a new playthrough and go through the first three level because on my \"complete playthrough\", the level does not reset.\n\nHelpful | 5\nDeveloper ResponseNov 18 at 7:10 AM\n\nHi! Happy to hear you liked it! The \"reset\" option for worlds is a really good suggestion, we will investigate what we can do with this:-)", "mamotzNov 20 at 5:41 PM\nQuite a treat but too short and easy\n\nLoved as the settings are stunning and beautiful. The puzzles are good but i feel there should be more of it in every stage.\n\nI hope they keep on adding new settings as free dlc as there isnt any replayablity after 100% the game which i was able to do in about 1.5hrs.\n\nGood work though and happy with the purchase as you can feel the care and love put into it by the developers.\n\nHelpful | 3\nDeveloper ResponseNov 22 at 12:56 AM\n\nThank you for sharing, really happy to hear you liked it! If it becomes as successful as we hope it will, we are open to keep working on the Curious Tale brand:-)", "jojasNov 19 at 1:01 PM\nSo fun and cute!!\n\nThis game is absolutely the best! Please developers, give us more levels to purchase! This is the most non competitive and relaxing fun I've had in a long time. The dollhouse likenesses are mesmerizing and the puzzles are fun to figure out. The animals are so sweet. I LOVE that you can open the doors of the buildings and see what's inside. The attention to detail is phenomenal! I can let the kids play this with no hesitation, and to be honest, I played it first! I just wish it had a lot more little worlds to explore!!\n\nHelpful | 2\nDeveloper ResponseNov 20 at 2:08 AM\n\nThank you for sharing this, we are so happy to hear how much you like it!", "LafingAnarkistNov 22 at 7:59 AM\nWonderful and imaginative\n\nThis game looks gorgeous in the headset and I love the art style. So lovable and delightful, it had me smiling the whole time. The only negative I have is that I wish there was more worlds to explore, but wanting more of a game is hardly a negative. Great work Fast Travel Games :)\n\nHelpful | 3\nDeveloper ResponseNov 28 at 6:32 AM\n\nThank you so much! Hopefully this game is as successful as we hope it will be, then who knows...:-)", "manxryanNov 14 at 2:21 PM\nCharming little game\n\nFirstly I want to say I really enjoyed this and the story does make you all warm and fuzzy, its a lovely little tale.\nThe puzzles are fun and make you grin as you solve them.\nIt's a great treat to sit down in vr and just do a little puzzle solving on the couch.\nMy only reason for not giving it 5* is I completed it very quickly and there is no real re play value (as is the way with puzzle games).\nBut hey don't let that put you off it's a cheap enough title to still make it worth a play through just don't expect to be playing it for hours on end.\n\nHelpful | 5\nDeveloper ResponseNov 15 at 1:48 AM\n\nThank you very much for sharing your impressions, happy to hear about the warmth and the fuzzyness:-)", "VR2050Dec 3 at 11:02 PM\nWhimsical and fun!\n\nA lot of fun. It made me feel like a kid again! And the puzzles arent insane hard. Yet still challenging. I hate when the puzzles are so hard I dont progress in the game.\n\nThe visuals are great as well. Its amazing the Quest can pull this off.\n\nGreat experience! \n\nHelpful | 0\nDeveloper ResponseDec 3 at 11:39 PM\n\nWow, thank you so much for sharing this!", "NinjaMonkeyMarkNov 15 at 2:12 PM\nVery Charming\n\nWonderful dreamlike dioramas set before you with several collectibles to find and brief chained puzzles to solve. This game can be described as whimsical, charming, playful and well, a bit short. If youre apt to puzzle games and have a keen eye, this shouldnt take you long at all to see through to completion. That said, I had fun and smiled the whole time, during my brief play through.\n\nHelpful | 4", "GameSeekerMJan 5 at 9:40 PM\nPuzzler with heart\n\nThis game is engaging and absolutely adorable! Smiling all the way through. Give this amazing game a try. Bravo devs!!\n\nHelpful | 1\nDeveloper ResponseJan 7 at 3:03 AM\n\nThank you so much, we are happy to have made you smile:-)", "Fantasmic2019Dec 19 at 4:29 PM\n\nI would give this five stars but twice I had to restart the game because it started glitching. At first I thought my Quest was messed up. Please fix.\n\nHelpful | 2\nDeveloper ResponseJan 2 at 2:28 AM\n\nHi, this is apparently a rare issue for some Quest players on multiple games at the moment. We know that Oculus is looking into this and hopefully a firmware update will resolve it soon.", "LeopardonNov 21 at 11:43 AM\nThoroughly enjoyable whimsy\n\nGreat little puzzler, bursting at the seems with production value and character. I hope this sells exceptionally well to encourage the developers to add further levels or dlc. Desert/canyon and fir tree forest types immediately spring to mind!\n\nGreat work Fast Travel Games [])\n\nHelpful | 2\nDeveloper ResponseNov 22 at 12:55 AM\n\nThank you so much! Those ideas are noted down:-)", "DarrinRDec 15 at 12:51 PM\nShort, but sweet!\n\nWhat a terrific game! Clearly a labor of love for the developers. Lots of fun. Sadly its over all too soon.\n\nHelpful | 2\nDeveloper ResponseJan 2 at 2:29 AM\n\nThanks for sharing, great to hear you liked it! Hopefully if the game becomes a success we can keep expanding on the concept somehow:-)", "HussmanNov 16 at 9:38 AM\nCharming as all hell\n\nThis is one cute charming puzzler with that extra bit of VR polish that we crave! I just sat there for minutes saying wow on the first level. Sure, it's not for everyone, but if you only have a teeny weeny bit of child still in you, you will most likely love this game!\n\nIt's oerfect for the whole family, with not too difficult puzzles, so the young ones can also play.\n\nIt will take you maybe between 2-5 hours to complete, depending on the level of child in you. :D\n\nDont miss out! /J\n\nHelpful | 2\nDeveloper ResponseNov 17 at 9:32 AM\n\nThank you very much for sharing this, really happy to hear you liked it so much!", "BLZDPraetorianNov 14 at 8:21 PM\nIm so excited to have my kiddo play!!\n\nTo be honest it took some convincing in my own head to get this game as i am not particularly fond of puzzle games. So with a few reviewer's (Arnookie,Oculus community) and my daughter in mind, i tried it out. And im so pleased i did! You have me so excited to show my daughter! But not before i ehem, play first....DADDYS SORRY! haha. You have made such a cute, interesting and thought out game that i cant wait for you to make more. Im confident you earn these 5 stars as I have only played the 1st level, and I had to stop to just say.... Well done. And thank you so much! \n\nHelpful | 8\nDeveloper ResponseNov 15 at 1:41 AM\n\nThank you so much for sharing this, hope your daughter likes it as much as you do!", "realblushNov 23 at 7:33 PM\nI felt that\n\nI expected a cute little puzzle game - what I got was one of the best VR games on the Quest.\n\nThe game is all about floating islands, in which you have to look for the missing pets. That is done by solving little puzzles that are not too hard, but you have to look around to really understand how to complete each island. They are designed outstandingly, with a level of details that make them feel like living places. All the puzzles are fun, and I liked that it made me think about them, while at the same time never being so hard I would get stuck.\n\nThere also is a story - which I don't want to spoil. It is a very personal one, and while not bombastic or with a huge payoff, it puts everything into a beautiful context.\n\nAnd the music - I ended up starting the game just to listen to the tracks. Believe me, they are incredible and no words do them justice.\n\nWith about 2 hours it is on the shorter side, but this is extremely high quality, which makes it well, well, well worth the asking price. I would not even be mad if they offered DLC for additional cost, because every island is simply perfect.\n\nIf you look for a fun, creative and outright beautiful game with a stunning soundtrack, look no further!\n\nHelpful | 2\nDeveloper ResponseNov 28 at 6:32 AM\n\nThank you so much for sharing your impressions, it means a lot to us that you enjoyed it so much!", "Grey888Dec 3 at 7:47 PM\nBig bug problum\n\nThe game is grate but ever Tim on the 2 level The game makes all the Islands black and pixelated ruining the experience and making it unplayable. I have even tried deleting and re-downloading it and I still experienced the same problem I hope the team can fix this problem.\n\nHelpful | 4\nDeveloper ResponseDec 3 at 11:40 PM\n\nHi, sorry to hear this. It seems to be an issue with many games on Quest at the moment. Would you mind sending an email to support@fasttravelgames.com so we can investigate further and try to help you that way?", "corbert6793Dec 20 at 10:17 AM\nGreat puzzles but extremely short\n\nI feel for the price the game is too short. I enjoyed the experience alot but 5 levels for a $15 dollar game is a little steep.\n\nHelpful | 1", "snappaheadNov 14 at 3:50 PM\nAn Adorable experience.\n\nIt's cute, well made and beautifully crafted. It's not long (took me about 90 minutes), but you'll get a polished, fun experience out it. I think itll be great to show new people (perfect to show kids!) to VR or non-gamers. Its instantly understandable and welcoming. Recommended!\n\nHelpful | 8\nDeveloper ResponseNov 15 at 1:46 AM\n\nMany thanks for sharing!", "ron7136Apr 6 at 5:44 PM\nGood for kids\n\nNice graphics, easy to play. Aimed at younger players but can be enjoyed by any age.\n\nHelpful | 0", "zack.slotkowskiJan 1 at 8:57 PM\nAwesome game for interactions.\n\nMy fianc loves this game. I bought it mostly for her and it is fun watching her solve the puzzles!\n\nHelpful | 1\nDeveloper ResponseJan 2 at 2:23 AM\n\nGreat to hear, thanks for sharing & Happy new Year!", "TarnimusJan 1 at 1:36 AM\nCute and lovely\n\nThoroughly cute puzzling. More interactivity would have been nice.\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:23 AM\n\nGreat to hear you liked it! We hope to expand on the concept going forward:-)", "Atlus8Nov 23 at 9:43 PM\nGreat for kids and adults!\n\nThis game is a breath of fresh air from all the shooting games! While the game is very simple, it makes up for it in the music, artistic design and even the story! I'm a 31 year-old man and the charm of the pets even had me gushing! You can knock out this game within 90 minutes, but still worth the purchase!\n\nHelpful | 0\nDeveloper ResponseNov 28 at 6:31 AM\n\nThis makes us very happy to read, thanks for sharing!", "AlabasterSlimNov 14 at 12:27 PM\nShort but super cute and charming\n\nI can really see my younger kids enjoying this, its a very beautiful and cute adventure. The puzzles are never too hard to complete either. Id love to see some additional levels in the future for this game as DLC.\n\nHelpful | 8\nDeveloper ResponseNov 14 at 12:32 PM\n\nThanks for sharing, we are happy to hear you liked it!", "ammorrison4Dec 22 at 6:02 PM\nSeriously so cute!\n\nNot too difficult, but not too easy. A few spots I got stuck. Absolutely adorable. Makes me feel like a I have a magic tiny world in my hands. Love it.\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:25 AM\n\nThank you so much for sharing, Happy New Year!", "MeowformebabyNov 17 at 5:27 AM\nMagical\n\nMagical experience, it is quite short, hence the cheap price tag Im assuming, just be warned if youre looking for a longer experience.\nThe puzzles are also quite easy.\nBut it was well and truly worth every penny.\nEvery moment made me smile. I noticed a few nods to other classic VR games in there, namely GNOG, and Astrobot. Not a lot, just a tiny tip of the hat but it was noticeable to me because I enjoyed both of those games a ton. :)\n\nHelpful | 3\nDeveloper ResponseNov 17 at 9:30 AM\n\nThank you for sharing this, so happy you enjoyed it!", "JNSNov 15 at 12:45 PM\nA unique game that will amaze your kids\n\nThis a really unique and well crafted experience that will leave your kids amazed explaining for hour what they saw and how they found the pets.\n\nHelpful | 6", "diesel7633Nov 14 at 8:08 PM\nPoor performance\n\nI experienced some performance studdering that ruined it like another reviewer mentioned. It wasnt all the time but enough that I needed to stop playing it. Im not entirely sure what sequence of events caused it but seemed like it was when the little guy appeared and there was talking.\n\nIm going to refund for now and keep an eye on it down the road to see if there have been improvements. The game looks really charming so it is a shame.\n\nHelpful | 4\nDeveloper ResponseNov 28 at 6:39 AM\n\nHi again, we just put a new patch live that should address the stuttering/framerate issues you were experiencing - please give it a try and let us know!", "Darkfr0gNov 17 at 11:29 AM\nCharming and fun.\n\nThis game is full of personality! Beautiful and creative worlds that are fun to interact with.\nThe puzzles are not mind bending but they are fun to complete.\nThe story unfolds nicely and will most likely touch something in everybody! This is a heartwarming and beautiful experience for all ages.\n\nHelpful | 2\nDeveloper ResponseNov 17 at 9:29 AM\n\nThis makes us very happy to hear, thanks for sharing!", "KarmaMoleNov 14 at 3:08 PM\nGreat for Kids, BIt Short for Adults :)\n\nGreat game with super cute graphics, the simple puzzles will entertain kids but might make it too brief for adults. You can read our full review at 6dofreviews.com :)\n\nHelpful | 11", "jennallureDec 26 at 10:19 PM\nLove\n\nI love it but it glitches on me \n\nHelpful | 2\nDeveloper ResponseJan 2 at 2:24 AM\n\nHi, great to hear you like it - as for the glitches, could we ask that you email support@fasttravelgames.com with some details about the issues you are experiencing, and we will try to help you there. Thanks!", "DunlaplyApr 1 at 7:24 PM\nDelightful and Charming!\n\nSuch a fun little collection of puzzles! It almost feels like the natural evolution of something like an I spy book\n\nHelpful | 0", "Kaliber_1Nov 26 at 7:14 PM\nCUTE BUT SHORT\n\nCute game, but way to short and easy. Perfect for kids or for not hardcore gamers.\n\nHelpful | 3", "dballot34Nov 17 at 2:41 PM\nVery cute and cartoonish\n\nIf youre looking for a relatively short experience with some beautiful visuals, you will really enjoy it.\nI never found the puzzles all that difficult. It took me maybe 1 1/2 hours to 100% complete the game.\n\nHelpful | 4", "CarmelclosureNov 14 at 5:22 PM\nCute Game But this should be for kids!\n\nI was so excited for this game to come out that I pre ordered the game. The game was being compared to my favorite game Moss. I was very disappointed that it is basically like a hide a seek game that Im sure most 5-10 year olds would love.\n\nHelpful | 10", "Too51ollNov 15 at 1:14 AM\nBeautiful game but.....\n\nCertainly a beautiful looking game with sound to match. Maybe a little short as mentioned by others. Biggest issue however is stuttering (on Quest), quite a lot of it. Braking the game for me unfortunately at the moment. Feels like unfinished beta version. Hopefully devs will be able to resolve it.\n\nPS. Reinstalled without any improvement. Tried on another headset with exactly the same results. Stuttering occurring when at close distance to main island mainly close to little pets and moving (not turning) head side to side.\n\nHelpful | 4\nDeveloper ResponseNov 28 at 6:40 AM\n\nHi again, we just put a new patch live that should address the stuttering/framerate issues you were experiencing - please give it a try and let us know!", "dallas.tothNov 19 at 7:28 PM\nGreat game but getting a weird glitch\n\nThis is a great game and my 7year old daughter loves it . We are hitting a weird pixilated glitch with the island with the shower. We turn on the shower and after a bit the middle starts to pixilate with black boxes.\n\nHelpful | 2\nDeveloper ResponseNov 20 at 2:07 AM\n\nHi, great to hear you both like the game! This glitch is happening in different games on the Oculus Quest, and usually it disappears after re-starting the headset. If that does not happen, you can try to uninstall/re-install the game (with progress being lost, unfortunately). If the problem still persists, please send us an email at support@fasttravelgames.com and we will try to help you there. Good luck!", "shannajo03Nov 14 at 10:40 AM\nPerfect for younger users\n\nThis game is adorable and perfect for my kids. There is nothing scary, the puzzles are not difficult, the story is meaningful and the artwork is beautiful.\n\nHelpful | 10\nDeveloper ResponseNov 14 at 10:51 AM\n\nThank you so much for sharing this!", "RiverBroadNov 19 at 3:58 PM\nvirtual hug\n\nA delight to play. Easy to pick up quickly and slip into, this game is adorable, relaxing, and an escape from the stress of the day. I hope more scenes are added but anticipate enjoying my replays until then.\n\nHelpful | 2\nDeveloper ResponseNov 20 at 2:07 AM\n\nFantastic to hear, thanks for sharing!", "GirlGeek101Nov 22 at 1:56 AM\nInstant puzzle pleasure\n\nI wanted a game like this for so long! It's the joy of point and click upgraded and modernized for an outstanding VR experience! Truly sets your imagination on fire!\n\nHelpful | 4\nDeveloper ResponseNov 28 at 6:33 AM\n\nWow, thank you so much!", "IIEasyPeasyIIDec 7 at 4:52 PM\nA gem!\n\nThis is a really great use of the VR medium. Fun and engaging. I would recommend this for just about everyone. Buy it and enjoy!\n\nHelpful | 0\nDeveloper ResponseDec 11 at 8:06 AM\n\nThis makes us very happy to hear, thanks!", "dgyfarmerDec 14 at 3:38 PM\nThe curious tail of the stolen pets\n\nSomewhat challenging only thru the first leave so far and is a lot of fun so far\n\nHelpful | 1\nDeveloper ResponseJan 2 at 2:29 AM\n\nGreat to hear, thanks for sharing!", "dr.justin.lewisNov 15 at 6:55 AM\nOne of the best for kids\n\nThis is an amazing game. My 8 year old will love this game as you try to find things on each of the stories. Very fun to just look around and play with the train sets etc.\n\nHelpful | 5", "darwins.lastNov 15 at 8:47 PM\nRelaxing Nostalgia\n\nGreat for adults or kids. Interesting little worlds and puzzles. Great amount of interaction. Very creative developers and had a great time playing it.\n\nHelpful | 5", "UDontHaveMyNameNov 25 at 6:00 PM\nJust so freaking charming!\n\nIts so cool looking at these little characters up close, and this title is so inventive! I appreciate that the devs did something unique.\n\nHelpful | 0\nDeveloper ResponseNov 28 at 6:31 AM\n\nThank you so much, it means a lot!", "guy.talmorNov 16 at 11:02 AM\n\nThe idea and graphics are good however the game is very easy and very short and it seems like it is designed for kids. I finished it in about one hour..\n\nHelpful | 4", "ZanyZarlyNov 14 at 2:56 PM\nOozes with charm, an absolute delight!\n\nStunning, a VR masterpiece. I long for a sequel or maybe even DLC. You owe this to yourself - pick it up!\n\nHelpful | 8\nDeveloper ResponseNov 15 at 1:47 AM\n\nThank you so much, we really hope to keep working on The Curious Tale concept in some way!", "GTHobbesNov 18 at 4:30 AM\nGreat Game\n\nIve only completed 2 of the worlds so far but love what I have seen.\nLook forward to playing whatever VR game these guys do next.\n\nHelpful | 3\nDeveloper ResponseNov 18 at 7:11 AM\n\nThank you so much for your support!", "barabba9174Nov 30 at 10:05 AM\nI love it!\n\nReally amazing. This morning I finished it in one and half hours, but I had a great time. Now I miss it.\n\nHelpful | 0\nDeveloper ResponseDec 3 at 4:32 AM\n\nThanks for sharing, we are very happy to hear you liked it!", "yeclekDec 2 at 10:13 AM\nLove the music!\n\nFun, relaxing and quite clever.\n\nHelpful | 1\nDeveloper ResponseDec 3 at 4:32 AM\n\nThe music from Wintergatan is something quite special indeed:-)", "TORUMONov 16 at 2:39 AM\nWonderful\n\nA beautiful game that will transport you to a magical world full of memories of a lost childhood\nTotally essential\n\nHelpful | 5", "daryl1983Nov 14 at 11:57 AM\nFun family friendly game\n\nGreat game to play with my kids. Hope they come out with more levels.\n\nHelpful | 10\nDeveloper ResponseNov 14 at 12:10 PM\n\nThanks for sharing, happy to hear!", "AilynKaraNov 20 at 5:07 PM\nShould be longer\n\nAll vr games need to be longer. Great for the price\n\nHelpful | 3", "AdelezoeNov 16 at 12:27 PM\n\nMost beautiful game ever, but too short... I want more!\n\nHelpful | 4\nDeveloper ResponseNov 17 at 9:31 AM\n\nThank you so much!", "zaraienNov 17 at 2:57 PM\nAmazing!\n\nTotally worth it, such a beautiful scenario and was completely driven by the story!\n\nHelpful | 3\nDeveloper ResponseNov 18 at 7:12 AM\n\nThat is amazing to hear, thanks for sharing!", "LiliMullerDec 1 at 10:05 PM\nBeautiful game!!!\n\nVery very very good!!!\n\nHelpful | 0\nDeveloper ResponseDec 3 at 4:31 AM\n\nThank you!!!", "sachristieNov 23 at 1:12 AM\n\nGreat game. Beautiful graphics and charming story. Go get,!!!\n\nHelpful | 0\nDeveloper ResponseNov 28 at 6:32 AM\n\nThank you!!!", "GozasanNov 17 at 11:14 PM\n\nGreat miniature worlds, incredible artwork!\n\nHelpful | 3\nDeveloper ResponseNov 18 at 7:12 AM\n\nThank you so much for sharing, will let our art team know:-)", "dougerzNov 15 at 12:15 PM\nIts great\n\nLove games like this, and its so well done.\n\nHelpful | 4", "MarkazieNov 14 at 3:28 PM\nIts ok graphics are good\n\nIts just not for me this game is just a fancy point and click hidden find.\n\nHelpful | 7"]