{"App Title": "The Line", "App description": "Have you ever felt like you were living in a ceaseless repetition? Set within a scale model of 1940s So Paulo, The Line is a 15-20 minute interactive story about love and fear of change, allowing you to unlock an enchanted miniature model of two miniature dolls, Pedro and Rosa.\n\nThis roomscale experience invites you to pull on knobs and even crawl under the machinery  to unfold the story of these figurines who are perfect for each other but reluctant to live out their love. \n\n\"The Line\" is great to showcase VR for first-time users. \nNarrated by Rodrigo Santoro (Westworld) and directed by Ricardo Laganaro, The Line was awarded the Best VR Experience prize at the 76th Venice International Film Festival. \n\nAdditional modes: \nHand Tracking: Using your own hands for natural interaction -Room scale and seated mode: Freely around the scale model, or experience the story around you for those with limited space or reduced mobility.\n\nNarration and SDH subtitles in English and Portuguese.", "Purchase section": "$4.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Roomscale, Sitting", "Supported Controllers": "Hand Tracking, Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Art/Creativity, Movie, Narrative", "Languages": "English, English (US), Portuguese (Brazil)", "Version": "32", "Developer": "ARVORE Immersive Experiences", "Publisher": "ARVORE Immersive Experiences", "Website": "https://www.arvore.io/project.php?p=the-line", "Release Date": "May 28, 2020", "Developer Privacy Policy": "TERMS OF SERVICE AND PRIVACY POLICE\nPLEASE READ THIS AGREEMENT CAREFULLY. THIS IS A BINDING CONTRACT. BY\nAQCUIRING OUR SOFTWARE, USING ANY ONLINE OR MOBILE PRODUCTS AND SERVICES,\nYOU AGREE TO OUR TERMS OF SERVICE. IF YOU DO NOT AGREE TO THE TERMS HEREIN,\nPLEASE DO NOT USE OUR SOFTWARE, OUR SITES OR ANY SERVICES PROVIDED BY THEM\nIN CONNECTION TO THE SOFTWARE.\nThese Terms of Service\n(Terms) govern and apply to your use of our\nvirtual reality games and applications and any other services provided by\nus\n(our\nServices) including, not limited to, the immersive narrative\nexperience\nThe Line and any other title, sequel or prequel produced\nbefore or thereafter concerning any franchise owned or licensed by us(the\nSoftware). If you comply with these Terms, you have the right to use our\nServices for your own personal noncommercial use. This license is for the\nsole purpose of enabling you to use and enjoy our Services and Software,\nunder these Terms.\nARVORE IMMERSIVE GAMES INC., owner of all the copyrights regarding the\nSoftware, in its sole discretion, may modify these Terms at any time. You\nare responsible for reading these Terms each time you use our Sites. By\nusing the Software, you agree to be bound by all Terms hereunder.\nWhen you download our Software from any app store or distribution platform\nyou acknowledge and agree that you must also comply with all applicable\nthird-party terms of service and privacy policies when using our Software\nor Services.\nAcceptance of Terms of Service. ARVORE IMMERSIVE GAMES INC. (also known as\nARVORE,\nWe or\nUs) owns, operates and maintains the Softwares\nwebsite, including, without limitation, all sub-pages, mobile application,\ngame, and widgets (the Sites). In addition, if you use or purchase any\nother product or service through the Sites, you also will be subject to\nany terms and conditions applicable to that product and service. If you do\nnot agree with these Terms, you immediately should stop using our Services.\nWe reserve the right, at any time and from time to time, to modify or\ndiscontinue the Service or terminate your access to the Service with or\nwithout notice, charge fees in connection with the use of the Service,\nmodify or waive any fees charged in connection with the Service, and offer\nopportunities to some or all users of the Service. You agree that we will\nnot be liable to you for any modification or discontinuation of the Service\nor termination of your access to the Service, in whole or in part, or of\nany product or Service, content or feature offered through the Service.\nYour continued use of the Service after such changes will indicate your\nacceptance of the changes.\nPage 1 of 12\nConsidering the contractual nature of this Terms, the Service herein is\navailable only to people who are of legal age and, in no event, may the\nService be used by a person under the age of 13 without consent from the\nrespective parents or legal guardian. The Service is owned, operated and\nmaintained by ARVORE and ARVORE does not represent or warrant that the\nService is appropriate or available for use in any particular jurisdiction.\nOnce you agree to this Terms you choose to access, view or use the Service\non your own initiative and at your own risk, and you are responsible for\ncomplying with all local laws, rules and regulations.\nSolely as a convenience to users, ARVORE may provide links on the Services\nto other websites owned by third parties. Unless otherwise expressly\nstated, ARVORE does not endorse or control these third-party websites and\nassumes no responsibility for them or the content contained therein.\nSoftware License. The Website, Software, the Services and the information\nand content available therein\n(collectively, our\nProperties) are\nprotected by copyright laws throughout the world. Subject to your\nagreement, and continuing compliance with these Terms, and any other\nrelevant policies, ARVORE grants you a personal, non-exclusive, non-\ntransferable, non-sublicensable, revocable limited license subject to the\nlimitations below to download, install and use a copy of the Software on\na single device that you own or control and to run such copy of the Software\nsolely for your own individual, non-commercial, entertainment purposes\nonly. You agree not to use the Service for any other purpose. You may not\nsell, copy, exchange, transfer, assign or otherwise distribute anything\nyou copy, create, buy or derive from the Software, unless you are expressly\npermitted by ARVORE. The limited license as provided herein does not grant\nany rights to display or provide the Software in public for commercial and\nnon-commercial uses, including but not limited to, public spaces, arcades\nor public exhibitions without the formal and express consent of ARVORE.\nIntellectual Property. You agree that ARVORE and its suppliers own all\nrights, title and interest in our Properties (including but not limited\nto, any games and applications, titles, computer code, themes, objects,\ncharacters, character names, stories, dialogue, concepts, artwork,\nanimations, sounds, musical compositions, audiovisual effects, methods of\noperation, moral rights, documentation, in-game chat transcripts,\ncharacter profile information). You will not remove, alter or obscure any\ncopyright, trademark, service mark or other proprietary rights notices\nincorporated in or accompanying the Software. ARVORE and PIXEL RIPPED name,\nstylized title, and other related graphics, logos, service marks and trade\nnames used on or in connection with our Properties or in connection with\nthe Software are the trademarks of ARVORE and may not be used without\npermission in connection with any third-party products or services. Other\ntrademarks, service marks and trade names that may appear on or in our\nProperties are the property of their respective owners.\nPage 2 of 12\nThis provision shall apply to recordings of games and applications, screen\nrecordings, live performance, including but not limited to any kind of\nlive streaming or recorded streaming platforms existent or that shall be\ninvented. Any use of the Software not provided by the Fair Use doctrine\nthat violates or in any matter cause any harm to our Properties shall\nsubject the infringing party to any remedies provided by law, including\nindemnifications and take down orders for the violating content.\nNecessary Equipment. The Software require certain equipment to be executed.\nYou acknowledge that you shall be responsible for any charges, e.g.:\ninternet access. Certain hardware may also be required to access certain\nfeatures and functionality of the Software. You are solely responsible for\nobtaining all hardware necessary to use the Software.\nOwnership. Our Software is protected by copyright, trademark, and other\nlaws of Brazil and the U.S.A. Except as expressly provided in these Terms,\nwe (or our licensors) exclusively own all Intellectual Property rights to\nthe Software, including title, drawings, dialogues, trademarks, characters\nall and any components of the Software. You may not remove, alter or\nobscure any copyright, trademark, service mark or other proprietary rights\nnotices incorporated in or accompanying the Software. If you provide any\nsuggestions, ideas, feedback, or recommendations to us regarding our\nSoftware, you give us a worldwide, perpetual, irrevocable, fully-paid and\nroyalty-free license to use and exploit that feedback for any purpose and\nwithout any obligation to you.\nLiability and Third-Party Devices. We do not hold any responsibility for\nany errors or omissions in any data or information contained on the Service,\nincluding, without limitation, any data or information provided by you or\nthat is contributed by third parties, such as independent game and\napplication developers or other users. while we attempt to make your access\nand use of the Service safe, we do not represent or warrant that the\nService or its servers or any data or information are free of viruses or\nother damaging components.\nYou may notice that our Software is designed to provide additional\nfunctionality\nwith\ncertain\nthird-party\nvirtual\nreality\ndevices\n(Devices), therefore you should carefully review the terms and conditions\nand all setup and operating instructions for such Devices. Considering\nthe above, were not responsible or liable in any way for any personal\ninjury, property damage, or any other issue you may have resulting from\nyour use of a Device.\nPrivacy Policy. We will only collect information we need to fulfill your\nrequests and our legitimate business objectives. We will never share your\npersonal information with third parties that are not bound by our Privacy\nPage 3 of 12\nPolicy unless you tell us otherwise, and we will never send you marketing\ncommunications without your consent.\nBY USING OUR SOFTWARE, YOU AGREE TO OUR ONLINE PRIVACY POLICY AND PROCESSING\nOF YOUR DATA IN ACCORDANCE WITH SUCH POLICY. IF YOU DO NOT AGREE TO THIS\nPRIVACY POLICY, PLEASE DO NOT USE THE SOFTWARE OR USE ANY SERVICES PROVIDED\nBY US.\nWe reserve the right to modify this Privacy Policy at any time, so please\nreview it frequently. You should consult our Sites regularly to acknowledge\nsuch revisions. Revisions to terms affecting existing Services shall be\neffective immediately after disclosure in our Sites.\nRegarding the information you give us directly and we collect when you use\nour Software:\n(a) User-provided Information. Especially when you register for an\naccount, make any purchase or interact, you may provide personal\ninformation, which includes name, date of birth, email address,\nmailing address, telephone number, geographic area, credit card\nor other billing information and security questions and answers.\nNotice that any information that you voluntarily choose to include\nin a publicly accessible area of our Sites, platform or the\nSoftware, will be available to anyone who has access to that\ncontent, including other users in some situations.\nSo we are clear on the terminology used herein, by the phrase\nuser-provided information we mean information that allows someone\nto identify or contact you, including, for example, your name,\naddress, e-mail address, phone number, as well as any other non-\npublic information about you that is associated with or linked to\nany of the foregoing information. When we use the phrase anonymous\ninformation in our Privacy Policy, we mean information that is not\nassociated with or linked to your personal information. Anonymous\nInformation does not enable identification of or contact with\nindividual persons.\n(b)\nCookies Information. We may send one or more cookies\n- small\ntext files containing a string of alphanumeric characters\n- to\nyour device. We may use both session cookies and persistent\ncookies. A session cookie disappears after you close your browser.\nA persistent cookie remains after you close your browser and may\nbe used by your browser on subsequent visits to our Services.\nPlease note that if you delete, or choose not to accept, cookies\nfrom our Services, you may not be able to utilize the features of\nour Services to their fullest potential.\nPage 4 of 12\n(c)\nAutomatically Collected Information. We may automatically record\ncertain information from your device by using various types of\ntechnology, including clear gifs or web beacons. We may also\ncollect data from you using the third parties APIs. This\nautomatically collected information may include your IP address\nor other device address or ID, web browser and/or device type, the\nweb pages or sites that you visit just before or just after you\nuse our Services, the pages or other content you view or otherwise\ninteract with on our Services, the dates and times that you visit,\naccess, or use our Services, and other information regarding your\nperformance in and use of our Services. We also may use these\ntechnologies to collect information regarding your interaction\nwith messages, such as whether you opened, clicked on, or forwarded\na message. This information is gathered from all users. We may\nalso use third party tracking data analytics services; for example,\nto help us analyze how users use our Services. These services\ncollect information, such as how and often and what features of\nour Services they use. We use and may share this information with\nour service providers to provide and improve our Services to\npotentially create new services.\n(d)\nGame and Application Analytics Information. We collect anonymous\nanalytics when you use the Software. All information collected\nin such manner shall be anonymized to protect your privacy. We\nshall use this anonymous information for internal use only, to\nprovide a better user experience, enhance the overall quality of\nthe Software or any other use exclusively for the purposes provided\nherein. The anonymous information collected in this manner shall\ninclude but is not limited to, information about the virtual\nreality headset, interactions with the Software, biofeedback and\nbiometrics information, geographic locations, date and time\nstamps, Internet Protocol information, cookies, which may uniquely\nidentify your browser or device to us.\n(e)\nThird Party Web Beacons and Third-Party Buttons. We may also\nimplement third-party content or advertising on the Software that\nmay use clear gifs or other forms of web beacons, which allow the\nthird-party content provider to read and write cookies to your\nbrowser in connection with your viewing of the third-party content\nin the Software. Additionally, we may implement third party buttons\n(such as Facebook like or share buttons) that may allow third\nparties to collect information about you through such third\nparties browser cookies, even when you do not interact with the\nbutton. Information collected through web beacons and buttons is\ncollected directly by these third parties and, consequently, is\nsubject to that third partys own data collection, use, and\ndisclosure policies.\nPage 5 of 12\n(f)\nIntegrated Services. You may in the future be given the option to\naccess or register for our Services through the use of your user\nname and passwords for certain services provided by third parties\n(each, an Integrated Service), such as through the use of your\nFacebook credentials through Facebook Connect, or otherwise have\nthe option to authorize an Integrated Service to provide personal\ninformation or other information to us. By authorizing us to\nconnect with an Integrated Service, you authorize us to access and\nstore your name, email address(es), date of birth, gender, current\ncity, profile picture URL, and other information that the\nIntegrated Service makes available to us, and to use and disclose\nit in accordance with our Privacy Policy. You should check your\nprivacy settings on each Integrated Service to understand and\nchange the information sent to us through each Integrated Service.\nPlease review each Integrated Services terms of service and\nprivacy policies carefully before using their services and\nconnecting to our Software.\n(g)\nChildrens Privacy. We do not knowingly collect any personal\ninformation from children under the age of 13, allow them to create\naccounts, sign up for newsletters, make purchases, interact on the\nchat or browse in our Services. ARVORE takes childrens privacy\nseriously and encourages parents to play an active role in their\nchildrens online experience at all times. We urge parents to\ninstruct their children never to give out personal information\nwithout parental consent.\n(h)\nHow we use the information we collect. We use the information we\ncollect to enhance our Software, providing excellence and in a way\nthat suits you, whether you are just using or by purchasing it.\nThe collected information can be also used to respond to your\nrequests and provide customer service, provide updates on the\nSoftware and other news, promotions and events offered by ARVORE\nand by third parties we work with, ask for your feedback and\nopinions on our Services, and provide personalized services. Also,\nwe may use your personal information, such as your email address,\nto contact you for administrative purposes, including customer\nservice, to address privacy violations or defamation issues,\neventual intellectual property infringement and as may otherwise\nbe described at the time that we collect such information from\nyou.\nWe use both your personal information and certain non-personal\nsite usage data to enhance the quality and design of our Services\nand to create new features, promotions, relevant ads and services\nby storing, tracking, and analyzing user preferences and trends.\nPage 6 of 12\nWe may also combine the information you submit to us with\ninformation we have collected from you in other forms, such as\nthrough emails or offline, or with publicly available information\nor information we obtain from third parties, such as our partners,\nadvertisers, and Integrated Services. If we combine or associate\ninformation from other sources with personal information that we\ncollect herein, we will treat the combined information as personal\ninformation in accordance with this Privacy Policy.\nARVORE also works with third party service providers to provide\nwebsite, game or application development, hosting, maintenance,\nenhance, and other services for us. Notice that these third\nparties, directly to the operators of such services and subject\nto those operators policies, if any, governing privacy and\nsecurity, may have access to or process your information as part\nof providing those services for us, limited to what is considerable\nreasonably necessary for them to perform their functions and in\nrespect of the confidentiality of such information. Therefore,\nsome of our Services may contain features or links to websites and\nservices provided by these third parties, which we do not claim\nany responsibility for its content or privacy and security\npractices and policies. Notwithstanding, we encourage you to learn\nabout third parties privacy and security policies before\nproviding them with information.\nWhen you provide us with personal information by entering in your\nusername, email addresses, or other personal information into our\nServices you consent to our collecting, using, and sharing it in\naccordance with this Privacy Policy. ARVORE allows you to control\nthe way we use personal information we might obtain from you. At\nthe time you provide it, we may give you the option to decline any\nfuture offers or information about new products, promotions,\nnewsletter, services or mailings in general.\nWe may disclose your information if required to do so by law or\nin the good-faith belief that such action is necessary to comply\nwith state and federal laws, from any country that the Software\nis used, in response to a court order, judicial or other government\nsubpoena or warrant, to cooperate with law enforcement or other\ngovernmental agencies, to take precautions against liability, to\nprotect ourselves or others from fraudulent, abusive, or unlawful\nuses or activity, to investigate and defend ourselves against any\nthird-party claims or allegations, to protect the security or\nintegrity of the Software and any facilities or equipment used to\nmake it available, or to protect our Properties or other legal\nrights\n(including, but not limited to, enforcement of our\nagreements), or the rights, property, or safety of others.\nPage 7 of 12\nInformation about our users, including personal information, may\nbe disclosed and otherwise transferred to an acquirer, or successor\nor assignee as part of any merger, acquisition, debt financing,\nsale of assets, or similar transaction, as well as in the event\nof an insolvency, bankruptcy, or receivership in which information\nis transferred to one or more third parties as one of our business\nassets. We also may disclose your information as may be described\nin a notice to you at the time the information is collected, or\nin any other manner to which you consent.\n(i)\nData Security. In order to improve the integrity and security of\nyour personally identifiable information we use certain physical,\nadministrative, and technical safeguards. Nevertheless, we cannot\nguarantee or warrant that such information you provide to us, and\nyou do so at your own risk, may not be accessed, disclosed,\naltered, or destroyed by breach of any of our physical, technical,\nor managerial safeguards. We may post a notice through our Sites\nif we acknowledge any security breach and may attempt to notify\nyou electronically so that you can take appropriate protective\nsteps.\n(j)\nInternational Visitors. Even though our Services are hosted in the\nUnited States and Brazil, it is planned and intended for global\nterritory so, in case you choose to use the Software from other\nregions or countries with laws governing data collection and use\nthat may differ from those whom this policy has been written, then\nplease note that you are transferring your personal information\noutside of those regions for storage and processing. Likewise, by\nproviding any information, including personal information, you\nconsent that we may transfer your data to other countries or\nregions in connection with storage and processing of data,\nfulfilling your requests, and using the Software.\nUnauthorized Activities. You are not allowed to do any of the following\nwhile using or accessing the Software:\n copy, edit, modify, distribute, sell, or lease any part of the\nSoftware\n(including any content in the Software), nor may you\ndecompile, disassemble, reverse engineer or attempt to extract the\nsource code of the Software;\n make any Software (including any content in the Software) available\non any internet site, network or file-sharing service;\n use the Software for any commercial purpose or for the benefit of\nany third party or in any manner not by these Terms;\nPage 8 of 12\n develop or allow any malware, adware, spyware, Trojan Horses,\ncancelbots, other automated bots, auto players, cheat utilities,\nspoofers, keyloggers, or other circumvention devices to be present\non any machine used to access the Services; and/or to attempt to\nupload/utilize such devices against the Services;\n use vulgar, obscene, pornographic language or other behavior while\nin the forums, chat rooms, or other public areas that will disrupt\nthe user experience in those areas of the site;\n violate any applicable law or regulation; or\n encourage or enable someone to do any of the foregoing.\nWe reserve the right to investigate and prosecute violations of any of the\nabove, as well as to claim any losses and damages and involve and cooperate\nwith law enforcement authorities in prosecuting anyone who violates these\nTerms.\nTermination. You agree that if you breach any of the terms of these Terms,\nyour license to use of the Software will terminate automatically. We\nreserve the right, in our sole discretion, to terminate or suspend the use\nof the Software if we believe or have been notified by a third party of\nits belief that, you may be infringing the rights of others, violating the\ncopyrights or trademarks of others or engaging in any inappropriate\nbehavior. We also reserve the right, in our sole discretion, to terminate\nyour access to all or part of the Service or to any product or service\navailable through the Service for any reason or no reason, with or without\nnotice. In the event of termination, you shall have limited access to any\nonline services regarding the Software.\nBy using the Software, you may view content that is provided by third\nparties, which may be objectionable, offensive, or otherwise inappropriate.\nWe are not responsible for such content, nor will we be liable in any way\nfor any content made available via the Software.\nYou understand and agree that the Software is provided to you AS IS and on\nan AS AVAILABLE basis.\nWithout limiting the foregoing, WE EXPLICITLY\nDISCLAIM ANY WARRANTIES\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR\nPURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT, AND ANY WARRANTIES ARISING\nOUT OF COURSE OF DEALING OR USAGE OF TRADE. We make no warranty that the\nSoftware will meet your requirements or be available on an uninterrupted,\nsecure, or error-free basis.\nHealth and Safety Warnings. In the event you use a virtual reality headset\nin connection with the Software, please read the warnings in the below\ncarefully before using the headset or the Software to reduce the risk of\npersonal injury, discomfort or property damage. By using the Software, you\nPage 9 of 12\nrepresent and warrant that you have read and understand these warnings and\ninstructions. We may update or revise these warnings and instructions, so\nplease review them periodically.\n(a)\nBefore Using the headset. Review the hardware and software\nrecommendations for use of the headset. Your Headset and the\nSoftware are not designed for use with any unauthorized device,\naccessory and/or software. Use of an unauthorized device,\naccessory and/or software may result in injury to you or others,\nmay cause performance issues or damage to your system and related\nservices. Before using the headset, please read and follow all\nsetup and operating instructions provided by the manufacturer of\nthe headset. People who are prone to motion sickness in the real\nworld may have a heightened risk of experiencing discomfort while\nusing a headset in connection with the application. Such\nindividuals should take extra care to read and following these\nwarnings carefully. ARVORE recommends seeing a doctor before using\nthe headset in connection with the Software if you are pregnant,\nelderly, have pre-existing binocular vision abnormalities or\npsychiatric disorders, or suffer from a heart condition or other\nserious medical condition.\n(b)\nGeneral Instructions and Precautions. USE ONLY IN A SAFE\nENVIRONMENT. The use of headsets distracts you from and completely\nblocks your view of your actual surroundings. Always be aware of\nyour surroundings when using a headset and remain seated at all\ntimes. Take special care to ensure that you are not near other\npeople, objects, stairs, balconies, windows, furniture, or other\nitems that you can bump into or knock down when using\n- or\nimmediately after using\n- a headset. Do not handle sharp or\notherwise dangerous objects while using a headset. Take at least\na 10 to 15-minute break every 30 minutes, even if you do not think\nyou need it. Each person is different, so take more frequent and\nlonger breaks if you feel discomfort. Listening to sound at high\nvolumes can cause irreparable damage to your hearing. Background\nnoise, as well as continued exposure to high volume levels, can\nmake sounds seem quieter than they actually are. Due to the\nimmersive nature of the virtual reality experience in the Software,\ndo not use a headset with the sound at high volume so that you can\nmaintain awareness of your surroundings and reduce the risk of\nhearing damage.\n(c)\nSeizures. Some people may have severe dizziness, seizures,\nepileptic seizures or blackouts triggered by light flashes or\npatterns, and this may occur while they are watching TV, playing\nvideo games or using any virtual reality applications, even if\nthey have never had a seizure or blackout before or have no history\nof seizures or epilepsy. Such seizures are more common in children\nPage 10 of 12\nand young people under the age of 20. Anyone who has had a seizure,\nloss of awareness, or other symptom linked to an epileptic\ncondition should see a doctor before using a headset in connection\nwith the Software.\n(d)\nDiscomfort. Immediately discontinue use of your headset when using\nthe Software if anyone using the headset experiences any of the\nfollowing symptoms: seizures; loss of awareness; eye strain; eye\nor muscle twitching; involuntary movements; altered, blurred or\ndouble\nvision\nor\nother\nvisual\nabnormalities;\ndizziness;\ndisorientation; impaired balance; impaired hand-eye coordination;\nexcessive sweating; increased salivation; nausea; lightheadedness;\ndiscomfort or pain in the head or eyes; fatigue; or any symptoms\nsimilar to motion sickness. Using virtual reality games and\napplications can make your muscles, joints or skin hurt. If any\npart of your body becomes tired or sore while using it, or if you\nfeel symptoms such as tingling, numbness, burning or stiffness,\nstop and rest for several hours before using it again. If you\ncontinue to have any of the above symptoms or other discomfort\nduring or after use, stop and see a doctor.\n(e)\nChildren. The headset should not be used by children under the age\nof 13. Adults should make sure children (age 13 and older) use the\nheadset in accordance with these health and safety warnings\nincluding making sure the headset is used as described in the\nBefore Using the headset section and the General Instructions and\nPrecautions section. Adults should monitor children (age 13 and\nolder) who are using or have used the headset for any of the\nsymptoms described in these health and safety warnings (including\nthose described under the Discomfort section), and should limit\nthe time children spend using the headset and ensure they take\nbreaks during use.\nIndemnification. You agree to indemnify, defend and hold harmless ARVORE\nand its affiliates and their respective owners, directors, officers,\nmanagers, employees, agents, contractors, advertisers and partners from\nany claim or demand, including, without limitation, reasonable attorney\nfees, that may be asserted or filed by any third party, arising out of or\nrelating to your use of the Software or any product or service available\nthrough the Software, your submission or provision of user content to the\nSoftware, your violation of these Terms or any other violation by you of\nthe rights of another person or party.\nGeneral. These Terms constitute the entire agreement between us with\nrespect to the subject matter and supersedes and merges any prior\nproposals, understandings and contemporaneous communications. These Terms\nwill be governed by and construed in accordance with the laws of the United\nPage 11 of 12\nStates, without regard to or application of conflicts of law rules or\nprinciples. By using our Software, you consent to personal jurisdiction\nand venue in the state courts of California for any lawsuit arising from\nor relating to these Terms or the Software.\nYou may not assign your rights or delegate your obligations under these\nTerms without our prior written consent. You acknowledge and agree that no\npartnership is formed between you and ARVORE by virtue of these Terms, and\nneither party has the power or the authority to obligate or bind the other.\nThe waiver by us of a breach of any provision of these Terms will not be\ntaken or held to be a waiver of the provision itself. If any provision of\nthese Terms is held by a court of competent jurisdiction to be contrary to\nlaw, such provision will be changed and interpreted so as to best accomplish\nthe objectives of the original provision to the fullest extent allowed by\nlaw, and the remaining provisions of these Terms will remain in full force\nand effect. You hereby agree that ARVORE would be irreparably damaged if\nthe terms of this Agreement were not specifically enforced, and therefore\nyou agree that we are entitled, without bond, other security, or proof of\ndamages, to appropriate equitable remedies with respect to breaches of\nthis agreement, in addition to such other remedies as we may otherwise\nhave available to us under applicable laws.\nYou agree that we may provide you with notices, newsletters, including\nnotices regarding changes to these Terms, by email, regular mail or\npostings on the Service. Any communication or notice that you provide to\nus will be provided by email at legal@ arvore.io.\nThese Terms constitute a legally binding agreement between you and ARVORE,\nand these Terms are accepted by you upon your use of the Software.\nPlease contact us if you have any questions about these Terms.\nPage 12 of 12", "Developer Terms of Service": "TERMS OF SERVICE AND PRIVACY POLICE\nPLEASE READ THIS AGREEMENT CAREFULLY. THIS IS A BINDING CONTRACT. BY\nAQCUIRING OUR SOFTWARE, USING ANY ONLINE OR MOBILE PRODUCTS AND SERVICES,\nYOU AGREE TO OUR TERMS OF SERVICE. IF YOU DO NOT AGREE TO THE TERMS HEREIN,\nPLEASE DO NOT USE OUR SOFTWARE, OUR SITES OR ANY SERVICES PROVIDED BY THEM\nIN CONNECTION TO THE SOFTWARE.\nThese Terms of Service\n(Terms) govern and apply to your use of our\nvirtual reality games and applications and any other services provided by\nus\n(our\nServices) including, not limited to, the immersive narrative\nexperience\nThe Line and any other title, sequel or prequel produced\nbefore or thereafter concerning any franchise owned or licensed by us(the\nSoftware). If you comply with these Terms, you have the right to use our\nServices for your own personal noncommercial use. This license is for the\nsole purpose of enabling you to use and enjoy our Services and Software,\nunder these Terms.\nARVORE IMMERSIVE GAMES INC., owner of all the copyrights regarding the\nSoftware, in its sole discretion, may modify these Terms at any time. You\nare responsible for reading these Terms each time you use our Sites. By\nusing the Software, you agree to be bound by all Terms hereunder.\nWhen you download our Software from any app store or distribution platform\nyou acknowledge and agree that you must also comply with all applicable\nthird-party terms of service and privacy policies when using our Software\nor Services.\nAcceptance of Terms of Service. ARVORE IMMERSIVE GAMES INC. (also known as\nARVORE,\nWe or\nUs) owns, operates and maintains the Softwares\nwebsite, including, without limitation, all sub-pages, mobile application,\ngame, and widgets (the Sites). In addition, if you use or purchase any\nother product or service through the Sites, you also will be subject to\nany terms and conditions applicable to that product and service. If you do\nnot agree with these Terms, you immediately should stop using our Services.\nWe reserve the right, at any time and from time to time, to modify or\ndiscontinue the Service or terminate your access to the Service with or\nwithout notice, charge fees in connection with the use of the Service,\nmodify or waive any fees charged in connection with the Service, and offer\nopportunities to some or all users of the Service. You agree that we will\nnot be liable to you for any modification or discontinuation of the Service\nor termination of your access to the Service, in whole or in part, or of\nany product or Service, content or feature offered through the Service.\nYour continued use of the Service after such changes will indicate your\nacceptance of the changes.\nPage 1 of 12\nConsidering the contractual nature of this Terms, the Service herein is\navailable only to people who are of legal age and, in no event, may the\nService be used by a person under the age of 13 without consent from the\nrespective parents or legal guardian. The Service is owned, operated and\nmaintained by ARVORE and ARVORE does not represent or warrant that the\nService is appropriate or available for use in any particular jurisdiction.\nOnce you agree to this Terms you choose to access, view or use the Service\non your own initiative and at your own risk, and you are responsible for\ncomplying with all local laws, rules and regulations.\nSolely as a convenience to users, ARVORE may provide links on the Services\nto other websites owned by third parties. Unless otherwise expressly\nstated, ARVORE does not endorse or control these third-party websites and\nassumes no responsibility for them or the content contained therein.\nSoftware License. The Website, Software, the Services and the information\nand content available therein\n(collectively, our\nProperties) are\nprotected by copyright laws throughout the world. Subject to your\nagreement, and continuing compliance with these Terms, and any other\nrelevant policies, ARVORE grants you a personal, non-exclusive, non-\ntransferable, non-sublicensable, revocable limited license subject to the\nlimitations below to download, install and use a copy of the Software on\na single device that you own or control and to run such copy of the Software\nsolely for your own individual, non-commercial, entertainment purposes\nonly. You agree not to use the Service for any other purpose. You may not\nsell, copy, exchange, transfer, assign or otherwise distribute anything\nyou copy, create, buy or derive from the Software, unless you are expressly\npermitted by ARVORE. The limited license as provided herein does not grant\nany rights to display or provide the Software in public for commercial and\nnon-commercial uses, including but not limited to, public spaces, arcades\nor public exhibitions without the formal and express consent of ARVORE.\nIntellectual Property. You agree that ARVORE and its suppliers own all\nrights, title and interest in our Properties (including but not limited\nto, any games and applications, titles, computer code, themes, objects,\ncharacters, character names, stories, dialogue, concepts, artwork,\nanimations, sounds, musical compositions, audiovisual effects, methods of\noperation, moral rights, documentation, in-game chat transcripts,\ncharacter profile information). You will not remove, alter or obscure any\ncopyright, trademark, service mark or other proprietary rights notices\nincorporated in or accompanying the Software. ARVORE and PIXEL RIPPED name,\nstylized title, and other related graphics, logos, service marks and trade\nnames used on or in connection with our Properties or in connection with\nthe Software are the trademarks of ARVORE and may not be used without\npermission in connection with any third-party products or services. Other\ntrademarks, service marks and trade names that may appear on or in our\nProperties are the property of their respective owners.\nPage 2 of 12\nThis provision shall apply to recordings of games and applications, screen\nrecordings, live performance, including but not limited to any kind of\nlive streaming or recorded streaming platforms existent or that shall be\ninvented. Any use of the Software not provided by the Fair Use doctrine\nthat violates or in any matter cause any harm to our Properties shall\nsubject the infringing party to any remedies provided by law, including\nindemnifications and take down orders for the violating content.\nNecessary Equipment. The Software require certain equipment to be executed.\nYou acknowledge that you shall be responsible for any charges, e.g.:\ninternet access. Certain hardware may also be required to access certain\nfeatures and functionality of the Software. You are solely responsible for\nobtaining all hardware necessary to use the Software.\nOwnership. Our Software is protected by copyright, trademark, and other\nlaws of Brazil and the U.S.A. Except as expressly provided in these Terms,\nwe (or our licensors) exclusively own all Intellectual Property rights to\nthe Software, including title, drawings, dialogues, trademarks, characters\nall and any components of the Software. You may not remove, alter or\nobscure any copyright, trademark, service mark or other proprietary rights\nnotices incorporated in or accompanying the Software. If you provide any\nsuggestions, ideas, feedback, or recommendations to us regarding our\nSoftware, you give us a worldwide, perpetual, irrevocable, fully-paid and\nroyalty-free license to use and exploit that feedback for any purpose and\nwithout any obligation to you.\nLiability and Third-Party Devices. We do not hold any responsibility for\nany errors or omissions in any data or information contained on the Service,\nincluding, without limitation, any data or information provided by you or\nthat is contributed by third parties, such as independent game and\napplication developers or other users. while we attempt to make your access\nand use of the Service safe, we do not represent or warrant that the\nService or its servers or any data or information are free of viruses or\nother damaging components.\nYou may notice that our Software is designed to provide additional\nfunctionality\nwith\ncertain\nthird-party\nvirtual\nreality\ndevices\n(Devices), therefore you should carefully review the terms and conditions\nand all setup and operating instructions for such Devices. Considering\nthe above, were not responsible or liable in any way for any personal\ninjury, property damage, or any other issue you may have resulting from\nyour use of a Device.\nPrivacy Policy. We will only collect information we need to fulfill your\nrequests and our legitimate business objectives. We will never share your\npersonal information with third parties that are not bound by our Privacy\nPage 3 of 12\nPolicy unless you tell us otherwise, and we will never send you marketing\ncommunications without your consent.\nBY USING OUR SOFTWARE, YOU AGREE TO OUR ONLINE PRIVACY POLICY AND PROCESSING\nOF YOUR DATA IN ACCORDANCE WITH SUCH POLICY. IF YOU DO NOT AGREE TO THIS\nPRIVACY POLICY, PLEASE DO NOT USE THE SOFTWARE OR USE ANY SERVICES PROVIDED\nBY US.\nWe reserve the right to modify this Privacy Policy at any time, so please\nreview it frequently. You should consult our Sites regularly to acknowledge\nsuch revisions. Revisions to terms affecting existing Services shall be\neffective immediately after disclosure in our Sites.\nRegarding the information you give us directly and we collect when you use\nour Software:\n(a) User-provided Information. Especially when you register for an\naccount, make any purchase or interact, you may provide personal\ninformation, which includes name, date of birth, email address,\nmailing address, telephone number, geographic area, credit card\nor other billing information and security questions and answers.\nNotice that any information that you voluntarily choose to include\nin a publicly accessible area of our Sites, platform or the\nSoftware, will be available to anyone who has access to that\ncontent, including other users in some situations.\nSo we are clear on the terminology used herein, by the phrase\nuser-provided information we mean information that allows someone\nto identify or contact you, including, for example, your name,\naddress, e-mail address, phone number, as well as any other non-\npublic information about you that is associated with or linked to\nany of the foregoing information. When we use the phrase anonymous\ninformation in our Privacy Policy, we mean information that is not\nassociated with or linked to your personal information. Anonymous\nInformation does not enable identification of or contact with\nindividual persons.\n(b)\nCookies Information. We may send one or more cookies\n- small\ntext files containing a string of alphanumeric characters\n- to\nyour device. We may use both session cookies and persistent\ncookies. A session cookie disappears after you close your browser.\nA persistent cookie remains after you close your browser and may\nbe used by your browser on subsequent visits to our Services.\nPlease note that if you delete, or choose not to accept, cookies\nfrom our Services, you may not be able to utilize the features of\nour Services to their fullest potential.\nPage 4 of 12\n(c)\nAutomatically Collected Information. We may automatically record\ncertain information from your device by using various types of\ntechnology, including clear gifs or web beacons. We may also\ncollect data from you using the third parties APIs. This\nautomatically collected information may include your IP address\nor other device address or ID, web browser and/or device type, the\nweb pages or sites that you visit just before or just after you\nuse our Services, the pages or other content you view or otherwise\ninteract with on our Services, the dates and times that you visit,\naccess, or use our Services, and other information regarding your\nperformance in and use of our Services. We also may use these\ntechnologies to collect information regarding your interaction\nwith messages, such as whether you opened, clicked on, or forwarded\na message. This information is gathered from all users. We may\nalso use third party tracking data analytics services; for example,\nto help us analyze how users use our Services. These services\ncollect information, such as how and often and what features of\nour Services they use. We use and may share this information with\nour service providers to provide and improve our Services to\npotentially create new services.\n(d)\nGame and Application Analytics Information. We collect anonymous\nanalytics when you use the Software. All information collected\nin such manner shall be anonymized to protect your privacy. We\nshall use this anonymous information for internal use only, to\nprovide a better user experience, enhance the overall quality of\nthe Software or any other use exclusively for the purposes provided\nherein. The anonymous information collected in this manner shall\ninclude but is not limited to, information about the virtual\nreality headset, interactions with the Software, biofeedback and\nbiometrics information, geographic locations, date and time\nstamps, Internet Protocol information, cookies, which may uniquely\nidentify your browser or device to us.\n(e)\nThird Party Web Beacons and Third-Party Buttons. We may also\nimplement third-party content or advertising on the Software that\nmay use clear gifs or other forms of web beacons, which allow the\nthird-party content provider to read and write cookies to your\nbrowser in connection with your viewing of the third-party content\nin the Software. Additionally, we may implement third party buttons\n(such as Facebook like or share buttons) that may allow third\nparties to collect information about you through such third\nparties browser cookies, even when you do not interact with the\nbutton. Information collected through web beacons and buttons is\ncollected directly by these third parties and, consequently, is\nsubject to that third partys own data collection, use, and\ndisclosure policies.\nPage 5 of 12\n(f)\nIntegrated Services. You may in the future be given the option to\naccess or register for our Services through the use of your user\nname and passwords for certain services provided by third parties\n(each, an Integrated Service), such as through the use of your\nFacebook credentials through Facebook Connect, or otherwise have\nthe option to authorize an Integrated Service to provide personal\ninformation or other information to us. By authorizing us to\nconnect with an Integrated Service, you authorize us to access and\nstore your name, email address(es), date of birth, gender, current\ncity, profile picture URL, and other information that the\nIntegrated Service makes available to us, and to use and disclose\nit in accordance with our Privacy Policy. You should check your\nprivacy settings on each Integrated Service to understand and\nchange the information sent to us through each Integrated Service.\nPlease review each Integrated Services terms of service and\nprivacy policies carefully before using their services and\nconnecting to our Software.\n(g)\nChildrens Privacy. We do not knowingly collect any personal\ninformation from children under the age of 13, allow them to create\naccounts, sign up for newsletters, make purchases, interact on the\nchat or browse in our Services. ARVORE takes childrens privacy\nseriously and encourages parents to play an active role in their\nchildrens online experience at all times. We urge parents to\ninstruct their children never to give out personal information\nwithout parental consent.\n(h)\nHow we use the information we collect. We use the information we\ncollect to enhance our Software, providing excellence and in a way\nthat suits you, whether you are just using or by purchasing it.\nThe collected information can be also used to respond to your\nrequests and provide customer service, provide updates on the\nSoftware and other news, promotions and events offered by ARVORE\nand by third parties we work with, ask for your feedback and\nopinions on our Services, and provide personalized services. Also,\nwe may use your personal information, such as your email address,\nto contact you for administrative purposes, including customer\nservice, to address privacy violations or defamation issues,\neventual intellectual property infringement and as may otherwise\nbe described at the time that we collect such information from\nyou.\nWe use both your personal information and certain non-personal\nsite usage data to enhance the quality and design of our Services\nand to create new features, promotions, relevant ads and services\nby storing, tracking, and analyzing user preferences and trends.\nPage 6 of 12\nWe may also combine the information you submit to us with\ninformation we have collected from you in other forms, such as\nthrough emails or offline, or with publicly available information\nor information we obtain from third parties, such as our partners,\nadvertisers, and Integrated Services. If we combine or associate\ninformation from other sources with personal information that we\ncollect herein, we will treat the combined information as personal\ninformation in accordance with this Privacy Policy.\nARVORE also works with third party service providers to provide\nwebsite, game or application development, hosting, maintenance,\nenhance, and other services for us. Notice that these third\nparties, directly to the operators of such services and subject\nto those operators policies, if any, governing privacy and\nsecurity, may have access to or process your information as part\nof providing those services for us, limited to what is considerable\nreasonably necessary for them to perform their functions and in\nrespect of the confidentiality of such information. Therefore,\nsome of our Services may contain features or links to websites and\nservices provided by these third parties, which we do not claim\nany responsibility for its content or privacy and security\npractices and policies. Notwithstanding, we encourage you to learn\nabout third parties privacy and security policies before\nproviding them with information.\nWhen you provide us with personal information by entering in your\nusername, email addresses, or other personal information into our\nServices you consent to our collecting, using, and sharing it in\naccordance with this Privacy Policy. ARVORE allows you to control\nthe way we use personal information we might obtain from you. At\nthe time you provide it, we may give you the option to decline any\nfuture offers or information about new products, promotions,\nnewsletter, services or mailings in general.\nWe may disclose your information if required to do so by law or\nin the good-faith belief that such action is necessary to comply\nwith state and federal laws, from any country that the Software\nis used, in response to a court order, judicial or other government\nsubpoena or warrant, to cooperate with law enforcement or other\ngovernmental agencies, to take precautions against liability, to\nprotect ourselves or others from fraudulent, abusive, or unlawful\nuses or activity, to investigate and defend ourselves against any\nthird-party claims or allegations, to protect the security or\nintegrity of the Software and any facilities or equipment used to\nmake it available, or to protect our Properties or other legal\nrights\n(including, but not limited to, enforcement of our\nagreements), or the rights, property, or safety of others.\nPage 7 of 12\nInformation about our users, including personal information, may\nbe disclosed and otherwise transferred to an acquirer, or successor\nor assignee as part of any merger, acquisition, debt financing,\nsale of assets, or similar transaction, as well as in the event\nof an insolvency, bankruptcy, or receivership in which information\nis transferred to one or more third parties as one of our business\nassets. We also may disclose your information as may be described\nin a notice to you at the time the information is collected, or\nin any other manner to which you consent.\n(i)\nData Security. In order to improve the integrity and security of\nyour personally identifiable information we use certain physical,\nadministrative, and technical safeguards. Nevertheless, we cannot\nguarantee or warrant that such information you provide to us, and\nyou do so at your own risk, may not be accessed, disclosed,\naltered, or destroyed by breach of any of our physical, technical,\nor managerial safeguards. We may post a notice through our Sites\nif we acknowledge any security breach and may attempt to notify\nyou electronically so that you can take appropriate protective\nsteps.\n(j)\nInternational Visitors. Even though our Services are hosted in the\nUnited States and Brazil, it is planned and intended for global\nterritory so, in case you choose to use the Software from other\nregions or countries with laws governing data collection and use\nthat may differ from those whom this policy has been written, then\nplease note that you are transferring your personal information\noutside of those regions for storage and processing. Likewise, by\nproviding any information, including personal information, you\nconsent that we may transfer your data to other countries or\nregions in connection with storage and processing of data,\nfulfilling your requests, and using the Software.\nUnauthorized Activities. You are not allowed to do any of the following\nwhile using or accessing the Software:\n copy, edit, modify, distribute, sell, or lease any part of the\nSoftware\n(including any content in the Software), nor may you\ndecompile, disassemble, reverse engineer or attempt to extract the\nsource code of the Software;\n make any Software (including any content in the Software) available\non any internet site, network or file-sharing service;\n use the Software for any commercial purpose or for the benefit of\nany third party or in any manner not by these Terms;\nPage 8 of 12\n develop or allow any malware, adware, spyware, Trojan Horses,\ncancelbots, other automated bots, auto players, cheat utilities,\nspoofers, keyloggers, or other circumvention devices to be present\non any machine used to access the Services; and/or to attempt to\nupload/utilize such devices against the Services;\n use vulgar, obscene, pornographic language or other behavior while\nin the forums, chat rooms, or other public areas that will disrupt\nthe user experience in those areas of the site;\n violate any applicable law or regulation; or\n encourage or enable someone to do any of the foregoing.\nWe reserve the right to investigate and prosecute violations of any of the\nabove, as well as to claim any losses and damages and involve and cooperate\nwith law enforcement authorities in prosecuting anyone who violates these\nTerms.\nTermination. You agree that if you breach any of the terms of these Terms,\nyour license to use of the Software will terminate automatically. We\nreserve the right, in our sole discretion, to terminate or suspend the use\nof the Software if we believe or have been notified by a third party of\nits belief that, you may be infringing the rights of others, violating the\ncopyrights or trademarks of others or engaging in any inappropriate\nbehavior. We also reserve the right, in our sole discretion, to terminate\nyour access to all or part of the Service or to any product or service\navailable through the Service for any reason or no reason, with or without\nnotice. In the event of termination, you shall have limited access to any\nonline services regarding the Software.\nBy using the Software, you may view content that is provided by third\nparties, which may be objectionable, offensive, or otherwise inappropriate.\nWe are not responsible for such content, nor will we be liable in any way\nfor any content made available via the Software.\nYou understand and agree that the Software is provided to you AS IS and on\nan AS AVAILABLE basis.\nWithout limiting the foregoing, WE EXPLICITLY\nDISCLAIM ANY WARRANTIES\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR\nPURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT, AND ANY WARRANTIES ARISING\nOUT OF COURSE OF DEALING OR USAGE OF TRADE. We make no warranty that the\nSoftware will meet your requirements or be available on an uninterrupted,\nsecure, or error-free basis.\nHealth and Safety Warnings. In the event you use a virtual reality headset\nin connection with the Software, please read the warnings in the below\ncarefully before using the headset or the Software to reduce the risk of\npersonal injury, discomfort or property damage. By using the Software, you\nPage 9 of 12\nrepresent and warrant that you have read and understand these warnings and\ninstructions. We may update or revise these warnings and instructions, so\nplease review them periodically.\n(a)\nBefore Using the headset. Review the hardware and software\nrecommendations for use of the headset. Your Headset and the\nSoftware are not designed for use with any unauthorized device,\naccessory and/or software. Use of an unauthorized device,\naccessory and/or software may result in injury to you or others,\nmay cause performance issues or damage to your system and related\nservices. Before using the headset, please read and follow all\nsetup and operating instructions provided by the manufacturer of\nthe headset. People who are prone to motion sickness in the real\nworld may have a heightened risk of experiencing discomfort while\nusing a headset in connection with the application. Such\nindividuals should take extra care to read and following these\nwarnings carefully. ARVORE recommends seeing a doctor before using\nthe headset in connection with the Software if you are pregnant,\nelderly, have pre-existing binocular vision abnormalities or\npsychiatric disorders, or suffer from a heart condition or other\nserious medical condition.\n(b)\nGeneral Instructions and Precautions. USE ONLY IN A SAFE\nENVIRONMENT. The use of headsets distracts you from and completely\nblocks your view of your actual surroundings. Always be aware of\nyour surroundings when using a headset and remain seated at all\ntimes. Take special care to ensure that you are not near other\npeople, objects, stairs, balconies, windows, furniture, or other\nitems that you can bump into or knock down when using\n- or\nimmediately after using\n- a headset. Do not handle sharp or\notherwise dangerous objects while using a headset. Take at least\na 10 to 15-minute break every 30 minutes, even if you do not think\nyou need it. Each person is different, so take more frequent and\nlonger breaks if you feel discomfort. Listening to sound at high\nvolumes can cause irreparable damage to your hearing. Background\nnoise, as well as continued exposure to high volume levels, can\nmake sounds seem quieter than they actually are. Due to the\nimmersive nature of the virtual reality experience in the Software,\ndo not use a headset with the sound at high volume so that you can\nmaintain awareness of your surroundings and reduce the risk of\nhearing damage.\n(c)\nSeizures. Some people may have severe dizziness, seizures,\nepileptic seizures or blackouts triggered by light flashes or\npatterns, and this may occur while they are watching TV, playing\nvideo games or using any virtual reality applications, even if\nthey have never had a seizure or blackout before or have no history\nof seizures or epilepsy. Such seizures are more common in children\nPage 10 of 12\nand young people under the age of 20. Anyone who has had a seizure,\nloss of awareness, or other symptom linked to an epileptic\ncondition should see a doctor before using a headset in connection\nwith the Software.\n(d)\nDiscomfort. Immediately discontinue use of your headset when using\nthe Software if anyone using the headset experiences any of the\nfollowing symptoms: seizures; loss of awareness; eye strain; eye\nor muscle twitching; involuntary movements; altered, blurred or\ndouble\nvision\nor\nother\nvisual\nabnormalities;\ndizziness;\ndisorientation; impaired balance; impaired hand-eye coordination;\nexcessive sweating; increased salivation; nausea; lightheadedness;\ndiscomfort or pain in the head or eyes; fatigue; or any symptoms\nsimilar to motion sickness. Using virtual reality games and\napplications can make your muscles, joints or skin hurt. If any\npart of your body becomes tired or sore while using it, or if you\nfeel symptoms such as tingling, numbness, burning or stiffness,\nstop and rest for several hours before using it again. If you\ncontinue to have any of the above symptoms or other discomfort\nduring or after use, stop and see a doctor.\n(e)\nChildren. The headset should not be used by children under the age\nof 13. Adults should make sure children (age 13 and older) use the\nheadset in accordance with these health and safety warnings\nincluding making sure the headset is used as described in the\nBefore Using the headset section and the General Instructions and\nPrecautions section. Adults should monitor children (age 13 and\nolder) who are using or have used the headset for any of the\nsymptoms described in these health and safety warnings (including\nthose described under the Discomfort section), and should limit\nthe time children spend using the headset and ensure they take\nbreaks during use.\nIndemnification. You agree to indemnify, defend and hold harmless ARVORE\nand its affiliates and their respective owners, directors, officers,\nmanagers, employees, agents, contractors, advertisers and partners from\nany claim or demand, including, without limitation, reasonable attorney\nfees, that may be asserted or filed by any third party, arising out of or\nrelating to your use of the Software or any product or service available\nthrough the Software, your submission or provision of user content to the\nSoftware, your violation of these Terms or any other violation by you of\nthe rights of another person or party.\nGeneral. These Terms constitute the entire agreement between us with\nrespect to the subject matter and supersedes and merges any prior\nproposals, understandings and contemporaneous communications. These Terms\nwill be governed by and construed in accordance with the laws of the United\nPage 11 of 12\nStates, without regard to or application of conflicts of law rules or\nprinciples. By using our Software, you consent to personal jurisdiction\nand venue in the state courts of California for any lawsuit arising from\nor relating to these Terms or the Software.\nYou may not assign your rights or delegate your obligations under these\nTerms without our prior written consent. You acknowledge and agree that no\npartnership is formed between you and ARVORE by virtue of these Terms, and\nneither party has the power or the authority to obligate or bind the other.\nThe waiver by us of a breach of any provision of these Terms will not be\ntaken or held to be a waiver of the provision itself. If any provision of\nthese Terms is held by a court of competent jurisdiction to be contrary to\nlaw, such provision will be changed and interpreted so as to best accomplish\nthe objectives of the original provision to the fullest extent allowed by\nlaw, and the remaining provisions of these Terms will remain in full force\nand effect. You hereby agree that ARVORE would be irreparably damaged if\nthe terms of this Agreement were not specifically enforced, and therefore\nyou agree that we are entitled, without bond, other security, or proof of\ndamages, to appropriate equitable remedies with respect to breaches of\nthis agreement, in addition to such other remedies as we may otherwise\nhave available to us under applicable laws.\nYou agree that we may provide you with notices, newsletters, including\nnotices regarding changes to these Terms, by email, regular mail or\npostings on the Service. Any communication or notice that you provide to\nus will be provided by email at legal@ arvore.io.\nThese Terms constitute a legally binding agreement between you and ARVORE,\nand these Terms are accepted by you upon your use of the Software.\nPlease contact us if you have any questions about these Terms.\nPage 12 of 12", "Space Required": "359.4 MB"}



["5 stars\n81%\n4 stars\n12%\n3 stars\n2%\n2 stars\n3%\n1 star\n2%", "darkuniMay 28 at 6:55 PM\nA neat way to tell a story ...\n\nVery short, lightly interactive; this amazingly charming love story plays out like an old-fashion diorama. The tongue in cheek nature of the story taking place in the environment was delightful and fun.\n\nJust reviewed Gloomy Eyes - and like that, this isn't an experience for everyone. It isn't a game; it isn't even really an experience - but a story told in a fresh, neat way.\n\nIf you liked this, get Gloomy Eyes too - likewise if you liked that? This is shorter, but just as enchanting to experience.\n\nVR doesn't have to be all gun-porn and e-sports.\n\nHelpful | 92", "ReviewsByJackie22 days ago\nBetter than I was expecting :)\n\nI really enjoyed this app. The story is cute. It's short and there isn't a lot to do but there are buttons to push, levers to pull, knobs to turn and you are walking a little bit, a few steps now and again to get to the next part of the story. You start by sitting on the floor and you end up down on the floor for a minute at another point as this is where the story takes you. You can do this sitting down or standing up. I stood up while the story played out and had no issues with balance.\n\nSome may take issue with paying money for such a short experience that they may only watch once but it is really cheap and I feel, it's worth it. I actually ran through it a couple of times. This is also something you can let someone else who maybe isn't familiar with VR try out for themselves.\n\nHelpful | 2", "TVL1977May 29 at 12:28 AM\nBeautiful scenery.\n\nOk. It's only a 15 minute ride. It says in the description, so stop wining about the 5 it costs.(going to a bar will also cost me 5 in 10 minutes, so what's to complain about)\nThe dedication and work put into it are definitely worth it. Very beautiful story! It's an experience.\nBtw..... Use roomscale while playing it. It's so engaging when you move from one part to another, sitting to standing,....totally immerges you into the setting.\n\nHelpful | 38", "robvanhooseJul 26 at 7:04 PM\nThere should be an extra star for some\n\nUses VR to bring you spatially into a physical space where you collaborate in the progression of the story. Use a big space if you can and set the setting all the way over. I did and was amazed at how well it had me walk around to get to things in its world. I havent felt this way from another title yet. Very innovative in a way that serves the story.\n\nId give it a sixth star if I could.\n\nHelpful | 2", "ehblancz19 days ago\n10 minutes later and I'm still smiling!\n\nWhat an absolutely wonderful experience! Storytelling at it's best. The hand tracking work perfectly, the mobility kept me involved, and the ending \"experience\" made me a virtual reality fan for life. The narration by one of my favorite Westworld characters was also a nice touch. Excellent job to the development team. Keep these types of high caliber experiences coming and I'll be happy to pay a reasonable price for them.\n\nHelpful | 1", "markerpensMay 31 at 6:13 AM\nA movie and a game all in one\n\nI didn't know what to expect when I first bought this game. I was pleasantly surprised.\nThe room scale is fantastic, making you walk through a door way, crouch down and press buttons, it works really well and aids the interactivity of the story really well.\nI can see this being the pioneer of a new age of story telling, a kind of link between gaming and movies.\n\nHelpful | 11", "sanjoseguyJul 2 at 4:43 PM\nBeautiful story.\n\nThis was a beautiful experience. This is an exciting, new canvas for storytelling yet simple and elegant. It kept me safely in my playing space and used my boundary layout for the presentation. It was really neat! It was short, sure, but what a wonderful way to introduce people to new, unique experiences like this!\n\nHelpful | 2", "AAristi1976Jul 14 at 9:45 PM\nShort but lovely and neat\n\nIt's a lovely story and I really like the feel of the model view. I do wish the character didn't call for attention so quickly, it removes some of the feel of being an invisible observer. I hope they make other stories using this style. It would also be cool to have full control of the model and it's parts, as a side game or extra content.\n\nHelpful | 1", "Gamertag_VRMay 29 at 10:42 PM\nA Short beautifully animated love story\n\nREVIEW IS ALSO AVAILABLE SPOILER FREE ON YOUTUBE BY SEARCHING Gamertag VR\n\nThe Line from ARVORE is a magically short story of love, making excellent use of the hand tracking technology found on the oculus quest and I really hope we see more developers making use of it to tell interactive stories this way.\n\nThe presentation is excellent with regards to music sound effects and is also complemented by Rodrigo Santoro mostly known from Westworld as your narrator. All this adds up to feeling like a high quality piece of VR story telling and has Toy Story like moments.\n\nYou feel like your standing beside a detailed model village which you can move around your space and explore. Your job is to push, pull, spin or twist your hands to move the story along.\n\nThe price for admission is $5/3 and lasts around 11 minutes. If you have more VR users in your house, for example my wife and daughter will definitely check this out due to the genre it then means as a family we have had over 30 minutes of enjoyment and then the admission fee doesnt seem so bad but for a single viewing I still its a little high for the amount of content & replay-ability BUT with all that being said it the line has definitely hit the mark and fully delivered on what they they set out to accomplish and I hope we see more but hopefully at slightly lower price.\n\nHelpful | 8", "symphyJul 29 at 8:50 PM\nReally adorable & great use of roomscale\n\nI really dug this. Its short but beautifully done. Make sure to really lean in and get right in there to see the detail.\n\nHelpful | 2", "virtualmandalaJul 28 at 2:47 PM\nLovely experience\n\nUnique physical mechanics (stand up & sit down) provide yet another facet of how we can view and interact with VR media. The story is sweet, powerful, and loving. A great addition to the library.\n\nHelpful | 1", "muddywaterzzzJun 2 at 7:48 AM\nOff the beaten path\n\nVR is definitely taking story telling in a new, interactive direction, and this minuet is an elegantly touching example. The hand tracking mostly worked great, and added a deeper sense of being there.\nAs other reviewers have pointed out, you'll spend the same amount of money for this game on a pint, so it's value is more than worth the purchase.\n\nHelpful | 5", "poetic_is_hereJul 4 at 2:34 PM\nStunning with a cool story, and twist\n\nHappy that the description mentioned the 15 minute experience. The story was cute, the experience great, and definitely a must buy. I love experiences like these, which is why I enjoyed my Oculus Go and now my Quest. Thank you! Keep em coming!\n\nHelpful | 2", "omega911May 29 at 2:24 AM\nWoW!!! Asolutely BriLLianT!!!\n\nGreat stories with light hand tracking. I even watch the credits\nGets you excited for the possibilities of handtracking. Devs I would pay more to see you guys implement more interactivity with the world such as the ability to pick a flower or fruitout a tree and feed the dog maybe even poke him and get a bark. It would be nice to make anything that's not being used in the story to be touchable. loved the interactive short stories looking forward to what's next.\n\nHelpful | 8", "Deadpool2896May 30 at 5:56 PM\nWow \n\nThis is a great way to use hand tracking first of all. If you are on the fence with this game just jump over because you will be so impressed!! This game may be short but the story will last a lifetime, I would recommend this game for the  tracking and the beautiful story it tells. Please get this and experience this adventure\n\nHelpful | 5", "NukemarineMay 29 at 5:21 PM\nCute Story for People of any Age\n\nIt's an interactive city model about a simple love story. The room scale works great where you move section to section as the story plays out. For the sitting experience, it works just as well where the scene are placed in front of you as they open up. Your interactions via hand tracking are basically like turning pages in a book, but incorporate the model concept quite well so you feel somewhat like a part of the story.\n\nI do hope that the developers think of a way for us to re-experience this inside the model at the scale of the puppets like the last scene did. It would allow a fun reason to replay the story from a fresh perspective.\n\nHelpful | 4", "TransJenderGalJul 5 at 9:03 AM\nAdorable\n\nJust a nice little heart warming story. Very beautiful. Worth a revist or showing to friends and family.\nSome light interaction.\nBest played standing imho.\n\nWorth it's price tag imho.\n\nHelpful | 2", "ParadiseDecayMay 28 at 11:38 AM\nTell stories with your hands!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=6Rwz03uSuI4\n\nMy Initial Thoughts:\nA very cool and stylish diorama with story elements you can control and interact with your OWN hands in VR thanks to the power of hand tracking.\n\nHelpful | 13", "Flitch_1989Jun 3 at 4:52 AM\nEngaging story and great controls.\n\nA lovely story. You need a reasonably big play space for this, I extended the barrier beyond my walls of the living room, but didn't hit into anything. The hand controle was done realy well, with smooth motions for moving objects and dials. The narrator was realy well done. Well worth the money and hope to see more like this.\n\nHelpful | 3", "ruudsterJul 24 at 9:41 AM\nVery nice, and with hand tracking!\n\nLovely interactive story. It's about 15-20 minutes, but it's beautifully made, touching, and you don't have to use the controllers.\n\nHelpful | 1", "wgdMay 31 at 11:16 AM\nInteractive Story\n\nLoved it. The use of hands to interact with the story is really well done. I also enjoyed the carefully crafted characters and story line. Looking forward to seeing more applications like this one.\n\nHelpful | 6", "krisvdvijverJun 3 at 12:54 PM\nbeautiful story\n\nI love these beautiful diorama type VR stories and this one is no exception. You know how this goes : very limited interactivity and pretty short. But, you get a great story (essentially a short movie) with beautiful, high quality graphics, excellent voice acting, and a lot of atmosphere. Perfect escapism.\n\nHelpful | 2", "goody2shoes20 days ago\nGreat story and great story telling!\n\nAwesome, well laid out, written, and designed. Highly recommend.\n\nHelpful | 0", "THESCOTTishGamerMay 27 at 7:38 AM\nBeautiful\n\nBeautiful love story illustrated with childhood toys, would highly recommend this experience\n\nHelpful | 18", "DallanQ19 days ago\nLoved it!\n\nI absolutely loved this story! I hope you do more!\n\nHelpful | 0", "Firehawk3721May 31 at 11:44 PM\nAmazing 15 minute experience\n\nI love whimsical miniatures so the world they created here is amazing. While I bought into Vr for gaming this interactive story may be my favorite experience so far.\n\nHelpful | 6", "Datt69Jun 29 at 12:48 PM\nBeautiful and immersive\n\nA lovely little story that really shows off the immersive power of virtual reality. This is precisely what I want from the Quest.\n\nHelpful | 2", "organisedJun 26 at 1:32 PM\nCharming and gorgeous little tale\n\nAbsolutely love what this experience does, highlights the power of the medium in a way that most other experiences fail to deliver on. Narration is spot on and the overall interactions are easy to follow and enjoyable.\n\nHelpful | 1", "james.southworthJul 2 at 11:05 PM\nBeautiful\n\nWhat a beautiful, incredible story. This was a short but captivating vr experience. Highly recommended.\n\nHelpful | 2", "luksceccatoJul 12 at 9:10 AM\nAmazing\n\nTotally worth the money! Just get it and enjoy.\n\nHelpful | 2", "mclaughlinlindaJun 26 at 2:59 PM\nFirst app I bought for Quest; loved it\n\nI love that you move around your space as the story goes along, and turn knobs, pull handles...at the beginning I didn't really follow the story too much with the distractions but I caught up quick...some reviews said it's too short and not worth the money but having experienced it I'd say it's more than worth the price of a beer or 2 :)\n\nHelpful | 1", "ArthurjiMay 30 at 8:25 AM\nSweet, charming VR animation short\n\nThe animation is beautiful, the story is sweet, I love the way they used space to unfold the story. Well worth the price. Highly recommended!\n\nHelpful | 5", "ZugZug64Jun 29 at 10:53 PM\nBeautiful story\n\nIn my opinion there's not much replay value but it makes for a great experience to see hand tracking in action and to amaze your friends and family with it as well.\n\nHelpful | 1", "okeyoneMay 29 at 2:16 PM\nGreat Fun to Watch\n\nPeople are complaining about the cost. If you can't afford the price don't buy it then complain. Wonderful experience for many viewers. 5 STARS!\n\nHelpful | 5", "Bender_2112Jun 4 at 9:17 PM\nAbsolutely Delightful!\n\nI love this cute story. Kind of reminds me Moss but its not a game. Its a short interactive story. Highly recommended if you can appreciate the arts and theater. I hope to see more stories told in this way.\n\nHelpful | 2", "snappaheadJun 13 at 2:44 PM\nCharming!\n\nI wasnt expecting much given the price and overall simplified visuals but this little story has some real heart to it. Nicely animated with good sound design and narration. It's very short at maybe 10 minutes but definitely worth a revisit. The interaction in the game is very minor and could be removed with little to no effect either way. It added nothing to the experience for me personally. Overall, a quality experience that I am glad to support with my $5.\n\nHelpful | 1", "renevanderreijdenJun 3 at 3:51 AM\nSupport the Devs!\n\nJust bought it ( only 2 beers) to support the devs to make more and longer of this beautiful experiences in the future! Hope lots of people also will.\n\nHelpful | 3", "Denisio7May 28 at 7:35 PM\nSpanish Please!\n\nNice story. May we have it in Spanish as well so my family can enjoy it\n\nHelpful | 8", "RogueMayhemJun 4 at 1:54 PM\nGreat story\n\nThis is the best interactive story telling ever. Very sweet. Also the 3D doesnt get you sick. I enjoyed myself. Best bang for your buck and great way to introduce VR to friends.\n\nHelpful | 2", "angyd83Jun 6 at 8:05 AM\nGorgeous !\n\nThis was a delight. Beautiful story, gorgeous animation, good interaction, its great for first-timers in VR.\n\nHelpful | 3", "EmpressbJul 17 at 12:54 PM\nShould be free\n\nI love this but there is no real interaction. I think they should give this away for free\n\nHelpful | 0", "Taytay6357May 28 at 11:46 PM\nBeautiful but...\n\nIt was a beautiful game and the graphics were good for that kind if game. Although it was very pretty and meaningful...I think it could have been 2 dollars maybe 3 but not 5, I think it was a little too short to be 5 dollars but that's just my opinion. Anyways, a beautiful game, had a lot of meaning, and the graphics were great for this type of game. Bye\n\nHelpful | 4\nDeveloper ResponseMay 29 at 9:58 AM\n\nHello Friend! We absolutely appreciate your feedback on The Line! We dedicated a lot of resources and time to research and develop this experience in order to create something meaningful and impactful for everyone. We do understand that the price may not suit some viewers, and we are doing our best to match these expectations with the ability to continue making projects in the future. As we are indie developers based in Brazil, your support for our projects is very much appreciated and we will continue to do our best! Also, if you'd like to talk to us directly you can join our discord here - https://discord.gg/a2MzaeP or through email contact@arvore.io.", "TAZ2020Jun 16 at 5:47 AM\nTruely lovely\n\nThis is a great immersive experience!! I enjoyed it. My kids loved it. Really well presented and thought out. Thanks to the Devs for this little gem!!\n\nHelpful | 1", "Marymount-DCMMay 28 at 11:17 PM\nExcellent !\n\nWonderful! I would love to see more!\n\nHelpful | 6", "tkansalMay 28 at 6:44 PM\nVery well done\n\nHeart warming story. Need more stories like this.\n\nHelpful | 5", "Flywheel82Jun 8 at 7:28 PM\nWorth it if you have discretionary money\n\nIf youre short on cash I would save and buy a game, otherwise you wont be disappointed.\n\nHelpful | 1", "momosiJun 7 at 10:03 PM\nAMAZING\n\nSpecial poetic experience\nLoved it.\n\nHelpful | 3", "FreeHugsGuyMay 31 at 7:01 PM\nWonderful!\n\nAbsolutely positively wonderful!\n\nHelpful | 4", "Aaronb3434May 28 at 3:36 PM\nCool\n\nNice!\n\nHelpful | 4", "janwillemheemskerkJun 5 at 8:53 AM\nNice!\n\nBeautiful short story! :)\n\nHelpful | 2", "willemichelsen9 days ago\nA pleasant little escape from\n\nIt was short but I loved it. A pleasant little escape from reality. And even caught myself yelling Pedro you can do this!\n\nHelpful | 0", "lesolorzanovJul 26 at 5:59 AM\nSweet, short, no hand tracking\n\nIt is an extremely sweet and very short story. It was suggested as a hand tracking app but it isn't (or at least it didn't work for me).\n\nI wished there was the possibility to take the characters in my hands or exploring the world after the story. It's not an impossible thing to make and it would add a lot to the interactivity.\n\nI wish there were more of these. Absolutely fantastic narration and story and models, even the credits were beautiful\n\nHelpful | 0", "OneMadEmuJul 29 at 9:06 AM\nSuper cute and well done but short.\n\nI must say that it is really short, even for the low price. But it's super cute and really well done. The hand tracking works well and the fact that you can move in the play space is really neat! Would recommend even if it's short.\n\nHelpful | 0", "yre0Jun 15 at 8:04 PM\nNo worth it\n\nNot even a game a super short story\n\nHelpful | 1\nDeveloper ResponseJun 16 at 3:36 PM\n\nHi friend! We do apologize if you felt that you were misled when purchasing our experience from the store. You are correct that this is more of a narrative experience and less of a game, as that was our purpose for the piece. We tried to include this info in the description by stating \"15-20 minute interactive story\", as well as including the genre as \"Art/Creativity, Movie, Narrative\". Could you please help us understand how we can better distinguish our application to avoid confusion? We would love to hear your feedback! If you can reach out to us on our email contact@arvore.io or through our discord channel. (https://discord.gg/jRzeVac) Thanks for your time! - team", "Pixie40Jul 6 at 4:52 PM\nSo very precious\n\nI went in not expecting much. But this was just so precious. It goes to show that VR doesn't have to be guns, cars, and immersive jump scares. There's plenty of room for an immersive story told from a unique perspective.The hand tracking interaction can occasionally be a little finicky (I'm looking at you crank organ), but overall this is just so... so... The only word I can think of to describe this is \"precious\". It's a sweet story and well worth getting, especially at it's price point.\n\nHelpful | 1", "Bluem000nJun 10 at 10:14 AM\nSmall but perfectly formed\n\nImmersive, interactive story of boy seeks girl. Well made, and a good advert for there capabilities of the Quest (graphics, sound, and hand tracking. Its free, download it now.\n\nHelpful | 1", "jackheffelfingerMay 28 at 5:30 PM\nSweet but a one trick pony\n\nFor people learning blue to use their VR hands for the first time its great, but for VR veterans its a one time experience. However, it is very heartfelt and awesome experience.\n\nHelpful | 3", "9FaceJul 12 at 9:38 PM\nInnocent and visually pleasing\n\nArtistic and heart-warming\nToo short tho...\n\nHelpful | 0", "meduzoJun 3 at 11:23 AM\nInteresting storytelling, boring story\n\nThey take complete advantage of the VR Medium, you need to live this experience with roomscale if it is possible for you. The way they tell the story is really unique, but I find the story itself lacking depth.\n\nYou should buy this on a sale, for me it's more on the $2.99 side. Don't get me wrong, you're buying quality content, but the shortness and predictibility of the story doesn't really push you anyway.\n\nFor a $4.99 pricepoint I would like it to have more languages support, I've played the english and portuguese version of this, the narration (even though it's the same story) changes a bit the experience.\n\nCongrats on the studio for releasing this great experience, if you guys release another title, I'll gladly buy it since I already know you do quality work, just find a better story to tell.\n\nHelpful | 0", "Leilei3003Jun 1 at 8:50 AM\nBeautiful but short\n\nVery beautiful slightly interactive story. But unfortunately too short.\n\nHelpful | 0", "JenspadMay 28 at 6:22 PM\nBeautifully done\n\nShort beautifully done however very similar to a lot of experiences that are free......\n\nHelpful | 0"]