{"App Title": "The Wizards", "App description": "The Wizards support Oculus Store Cross-Buy!\n\nThe Wizards is an award-winning action-adventure game with an unique system of casting spells with hand gestures and acclaimed narration and voice acting by Jason Marnocha.\n\nUse Touch controllers to destroy your enemies by weaving magic into lightning, fireballs, and other elemental spells. Chain combos and use different tactics against the hostile creatures. Make the game as challenging or as casual as you like with Fate Cards, and become the hero youve always wanted to be with powerful spells at your fingertips!\n\n Action-adventure VR spellcaster set in a rich fantasy world\n Campaign featuring time travel, heroic battles and dragons\n Intuitive system of casting spells with hand gestures\n Element-based spells to learn and upgrade\n High replayability thanks to game-modifying Fate Cards\n Free movement and/or free teleportation-based exploration\n Left-handed mode", "Purchase section": "$24.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Adventure, Arcade", "Languages": "English, Chinese (China), French (France), German, Japanese, Russian, Spanish (Spain)", "Version + Release Notes": "1.11", "Developer": "Carbon Studio", "Publisher": "Carbon Studio", "Website": "https://thewizardsgame.com/", "Release Date": "June 6, 2019", "Developer Privacy Policy": "", "Developer Terms of Service": "", "Space Required": "3.43 GB"}



["5 stars\n55%\n4 stars\n23%\n3 stars\n10%\n2 stars\n5%\n1 star\n6%", "fat_ass_noah14 days ago\nWhat VR should be...with better graphics\n\nThe game is awsome really. The spells hand motions are simple and straightforward but I wished they could be casted from both hands, for example casting a fire ball in the left hand and the right hand. This would create possibilities for awsome combos.\n\nBeing able to upgrade your spells is cool especially so that the lightning spells separates in each hand. I still havent been able to achieve the master level for your fireballs which would max out this spell.\n\nI do think that the game is laking enemies and difficulty.\n\nThe biggest default are the graphics. They are really really really bad. Do not buy this game without knowing this! After seeing videos I knew what to expect but still.\n\nI hope to see The Wizards: Dark Times soon on quest as the graphics seem really better but it also is all I think the game is missing (casting in both hands, more spells, more enemies, more difficulty, and way way better graphics).\n\nIf the developer reads this fhey please think about bringing Dark Times or atleast the Enhanced Edition to Oculus Quest.\n\nHelpful | 13", "JenspadJun 5 at 7:48 PM\nEnjoyed this game and the Genre but.....\n\nPlease do not come out with wizards dark times for quest and make it an entirely new title to purchase because I believe that should be additional DLC for this game....it's the same game but with different environments. I do believe it would make this more prominent in the store as it is not talked about as much as other titles. I've always thought this was a title that did not get enough attention that is just as good as other titles that do. Spells are cool especially fireballs and Ice bow but I agree more puzzles would be nice hence the reason why adding dark edition as a content update instead. Love the narration it's a decent title for the price. In no way would I say it's complete garbage or a waste of money as another review stated.\n\nHelpful | 74", "WalterIsMe13 days ago\nA fun game, not for everyone\n\nThe wizards is a great game where you can cast some spells one bad thing is that there arent enough. The spells in game are great but some more would be nice I love, how they made you have to do gestures to cast a spell. My next gripe is the enemies there isnt enough variety the final boss is fun but other than that they can be repetitive I noticed this more on my second play through but if you get bored of things like that then I cant recommend it. I loved it though so if your looking for a fun magic based VR game then this is the best. (Upgrade shield first its fun to throw around at enemies.)\n\nHelpful | 4", "Raizen325Jun 26 at 10:27 PM\nOverall great but one Major issue\n\nSo I gave this game a 4 stars because it is very enjoyable and overall a great quest but one issue Im facing is the teleportation, it will show where I need to teleport but wont allow me to teleport there. Im on the final boss area but its not letting me teleport over to said area. This is a major bug that needs fixing. If they fix this then I will change my rating to a 5 stars. Overall great game just that one bug.\n\n\nEDIT: I got it to work but still a annoying bug. As I said amazing game and that was the only major issue I came across, the only one I noticed! If your on the fence as I was I highly suggest getting it and trying it out!\n\nHelpful | 14", "StephenGdBaker15 days ago\nVery good\n\nSpell gestures work well. Visually it's good. The game play is enjoyable. Only 4 because there aren't many meaningful things in the environment to interact with which makes it feel rather simplistic. Especially if you've played things like Zelda or DTRH. I'm glad I bought it. And it's definitely fun.\n\nHelpful | 1", "DarkAngel10614Jun 28 at 8:13 AM\nGood for kids and adults alike\n\nI have found that not ALL the spell gestures work as they are supposed to. Now this could be just me and my set-up, or it could be inherent in the game. The fireballs, for example, for me, works best to do palm up and a quick up\\down jerk. If I have my lighting right, I can cast it 95%+ of the time. (I am prone to migraines, so my room is set up pretty dark normally)\n\nOnce I figured out the differences in gestures, the game is more enjoyable than frustration, so play around with it til you can pull up the spell 9 times out of 10 in the pocket dimension.\n\nUsing mixed teleport and walk allows me to explore, but I still jump when I start getting motion sick. (Had quest about 3 months now and Gen X, plus not a daily player)\n\nThe puzzles are enjoyable, hard at times, but that's part of the fun. Most single quests take me about 30-45 minutes cause I explore. Trying to find fate cards and the fairy crystals.\n\nBlue walls can come down with a fireball, red needs a cannon.\n\nDefinitely what VR was made for, tho some improvements could be made. I look forward to playing the sequel as well.\n\nAll in all, price is a bit high, but worth it. Just enjoy the game rather than racing to beat it.\n\nHelpful | 12", "shimmysperber19 days ago\nGood for the first few hours but...\n\nOverall it's a pretty good game I don't know if it's worth it for 25 dollars Bob its overall on nice game but when you get to the third chapter first of all you died from every hit. But that's not the main problem the problem is it repeats the same thing just in a different environment and there's very little spells you can do also just gets very hard and it's not even fun anymore you literally have to stand there with your shield and just fireball everything I paid $25 cuz I thought I'm going to have fun learning a lot of styles going different adventures and it's also the same enemies there is one or two different enemies after chapter 3. But that's it it's an okay game but I suggest you find a different Magic game they came out recently with a different one it's called Dark Times it's from the same company but I think it's better because they updated it and I really think I should get it for free since I paid for this game and it's basically the same thing also I think they're not paying so much attention do the game itself I don't think they put hard working at only at the beginning they did is Dana was fun learning new spells and everything but then it gets boring that means they update the game and put new stuff I'll rate it five-star\n\nHelpful | 3", "master_builder75Jun 27 at 8:39 AM\nBlew my expectations out of the water\n\nI had heard people talk about how the gameplay gets repetitive and it just basically is killing wave after wave of enemy's but I was very happily surprised that it isn't, the levels are large and not always a single linear path to follow due to hidden objects around such as fate cards and fairy fragments. The graphics are not incredible but it is a quest game and you have to keep in mind its limitations, it looks great for what they were working with. The spell mechanics are fun and make you feel like a real wizard when you are surrounded by a ton of enemies and chaining together spell after spell at enemy's, I like being able to upgrade spells to make them more powerful because it gave me the sense of progression as I continued through the campaign, like I was slowly getting more familiar with the art of wizardry. The voice acting is great with humor sprinkled in, there are quite a few different levels, all with their own unique layouts and puzzles. The boss fights feel epic. The only real gripe I have is that I wish you could summon one handed spells such as the arcane shield and fireball with both hands at once, but that's not a big deal. All in all hours of fun and I absolutely would recommend you try it if you are even a little interested.\n\nHelpful | 6", "JaCrispy119A day ago\nFun\n\nPretty fun but they need an objective marker or something\n\nHelpful | 0", "wisxxApr 30 at 7:54 AM\nno regrets\n\nI bought this on sale, really happy I made the purchase. I like that they have you do specific movements to do spells, makes it feel a lot more real. Sometimes it doesn't work properly and my shield doesn't pop up even though I'm positive that I did the movement right, but maybe that's an issue with the quest rather than this game.\n\nCharacter movement reminds me of when you play an older non-vr game ported to VR (like Quake). What I mean by this is movement isn't affected at all by where you're looking, which feels really awkward. I'm also not a fan of how aiming is done with your head.\n\nI've gone back to previous levels to get a higher score and find all those crystals so there's some replayability. I hope more games like this come to the quest because this is what excites me about VR, being able to do magic and fight monsters. I've played enough shooting games\n\nHelpful | 22", "TheOnlyFatMan91May 27 at 1:03 PM\nReally fun\n\nBeing new to the whole vr world I had found that there are a lot of games that just really dont live up to the hype. But this game definitely has given me hope I just have to keep looking. The graphics are great and smooth enough that even when sitting to play you dont get disoriented (unless you turn your sensitivity to max), so far the game play is really fun, the hand gesture magic use is an awesome feature that makes you wish you could really do this. Only giving 4 stars because the only issue I have is that you are scored points on each level but I have no idea how they actually score you. So if your trying to maybe beat your friends high score you have no idea what perimeters you have to do better at to score higher.\n\nOverall great job devs. Amazing game and Id love to play some more of your games in future.\n\nHelpful | 6", "fer0nJul 12 at 9:15 AM\nOne of the most enjoyable gameplay games\n\nI love the spellcasting mechanisms, especially unlocking and upgrading them. The story doesnt take too long, but to upgrade everything youll probably have to play a few of the levels again and explore a bit more which is nice.\n\nI especially enjoyed the game because its not as tense as Lies Beneath or Half Life Alyx, which Ive been playing (though I got scared occasionally by a phantom appearing right next to me).\n\nThe narrator is probably the best Ive seen so far, made me smile quite often.\n\nI really hope Dark Times is coming to the quest soon. I cant wait (and probably wont since its possible to play it with oculus link).\n\nHelpful | 0", "DemotedBreadSliceJul 11 at 12:37 AM\nAmazing. But\n\nThis is an amazing game but it just needs to be polished with movement and graphics i have no other complaints.\n\nSpells: Fun and great once mastered\n\nCombat: Amazing with cool bosses\n\nStory: One of the best along side trover saves the universe\n\nChallenge:\nBeating the game? Easy\n100% of the game complete? Took me over 10 hours and i loved almost every second of it\n\nI guess one more flaw is Time synchronization points = HP i didnt know this my b\n\nGood luck gamers and happy hunting\n\nHelpful | 1", "lord_luciferJun 21 at 3:27 PM\nReally fun game\n\nThe graphic isn't that great but the game is really fun! The fire ball throw is a little weird. But you learn how to shoot ice arrows rightaway. And they are both casted as spells!\n\nLike this is literally my dream come true to be a wizard lol It has really good UX. Honestly the best out of the games I owned so far. You can walk and teleport so you are not missing either experience.\n\nFeeling motion sick from walking? Teleport around. Monsters showing up? Battle away.\n\nIt does have a battle spot kind of adventure style. So you won't run into any monsters while exploring the maze. And then you fight a swarm at certain points.\n\nNot sure if this game is able to improve on what it is. But if not definitely looking forward to a v2 of this with better graphic and monsters you can fight while exploring\n\nHelpful | 1", "MajorasWrath20 days ago\n\nThis is probably my favorite game on the oculus. In my opinion it only has one flaw and that is that it is a little short. Personally I wish there were more levels.\n\nHelpful | 1", "gavstersJul 7 at 6:43 AM\nOne of the best games\n\nI love the magical genre and was disappointed when the sequel was only on the rift but i love the how you have to unlock different spells and use and do the hand motions i like naruto so it is a great game for me but the story is to short and completed it in like 5 days but I replay it and still good please bring dark times into quest \n\nHelpful | 1", "arcaneastronautApr 13 at 2:31 AM\nWhat I was waiting for\n\nThis game is more or less how I was hoping VR would bring magic to life before VR was really a thing. Amazingly smooth and immersive spellcasting gestures that have to be perfected over time. I started out awfully, casting spells I didn't mean to and awkwardly running from ogres until I realized in the training area that casting suddenly becomes almost instinctive if you actually put effort into your gestures. Fireballs can be a pain if you're not \"igniting\" them in a fluid motion, for example. And oh my god, the lightning spell once you start getting it right feels SO GOOD. I think a lot of people don't notice that you can turn off auto-aim as well, making it 100x more immersive and forcing you to learn how to properly cast. It's actually easier to aim, in my opinion. I absolutely love this game and I hope there's more to come.\n\nHelpful | 62", "f1shb0wlJul 5 at 4:53 PM\nFun game but I kinda want the other one\n\nThis game was fun but I would prefer the wizards dark times but this was fun. P. S. Hope the wizards dark times coming to the quest.\n\nHelpful | 2", "cotheturtle24 days ago\nGood game\n\nVery fun and challenging but not long enough\n\nHelpful | 0", "Teonis25 days ago\nGreat game\n\nIt has cool magic mechanics, storywise it's meh, but if it would get hand tracking, man, it would be amazing!!!\n\nHelpful | 0", "rusty2064Jul 3 at 8:49 PM\nIts okay, but..,\n\nIm always stuck on the first level\nIts either I didnt get the three stones, or I hadnt obtained enough points (and heaven help me on how you obtain 3800 points?!?!)\nIts gotten to the point Im tired of the game. I have the fireball, bow AND electric bolt all to which have not helped me achieve enough points\n\nIt would be great to have a point calculator to identify how your coming along, as well as what your missing or need to obtain the next part of the game\n\nHelpful | 1", "Timmybln1Jul 11 at 11:34 AM\nAmazing Game\n\nSometimes it is difficult to cast some spells (namely arcane missile) but overall it is a moderately challenging game that I recommend for all players, and the spellcasting is so uniquely amazing\n\nHelpful | 0", "JimZMMar 22 at 11:35 AM\nokay graphics, sluggish weapon aiming\n\nPros:\n- good voice acting\n- spellcasting is intuitive\n- gets quite fun/thrilling/immersive after 1 hour\n\nCons:\n- okay environments, okay graphics, some graphics are sluggish\n- fireballs are aimed with your head, aiming is sluggish and unintuitive (but you can get adapted to it)\n- too much boring tutorial/speeches (at first)\n- sometimes unintuitive or not well designed\n\nHelpful | 20", "Noor_AzzonyMay 4 at 10:12 AM\nOne of the best games on quest... but!\n\nI bought it as a risk... it turned out to be an amazing choice!\n\nI was hesitant because the game banner totally sucked... looks like a board game cover... gives this game no justice at all... I believe, from a marketing and design perspective, if the devs did their magic (pun intended) on the cover, the game will sell like hot cakes...\n\nthey did an amazing job in the game design, movement, spell casting gestures and enemy AI and design...\n\nA true piece of art!\n\nHelpful | 2", "Twistedkain420Jul 20 at 12:32 PM\nVery good\n\nI love how you move your arms to cast spells!\n\nHelpful | 0", "odiousego65Mar 5 at 8:50 AM\nPower fantasy fulfilled\n\n4 stars for the game that made It fun to be a wizard again. The graphics leave alot to be desired but it's a quest game so you'd be hard up to find anything different. Buy it and lose yourself in a epic adventure!\n\nHelpful | 50", "Partiboy23Apr 29 at 6:53 PM\nGood but not great\n\nFireballs are a little janky but otherwise the controls for the whole thing feel real good makes you feel real bada$$. graphics are ok but could be improved. Pretty good story could use more spells. Adding more spells would be amazing hope you guys improve this good game.\n\nHelpful | 2", "InstantFanMay 12 at 11:25 PM\nMakes you feel magical\n\nJust finished this game, and all I can say is wow. The game truly does make you feel like you have magical powers; my favorite power is the electricity you can shoot from your hands. I just wish that the game was longer!\n\nHelpful | 4", "aleks.pierceMay 6 at 5:42 PM\nAlmost a perfect game\n\nI've almost completely finished this game and I have loved almost every aspect of it. The voice acting is decent, the quest Version still looks good even with the step down in graphics. Where the game really shines for me is the combat. Yes it is basic wave shooter combat but the controls are so immersive that it doesn't matter. I love the motions for different spells. The only disappointment I had was that I wished some of the puzzles were better, or just more of them.\n\nHelpful | 1", "ZestyyyMay 1 at 12:33 AM\nAMAZING game but....\n\nThis game is so fun and I love the mechanics of it, but theres one flaw that I think makes the game kinda dull, theres not enough spells, there are only 6 spells in the game and I think the game can have wind, dark, light, buff magic and others too, theres only 2 fires, 1 ice, 1 defense, 1 Crystal, 1 lighting, thats not a lot tbh, this game just needs a spell update and will be PERFECT!\n\nHelpful | 1", "dgagarkinMar 26 at 4:32 PM\nSpell casting simulator\n\nNot really an RPG, more just wizard simulator with cool gesture-controls for spells. Dont expect Witcher or Fable and you wont be disappointed. Overall not a bad game, and its cool to cast spells on the fly. Still, something is lacking\n\nHelpful | 8", "AzraemJun 27 at 7:50 PM\nI play this game and....\n\nI see a first mini cute crature and i remember me in baby..\n\nHelpful | 0", "drew.hyndsApr 15 at 3:59 PM\nFun but not amazing\n\nI got this game on sale on the rift store, and I was fairly happy with the price I paid, but I definitely think 18.99 would of been too much. The graphics aren't great, the spell casting is cool but doesn't always work perfectly, the story was a little bleak but fun, the voice over narrator was really good with some fun jokes :p\nThe game took me maybe 4 hours to complete, and probably 2 or 3 more going back to collect the gems. I'd recommend it if you can find it on a sale and wanna cast some spells :)\n\nHelpful | 5", "PIX3L4TORJun 12 at 5:02 AM\nAMAZING\n\nThe game was really cool I never imagined me shooting fire balls at goblins in cry I had no regrets at all\n\nHelpful | 1", "spookeeMay 17 at 1:34 AM\nAwesome game great graphics\n\nA lot of people were complaining about the graphics but theyre pretty amazing compared to most other quest games and its very immersive\n\nHelpful | 2", "im_watching_youFeb 13 at 7:50 PM\nGreat game I felt like a wizard\n\nPros:\nMakes you feel like wizard\nImmersive\nCool spell casting\nAble to make enemies stronger or weaker\n\n\nCons:\nGraphics are not great\nStory only takes 2-3 hours to play through\n\nOverall this game is amazing with very few problems it runs very smoothly and gameplay is great. It takes 2-3 hours to play but you can replay any level. In the game you find cards that can make enemies easier or harder to fight which makes replay ability much better. I also heard the developers are planing on making more levels but dont quote me on it. This game is must buy and I personally think it is one of the best on the quest.\n\nHelpful | 30", "yellowscotchJul 18 at 10:28 PM\nIts fun but not polished\n\nThe game as a whole is fun but there are many things that can annoy you, but really after playing for a bit its a lot lf fun, just expect to see a lot of things like see through walls, the gesters feeling like they arent working, but really a great game, its fun\n\nHelpful | 0", "RobsWebMay 31 at 12:52 PM\nIt's like Arizona sunshine meets D&D.\n\nIt's like Arizona sunshine meets D&D.\n\nComfortable\n\nVisually impressive\n\nSpells feel like magic\n\nHelpful | 1", "Big_ZukkyJul 28 at 4:10 PM\nDeserves more recognition\n\nI have played for around an hour, and so far it has been very fun and I have had no issues. I have had no problems with the gestures to activate spells unlike other people, so if you are thinking about buying this, I would highly reccomend it.\n\nIt needs more recognition because I find most of my games on you tube reviews, but I saw this on the Oculus store near the bottom!\n\nHelpful | 0", "CrispedWizard98Mar 21 at 11:15 PM\nBuy this now\n\nI honestly dont know if I can describe this game but it is AMAZING. This is the first fully fledged out wizard magic game I've tried. I love the easy to learn mechanics and just casting spells is smooth and feels great. This is an amazing game to get if you have a young one in your family or if you just love fantasy and magic. It's essential to buy right now because its 60% off. $10! HIGHLY recommended this game to anyone\n\nHelpful | 3", "sharktale2Feb 26 at 10:40 AM\nMeh\n\nIt is a good game. Great even. For about the first 30 minutes. Thus game is entirely driven by a sense of wonder with no real progression in the story and whilst at first you do feel intruged and amazed you aren't drawn back into play and it gets old quick. If a good plot was added and more spell customization thus game would be an easy 5\n\nHelpful | 13", "bnaas30Jan 7 at 11:11 AM\nDoesnt Draw Me Back In\n\nThis is a great game that brings out my inner nerd, but after I finished the story, I had no want to jump back in as I do with other games. The fate cards are neat, but not something thats going to draw me back in and only gives the game slightly replayibility Maybe adding in some type of arena, horde, or arcade mode might bring back in. As well as multiplayer. Bettering the graphics will also increase the appeal.\n\nHelpful | 72", "Tanner145 days ago\nAmazing\n\nIts a amazing game only 1 thing would be nice to have, is more spells.\n\nHelpful | 0", "KonoDioDa4Mar 27 at 8:08 AM\nIts worth it!\n\nThis game is very fun when you are a master wizard and have unlocked all of the spells. Although this game needs work, it does have many pros and very few cons. I just wish there were more spells and loot around each map in the level.\n\nHelpful | 1", "BrendanRoyMay 9 at 6:48 PM\nNot the worst game I've played...\n\nGraphics are borderline bad but I'f you get lost in the game goodluck theres no arrows or check marks to show you were to go audio isnt the best either it's a slow paced game also I was disappointed\n\nHelpful | 1", "amypaulusJun 5 at 12:17 PM\nEhhhh\n\nIts okay\n\nHelpful | 0", "beggerkingMay 2 at 4:31 PM\nSo far so good\n\nAwesome! Would have made my childhood complete if it had came out 30 years earlier:). But seriously, it's awesome\n\nHelpful | 0", "aaron.haslettFeb 22 at 2:00 PM\nBroken mechanics\n\nThe gesture for the fireball isn't recognized about 2 out of 5 attempts, no matter how careful you are with it.\n\nWhen you throw something it will randomly just drop to the floor or go in some random direction about 1 in 3 times.\n\nJoystick movement with the left controller will randomly decide that forward means left. It's failing to account for some other rotation. Not sure which one\n\nIf you teleport near to an inaccessible part of the map the game will get into a state where it won't recognize what you're pointing at, which is annoying when you find a red crystal in a hidden location. Fixed by teleporting slightly further away.\n\nWhen you teleport you will sometimes randomly be facing some other direction than you specified or be in a slightly different place than you pointed.\n\nAlso the fireball throwing mechanic is very poorly designed even if it did work. It's trying to mix normal throwing with essentially a laser guided projectile where the target is whatever you're looking at. That doesn't make any sense because 1. when you're throwing something your eyes move to get the throw right, and 2. You have to ignore the actual direction the throw was in, so what was the point in the throw other than the force? You should just forget the throwing part and just make it an eye targetted projectile. That makes more sense for magic anyway.\n\nHelpful | 14", "Hexfold96May 4 at 2:56 PM\nEverything I expected and more!\n\nI expected mediocre content and an ok story, but it was so much more.\n\nHelpful | 0", "wgguyJun 26 at 5:06 PM\nThis is great!\n\nI havent finished the campaign yet, however, upgrading your spells has been one of my favorite parts. Ice bow and lightning are my personal favorites. This game is something new that I hadnt discovered yet on the quest, and I have been enjoying every second of the experience.\n\nHelpful | 0", "chiquita.barrazaJan 4 at 4:53 PM\nGood fun\n\nEverything has already been said. Game is very fun, hand gesture spells are clever and work nearly perfect. Sure a hoard mode would be fun and more content is always a plus but it is plenty fun to just go in and battle stuff. I replayed the first boss a bunch of times using the fate cards which change the difficulty so replay value is there.\n\nHelpful | 22", "slappy2669Jun 8 at 2:10 PM\nNice puzzle game\n\nI really like hand gestures that you need to do in order to make the weapons Spells form. But you do have to do the hand gestures right otherwise it will not work. freaking out in the middle of combat is not the games fault . Id really like it if there was a few more puzzles . Im glad I bought a the game and so will you....... a side note . I do wish they would have haptic feedback so I can feel the attacks or when Im being healed the haptics on that would feel really cool\n\nHelpful | 0", "GzeppJan 26 at 5:17 AM\nGreat, but missing features\n\nI dont know why I waited so long to play this title. Great fun sorcery mechanics with waving your arms in different motions really takes the VR - Immersion to the next level. Wish the graphics were better, but thats due to the Quest limitations.\nAlso I hope but doubt, the Developers will add some type of Multiplayer system to this game\nWould be awesome to incorporate some type of Horde mode.\n\nIn conclusion this game is lots of fun with meh graphics. Story is entertaining with excellent voice acting\nAlso if you own a Rift / RiftS its also cross buy.\nPC - Experience graphics are definitely a welcomed addition.\n\nHelpful | 2", "Brickshooter985May 23 at 9:49 AM\nTrash\n\nTotal and complete trash. Dont waste your time or you money.\n\nHelpful | 2", "RedwolfRoninMay 21 at 3:52 PM\nGood game. Worth the price.\n\nI like the gesture based spell casting idea. Needs a little fine tuning because it didn't work every time I cast but it didn't fail enough to take away from the game. Good game not sorry at all that I bought it. Very much worth the price.\n\nHelpful | 0", "Infamous2ndSonMar 7 at 10:47 PM\nSpell casting fun!\n\nI felt like a real wizard! Lots of different motions for different spells. Fun narrator. Longer than most Quest games. Nice!\n\nHelpful | 2", "phillyg2020Jun 17 at 5:24 PM\nAmazing!\n\nGreat game! So cool casting spells! I hope Dark Wizards comes to the Quest?!?!\n\nHelpful | 0", "Tvick333Feb 11 at 5:16 PM\nEverything I hoped for\n\nAmazing game all the way around. Good story with an east to use interface. Brings magic to your finger tips in the way we all wanted as kids. Must have for the Quest, would give 6 stars if I could!\n\nHelpful | 2", "stijn.zaalbergDec 4 at 2:27 PM\nThank you! Where's part 2?\n\nThank you for making this game! It really makes you feel like you are a real wizard. The moment you realise you don't have to think about your spells anymore is awesome. Also the small scares when you suddenly run into an enemy is also very satisfying! Part of some minor fireball throw issues IT is great, but unfortunately it feels like something is missing.. the story was fun and creative, but I'm in need for a horde modus, or some cop! That would be great! Keep up the good work!\n\n4th December 2019:\nDue lack of content I'm degrading 1 star unfortunately.. sorry. Still loved the game! I'm in need of a horde mode, or multiplayer!\n\nHelpful | 32", "DashieiMay 3 at 8:52 PM\nWizards\n\nThis game is very fun because when you collect the cards from the chest you change the difficulty and you can challenge yourself\n\nHelpful | 2", "DenL-VRJan 7 at 6:46 AM\nExcellent game!\n\nLove this game, the spell casting by hand gestures feels really immersive. Going down the castle felt like I was playing a mage character in Diablo1 in VR! Now devs, give us the extended edition that PC and PSVR players got! We seek more knowledge and power!\n\nHelpful | 5", "Toaster_lordJun 4 at 5:16 PM\nGood game\n\nThe game is amazing but it can be a bit liniar on some levels.\n\nHelpful | 0", "xanderisbobMar 15 at 9:11 PM\n\nThis game is awesome but i finished it in 4 days can you add a pvp or co-op\n\nHelpful | 0", "Bobmuffin12345Feb 28 at 7:05 PM\nThis games fire\n\nLike Skyrim but in vr\n\nHelpful | 2", "kristofer4241Feb 21 at 3:32 AM\nNOT BAD\n\nI like this game but gets bored quickly\n\nHelpful | 0", "88KKDec 25 at 4:24 PM\ngood game\n\nits a good game! I like it gives you option to use locomotion and teleport at same time, this could reduce my motion sickness. The reason i only give 3 stars is because theres no horde mode and co-op, and only 6 spells. If devs will add these features in 2020, Ill update the rating to 5 stars.\n\nHelpful | 5", "jtk_10invrFeb 15 at 9:50 PM\nI love it but\n\nIf your Quest haves been exposed to a little bit of sunlight the darker areas will be very annoying but still a great game\n\nHelpful | 1", "HenryScreeeJan 12 at 10:52 AM\nBest game on quest\n\nI recently got my quest, and have been playing games like beat saber, and I was scrolling through the games on the store and found this game. This game is very fun and I like the concept alot. If you like fighting orcs and goblins with spells casted by hand signs, this is the game for you.\n\nHelpful | 1", "wrightgamersJan 3 at 9:36 PM\nYou're a wizard!\n\nGreat fun! Gesture based spells make combat very entertaining outside of the basic fireball. There is an element of strategy in deciding what spell can be used for your situation, and then being able to execute correctly while monsters are bearing down on you. Teleportation plus standard movement works well, and the Quest makes maneuvering easy as you'll often want to spin after teleportation in combat.\n\nDefinitely a good buy for an entertaining game!\n\nHelpful | 2", "Obediah12345Feb 7 at 4:31 AM\nVery good game\n\nI love this game but I can't get past the second dungeon because the monsters keep killing me in one hit.\n\nHelpful | 0", "DadzastaJan 12 at 1:08 PM\nWizards\n\nLove this game, my wife picked it out and its a wonderful adventure game. Made it through all levels but need to actually secure all of the challenges, such as fins all the pieces of the shar Stone and the cards!!! AAA game.\n\nHelpful | 0", "nickam992Feb 2 at 10:57 AM\nThis is the have I was looking for\n\nThis is the essential RPG for the Quest.\n\nHelpful | 2", "ThetrueReeFeb 14 at 6:45 AM\nThe wizards is great\n\nAt first it is boring but then it gets so much cooler\n\nHelpful | 1", "AF07Feb 11 at 2:51 PM\nPretty fun\n\nIts just fun\n\nHelpful | 1", "MillsAndThrillsJan 28 at 9:41 PM\nLots of fun\n\nGive it a try. Good mechanics and smooth gameplay.\n\nHelpful | 1", "ShalmezadNov 30 at 4:26 PM\nI'm a wizard Harry\n\nFireballs, frost bows, literal lightning from my finger tips. All the power of the arcane without the years studying magic.\nLoved the gesture system, even if I was frantically flailing my arms as a horde of goblins swarmed me.\n\nHelpful | 3", "KatcandothingsMar 24 at 10:08 PM\nBest experience so far\n\nUsually I wouldnt go out of my way to rate an app let alone rate one 5 stars. This experience I feel had some of the best functions of any Ive done, especially the way you cast. The enemies are interesting along with the level design and functions.\n\nHelpful | 0", "Spikeyboy2222Apr 8 at 8:00 PM\nAwesome game\n\nReally cool concept and I really like the author who kind of guided you through the game, the spells are awesome, but the spells are a little hard to activate sometimes.\n\nHelpful | 0", "MousemuncherJan 26 at 1:24 PM\nWhat vr was made for\n\nAwesome fun, very immersive, love it.\n\nHelpful | 1", "bbbrrromezDec 29 at 1:47 PM\nEnjoyable gestures control\n\nOverall an enjoyable game but wish the graphics were a little more magical.\n\nHelpful | 1", "NultharDec 9 at 12:20 AM\nGreat Game!\n\nThis is my favorite game on the Quest so far, the spells are satisfying and the action is intense. My only problems is that some heights are not selectable such as 5'9 and 6'3 also my hand don't reach the floor. But other than that it's a great game, 8/10 will mage again!\n\nHelpful | 0", "InkTherapy101Jan 29 at 6:39 PM\nAwesome\n\nGreat game\n\nHelpful | 1", "robot_builderOct 13 at 7:12 PM\nBest game on quest\n\nThis is the best action adventure game on the quest right now. It's the first game that actually feels like a game and not just an app. I love the voice actor. The action and the villains are great. And the powers you acquire make you feel like a real wizard. Once you master them the game gets even more fun! Game can be challenging at times the campaign length is 2-3 hours. Gives me feelings of playing Skyrim. Its definitely worth giving it a try if your into adventure games you wont be sorry. This is my first VR headset and I am not disappointed.\n\nHelpful | 24", "EpsilornSep 27, 2019 at 11:45 PM\nCould have better presentation\n\nDon't look at the video, it shows the PC version of the game. Graphically and more over sound wise this game Is really sub par. Gems seem like red pieces of plastic. Magic fx in a wizard game should be the most important thing. Here they are sub par in respect to other games on the same platform (ie wands). Walls have really low resolution textures with pixels big as your face. And sound is the worst part: low, not in sync and with cheap sound effects. The gameplay is really good and adventurous so I'm hoping for wizards 2 to solve what has been going wrong in this version...\n\nHelpful | 48", "Thegamer13Jan 25 at 6:06 PM\n\nI love VR and it is one of if not my favorite platform and The Wizards takes the cake on my favorite game so far.\n\nHelpful | 1", "kevin.w.looneyDec 7 at 6:40 PM\nThe wizard\n\nBy far my favorite game on my Quest at the moment, Ive dreamt about this kind of game for years, being able to cast multiple awesome spells with just gestures that can be upgraded too, its a blast .\n\nHelpful | 0", "nachoguapoNov 22 at 8:23 PM\n\nI have never gotten past the first 2 spells where it is basically teaching you what to do because it doesn't recognise the controller for the spells. Even though no other problems with any other games\n\nHelpful | 9", "ThatCodingKidNov 6 at 4:58 PM\nNot enough content\n\nI can only give this 4 stars because of the lack of spells. I expected at least 20, but there are only 6 spells, and not that many levels. The game is great aside from that and mediocre graphics.\n\nHelpful | 8", "xGravebornxDec 31 at 8:34 AM\n\nGame is great! I hope they expand and have more!\n\nHelpful | 1", "Lubed-n-ButteredDec 20 at 2:21 AM\nNeeds co-op\n\nI like the game but I feel like all its really missing is a group of friends, even if its only in some arena/hoard mode or whatever.\n\nHelpful | 3", "Darkwyvernz82Dec 31 at 8:03 PM\n\nGreat mechanics\n\nHelpful | 0", "BeeboTheGodOct 23 at 2:57 PM\nIts AMAZING\n\nI was waiting for my quest for 6 months and I have been watching videos of it for that long. Then it was one of the first games that I got and I loved it even more that I thought I would. I would highly recommend this game even though it is not a beginner game. ENJOY!!!\n\nHelpful | 9", "Blax1Nov 25 at 11:13 AM\nNeeds more Spells\n\nThe best thing about this game was the authentic feel of casting the magic, im not one to criticize but this game desrves more levels and MORE SPELLS\n\nHelpful | 3", "battlebot2025Dec 10 at 4:42 AM\nGreat Game!!\n\nI got this game on my birthday and it my favorite, great job developers\n\nHelpful | 1", "Hazey113Dec 25 at 1:19 AM\nBEST GAME EVER\n\nI love it so much cant wait for the dark times next year the best vr experience ive ever hade the hand gestures are on piont onlt thing is i hope the allow hand traking or theres no piont in using controles when hand gestures in real life are much easily\n\nHelpful | 0", "Killerfire1290Jan 21 at 2:44 PM\nGood game\n\nGreat game all they need to do is add more spells and update the graphics\n\nHelpful | 1", "sedati73Jul 14, 2019 at 6:50 PM\nPerfect VR concept\n\nFirst and foremost, this is something at its core that is best suited for VR over any other format. The spellcasting concept is great and well executed. The graphics are passable, but I found the sense of scale excellent and did feel fully immersed. The story is minimal, but the voice work is excellent. I especially loved how the sanctum works as a very creative menu- really wish more games would incorporate things like this. I enjoyed it enough to complete all levels and spells to max. I may continue further as the leaderboard proves a good enticement (maybe after new tracking updates.)\n\nI did have a few notes:\nSound, while sufficient, seems an easy fix to really make things more epic. Spells just never feel that powerful. Also, there's a weird delay- if you drop an object, the sound comes a second or so after impact. Most frustrating was footsteps (which can be lowered in options). What is supposed to be the sound of your footsteps always sounded a few paces back and slightly to the left of me. I never got used to it and often found myself spinning around looking for an attacker.\n\nColor- the pallate is very bland. I think some creative lighting and splashes of color would go a long way.\n\nAll or nothing attacks: The game is broken up into areas of exploration and battle arenas. I would have enjoyed some smaller attacks and more one-on-one encounters.\n\nAt current pricing I feel I got enough value, but if it was maybe $5 less it would be a full recommend. That said, I would absolutely purchase a sequel.\n\nHelpful | 29", "ChimiedelameSep 3, 2019 at 7:31 AM\nGreat !\n\nHello, I apologize in advance, I do not speak English very well.\n\n\"The wizard\" is a game that should not be tested once. The first part is confusing, we appreciate necessarily the game at first. The second time we go back into the game and we had time to get used to how to cast his spells and the general operation of the game it becomes impossible to get away. The multiple levels of difficulty (created by the choice of malus bonus cards) allow the game to increase its lifespan, as well as to solve the difficulty to your level of experience of video games.\n\nYoung witch, young wizard, develop the power that is in your hands and indulge yourself with this title!\n\nHelpful | 11", "EpicBeast552Oct 2 at 5:44 PM\nAmazing\n\nThe only thing that was relatively bad about this game was that the graphics werent as good as some of the other games that I have but I can give that up for the gameplay. Casting spells and getting to yeast put your own wizard adventure is just what I wanted.\n\nHelpful | 2", "diego.carballo.18041Oct 13 at 9:08 PM\nFantastc, Id definitely recommend it\n\nGreat game, would definitely like to see some more enemy variety,as well as some more spells as dlc which Id pay for (maybe something like summoned swords, and throwing daggers)\n\nHelpful | 1", "Captain_Insano_Nov 20 at 2:43 PM\nSir\n\nGood game but made us sick when moving with the controller.\n\nHelpful | 2", "wascomjr.Nov 1 at 6:15 PM\nAwesome\n\nUseing your hand motions to cast spells ingenious, where I go to get away and get good cardio.\n\nHelpful | 0", "ajmurrayukOct 17 at 3:40 PM\nWay too unstable\n\nKeeps crashing on 1st level of 2nd set. Shame as it makes it unplayable (on Oculus Quest). Will try once more and request a refund if they dont fix.\n\nHelpful | 4\nDeveloper ResponseDec 3 at 2:04 AM\n\nHi! Sorry for the delay. Could you contact us at support@carbonstudio.pl with the description of the issues you're describing? As many details as possible will be very helpful.", "Wraith2021Jun 6, 2019 at 2:00 PM\nJust What The Quest Needed\n\nI've played this game on both the Rift and PSVR, and I am really thankful that it made it to the Quest. The freedom of 360 degree movement along with gesture base spell casting and instant teleportation (not as a travel method, but as am means to evade attack), make you feel powerful, learning new spells and fighting monsters is all in a days work for The Wizards.\n\nIf you are into fantasy, and love mages, this is the game for you.\n\nHelpful | 214", "OliverJayNov 7 at 6:42 PM\nThe Wizards\n\nFriggin awesome game!\n\nHelpful | 0", "vrabbitsNov 1 at 9:03 AM\nReally good.\n\nAmazing game but super short. Also not very hard.\n\nHelpful | 1", "SoapySonOct 5 at 3:22 PM\nLoved it\n\nImmersive, engaging, adrenaline rush, awe inspiring at times, great variety in levels, great bosses, great attacks, good audio. Can't wait for a follow up\n\nHelpful | 3", "xxthebestxxOct 28 at 3:16 PM\nAmazing game\n\nSo much fun I could not stop playing I Highly recommend it\n\nHelpful | 0", "Volker3Oct 18 at 11:20 AM\nGanz gut\n\n4 sterne\n\nHelpful | 1", "mau_91Aug 6, 2019 at 6:11 PM\nAwesome game !\n\nOk first of all the game is pretty cool , if you are like me who loves spell casters this game is for you , the devs did a really good job on this one . Now , I give it 4 stars only for the fact that sometimes the tracking is a bit buggy . @devs , I dont know if you plan to keep working on the game , but man if you guys come up with some updates regarding more spells and quests that would be great , this game has a ton of potential ! *heres hoping for some dark spells*\n\nHelpful | 8", "ArcetosOct 7 at 1:34 AM\nAwedome\n\nFrom all the games, this is in my top 3. The spellcasting works perfectly and you truly feel like a mage. I totally recommend it\n\nHelpful | 3", "MobolandJun 6, 2019 at 4:58 PM\nWizardly Fun\n\nThis game is great. The gestures feel just right. The locomotion feels good and I'm glad there's options for sliding and teleporting.\n\nMore about the gestures - They make it very immersive. I felt like a real wizard every time I summoned spells. The fireball started off feeling weird but soon I was chunking them like an NBA player in the 3 point contest. Walking into a new area and summoning the shield makes me feel invincible. No spoilers about the other spells, but they feel even better.\n\nGreat game so far. Definitely worth the $$.\n\nHelpful | 133", "WentlleOct 20 at 12:51 AM\nAWESOME\n\nGreat game beat it three times please add pvp or multiplayer horde mode please\n\nHelpful | 1", "anthonshOct 16 at 10:37 AM\nBeautiful and immersive\n\nI'm not big into \"magic\", but I love this game because it is very well done.\n\nHelpful | 2", "BuddyweiserSep 23, 2019 at 9:15 PM\n\nI love this game! It's much better on the Quest but the graphics aren't as high as say the PSVR. Still.. I love it!! I just wish there was more is all.\n\nHelpful | 3", "aaron.sommers.1253Jul 9, 2019 at 9:21 AM\nThe Wizards\n\nThe wizards is one of my favorites. I do already own this title on my Psvr, but found it hard to play do to the limited tracking. This game played on Quest is awesome, hand gesture spell system rocks. The Wizards is a must own, have fun. One last thing have not found Arena mode, Hope it's coming. Please add the multilayer part of the game.\n\nHelpful | 10", "UntoldSlaughtaSep 3, 2019 at 1:31 AM\nOutstanding can't wait for dlc\n\nReally good game this is exactly the type if game I was looking for in the quest love the spell casting system really love the locomotion options no motion sickness a perfect RPG for VR I'm really looking forward to the expansion game has alot if potential for more!\n\nHelpful | 0", "xenoking25Oct 10 at 4:10 PM\nLove it\n\nVery hands on great tutorial and gameplay alike strongly recommended\n\nHelpful | 1", "JessXeSep 18, 2019 at 10:41 PM\nLove it\n\nCasting spells with hand gestures is so much fun!\n\nHelpful | 1", "ShemhamAug 1, 2019 at 10:05 AM\nReally wanted to like this\n\nThe whole game has an unfinished feel to it. I really appreciate the devs bringing this to the quest but it needs more options. I can't be the only one who has to cast spells multiple times for them to actually cast! Yet there's no option to change the settings. I pull trigger and twist my wrist at least 2/3 times before I can get a fireball. This is a game breaker for me sorry. Otherwise this could have been a really good game!\n\nHelpful | 4", "PolemarxosAug 6, 2019 at 2:15 PM\nCasting spells is awesome!\n\nI like the casting spell and combat system.\nI completed 100% of this game in around 12hours...\nNeed more staff to do for sure.\nI would love to see a horde coop survival mode!!!\n\nHelpful | 5", "Manny.N.AmesJun 13, 2019 at 3:58 PM\nGreat Fun; Could Use Some Tuning\n\nI really, REALLY want to give this one five stars but a few things prevent it:\n\n1. I don't see any other mode but the campaign.\n2. The UI is really bad at staying in view of the player, particularly the subtitles.\n3. The tracking is a bit senile; my fireballs should not go left when I throw it forward. Also, in combat the game gets the Bow and Missile gestures confused.\n4. Some of the Fate Cards have effects that are unlisted, most egregious being the only one hourglass card which turns every hit into a one-hit kill but doesn't tell you that. I actually thought my game was busted because I kept dying in a spot that only dealt minor damage the first time.\n\nOverall, I do not regret buying this game. It was a great way to expand my library and it doesn't get mad when I move around. I just can't justify five stars with the above problems but the game itself still works remarkably well, just needs some spit and polish.\n\nHelpful | 17", "Crazy_SaneJul 15, 2019 at 2:02 PM\nYou're a wizard, Harry\n\nA decent adventure game, but great spell casting mechanics. I wouldn't call this a full fledged RPG, but there's exploring and puzzle solving to be had. The casting of spells is very well done and will have you feeling like a powerful wizard. I don't think it quite deserves 5 stars, but it definitely deserves more than 4.\n\nHelpful | 9", "lee.nicholsonJul 23, 2019 at 10:27 PM\nI like the challenges.\n\nA Great puzzle experience. An Okay VR experience. The levels are fun. The controls are clunky; does not follow the directions taught to us in 'First Steps'. Fails to take advantage of what the Quest can do.\n\nHelpful | 4", "ZekresAug 24, 2019 at 8:00 PM\nGreat game for fantasy lovers\n\nUpgradable spells, good motion controls, and unique spellcasting. Would recommend for anyone considering buying it. Beautiful game in my opinion\n\nHelpful | 2", "Greekspartan121Jun 9, 2019 at 1:33 AM\nNot happy with this purchase\n\nWould say this is my worst game in my collection, regret buying this,sounded great fun but not.\nThe tracking seems to be off,hand disappears from time to time, teleporting not great, actually is pretty annoying to be honest.\nWould like a refund to buy something else.\nGraphics could have been better on giants,like a big walking blob walking towards you.\nOh well,not one for the library unfortunately in my opinion and I love this type of game but not this one.\nTracking and poor quality let this down for me.\n\nHelpful | 31", "DeaDEyE0510Jul 7, 2019 at 10:37 AM\nWas hesitant to buy... BUT!\n\nI was super hesitant to buy this one because of all the people saying that the hand gestures required to make spells did not work well. This would be a game breaking issue if that were the case. I am now almost all the way through the game and have had zero issues with casting spells. Its actually very easy and fun to do. The graphics are nice, the game is clever, and I am very satisfied with it overall. If you are worried about the game not working well, like I was, dont worry about it, the game works awesome.\n\nHelpful | 10", "NecroNecroJul 19, 2019 at 1:07 PM\nMust have if you like fantasy\n\nIf you get vertigo easily it might not be the best game for you, but if its no problem, its an amazing game that makes you feel you are inside a cartoon. Its easy to learn and each spell feels different, the graffics are good for Quest and destroing parts of the stage is really fun.\n\nHelpful | 4", "CormactheKidJun 26, 2019 at 2:05 PM\nA bit dull\n\nFirst off, the hand gestures to create your spells is amazing. Its an awesome idea and it works very well. It really feels like you are creating a bow with magic, or a fireball, whatever else you might want. But its as if thats the onlt thing going for it. Doesnt look very good. The enemies are dumb and easy, especially since you can continue to teleport away from them, and the environment is unimaginative. Once you get over how fun it is to have the hand gestured spells, this game is dull. Definitely wish i had not spent as much money as i did on it\n\nHelpful | 7", "alexg72Aug 5, 2019 at 1:56 PM\na dream come true\n\nThere is only one thing to say: this game is a dream come true for any guy grown with bread and dungeons and dragons :) Waving your hands to cast powerful spells is so fun!\n\nHelpful | 2", "PherosisJun 10, 2019 at 10:29 AM\nNeeds Some Improvement\n\nI absolutely love this game! Normally play it on Steam. Am very, very happy they have made it accessible on the Quest. :)\n\nAt the same time, they did not include Arena Mode on the Quest version, which was my favourite way to play.\n\nBugs:\n\n- When you set gaze based aim to 0, instead of it shutting off. It gets buggy sending spells in random directions/velocities.\n\nHelpful | 25", "gogo123456Jun 23, 2019 at 6:31 PM\nControl s suck a bit\n\nThis is definitely a fun game to play and I am enjoying it but sometimes to create your weapons the controls can be finicky trying to make lightning and following it exactly the way that I was Shown doesnt always work and I end up getting beaten or killed every single time because of it I stood there for 10 minutes in my environment trying to make sure I was doing it correctly... as soon as I get in a confrontation its finicky it doesnt work appropriately Pain IN THA ACE!!\n\nHelpful | 12\nDeveloper ResponseJul 4, 2019 at 8:14 AM\n\nHello, did you try casting the lightning spell when holding your hands close to your chest? The gesture works every time when the player pushes both hands forward while holding both triggers at the same time. Don't hesitate to reach us at support@carbonstudio.pl should you encounter any difficulties with casting spells.", "darwins.lastJun 6, 2019 at 2:36 PM\nLooks Fantastic & Plays Great\n\nIf you're a dungeon, magic, dragon, Lord of the Rings, Harry Potter type fan, this is your game! Graphics are great, gameplay is really fun, atmosphere is doom-y and well done. And, the narrator cracks me up... Watching the lightning spells sizzle and illuminate rock wall textures is great. :)\n\nHelpful | 20", "JohannasonJun 10, 2019 at 2:57 PM\nMagic arena shooter\n\nBug: completed Master Challenge to fully upgrade the Fireball spell, then died. The challenge is now incomplete, and cannot be completed.\nOn its face, the game is a simple rehash of an old formula: go here, deal with this flood of enemies, move on to the next too-small room. Maybe you'll find some secret items along the way.\nBut the spell gestures really make it something else. You don't select your spell like it's some weapon from a menu, you have access to all six spells by their gestures. These gestures impose \"cooldowns\" by the amount of time they take to execute.\nWhere this game suffers, is with the specialist enemies. The mages make it difficult to cast anything other than Fireball, while they're bombarding you. And the Aether phantoms are total BS. Can't dodge them, and the only effective spell also prevents you from using any other magic.\n\nHelpful | 9", "FrancKaosJun 6, 2019 at 11:12 AM\nPerfect\n\nOK, not perfect but they support cross pay (buy on one device then play on t'other), so I'm giving it top marks, that's consumer friendly!\n\nHelpful | 35", "samsonite312Jun 6, 2019 at 10:24 PM\nFun so far, graphics are a little meh\n\nThe trailer must be for the Rift version, because the Quest version doesn't look nearly that good. Still, the game is a lot of fun so far!\n\nHelpful | 23", "j.c.d.williamsAug 13, 2019 at 12:15 PM\nIts good...but\n\nIts good but I brought a psvr and on that one there are levels that are not on the quest version\n\nHelpful | 8", "DrExplosivesJun 21, 2019 at 1:54 PM\nGood Overall\n\nThe game is great but the tracking for the gestures could use some fine-tuning. It kind of ruins the combat when you have to try to cast the same spell 10 times before it works. So far it seems to mainly be with the fireball and shield spells. The game is great other than that though.\n\nHelpful | 0", "FinnyWiggenJun 13, 2019 at 2:19 PM\nDisappointed\n\nNot a bad game. Just not a great game. Graphics are poor quality, the game glitches, and overall it just feels low quality. In fairness, I am comparing it to the high quality games like Journey of The Gods, Moss, etc which have set a high bar and have such crisp graphics.\n\nNevertheless this feels like a mid-range game. Certainly not a top tier game.\n\nHelpful | 5", "SquidFurBrainsAug 29, 2019 at 5:45 PM\nPretty good\n\nPretty good\n\nHelpful | 1", "JaximusDecimusJun 6, 2019 at 12:02 PM\nA pleasant surprise.\n\nWent into this not exactly knowing what to expect. I'm only an hour in, but what I've seen of the game so far has been fun, charming and well polished. Defintely worth a look.\n\nHelpful | 26", "X_Parzival_XAug 29, 2019 at 3:21 AM\n\nGood Game\n\nHelpful | 0", "mloft3Jun 6, 2019 at 1:14 PM\nSolid game\n\nWant to feel like Dr Strange? Here's your chance! Solid concept and well executed. Enough spell variety once they're upgraded to add slow / stun effects. Good voice acting and sound in general. Very polished.\n\nHelpful | 22", "geoffrey.milner.12Jun 14, 2019 at 1:49 AM\nNo areana mode\n\nGiving 4 stars it's a great game but no areana mode I only bought the game for areana mode cause I had trouble playing on psvr with move controller thought it would be great with better control's if the areana mode comes later it's a 5+\n\nHelpful | 4", "LAMBDA_DESTROYERJun 24, 2019 at 3:49 PM\nA bit janky\n\nThe overall theme, atmosphere and voice acting were excellent. However, the plot, and most importantly, the controls were a bit of a chore to figure out. Additionally, the animations were often clunky, the monsters repetitive and unimaginative, and the spells were quite limited in terms of how many there were (only six; far less than any self respecting wizard would know). The real show stopper for me, however, were the controls. When casting spells I often felt that the gesture detection was off and certain spells required far more effort to chuck at am enemy than any real life ball would have. The auto aim system was unhelpful in remedying this, as I would hurl a fireball with a full swing only to have it drop to the ground one foot in front of me; very unsatisfactory. While I could see someone being entertained with this game for nine or ten hours, I have no desire to replay any missions, so I won't be logging any more than the three or four hours that it took me to beat the main story. Hence the game is too short for my taste as well.\n\nAbout me: I am quickly becoming a VR vetran with over 60 hours of play logged on my Quest since purchase. I have always loved Wizards, and I want to be one when I get old. Based on my level of experience and my baises, I would not recommend this game to a friend.\n\nHelpful | 7", "AlienTBJun 18, 2019 at 10:16 AM\nWho Doesn't Want to Be a Wizard....\n\nI love this game. I was so pumped when I found out this was coming to the Quest. The Rift version is great but I really wanted to see what this game was like without the cable. This is a really good port. The graphics are still great. I use both the teleport and free movement and both work excellent. The combat is still very smooth. Orcs are still giant and ugly and super fun to drop with some magic fire balls. Most of the complaints you will see on this game is that it's simply not long enough or needs more spells. But that's more of a testament to how fun the game is that we want more so we can keep playing and getting new things. Highly recommend adding this title to your collection. Plus it's cross buy so enjoy it on both Quest and Rift.\n\nHelpful | 1", "DiadrasJun 12, 2019 at 7:06 AM\nGame is loads of fun\n\nThis game is REALLY fun, it is in my top 3 games of all VR and completely worth the price. I really hope the game will be updated later with more spells and levels.\nIn the trailer it shows that he juggles a fireball, this is sadly not possible in the game itself because the fireball becomes a fast projectile upon release. This may be just an oculus quest tracking thing though... (or something I haven't figured out yet, edit: you can pick the fireball up from hand to hand)\n\nHelpful | 4", "vin_the_tacoJul 6, 2019 at 11:44 PM\nThe most immersive VR experience ever\n\nThis game is amazing. I feel like dr strange mixed with the arrow. This is the first VR game that actually made me forget completely about the real world.\n\nHelpful | 6", "DarynXJun 22, 2019 at 4:55 PM\nTrailer must be from PC version\n\nAwful graphics, textures are very Low Detail. If the Trailer would show the quest Version i would Not Have bought lt!\n\nHelpful | 13", "CabronusMaximusJun 9, 2019 at 1:19 PM\nGreat Fun, VR\n\nAs a VR newbie, this game hits the \"why VR?\" nail right on the head. The visuals are captivating and the gesture-based combat is excellent as you teleport about as a Sorceror taking on hordes (or a few) Gobbos. A very well put together game overall. I'd like to see more classic spells (Sleep, Magic Missile, Familiar, etc), and maybe a party mode. Only real negative is I am still getting used to the auto aim, which seems a bit \"hit and miss\" at times especially if you gesture and cast too fast. However, I'd put this a joint top game alongside Space Pirate Trainer.\n\nHelpful | 5", "sunandsnow24Jun 6, 2019 at 6:53 PM\nGreat port to the Quest\n\nI have this on PSVR and I think it looks better in the Quest. No more \"Out of play area\" issues when leaving over the map table. The graphics are amazing. Excellent job, I'm really enjoying the game.\n\nHelpful | 16", "Rocky2234Jun 7, 2019 at 3:37 PM\nTruly stunning\n\nEver since getting my quest Ive been very very impressed with it and the games Ive played so far but this game has really blew me away. I never thought the quest could run a game like this due to its obvious hardware limitations but Im clearly underestimating it , this game is visually stunning and runs very smooth with responsive easy to master controls, everything is close to perfection I would highly recommend it to everyone its worth the money and I look forward to playing through the rest of it.\n\nHelpful | 7", "richards.113Jun 7, 2019 at 5:19 AM\nIntuitive and Immersive\n\nHand gestures to cast spells, teleportation as magical movement, incredibly detailed models and visual land/skyscapes.\nThe game is fun and makes you feel like a bit of a superhero/sorcerer.\nJust play in a good space to make it easier to throw fireballs w/o having your mesh pop up.\n\nHelpful | 6", "agitokazuJun 6, 2019 at 11:08 AM\nAn awesome Port\n\nPlays like it's Pcvr counterpart, and looks amazing on the quest\n\nHelpful | 23", "SamL1ghteningJul 28, 2019 at 7:49 AM\nAmazing\n\nExactly what quest needs\n\nHelpful | 1", "TOXICMUSHROOM666Jul 19, 2019 at 11:34 AM\nAMAZING!!!!!!!\n\nOh my goodness casting spells feels so awesome!!!\n\nHelpful | 2", "lelel86Jun 7, 2019 at 2:14 PM\nGreat game!\n\nIts really fun and makes you feel like Doctor Strange or some kind of wizard. Hand gestures are great and the world is beautifully crafted. The narrator is also very entertaining. Amazing work from the developers.\n\nHelpful | 4", "Locust023Jul 5, 2019 at 5:24 AM\nGood game but...\n\nThe game was fun,intuitive, and creative with hand movements but the movement wasnt smooth and made me feel dizzy unlike any other VR game Ive played\n\nHelpful | 2", "smartass1379Jun 27, 2019 at 1:03 PM\nInsanely fun\n\nThis is such a great title. Gives you the ability to make it harder or easier and its a pretty long game.\n\nHelpful | 3", "That_one_guy_Jul 5, 2019 at 10:43 AM\nUnable to open\n\nI spent 26 USD on a game that I cant even open on my quest I started at the loading dots on a black screen for 20 minutes and no bueno I still havent opened the game and I also dont know how to get a refund\n\nHelpful | 4", "Sully327Jun 14, 2019 at 12:39 PM\n\nThis game is amazing, the controlls are really easy to learn and the graphics are amazing. I really hope for some sort of expansion because I want to see more of this game\n\nHelpful | 2", "mythicalcityJun 13, 2019 at 10:31 PM\nAwesome\n\nFinally a great magic and spell casting VR game! Great voice over and the gestures work really well. Love it and cant wait for more content.\n\nHelpful | 1", "mosquito_manJul 1, 2019 at 8:20 AM\nVery good.\n\nI think John Wick likes Cheetos too.\n\nHelpful | 2", "wesker23Jun 8, 2019 at 2:25 PM\nBrilliant\n\nI love this just what ppl need if they like merlin and the like cast spells fight orca etc I say dont think just jump right in\n\nHelpful | 2", "WansyJun 20, 2019 at 6:22 PM\nOne of the best!\n\nAwesome!! I have played them all. Top 2 for sure\n\nHelpful | 1", "saberbatorJun 8, 2019 at 10:12 PM\nAn amazing experience\n\nHave you ever wanted to be a magician? Feel the power? This experience has it.\n\nHelpful | 3", "zac.shafferJun 24, 2019 at 6:12 PM\nIt Stopped Working\n\nFun game until the latest update when it just stopped working. Its in perpetual load mode. Very frustrating\n\nHelpful | 3\nDeveloper ResponseJul 4, 2019 at 8:22 AM\n\nHello, I assume you have tried reinstalling the game? Please reach out to us at contact@carbonstudio.pl and provide us with the details such as the version of the headset (64gb vs 128gb), when was the last time the game worked, whether the headset is connected to the internet or are you using any software to record the footage from the headset.", "chessbearJun 20, 2019 at 8:49 PM\nEh?\n\nI didn't feel any heart in the game,\n\nHelpful | 2", "DeVaIereJun 10, 2019 at 5:59 PM\nWon't Launch\n\nIt just shows me a black screen with the 3 loading dots.\n\nHelpful | 4\nDeveloper ResponseJun 11, 2019 at 5:31 AM\n\nHello, could you tell us any details about the game not launching itself? How many times did you try launching the game? Did you try downloading the game again? Did you leave the game on for a few seconds and it didn't go past the loading screen? How long were you waiting for the game to start? Please reach out to us at contact@carbonstudio.pl and we'll try to assist you with this issue."]