{"App Title": "The Exorcist: Legion VR", "App description": "What an excellent day for an exorcism!\n\nDescribed as one of the most disturbing experiences available for virtual reality, The Exorcist: Legion delivers FIVE unique stories and features a variety of demonic entities, exorcism tools, hidden artifacts and atmospheric locations. Delve deep into the heart of the supernatural as you learn the trade of demonic exorcism and uncover secrets leading you towards a final confrontation with your darkest, most hidden fears. Are you brave enough?\n\nThe Exorcist: Legion is part action, part mystery, part puzzle-solving... and ALL terror.\n\nCross-buy enabled!", "Purchase section": "$24.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Horror, Narrative", "Languages": "English, English (US), English (Australia), English (Canada), English (South Africa), English (UK), Spanish (Argentina), Spanish (Chile), Spanish (Colombia), Spanish (Mexico), Spanish (Peru), Spanish (Puerto Rico), Spanish (Spain), Spanish (Venezuela)", "Version": "1.0.9", "Developer": "Wolf & Wood, Ltd.", "Publisher": "Fun Train, Inc.", "Website": "http://www.exorcistlegion.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "OCULUS QUEST AVAILABLE! (CLICK HERE)!\n\nBUY EPISODES\n \nNEWS\n \nCONTACT US\n \nPRESS\nWEB SITE TERMS AND CONDITIONS OF USE\n\n1. Terms\n\nBy accessing this web site, you are agreeing to be bound by these web site Terms and Conditions of Use, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site. The materials contained in this web site are protected by applicable copyright and trademark law.\n\n2. Use License\n\nPermission is granted to temporarily download one copy of the materials (information or software) on LegionVR's web site for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\n\nmodify or copy the materials;\n\nuse the materials for any commercial purpose, or for any public display (commercial or non-commercial);\n\nattempt to decompile or reverse engineer any software contained on LegionVR's website;\n\nremove any copyright or other proprietary notations from the materials; or\n\ntransfer the materials to another person or mirror the materials on any other server.\n\nThis license shall automatically terminate if you violate any of these restrictions and may be terminated by LegionVR at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format.\n\n3. Disclaimer\n\nThe materials on LegionVR's web site are provided as is. LegionVR makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, LegionVR does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its Internet web site or otherwise relating to such materials or on any sites linked to this site.\n\n4. Limitations\n\nIn no event shall LegionVR or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption,) arising out of the use or inability to use the materials on LegionVR's Internet site, even if LegionVR or a LegionVR authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n5. Revisions and Errata\n\nThe materials appearing on LegionVR's web site could include technical, typographical, or photographic errors. LegionVR does not warrant that any of the materials on its web site are accurate, complete, or current. LegionVR may make changes to the materials contained on its web site at any time without notice. LegionVR does not, however, make any commitment to update the materials.\n\n6. Links\n\nLegionVR has not reviewed all of the sites linked to its Internet web site and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by LegionVR of the site. Use of any such linked web site is at the users own risk.\n\n7. Site Terms of Use Modifications\n\nLegionVR may revise these terms of use for its web site at any time without notice. By using this web site you are agreeing to be bound by the then current version of these Terms and Conditions of Use.\n\n8. Governing Law\n\nAny claim relating to LegionVR's web site shall be governed by the laws of the State of California without regard to its conflict of law provisions. General Terms and Conditions applicable to Use of a Web Site.\n\n\n\nPRIVACY POLICY\n\nYour privacy is very important to us. Accordingly, we have developed this Policy in order for you to understand how we collect, use, communicate and disclose and make use of personal information. The following outlines our privacy policy.\n\n\n\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\n\nWe will collect and use of personal information solely with the objective of fulfilling those purposes specified by us and for other compatible purposes, unless we obtain the consent of the individual concerned or as required by law.\n\nWe will only retain personal information as long as necessary for the fulfillment of those purposes.\n\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\n\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\n\nWe will protect personal information by reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\n\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained.\n\nThe Exorcist III and all related characters and elements are trademarks of and  Morgan Creek Film Partners I,and LegionVR, LLC, a Fun Traincompany. Trademarks belong to their respective owners. All Rights Reserved.\n\nThis is a work of fiction which is protected under the copyright laws of the United States and other countries throughout the world. Country of first publication: United States of America. The story, all names, characters, places and incidents portrayed in this production are fictitious. No identification with actual persons (living or deceased), places, buildings, and products is intended or should be inferred.\n\nEULA &Privacy Policy", "Developer Terms of Service": "OCULUS QUEST AVAILABLE! (CLICK HERE)!\n\nBUY EPISODES\n \nNEWS\n \nCONTACT US\n \nPRESS\nWEB SITE TERMS AND CONDITIONS OF USE\n\n1. Terms\n\nBy accessing this web site, you are agreeing to be bound by these web site Terms and Conditions of Use, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site. The materials contained in this web site are protected by applicable copyright and trademark law.\n\n2. Use License\n\nPermission is granted to temporarily download one copy of the materials (information or software) on LegionVR's web site for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\n\nmodify or copy the materials;\n\nuse the materials for any commercial purpose, or for any public display (commercial or non-commercial);\n\nattempt to decompile or reverse engineer any software contained on LegionVR's website;\n\nremove any copyright or other proprietary notations from the materials; or\n\ntransfer the materials to another person or mirror the materials on any other server.\n\nThis license shall automatically terminate if you violate any of these restrictions and may be terminated by LegionVR at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format.\n\n3. Disclaimer\n\nThe materials on LegionVR's web site are provided as is. LegionVR makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, LegionVR does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its Internet web site or otherwise relating to such materials or on any sites linked to this site.\n\n4. Limitations\n\nIn no event shall LegionVR or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption,) arising out of the use or inability to use the materials on LegionVR's Internet site, even if LegionVR or a LegionVR authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n5. Revisions and Errata\n\nThe materials appearing on LegionVR's web site could include technical, typographical, or photographic errors. LegionVR does not warrant that any of the materials on its web site are accurate, complete, or current. LegionVR may make changes to the materials contained on its web site at any time without notice. LegionVR does not, however, make any commitment to update the materials.\n\n6. Links\n\nLegionVR has not reviewed all of the sites linked to its Internet web site and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by LegionVR of the site. Use of any such linked web site is at the users own risk.\n\n7. Site Terms of Use Modifications\n\nLegionVR may revise these terms of use for its web site at any time without notice. By using this web site you are agreeing to be bound by the then current version of these Terms and Conditions of Use.\n\n8. Governing Law\n\nAny claim relating to LegionVR's web site shall be governed by the laws of the State of California without regard to its conflict of law provisions. General Terms and Conditions applicable to Use of a Web Site.\n\n\n\nPRIVACY POLICY\n\nYour privacy is very important to us. Accordingly, we have developed this Policy in order for you to understand how we collect, use, communicate and disclose and make use of personal information. The following outlines our privacy policy.\n\n\n\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\n\nWe will collect and use of personal information solely with the objective of fulfilling those purposes specified by us and for other compatible purposes, unless we obtain the consent of the individual concerned or as required by law.\n\nWe will only retain personal information as long as necessary for the fulfillment of those purposes.\n\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\n\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\n\nWe will protect personal information by reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\n\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained.\n\nThe Exorcist III and all related characters and elements are trademarks of and  Morgan Creek Film Partners I,and LegionVR, LLC, a Fun Traincompany. Trademarks belong to their respective owners. All Rights Reserved.\n\nThis is a work of fiction which is protected under the copyright laws of the United States and other countries throughout the world. Country of first publication: United States of America. The story, all names, characters, places and incidents portrayed in this production are fictitious. No identification with actual persons (living or deceased), places, buildings, and products is intended or should be inferred.\n\nEULA &Privacy Policy", "Space Required": "1.60 GB"}



["5 stars\n59%\n4 stars\n21%\n3 stars\n6%\n2 stars\n6%\n1 star\n7%", "kylekol94Jul 30 at 4:01 PM\nFair\n\nWas not really scary as more as ominous. It was creepy and each case was unique but it did not make me shiver. The graphics were very good I have to say. There were some glitches like in the church when you head back into the main room the statue got me stuck behind it and it took me a while to get past it with teleport but I got out.\n\nHelpful | 10", "12JedivsMandalorian24 days ago\nCreative but not that scary.\n\nI think its an excellent game very creative. I dont know why people are having so many glitches. Ive only had minor glitches and I completed the game. I love the game very creative works very well. You feel like your in a horror film. I grew up on horror films so maybe thats why I dont find it that scary. To me Dreadhalls was really scary probably because you have no weapons. I still like this better because its very entertaining but too short needs longer or more chapters.\n\nHelpful | 3", "M1dNightCROW4 days ago\n\nMe and my three other brother who are all over the age of 18 played for ten minutes each and we cant open the game anymore and we are about to uninstall due to us not having the guts to play again we couldnt even get through the first chapter....5 stars\n\nHelpful | 3", "nishruu2Jul 3 at 1:13 AM\nspooky\n\ni really liked the first 2 chapters and still do; however; the hints for what to do are not intuitive, and i looked at the clipboard for chapter one and realized i did not do 100%. so. i revisited. chapter one and ....you start over.\nfinished 100% chapter one and now the 1st exorcism was not longer done and reentry,,,,; nope had to restart game , replay ch 1 and ch2 .....stop for now.......\nwave your empty hand over the line on the message board to start the chapter\n\nHelpful | 9", "whitedemon24Apr 20 at 7:09 AM\n\nNeeds more levels for sure but other than that it definitely gives you chills in some parts and there were times a certain thing was supposed to happen like on the second level with the inmate when you approach her in her room youre supposed to hold your cross up and she disappears from there and create a hellish maze for you but the first time I played it glitched and this ol girl and I just kind of stood there for 15 minutes having a staring contest like we were both waiting for the other to make a move and I made all of mine though like I sprayed on her face with the salt I bashed her head with the cross, I blinded her by the light, and I even listened to her problems and gave her a nice cooling bath with the water of Jesus Christ sooo there was that quite the awkward time but other than that its a pretty great game\n\nHelpful | 84\nDeveloper ResponseApr 21 at 9:08 AM\n\nSorry about that situation with Lucy. We can see how that would be awkward. Believe it or not, you never leave her padded cell. Ronove is a master of mind manipulation and you are drawn into his mental labyrinth.", "Blaviken2 days ago\nBUG BUG GLITCH\n\nI would freaking love to give this an awesome review. it would definitely get at least four stars... It's an amazing game with a fantastic concept.\n\nbut shame on the developers because this has so many glitches and bugs I want to throw my freaking headset.\nI played over 10 games so far and this is the first game I've had this many problems with.\n\nIt's too much to explain but basically, if you walk into something you're stuck,but besides that anytime I get to a major part the whole freaking thing glitches and I have to reset it!\n\nSO disappointed, do not get this game until they fix it.\n\nHelpful | 0", "chris.marello.5Apr 30 at 3:27 PM\nTerribly scary for certain people!\n\nIf you're not cool with paranormal stuff and you want 5 really good spooky chapters this is for you!! 2 friends and I had to continually rotate the headset some times 3 times on the same chapter because it got all of us spooked . Worth the money if you want horror.\n\nPros: somewhat full story\nVery scary sequences( for most)\nGreat audio really sets the mood\nGraphics( more on that below)\n\nCons: a little buggy had to restart 2 chapters because we got stuck and the story wouldn't continue.\nGraphics are good but they mixed textures with different quality levels so you could have a hi-res texture next to a low-res texture and it was at least distracting sometimes for me.\n\nHelpful | 29", "Bravo-November7May 20 at 10:49 AM\nWhat a WonDerfuLL GaMe . . . & LiFe!\n\nI'm a new Quester and being a longtime \"EXORCIST\" film fan, I was going to wait until October to purchase this game series. But then, a few days ago, it was availablefeatured as the Daily Deal on sale in the Oculus store and I had to purchase it.\n\nAs soon as I entered the game, I truly felt like I was Lt. Kinderman (a mix of both Lee J. Cobb & George C. Scott). Before I began my journey, I was hoping to witness something \"Blatty Style\" in the form of a spider walk, headspin, or a ceiling crawl. And with the latter, I did, a few chapters in. And it was oh-so satisfying to see and experience.\n\nIs it scary? I'm sure it is for many, but since I'm a longtime horror fan, the jumps and scares were awesome, but for me, personally, they were more of thrills and chills as it takes a lot to scare me, much like the 1974 film did when I was a child when seeing it for the first time (R-rated.) But, there was one moment that caught me off guarda very scary surprise that did make me jump and gasp out loud in which I lost my breath. And that was in Chapter 5 when revisiting Father Bell's office once again. The quick charge. The knockdown. That was great. And the entire quick segment of Bell's office having the classic 'Exorcist' chamber-of-horrors elements had me wanting more.\n\nI also loved how the game paid homage to the first and third films, especially with Pazuzu, the mention of Father Morning, and the Gemini Killer! I encourage the developers to continue this series further, maybe in the form of other leading characters and locales. And from the films, there are so many side stories and locales that could be pivotal storytellers for that continuing series. Perhaps a prequel or even again, a modern-day sequel taking us back to Georgetown to the infamous \"M\" Street steps and the former rented, McNeil home.\n\nBut there are \"a few boos from the gallery,\" as I could only give this 4 out of five stars due to some bugs and glitches along the way. Overall, great game!\n\nHelpful | 9", "GHOSTLY_VR7 days ago\nScary but fun\n\nMy family tried this game and lets just say we screamed from fear like crazy but it was fun I highly suggest you trying this game if you like horror games 5 star\n\nHelpful | 0", "virtualmandalaJul 9 at 10:55 PM\nLoved it!\n\nNew VR user. I bought a ton of different games to try and this was the second game I played all the way through (first was The Room). Some scary parts for sure. I hurt my throat gasping so hard early on in chapter 5 (whoever developed that scare, I hate you).\n\nHelpful | 2", "NastiGoreJun 27 at 11:40 PM\nFun Game but glitches out.\n\nI do really like this game as Im a fan of Horror and this one really gets ya going in terms of fear and anxiety. But Im having issues with Chapter 4. Once I come face to face with the demon I cant do anything. At first I thought maybe I was doing something wrong so I watch a play through and saw I was doing the correct thing. I stood there dodging things for about 5 mins hoping something would happen but no matter how long I pointed the cross at the demon nothing happened at all. I even replayed the level thinking it was just a glitch in the first run but still did it the second run also. Help would be appreciated Devs.\n\nHelpful | 2", "masoooo24 days ago\nReally recoup d if you consider yourself\n\nWas rlly creepy and all these glitches ppl have talked by have been fixed and was scary graphics so I would definitely recommend it\n\nHelpful | 0", "lethal-ham18 days ago\nTime to get holy with it\n\nI literally just had my cross out at all time and that about all I can say but the games great\n\nHelpful | 1", "turnerd123Apr 25 at 4:45 AM\n\nIm having a problem with chapter 4. It keeps breaking and Im being placed outside of the depo chanm storage room. Ive already tried re-installing the game but it doesnt fix it. Other than that it is an amazing game and I would suggest it to any horror fan\n\nHelpful | 8", "NigzillaJul 15 at 10:09 PM\nTerrible ending\n\nNeeded more levels terrible ending but super creepy and gives you genuine chills\n\nHelpful | 0", "TornOpenHeartJul 15 at 1:26 PM\nIm being held at Gunpoint to make this\n\nHelp\n\nHelpful | 5", "Cathy845Jun 28 at 9:08 AM\n\nMy review is: this is free for the Rift. I paid $24.99. Down the Rabbit Hole is $.99 for the Rift. Affected Manor is also free - I paid $9.99. Not sure why. Is it more difficult to develop for Quest? Please develop more experiences thanks.\n\nHelpful | 3", "statonfam7Jul 18 at 11:35 AM\n\nVery scary game, love the game play. Everyone in my family that was brave enough to play it has screamed and that is all I could ask for\n\nHelpful | 1", "CamGraham16Jul 16 at 3:45 PM\nBest game on quest!\n\nBy far the scariest experience for VR. All five episodes do an excellent job of being scary while limiting jump scares! Great atmosphere\n\nHelpful | 1", "CoOkieMongerMay 6 at 9:41 PM\nFun but super glitchy\n\nAs of today, I'm unable to finish this game because chapter 5 is so broken. I'm more afraid of accidentally walking through the cavern wall and the \"WARNING OUT OF BOUNDS\" screen pop up and block everything. Ok if it's out of bounds then why not make it unable to be walked through...by some time of barrier? I'll attempt chapter 5 for the 4th time tomorrow...currently wont let me walk through the next area that I'm pretty sure I'm supposed to go. I say this because the game breaks sometimes and I can only see the red walkway layout of the entire cavern but when it restores a normal view that area is impassable. It's completely black like its unloaded and when I stick.my hand into it it cleanly disappears. Chapter 2 was fun and creepy though..besides the bug with the wooden mirror.\n\nHelpful | 10", "CribselJun 16 at 3:58 PM\nGreat game, few problems\n\nIt is a good game don't get me wrong but sometimes I would get stuck on a level and not know what do. I search up what to do and it doesn't help at all.\n\nHelpful | 1", "murphy535513 days ago\nBugs!!!!\n\nStuck on chapter 2 because I cant proceed because it keeps glitching so much\n\nHelpful | 0", "Zer089Jun 11 at 8:56 AM\nThis is the best horror experience!\n\neach chapter is more scary then the last one I love it! I recommend this to anybody!\n\nHelpful | 4", "Kingkong2009Jul 13 at 4:56 PM\nBuy it if your brave\n\nThis game is so scary and fun you got to be brave\n\nHelpful | 1", "superpea98Apr 1 at 1:47 AM\nBest horror game Ive played\n\nEasily the best horror game Ive played. Currently Ive only managed to pluck up the courage to play the first chapter, and it was incredible. Tension and suspense is built up really well and I jumped at the slightest thing. Its definitely a must buy for anyone looking to be scared\n\nHelpful | 9\nDeveloper ResponseApr 21 at 9:09 AM\n\nWow, this is really high praise. Thank you so much for the kind words Superpea.", "cscahallJul 14 at 12:38 PM\nThis is a spooky game\n\nThis is so scary that I poop my self and fun get it now :D\n\nHelpful | 0", "michael.w.ford2May 20 at 7:10 AM\nHorrific journeys into the pandemonium\n\nOne of the best horror games I have ever indulged in. Different chapters with different atmospheres, surrounding the player with subtle waves of terror. An experience to behold with worthy atmospheres enveloped with Legion in many shapes and forms. Want more chapters!!!!\n\nHelpful | 0", "TOPflrELEVATOR4 days ago\n\nGot pretty scared. I dont get scared during horror movies because they are all predictable. But in vr its a different story. I love how it has a story line to it with like a clue detective feel.\n\nHelpful | 0", "J3SS1CAK3SApr 15 at 5:52 PM\nboooooooo\n\nGame is too glitchy to actually enjoy. Had to replay a level 10+ times and kept glitching out to the point where I was unable to continue. Attempted to get a refund due to inability to complete game and response was to uninstall app and reinstall. So now I have to replay the entire game to complete it ? Not worth the money for the experience.\n\nHelpful | 10", "vrpersonkidJun 10 at 10:28 PM\nA must have\n\nIf you like horror you came to the right place this game is scary combined with puzzles awesome game\n\nHelpful | 1", "2PumpTrumpMay 5 at 4:46 PM\nExperiencing a glitch in the 3rd level\n\nOnce I go down the elevator on the 3rd mission I see a red rectangle and i cant open any doors when i move it says warning out of bounds...I paid decent money for this and it's seriously frustrating.\n\nHelpful | 5\nDeveloper ResponseMay 14 at 7:16 AM\n\nThe elevator is actually in Episode 4: Samaritan. This generally occurs if you have accidentally moved outside your play space. Try taking a few steps backward in your real space to step back into bounds.", "elCholeJul 7 at 5:00 AM\nFull of bugs\n\nLooks good but all bugs spoil the game. Too expensive to be really short.\n\nHelpful | 1", "MrmangaMay 18 at 3:16 AM\nI cried\n\nI cried... 5 stars\n\nHelpful | 4", "LordWilliusFeb 4 at 12:26 PM\nStands outs from other games\n\nThis horror game is definitely one of the better games on the oculus store. Graphics, physics, and the story are very well done. However the story is a little short, the quality makes up for it. The only problem I encountered was that sometimes some chapters would glitch and become non-playable mid chapter. But I was able to fix that glitch by turning my oculus quest off and back on.\n\nHorror Rate: 9/10\nStory Rate: 7.5\nGameplay Rate: 9/10\nOverall Rate: Must-Have-For-Horror-Fans/10\n\nHelpful | 34", "JoeyReMay 24 at 8:33 AM\nGlitches\n\nIve had a horrible experience with the app. Constant glitches starting on level 2, had to restart about 10 times. Has potential, but waste of my money.\n\nHelpful | 2", "justsaewhenApr 26 at 6:26 PM\nEnjoyable, but...\n\nIt feels like you trigger of every \"jumpscare\", which decreases the dread and tension. Especially when you have no idea where to go and what to do (other than the first level).\n\nEven after getting help from walkthroughs a dozen times, I still find the way to progress in the game unorthodox.\n\nDreadhalls is cheaper and does it better.\n\nHelpful | 1", "agganis1984Jul 3 at 9:52 AM\ngood game, but im confused,\n\nthe file of the game is supposed to be 1.6 gigabytes but when i downloaded the game on my oculas quest it was only 897 megabytes, the game works ok i played it for a few minutes, i guess my concern is if i downloaded half the game or a version of the game at a lower quality resolution i bought the game from the oculas store, for a game this big i would've thought the file size would of the game would've been the whole 1.6 gigabyte\n\nHelpful | 0", "Kitsunenokage66May 7 at 6:19 PM\n\nSuper fun, creeped me out. Love how it gets progressively scary instead of hitting you all at once.\n\nHelpful | 2", "Dr.Evil.690Apr 20 at 6:18 AM\nLoved it\n\nMe and wife both love scary movies but this game gave both us a level of realism of our own fears in this demonic vr game. Its so much fun to watch others navigate through the maze of one of the best games that will scare the crap out of you. Well done\n\nHelpful | 1\nDeveloper ResponseApr 21 at 9:08 AM\n\nThank you so much!", "KarlDrinkwaterFeb 29 at 8:11 AM\nPotential, but buggy\n\nWhen it works, this is a good, creepy experience, with five (short?) chapters. I was enjoying it.\n\nOther reviews note the unfixed bugs and glitches, though. I have played twice. First time: did chapter 1. Second time chapter 2. Within a few minutes it had gone wonky. I was in a room with someone and we were falling into fire or something - I had the crucifix in my hand but it was jerking/flickering and couldn't be dropped or swapped for anything else. Then a demon ran at me down a corridor and kept resetting back to the start and doing it again. Movement was disabled for me, the crucifix still couldn't be dropped, there was nothing I could do but quit. Horror quickly dies along with immersion, and frustration destroys it completely.\n\nA minor thing is that ch1 ended and took me back to the precinct without my choice. Fine. I wanted to go back and have a second look around (as a detective might). BUT! You can't without it resetting everything. You have to play the whole thing with scripted events again, whereas I just wanted to look for any clues I'd missed.\n\nHelpful | 8", "codywayyneApr 10 at 2:45 PM\nScary but short\n\nId give it a five if it wasnt so short, but Im also a very easily terrified person who thought it was so scary! Loveeeeee\n\nHelpful | 1", "buzzin247Apr 10 at 11:48 AM\nGreat\n\nScary but short the price is way to much\n\nHelpful | 2", "eric.sullivan.587268Feb 7 at 8:51 PM\nScary\n\nThis game has me alittle more than jumpy cause you never know what's coming out at you if you want to feel scared this is the game for you cause it puts you into the horror and when you think your safe nope your wrong it's like the game gives you enough time to breathe then jumps at you again you kinda feel helpless with only a few items the cross holy water a thing that squirts a mist and a lighter sometimes your afraid to be without all 4 things only if you could have 4 arms then you might feel safe\n\nHelpful | 7", "uuuserbanrMar 16 at 3:41 PM\nScary\n\nSo scary I had to exit the game\n\nHelpful | 6", "tkjoneslvApr 27 at 8:38 AM\nAbsolutely horrifying\n\nAlmost Every single chapter took me days to complete because i was so scared.\n\nHelpful | 0", "HeizenbergJrDec 29 at 10:36 AM\nTakes horror to a new level\n\nWhen I got this game I really didn't have high expectations because the Exorsist is not the best horror franchise to hit the market. However, this game brings a whole new horror experience. When I casted this to the TV, onlookers where not too frightened of the jupscares or creepy feel of the environment. They where watching a crappy animated horror movie. But, to the person in the quest completely immersed into this experience, they walk nervously around corners and through doors. When you're immersed, you're not just watching a horror movie, you are the person in the horror movie fighting for their life. I had originally thought this game would be a arcade style game where you have to fight the demons 1v1 and restart when you failed. This game is nothing like that. It is a escape room that at times will house you deepest darkest fears.\n\nHelpful | 45", "mepisklakApr 3 at 11:36 PM\nReally fun\n\nThis game was really fun had a good story would rate five stars but this game is short\n\nHelpful | 1", "hass.khan.5Apr 22 at 3:06 PM\nGives bad motion sickness\n\nGives very mad motion sickness . People who have problem with motion sickness , avoid\n\nHelpful | 3\nDeveloper ResponseMay 14 at 7:19 AM\n\nWe're sorry to hear that hass! There are a variety of comfort options available in the in-game settings including various degrees of snap turning, teleporting, etc. You can access these settings via your wristwatch.", "Minnie2002Feb 17 at 2:59 PM\nCreepy!!\n\nI personally enjoyed it immensely, as did my mother. More creepy than scary most of the time, enough to give you the chills. Had some glitches that they need to fix, but enjoyable overall.\n\nHelpful | 3", "steve3poJun 17 at 7:12 PM\nScary enough\n\nI have never used a home button to ditch a game in the middle of a scary moment. Success, this game got me to jump and quit.\nGreat games and really does scare the heck out of you.\n\nHelpful | 0", "stinky_toesApr 24 at 2:53 PM\nif your looking for scary play this\n\nI litter my could not finish I got to scared\n\nHelpful | 1", "larrphMar 22 at 8:37 PM\nToo scary\n\nHad to put it down. Way too intense for a first try at VR. Ill go back after something more tame.\n\nHelpful | 3", "DylanLevine14Jul 10 at 4:05 PM\nGreat game.\n\nThe very first time the demons whispered I practically pooped\nmyself and back out of the game. If you want a good scare this is worth the money.\n\nHelpful | 0", "deliriouspigJul 9 at 5:25 AM\nGood but\n\nBest scary game it needs more levels\n\nHelpful | 0", "ScottandEmmaJan 16 at 6:26 PM\n\nI feel like every game on here has rave reviews but this one delivers for horror fans! Got goosebumps playing mission #3. Would NOT play alone and I'm a 30 year old guy who loves horror movies and rarely gets scared. Love it, I'm not a puzzle/mystery type person who enjoys searching for clues and such but it works here, trailer doesn't do this game justice\n\nHelpful | 7", "m.cody.simsFeb 10 at 1:13 PM\nMy favorite horror game on the Quest\n\nExorcist Legion is a master class in horror VR. Everything from the story, graphics, mechanics and overall atmosphere is just stellar. I would highly recommend this game to anyone that is looking for an extremely scary time in VR.\n\nHelpful | 4", "Lord_Of_IceJul 8 at 5:21 PM\nGreat Immersion\n\nHonestly this game has a good story but the immersion is unreal I get terrified when I play this but I dont want to stop\n\nHelpful | 0", "IIBRATTYIIJul 3 at 3:45 PM\nBeyond scary\n\nThis game will scare you no matter how brave you are the only downside is that there isnt that many levels which they should definitely get more\n\nHelpful | 0", "whitefaceddemonJul 1 at 12:18 PM\nPretty cool\n\nActually scared me sometimes\n\nHelpful | 0", "blazegaming64Jul 1 at 4:23 AM\nReview\n\nIt's quite scary in some parts, I didn't get scared on First Rites but the rest I got chills, it's a pretty good game.. \n\nHelpful | 0", "seth.misukanisApr 4 at 5:59 AM\nLoved it\n\nSuper scary, anyone who wants a thrill has to play.\n\nHelpful | 1", "GeorgehelenJan 19 at 8:38 AM\nToo many glitches\n\nOverall this could be a good scary game, but cursed with irritating glitches that make you have to restart the level losing the appeal and flow of the game.\nIn chapter 2 & 4 (have not yet done chapter 5 but by the reviews I dont think Ill bother cos thats the game with the most glitches) towards the end of game all I got was a pitch black screen with a bright red floor plan, the Audio was ok but needless to say that after a while of trying to get out of this area with no luck you have to restart the game which makes it boring and frustrating as opposed to scary and fun.\nAlso the constant out of bounds message is also frustrating when you are well within your assigned boundaries, again spoiling the ambiance of the game.\nAll in all the possibilities for a good game are there but I personally feel the devs shouldnt have released the game with so many glitches as per other gamers comments. I kinda feel robbed of my money because I couldnt play it as it was designed.\nSo please developers listen to us and bring out an update fixing these issues otherwise the game in the whole is actually unplayable in its current state.\n\nHelpful | 5", "PabloesreserveMar 19 at 6:11 PM\nAAA\n\nScary and fun!\n\nHelpful | 2", "reaper1415Mar 7 at 8:08 AM\nHorror\n\nReally good horror game\n\nHelpful | 3", "MaelwolfMay 14 at 5:43 PM\nDead by Dawn\n\nThe developers are obviously sickos who enjoy freaking me the heck out! What an experience, the scares are very well crafted, and the game maintains a sense of dread with every step forward. What a phenomenal horror game! This is how you utilize VR to provide immersion. Hope to see more!\n\nHelpful | 1", "jaydegeerDec 26 at 12:11 PM\nLoving it.\n\nThe game is insane, completely have to take off headset to take breathers...keep having to tell myself while I'm playing, \"it's just a game\"...love it and the music, suspense just overall a must own. On level 3 or case 3 and still no motion sickness like other horror games I've experienced. Kind of terrified to see what lies ahead. Only playing in the day time so time to get back to it (its obviously day time now). Thanks oculus quest and makers of the game for another fun title to add to my collection.\n\nHelpful | 6\nDeveloper ResponseDec 27 at 4:31 PM\n\nWe absolutely loved reading this review. Wolf & Wood worked especially hard on the music and it was so nice to see that you appreciated that aspect. Happy Holidays!", "MangoFett54Oct 15 at 6:31 PM\nPretty good but not very replayable\n\nI loved the main story, very creepy. Definitely the kind of horror I want to see more of on quest. But I feel like there should be some sort of survival mode or something. Just something to make the game more repayable. Its 25$ and can be completed in around 2 hours, which isnt enough time imo.\n\nHelpful | 71", "batgirl101Apr 16 at 12:07 PM\nI want a refund\n\nThis game sucks, i just got it 2 days ago i try to play 3 times and is trash super boring ,i would like a refund please\n\nHelpful | 1", "jmxter144Jan 24 at 7:28 PM\nMeh\n\nThis game isn't super scary like some of the reviews say, but it has its moments. Jumpscares can ruin the experience but the game does a great job of building the tension throughout each chapter, even if every \"encounter\" is a scripted experience.\nUnfortunately the game has many drawbacks in the form of both extremely frustrating gameplay elements, collision, and glitches that force restarts.\nThe collision (moving into an object or through a wall and getting stuck) I can forgive because it's a universal problem in VR.\nbut the Cross is used for almost every \"exorcism\" (basically a puzzle) and is absolutely inconsistent in whether you hit targets or not, regardless of where you point it.\nFar more frustrating is exploring rooms and having your light go out so you get stuck. If you were supposed to go somewhere else first, the game gives you no indication. In fact, you have to figure just about everything out yourself and if you didn't do it the exact way the devs wanted, tough luck! Sometimes your screen just turns black for no reason, which can be solved by pausing, but sometimes it just outright crashes. How long has this game been on the market and these problems are being encountered as of writing tells you how much the devs care.\n\nHelpful | 3", "trussFeb 4 at 5:49 PM\nSo far so good!\n\nSo far its a pretty awesome game! Just got the quest and wanted a horror/thriller game and its not disappointing! Ill update and edit this review if anything changes but as of now with only a little bit of time invested Id say its worth getting.\n\nHelpful | 0", "pm.nadeau.9Jan 27 at 6:49 PM\nDemonic bugs\n\nI get at a spot where, according to guides, im suppose to do a precise action, but no matter how correctly I do it, doesn't work. Reload chapter and next time doing the same thing it works. Get to a another scene where the same thing happens again. Rince and repeat. Then it happens again...and again. At some point, im stuck behind a semi translucid wall that I was supposed to be on the other side for the game to continue.\n\nThe game by itself is, or atleast seems amazings sor far as mid chapter 2, but it has being delivered in such unfishised state that you should wait for the producers to sort out their mess. It is already expensive to buy games for 35$ that last 2.5 hours so maybe it could at least come bug free.\n\nHelpful | 3", "sdawson535Jan 16 at 6:26 PM\nGreat but few problems\n\nWe are green but theres one problem I ran by while playing the game sometimes you get stuck in the wall and have to restart your game and that would restart some of your progress but besides that great fun game with lots of play time and levels\n\nHelpful | 1", "LeoTheGeneralJun 21 at 12:45 AM\nLeo\n\nA lot of bugs, glitches. Very frustrating experience. When you have all these bugs you cannot sell the game for that price. I would definitely like to have a refund.\n\nHelpful | 0", "tomkilvertFeb 21 at 8:19 AM\n\nSeriously scary stuff \n\nHelpful | 2", "HelloAlice2019Jan 3 at 8:48 AM\nBeautiful, creepy and terrifying!\n\nI only completed about a quarter of the game, mostly because I can not handle more than 5-10 minutes of this game at a time. The visuals in this game are stunning, especially considering Quest limitations.\n\nThe atmosphere is so eerie that I literally feel if someone touched me while I am in this game I would scream and jump all the way up to the ceiling.\n\nExorcist made me find out what I would be like if I was scared witless in real life. Wondering around the Church slowly almost constantly looking back at the Confessional stall, saying \"I am done, I am done\" every time I heard creepy noise or whisper. Several times I realized I forgot to breath. And when I saw that the body was gone from the Confessional I felt a strong urge to start crying. Oh, and I had the most horrifying nightmare of my entire life 1st night after playing Exorcist.\n\nSo this game is beautiful but incredibly unnerving and at times horrifying. Play at your own risk :)\n\nPS. For adrenaline fans, I would advise to AVOID YouTube review or walkthrough videos of this game. Not knowing what will happen next might be a big contributor to the fear factor of Exorcist.\n\nHelpful | 3", "The-OrcaDec 31 at 8:11 AM\nAbsolutely Horrifying\n\nIf you truly like to be scared (and I do) this is for you! It makes it so much worse, the rotating chair I use squeaks badly and at times it sounds like whining or whimpering. ( I soooo need a new chair.) and the cat doesnt help when he rubs my leg when walking by. And the dog barking out of the blue at nothing. I really cant play if nobody is home. Absolutely the scariest game in vr so far, l love dread halls but this beats it. Kinda disappointed the the theme music from the movie wasnt in it. And it did have a couple bugs in it, had to start one chapter over cause I was stuck and couldnt move just kept shaking.\n\nHelpful | 3", "princesspiJan 20 at 3:49 PM\nTerrifying.\n\nI greatly enjoyed this. It's a cross between an escape puzzle and a haunted house. Really well done.\n\nHelpful | 0", "Arrieta1205Dec 26 at 4:58 PM\nGlitch\n\nGreat game, excellent experience actually scares only problem the game keeps glitching for me in the asylum level, it breaks the experience when you try to show it to some one and it always glitches\n\nHelpful | 2", "tymitchJan 3 at 10:57 AM\nIt's good but...\n\nI had a good time playing the game for what it's worth. But the game continuously glitched out and walking out if bounds didnt warrant any kind of help. During the end screen we couldnt see anything it was pitch black, and we had to start the entire game over twice... its buggy. But I liked the story\n\nHelpful | 2", "tnt_witherFeb 4 at 6:27 PM\nHow do I refund?\n\nI dont see a refund option. Also this game is a really scary game so get ready (tutorial is hard to get past)\n\nHelpful | 0", "the_samoanApr 26 at 10:59 PM\nPretty scary ...\n\nThis game is pretty cool better than all the other cheap horror I've ayed on here I got scared a couple of times... lol the whole game had me hunched over scared 10 out of 10 \n\nHelpful | 0", "SushiTrashDec 23 at 6:10 PM\nThis game is so fun and scary!\n\nThis game will keep you on the edge of your seat the entire time! Its so much fun. Its a little scary but not too bad. Mostly suspense and not a lot of jump scares. It is so worth the money and you can play the entire game in a span of 7 hours. Totally worth the buy and the stories great!!\n\nHelpful | 1\nDeveloper ResponseDec 25 at 2:17 PM\n\nThank you so much. Really glad you enjoyed it. Did you find all the artifacts?", "theoryofeverywhereJan 1 at 1:25 PM\nEntertaining enough\n\nWell it is a bit scary but totally fine. I was walking around at full speed without hesitation by Chapter 2. You kind of get your VR horror legs after a bit. The real problem here is the play mechanics. I basically just walk around the level grabbing everything until some new audio or visual queue occurs. Sometimes things make sense but it REALLY take me out of the experience when I am just wondering what I am supposed to do next. It just makes for an unsatisfying and less scary experience when I cant interact with the world in a more natural way. Try this if you want to try VR horror though. Chapter 3 is definitely the high point.\n\nHelpful | 1", "EthansrMay 22 at 10:20 AM\nImmersive\n\nOmg the depth is for real,I'm loving it!\n\nHelpful | 0", "MullenManDec 21 at 7:49 AM\nGreat game for horror fans\n\nThe game has such a horrifying atmosphere and its amazing! Any horror fan will love this. My only complaint is I ran into a glitch in part 3, but after restarting the game it got fixed! So overall great game\n\nHelpful | 0", "mary.vareliJan 11 at 7:36 AM\nImmersive!!\n\nI enjoy the game, it is immersive and the graphics are amazing. I had some issues with the tools, solved by the helpful developers. Overall, I like the game and look forward to seeing more chapters.\n\nHelpful | 0", "pannese1Jan 5 at 12:30 PM\nExorcist\n\nLoved this experience, My puzzle solving needs to improve, would like not to take so long finishing the chapters. Very immersive, very scary and very satisfying in completing. Thank you so much, cant wait for part 2!\n\nHelpful | 0", "adamkanderson03Dec 29 at 12:24 PM\nWorth the money\n\nThis game will definitely scare you and there are 5 levels to play and each takes about 30 minutes each and a very good storyline that keeps you engaged. Worth the money however not sure what the artifacts it tells you to find are.\n\nHelpful | 1\nDeveloper ResponseDec 29 at 4:23 PM\n\nAdam, there is 1 artifact hidden in Chapter 1, 2, 3 and 4. These artifacts can upgrade the items in your exorcism kit. If you miss them, you can also try poking around the evidence room after you finish a chapter. Glad you're enjoying the game!", "steve123678Dec 28 at 7:59 PM\n\nMore levels\n\nHelpful | 3", "RKULASA85Feb 20 at 4:42 PM\n\nNot all that\n\nHelpful | 0", "davidhobbisFeb 5 at 1:06 AM\nExorcist\n\nChapter 4 wold not let me finish got to last door and doors would not open\n\nHelpful | 2", "eric.welwood.7Jan 12 at 1:03 PM\nScary\n\nProbably one of scariest VR games I've tried. But also has some puzzle solving aspects that put it ahead of the competition. Would recommend it.\n\nHelpful | 0", "Aaronb3434Dec 3 at 9:45 PM\nCool\n\nI love this horror game it's one of my fav apps on the quest. but Houston we have a problem?? when I tried to uninstall it from my quest it just keep saying uninstalling and there's no way to remove it from my app list. if possible please fix this error so I can restore it back in my library. thank u oh by the way will more chapters be added soon?\n\nHelpful | 3\nDeveloper ResponseDec 25 at 2:20 PM\n\nWe received your request as well. Was this ultimately resolved? If not, please reach out again and we'll make sure you can get up and playing again.", "JackJensenDec 14 at 12:16 PM\nTerrifying\n\nSuch a great game. Good story. Graphics are decent. I did have a few issues clipping into the walls and such and had to restart the game. Looking forward to more content.\n\nHelpful | 1", "luka83Dec 27 at 6:50 AM\nDob't buy it's too buggy to play\n\nBy chapter 3 you will be getting no visuals, only leaving the gane and reentering will bring the screen back. By the time you get to chapter 4, even exitubg will not help and your jourbey will end. Game was poorly ported to oculus wuest and is not usable. If this doesn't stop you maybe poor graphics will. Interactivnes also sucks, you will not be able to open most drawers due to many bugs.\n\nHelpful | 2", "mario.melendez.868Apr 30 at 3:58 PM\nGives you chills\n\nDefinitely fun parts will give you chills but could use more levles\n\nHelpful | 0", "Techno3601ytMar 20 at 3:20 PM\nGood game but with some problems\n\nThe game plays very well and besides a few bugs, runs very smoothly. however, I know its on the quest but the graphics suck,\nwhich wouldnt be a problem for me in most games but in a horror game it partially ruins it for me. By the end of the second chapter when I feel like I should be terrified, I was laughing.\n\nHelpful | 0", "lilhammerDec 20 at 7:16 PM\nScary as hell\n\nThis by far is the most frightening game Ive ever played. So far, Ive only played the first two chapters and Ive already thought about not continuing, but I know Ill come back for more.\n\nHelpful | 0\nDeveloper ResponseDec 25 at 2:18 PM\n\nWe can't wait to hear if you make it to the final chapter!", "XCaleburDec 20 at 6:02 PM\nGreat Vr Horror Game\n\nIve played my fair share of horror games but the exorcist throws it to another level. I find it hard to be scared by games and Im glad this one was able\nTo give me spooks\n\nHelpful | 1", "NathanJHuttJan 22 at 11:24 PM\nBest horror game to start out with\n\nAmazing\n\nHelpful | 0", "UhluhtkNov 18 at 2:41 AM\nVery epic and scary\n\nThis game is great if you like a good scare. But, I gave it a three star review because the controls are like controlling a backwards bike while blindfolded and sometimes you have to read a note or a book in this game and its very hard to read. Dont get me wrong, I love this game and it is one of the scariest video games I have ever played. It does a great job creating a spooky atmosphere and has some great scares but I personally just dont like the controls.\n\n\nEdit: thank you for informing me about this, this makes the game much better and more comfortable.\n\nHelpful | 6\nDeveloper ResponseNov 17 at 1:37 PM\n\nIf you open up your mobile phone in-game and browse the options, you can find a variety of options for locomotion, object interaction, etc to suit your play style the best. Uhluhtk, thanks for the love.", "lauren.HigdonDec 7 at 2:09 PM\nScary!\n\nVery fun and spooky. Hope they are making more cases to go on. Probably could have finished it all in one day.\n\nHelpful | 1", "Ihrie4 days ago\nOk not excellent\n\nThe game does a reasonably good job building atmosphere but is completely undermined by some of the atrociously low textures used in some of the later parts of the game. Also at times it feels a little clunky in handling some of the puzzles.\n\nIt was an OK experience but doesnt really have any replayability and It didnt really feel worth the $25 asking price.\n\nOverall though it has an interesting story and Id certainly consider recommending if it was on sale or you were just looking for something horror that isnt just jump scares.\n\nHelpful | 9", "Retro-FoxNov 15 at 5:08 PM\nPretty good, not bad. Camera glitches.\n\nThe only thing that gets in the way is that sometimes when exploring. you can turn the camera just right & everything goes black or you just simply can't move\n\nHelpful | 4", "SwiftDaGreatDec 5 at 6:50 AM\n\nNice\n\nHelpful | 2", "emeraldphoenix7Dec 26 at 10:32 PM\nAbsolutely Amazing and Terrifying\n\nAwesome game that terrifies me and my friends, worth every penny.\n\nHelpful | 0", "Icywolf100Dec 25 at 4:44 PM\nReally good\n\nThe game is really good chapter 5 is my favorite\n\nHelpful | 1\nDeveloper ResponseDec 25 at 2:17 PM\n\nMatt, on Quest you need to use the \"Bees Oil Burner\" from your exorcism kit to navigate certain parts of the tomb. Also, there are candle markers to help you find your way.", "ParadiseDecayOct 25 at 7:41 AM\nPlaying the game in a Haunted Cellar!\n\nMy Initial Impressions:\nHorror games in VR are some of the best experiences you can try, they really fool your brain into thinking you are there and it's all real.\nI go the extra mile and play this horror game in a haunted cellar. (See my Video below!)\n\nPART 1 of my Halloween Series:\nhttps://www.youtube.com/watch?v=mtG17TwuVYY\n(Please Note: Links might not work from Oculus so please search YouTube for 'Paradise Decay VR The Exorcist')\n\nHelpful | 2", "SickDubstepDropNov 2 at 2:07 PM\nYou must buy this game.\n\nIt's not like you'll be getting jump scares right when you start, but it has a whole storyline to immerse yourself in and that's when it scares you. Very well made game, and the price isn't too painful to your wallet.\n\nHelpful | 4", "booty302Aug 25, 2019 at 5:19 AM\nthis is best horror so far\n\nstart out ok until chapter 4 the game has a warning sign and can't play it anymore. really disappointed. thought it should be a great horror game. please fix this issue on chapter 4 otherwise i would like a refund. unbelievable\n\nupdate: chapter 4 no more glitching. it works great. now let's see chapter 5\nupdate: overall its much better than the face your fears. it's more playable compared to fyf 2 its more like in motion sickness feeling and i can't play further that game. i gave 4 stars out of 5 because its still give a little dizzy but still able to play and completed the whole chapters so i would still recommend to buy this game. it's worth your money\n\nHelpful | 8", "Crazy_SaneOct 10 at 4:13 AM\nYour mother sucks rocks and smells!\n\nThis is my favourite horror game on the Quest. The game is very well written and will make the hair on the back of your neck stand up. It's not all jump scares, although there are a few. Nice graphics and gameplay, but I thought it was a little short.\n\nI'd love to see a sequel.\n\nUpdate: A second season sounds great! I'll buy some brown underwear in preparation.\n\nHelpful | 9\nDeveloper ResponseOct 8 at 2:08 AM\n\nThank you for the compliments regarding the narrative. We are discussing the possibility of a 2nd season...", "maks111Nov 15 at 3:53 AM\nThe worst game in the store\n\non the second episode crashes the game for the first time in the patients room. when you get the cross nothing happens and there is no save, you have to go out and restart the game to go through all over again. the second time crashes after when a man with a pigs head runs at you. runs endlessly. thanks to the developers -25 $ for the worst game on vr\n\nHelpful | 1\nDeveloper ResponseNov 17 at 1:23 PM\n\nPlease reach out to us so we can help you with these crashes. That definitely should not be happening.", "Word.NoFaceDec 22 at 12:13 AM\nToo bad\n\nGame is broken and its too bad. Did all clues for certain levels and then nothing happens. Too bad..\n\nHelpful | 1\nDeveloper ResponseDec 25 at 11:16 PM\n\nHi, let us know how we might help you.", "joeycrippenOct 16 at 8:55 PM\nAwesomely horrifying\n\nI'm a big horror movie guy, and I've played a few horror games but nothing compares to vr horror. It is So immersive and the story does a great job to give sense to everything going on.\n\nHelpful | 3", "yourcorpsOct 17 at 6:20 AM\nScary. But plays like garbage.\n\nThe controlls are a nightmare and the puzzles at times were one of those mash every two objects together times. Would have been a better experience just walking around with scripted scare scenes without the lousy puzzles. My first regrettable purchase experience on the quest. Definately not worth the price tag. I would say it was good for a cheap scare, but the price is obviously hiked up for the puzzle aspect, which entirely kills the experience.\n\nHelpful | 10", "redalert33Oct 18 at 7:50 AM\nSolid game, but not too scary\n\nThis game is pretty dece, but nothing great. It's pretty short... maybe took me an hour to get through it, and at times it drags and can be pretty boring. It has a few cool scares and creepy things but overall I was kinda disappointed. Face Your Fears 2 was WAY better as a horror game in my opinion.\n\nHelpful | 6", "lonjemoco52Sep 29, 2019 at 6:30 PM\nLook its alright\n\nLook Im a huge fan of horror and this title seems to fulfill my horror need to a certain level. Its seems though they filled this game with cliche horror moments. But if you are looking for a good horror game then get this one\n\nHelpful | 2", "MikeOliver88Oct 8 at 5:05 AM\nScary and awesome\n\nIm a huge fan of the Exorcist 3 movie and this game reminds me of that. Its a detective clue searching game with creepy scary stuff going on. Like the lights go out and demon voices taunt you. Thats all I got. Its great, play it\n\nHelpful | 5", "WineSteinSep 24, 2019 at 5:33 PM\nThis game bugged me.\n\nFirst, let me say I absolutely love horror games. As a film director (student), I strive to make films that are full of ambiance and psychological scares. This game does a very good job at building a sense of dread and horror throughout each story. Thats about all it does.\n\nIve tried several times to complete the last two missions yet every time I get near the end, the game bugs out. I dont mean simple walking into blackness and trying to figure out how to get back on the map (which happens on every level every time I play), but instead it just doesnt work period. The final level wouldnt even let me finish. The jump scares are horrendously buggy as well. When I first played, the ending of the first level just turned into a red plane of squares with nothing happening. Wait for a better horro game to come out thats not so glitchy.\n\nI tried to refund this game through Oculus, but unfortunately, I had played over the 2 hour limit (mainly because I was trying to see what happens at the end of the first mission since it wouldnt work... Save your money! I wish I had...\n\nHelpful | 14", "darwins.lastNov 6 at 11:42 AM\nScary\n\nVery creepy game. Cant wait for the rest.\n\nHelpful | 2", "JTubbrittSep 9, 2019 at 12:13 PM\nVery scary.\n\nHave to admit, I have been put off writing a review on this because I feel I haven't played it enough yet. The reason being, I'm 44 years old and I still find this very scary. Exactly what I want, but I need the house to myself and no interruptions to really enjoy this. Delighted with my purchase. Just need to have the nerve to jump right back in for a long session.\n\nHelpful | 1\nDeveloper ResponseOct 2 at 5:17 PM\n\nJT, thank you. We love hearing this. Take it one chapter at a time and enjoy the details!", "snake85027Oct 27 at 12:59 PM\nScary\n\nThis game scares the hell out of me\n\nHelpful | 2", "Lady_MadelineSep 6, 2019 at 7:11 PM\nBest horror game\n\nThis is the best horror game right now for the quest! I love it so much I would play it again and again. But whats the point with playing it over and over? Just to not get scared anymore? Nah I would play again in maybe 3 months so I forget about most of the game. That's what keeps the immersion going. Waiting to play again because if not then it'll get old and boring. Now for my thoughts. 10/10 worth $25. I found chapter three to be the most depressing and chapter five to be the most terrifying. I love this game. If you haven't already, get the game you'll love it\n\nHelpful | 1\nDeveloper ResponseOct 2 at 5:18 PM\n\nThank you for the kind words. Many of us are particularly fond of Chapter 3: Skin Deep. Very glad to hear you're enjoying the game.", "UntoldSlaughtaAug 29, 2019 at 7:54 PM\nScary as hell\n\nBra hard to finish not jump scares the demons and their lore is really good very creative I like how the environment reacts to you where you're looking to get you to the scariest point of the game I didnt get motion sickness which is good and nice how you can defend yourself but have to make the right choices when the time comes completely unsettling the games demons have a great way to make you lose all hope even with the exorcist kit at your side I'm hyping myself up just to play five I hope more is released soon keep up the good work!\n\nHelpful | 3", "lorraineaOct 19 at 9:23 PM\nAMAZING\n\nLiterally the scariest game\n\nHelpful | 4", "dennisdamenace202Oct 21 at 7:37 AM\nPretty good, short, but good\n\nI found it to be cool, atmospheric, some jump scares.\nAll in all my only complaint is the length.\n\nHelpful | 1", "eric.schauer.79May 25, 2019 at 7:09 PM\nChills and terror\n\nThis game is absolutely terrifying. It is like nothing Ive ever experienced before. It has me and my son creeped out. Graphics are good. Interactions are fun and exploring the environments are fulfilling. Highly recommend this game.\n\nHelpful | 58", "xAP0110xSep 14, 2019 at 11:51 PM\nOk\n\nIt will definitely give you a few scares but still not worth it. Long load times, storyline doesn't matter, lots of extra details that you don't need to finish the game so don't bother reading reports or paying attention to detail. You have multiple items in your inventory but almost all are not needed.\n\nHelpful | 3", "GreatQuailJul 16, 2019 at 7:25 PM\nExpect Chills and Glitches\n\nHorror games are my favorite type of video games, and Exorcist VR is a fantastic addition to the library! It is genuinely scary, and really knows how to build a steady creep factor. The mechanics are fairly simplethis isn't a shooter, it's pretty much an atmospheric walkthrough with lots of chilling moments and great atmosphere. While I'd love more interactivity, it still delivers a few genuine frights with every episode.\n\nUnfortunately, as of right now, the game has numerous glitches. I have yet to get through a single episode without a game-crashing glitch, forcing me to start that episode over again. It takes an average of 2-3 tries to make it through a single episode. Controls that freeze up, crucifixes that suddenly vanish, dramatic encounters that don't trigger a resolution, it's all there. This is a tremendous shame, because these glitches pull you right out of the experience. Hopefully an update will eventually solve these problems, but for now, expect an uneven playthrough.\n\nBut to conclude, I still think it's worth the money, and I hope more games like this will come out soon. Can we have a VR version of \"The Thing?\"\n\nHelpful | 11", "Kobi_KobiashiJul 24, 2019 at 4:08 AM\nLegitimately terrifying\n\nThere is no horror movie too scary for me. I never get creeped out or fall for jump scares. Im like a robot watching horror movies. This experience, on the other hand, I can only play in small doses before saying nope and taking off the headset. The developers did an amazing job of creating deeply suspenseful and unsettling environments. This is a must for horror fans, especially those who have never experienced VR horror before.\n\nI gave 4 stars instead of 5 because one or two chapters were noticeably weaker than the others. All in all, this is well worth the money.\n\nHelpful | 6", "rcazzyJul 21, 2019 at 8:44 AM\nPlagued with game breaking bugs\n\nA decent horror game but there are game breaking bugs which keep popping up in each level. This includes encounters not occuring which are meant to (requiring a level restart to enable), interactions which are supposed to work not working (again needing a restart) and the final level is unplayable as the players \"headlight\" becomes disabled and the level is too dark to proceed as the in game hand held torch does not cast light. I wouldn't recommend this in is current form and I'm surprised it passed QA.\n\nHelpful | 11", "My_WayOct 29 at 3:11 PM\nGame keeps crashing\n\nMoving from room to room crashes the game in level 4. Not waste your money\n\nHelpful | 1\nDeveloper ResponseOct 29 at 5:55 PM\n\nPlease reach out to us so we can help you diagnose this issue.", "MystereGuyMay 21, 2019 at 5:50 PM\n\nI'm a big horror fan and it takes a lot for me to get creeped out. This game delivers! Originally I played the first chapter on the Rift and was happy that a game was able to make me jump and feel uneasy. Now with the Quest, I'm happy to say that it still delivers! The graphics take a small hit, but not that far off from the Rift. They did a great job with this port. If you love horror games and don't mind getting scared, this is for you!\n\nHelpful | 243", "Pieman476Oct 14 at 7:38 PM\nGood game\n\nVery spooky\n\nHelpful | 1", "TheSanguinJayOct 1 at 8:33 PM\nIt's amazing\n\nThis game is creepy scary and interesting the mechanics are great\n\nHelpful | 2", "MylarSep 2, 2019 at 8:18 PM\nGreat game, a few bugs\n\nSuch a creepy game! I was surprised at the level of atmosphere.\n\nUnfortunately, when streaming to a nearby source (like a phone), if it allows you to stream at all- it wont send any audio along with the video. Just silent video for everyone else watching. I hope you can fix this!\n\nHelpful | 2", "twistedhpy7Sep 7, 2019 at 6:56 AM\nScary as hell\n\nThis game is awesome! The hairs on my neck were standing up. I had goosebumps. I just finished chapter one. New to oculus and am enjoying every minute. Cant wait to see more.\n\nHelpful | 2", "god.has.left666Aug 18, 2019 at 5:24 PM\ndissapointed but not surprised\n\nI am a huge fan of horror and horror games. With games, it's not difficult to freak me out (I couldn't finish Outlast) but oh god, this game didn't scare me at all. I thought it would be a great experience to play virtual horror but this was a huge dissapointment. Overall game feels like a demo. I finished this game maybe in three hours or so. Story is pretty flat, most of the items available are used maybe once or twice so it feels like they are useless(except for crucifix). I liked the environment and some claustrophobic parts of the game but that's all. Don't expect much from this game.\n\nHelpful | 0", "Paine2236Sep 12, 2019 at 1:06 PM\nWear brown pants\n\nBrilliant game and scary as hell going into it I just found it a little less scary around half way through.\n\nHelpful | 1", "Tummie555Jul 28, 2019 at 1:36 PM\nGreat game, afraid to start.\n\nAs a VR veteran I can say there's two genre's where VR is mind blowing next level: racing/flying simulators AND horror. Even on Samsung gear or oculus go, graphics don't matter when the genre is horror. You'll feel instantly immersed in these kind of scenes and scream like a scared baby*itch. The fear overloads all rational thoughts. And this version is on the Quest, so all the bells and whistles. Graphics are awesome, 6dof freedom, controller tracking, no cables. Just you and the haunted. You owe it to yourself to get at least one scary vr game.\n\nHelpful | 6", "KristaalosSep 10, 2019 at 8:59 PM\nCreepy & Entertaining\n\nScary game. The 6-DOF really makes this game shine. Very fun as a party game if you have a way to stream to a tv.\n\nHelpful | 2", "BossbeastJun 3, 2019 at 5:07 AM\nCreepy\n\nI dont have the crucifix at the start of the chapter - Ive watched a few playthrough videos of the start and everyone else has it. UPDATE - restarted the game and it was there on next play. Still a bit annoying having to start the chapter again. Apart from this slight problem Ive enjoyed the game a lot so far. Very creepy atmosphere\n\nHelpful | 10", "MORTONICAug 18, 2019 at 10:50 AM\n\nMy first vr horror game on quest I've played many horror games in vr but this is definitely one of the scariest\n\nHelpful | 3\nDeveloper ResponseOct 2 at 5:19 PM\n\nWelcome to Quest and thank you for the compliment!", "fernando.vazquezjrJul 5, 2019 at 8:28 PM\nTwiztid wicked and very intriguing!!\n\nNow I can play this one a couple times and still enjoy it.. it's scary fun especially watching your friends get on the floor and do some weird stuff while playing the game lol.. I like the storyline I like the interaction and I love the dialogue.. good job on the game bravo\n\nHelpful | 6", "glenn.ratcliffe.961Aug 5, 2019 at 6:23 PM\n\nA few scares but that 'out of bounds WARNING' sux big time. WTF is it/dose it mean? How do I stop it? Can't even finish the game as when in the cave, it constantly dose it. Very frustrating game when you can't play it because of said warning above. Save your money people till this issue is fixed.\n\nHelpful | 8", "jimjrc77May 25, 2019 at 7:23 PM\nAmazed, impressed, worth the money.\n\nOnly have done chapter 1 so far. It made the hair on the back of my neck stand up. Chills down my back. This is my first horror game in VR and I am very impressed. I have never had a movie make me have this feeling. But VR made it very real and sucks you in fast.\n\nHelpful | 20", "spudthepotatoMay 29, 2019 at 2:36 PM\nLegitimately too scary for me\n\nThe first time I tried this game - it was on a Lenovo Explorer (PC based) headset that my friend was letting me use. This game legitimately floored me and caused me to throw off the headset and nearly throw it across the room. Ive never been so scared of something in my life.\n\nThe quest version is no different. There is definitely a massive graphical downgrade relative to the PC version. Textures are not rendered very well and sometimes text can even be hard to read unless its right by your face. But I still had tons of fun and it still felt just as immersive. I havent been able to make it past the first level because of how terrifying the game is.\n\nIm disappointed that this game is so hidden in oculuss store. I had to search for this game by title and I only knew it was coming to the quest because of how closely I was following the quest before its launch.\n\nI highly recommend this game but just play it on soft carpet and have a change of pants nearby because you will likely **** your pants and throw your brand new oculus quest across the room lol.\n\nHelpful | 14", "Spanky8237May 21, 2019 at 11:43 PM\nNow THIS is a horror game!\n\nI don't know what the Quest has planned for the future for horror games, but it's going to be tough to top this experience!\n\nHelpful | 35\nDeveloper ResponseMay 22, 2019 at 9:26 PM\n\nSpanky, thank you this is huge praise.", "LookeStuffJun 2, 2019 at 6:29 PM\nExceedingly horrific\n\nThis game plunges you into the depths of a horror film with fantastic narrative game design. Favourite game so far on the quest and I am. Extremely proud of the devs for making this possible. The psychological impact of playing this is fantastic for any true horror fan. Not for the faint hearted in any sense.\n\nHelpful | 11", "longsydneyJun 3, 2019 at 5:56 AM\nTruly horrifying\n\nOmg it is the most scariest game I've played ever! Tried playing the first chapter alone at night and i was so freaked out that i couldn't go on and had to continue the game during day light hours! Puzzles were interesting, the atmosphere and storyline combined with the eerie music was terrifying! A must play game for the serious horror fans.\n\nHelpful | 10", "SpirehunterJun 7, 2019 at 11:12 AM\nMust buy for horror fans\n\nI'm just going to say this. There's a part in the 2nd level that had me pacing back and forth for 15 minutes, until I finally worked up the courage to continue. If you are a horror fan, do yourself a favor and pick up this game. I've yelled countless times. What a rush!\n\nHelpful | 10", "DanMusJun 20, 2019 at 11:56 AM\nGlitchy\n\nTo start on a plus point this is a very scary game at times. I read that it peaks at the 3rd chapter but for me it was chapter 4 that I was most creeped out by - I had a real sense of dread playing that section. Graphically its ok but not overly crisp - its especially hard to see in darkened areas. I get this is probably a limitation of the Quest but it is particularly frustrating in the final chapter when you can barely see where you are going. There is a light source you carry around with you in the game but that doesnt help at all - it just creates a fuzzy glow in front of you but doesnt seem to illuminate your surroundings. Ive actually been unable to finish the final level because I cant see where Im going - from looking online I know Im near the end of the level but just cant seem to see anything in a darkened area Ive reached. Which leads to another problem - I keep getting stuck to the spot and the controls to walk just wont work. This happened on the brilliant chapter 4 too and it did spoil what was otherwise a great level. I had to physically walk in my kitchen (being careful of my furniture) to reach the bit I needed to interact with in-game. And on chapter 3 I got stuck because I needed the crucifix to progress and all I had was an empty slot in my inventory where it should have been. I had to restart the level (when I was three quarters of the way through) to get it to reappear. Overall a pretty decent experience but sadly really let down by some serious performance issues and Id struggle to recommend it based on its problems\n\nHelpful | 11", "obsouleteJun 28, 2019 at 6:51 PM\nFree rotation\n\nThe game was good I enjoyed the story. I hope they add new chapters further down the road, it ended rather quick only having 5 chapters that aren't that lenghty.\nMy major issue and I assured it's the game, cause on a different game i had perfect smooth rotation using joystick, has a stutter when rotating camera with right joystick on quest regardless what speed you use. I like playing with smooth turning and movement on, I feel more emersed for the realism, but with this rotation issue I have been using teleport 45 degrees Tmat a time and it just runs what could be a great game. I hope y'all update it and sort this out soon.\n\nHelpful | 6", "andyphillips99Jul 7, 2019 at 10:42 AM\nClumsy / buggy\n\nControls too complicated, lots of faffing about makes game too slow - you spend 80% of the time thinking ok.. what am I supposed to do now as in, where is the puzzle rather than how to solve it\n\nFeels very half baked compared to most other vr games\n\nHelpful | 6", "KoverathMay 29, 2019 at 6:07 PM\nA Terrible short mess\n\nI finished the entire game in around 40 minutes without rushing and the final chapter Tomb is awful, the graphics are sub-ps1 and its actually broken, I kept walking through walls even though I was moving with the analogue stick and seeing a weird red map outline.\n\nHelpful | 24", "matsterJun 15, 2019 at 6:38 PM\nGood game for horror fans\n\nI really enjoyed the game. Did glitch on me a couple of times but other than that was a great experience. Had a blast watching my nephew freak out on the first chapter\n\nHelpful | 4", "PurplemikeyMay 26, 2019 at 4:46 PM\nThe Exorcist deliver and i got scared\n\nI always liked horror movies and games as I tried to scare my self without being able to. Rarely made any jumpscares in my life... No flat screen games achieved that and I can't remember if a movie did.\n\nI just can't get immersed in flat screen... Even with headphones.\nThen I bought the Oculus Go and had my first real jumpscares with goosebumps (from another game I won't name). When I bought the Quest I wanted to be scared again. I bought horror games and tried them. The Exorcist is really standing out. This game is what I was looking for.\n\nIt is well made, immersive, beautiful and scary. They use pretty much everything they can to scare you... Lighting, ambiance, noises, objects... Won't spoil you but... It is great!\n\nIf you are into horror games you are into the exorcist VR. Grab it and live the experience.\n\nHelpful | 12", "Shreader87Jun 15, 2019 at 11:40 AM\nScary!\n\nThis game is fun and scary! You start off not so scared but it builds up and gets scarier and scarier! its also got a puzzle aspect. Great Game for thoose who love some scares!\n\nHelpful | 2", "sdowneyJul 14, 2019 at 1:46 PM\n\nHead to toe in goosebumps! Wolf and Wood have nailed it. Buy this now.\n\nHelpful | 5\nDeveloper ResponseJul 15, 2019 at 9:43 AM\n\nThank you so much!", "BigelowedJun 2, 2019 at 1:55 PM\nAlready spooked\n\nAnd I only finished the first area so far, great work porting this to Quest!\n\nHelpful | 8", "agitokazuJun 18, 2019 at 3:49 PM\nLovin It!\n\nSo far, pretty well made from what I played... I'm into the Horror Genre especially in VR. Can't wait for this studios next installment into this genre\n\nHelpful | 7", "Chris_StaceyMay 26, 2019 at 7:52 AM\nSh** your pants scary!\n\nIf you're a fan of William Peter Blatty's The Exorcist you'll love love this! Atmospheric, intriguing and terrifying. This looks so good on the Quest, really impressive. If you're a horror fan you've got to get it!\n\nHelpful | 12", "captainchazOct 19 at 8:36 AM\nA Worthy Exorcist Entry\n\nNot only is this game worth its price; it's also worthy of its two main inspirations: The Exorcist and The Exorcist III. The game's beautiful, cerebral, and truly horrifying. I highly recommend it.\n\nHelpful | 9", "Charlie_LainezMay 23, 2019 at 3:17 PM\nFun and Scary\n\nThis game is worth the money, so scary I like it.\n\nHelpful | 16", "mikeukfan69Jul 4, 2019 at 10:50 PM\n\nDizzying\n\nHelpful | 3"]