{"App Title": "Thumper", "App description": "Thumper is rhythm violence: classic rhythm-action, blistering speed, and brutal physicality. You are a space beetle. Brave the hellish void and confront a maniacal giant head from the future.\n\nScream down the endless track and crash through punishing obstacles with simple, airtight controls. Hurtle forward, master new moves, reach overwhelming velocities, and survive epic boss battles. Every crushing impact is interwoven with a pounding original soundtrack. To reach synesthetic bliss, you must go through rhythm hell.\n\n* Nine levels of Rhythm Hell\n* Adrenalizing Boss Battles\n* Simple Controls: one stick and one button\n* Psychedelic Visuals\n* Original Soundtrack by Brian Gibson of noise-rock band Lightning Bolt", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Music", "Languages": "English, Chinese (China), Chinese (Taiwan), Danish, Dutch, Finnish, French (Canada), French (France), German, Italian, Japanese, Korean, Polish, Portuguese (Brazil), Russian, Spanish (Mexico), Swedish, Turkish", "Version + Release Notes": "1.00", "Developer": "Drool LLC", "Publisher": "Drool LLC", "Website": "http://thumpergame.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "HOME BLOG PRESSKIT MANUAL SUPPORT\nTHUMPER / DROOL LLC Terms of Service and Privacy Policy\n1. TERMS\n\nBy accessing the website at http://thumpergame.com or playing a THUMPER / DROOL LLC game, you are agreeing to be bound by these terms of service, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site or playing our games. The materials contained in this website and in games are protected by applicable copyright and trademark law.\n\n2. DISCLAIMER\n\nThe materials on THUMPER / DROOL LLC website and in games are provided on an as is basis. THUMPER / DROOL LLC makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties including, without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights.\n\nFurther, THUMPER / DROOL LLC does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its website or in games or otherwise relating to such materials or on any sites linked to this site.\n\n3. LIMITATIONS\n\nIn no event shall THUMPER / DROOL LLC or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials on THUMPER / DROOL LLC's website or in games, even if THUMPER / DROOL LLC or a THUMPER / DROOL LLC authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n4. ACCURACY OF MATERIALS\n\nThe materials appearing on THUMPER / DROOL LLCs website and in games could include technical, typographical, or photographic errors.THUMPER / DROOL LLC does not warrant that any of the materials on its website or in games are accurate, complete or current. THUMPER / DROOL LLC may make changes to the materials contained on its website or in games at any time without notice. However THUMPER / DROOL LLC does not make any commitment to update the materials.\n\n6. LINKS\n\nTHUMPER / DROOL LLC has not reviewed all of the sites linked to its website or in games and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by THUMPER / DROOL LLC of the site. Use of any such linked website is at the users own risk.\n\n7. MODIFICATIONS\n\nTHUMPER / DROOL LLC may revise these terms of service for its website or games at any time without notice. By using this website or playing games you are agreeing to be bound by the then current version of these terms of service.\n\n8. GOVERNING LAW\n\nThese terms and conditions are governed by and construed in accordance with the laws of the United Staes and you irrevocably submit to the exclusive jurisdiction of the courts in that State or location.\n\n9. INDEMNIFICATION FROM HARM, BODILY OR OTHERWISE\n\nYou acknowledge that THUMPER / DROOL LLC is not responsible directly or indirectly for any bodily or psychological harm and property damage you may experience while using its website or games. Play safe though. Dont hurt yourself.\n\nPrivacy Policy\n\nYour privacy is important to us.\n\nIt is THUMPER / DROOL LLCs policy to respect your privacy regarding any information we may collect while operating our website and games. Accordingly, we have developed this privacy policy in order for you to understand how we collect, use, communicate, disclose and otherwise make use of personal information. We have outlined our privacy policy below.\n\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\n\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\n\nWe will collect and use personal information solely for fulfilling those purposes specified by us and for other ancillary purposes, unless we obtain the consent of the individual concerned or as required by law.\n\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\n\nWe will protect personal information by using reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\n\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\n\nWe will only retain personal information for as long as necessary for the fulfillment of those purposes.\n\nWe will collect behavior and gameplay information only for non-nefarious purposes\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained.THUMPER / DROOL LLC may change this privacy policy from time to time at THUMPER / DROOL LLCs sole discretion\n\n Drool LLC 2013 - 2020 / THUMPER and logo are registered trademarks of Drool LLC /Terms of Service", "Developer Terms of Service": "HOME BLOG PRESSKIT MANUAL SUPPORT\nTHUMPER / DROOL LLC Terms of Service and Privacy Policy\n1. TERMS\n\nBy accessing the website at http://thumpergame.com or playing a THUMPER / DROOL LLC game, you are agreeing to be bound by these terms of service, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site or playing our games. The materials contained in this website and in games are protected by applicable copyright and trademark law.\n\n2. DISCLAIMER\n\nThe materials on THUMPER / DROOL LLC website and in games are provided on an as is basis. THUMPER / DROOL LLC makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties including, without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights.\n\nFurther, THUMPER / DROOL LLC does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its website or in games or otherwise relating to such materials or on any sites linked to this site.\n\n3. LIMITATIONS\n\nIn no event shall THUMPER / DROOL LLC or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials on THUMPER / DROOL LLC's website or in games, even if THUMPER / DROOL LLC or a THUMPER / DROOL LLC authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n4. ACCURACY OF MATERIALS\n\nThe materials appearing on THUMPER / DROOL LLCs website and in games could include technical, typographical, or photographic errors.THUMPER / DROOL LLC does not warrant that any of the materials on its website or in games are accurate, complete or current. THUMPER / DROOL LLC may make changes to the materials contained on its website or in games at any time without notice. However THUMPER / DROOL LLC does not make any commitment to update the materials.\n\n6. LINKS\n\nTHUMPER / DROOL LLC has not reviewed all of the sites linked to its website or in games and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by THUMPER / DROOL LLC of the site. Use of any such linked website is at the users own risk.\n\n7. MODIFICATIONS\n\nTHUMPER / DROOL LLC may revise these terms of service for its website or games at any time without notice. By using this website or playing games you are agreeing to be bound by the then current version of these terms of service.\n\n8. GOVERNING LAW\n\nThese terms and conditions are governed by and construed in accordance with the laws of the United Staes and you irrevocably submit to the exclusive jurisdiction of the courts in that State or location.\n\n9. INDEMNIFICATION FROM HARM, BODILY OR OTHERWISE\n\nYou acknowledge that THUMPER / DROOL LLC is not responsible directly or indirectly for any bodily or psychological harm and property damage you may experience while using its website or games. Play safe though. Dont hurt yourself.\n\nPrivacy Policy\n\nYour privacy is important to us.\n\nIt is THUMPER / DROOL LLCs policy to respect your privacy regarding any information we may collect while operating our website and games. Accordingly, we have developed this privacy policy in order for you to understand how we collect, use, communicate, disclose and otherwise make use of personal information. We have outlined our privacy policy below.\n\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\n\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\n\nWe will collect and use personal information solely for fulfilling those purposes specified by us and for other ancillary purposes, unless we obtain the consent of the individual concerned or as required by law.\n\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\n\nWe will protect personal information by using reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\n\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\n\nWe will only retain personal information for as long as necessary for the fulfillment of those purposes.\n\nWe will collect behavior and gameplay information only for non-nefarious purposes\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained.THUMPER / DROOL LLC may change this privacy policy from time to time at THUMPER / DROOL LLCs sole discretion\n\n Drool LLC 2013 - 2020 / THUMPER and logo are registered trademarks of Drool LLC /Terms of Service", "Space Required": "381.5 MB"}



["5 stars\n67%\n4 stars\n16%\n3 stars\n8%\n2 stars\n3%\n1 star\n6%", "Robertobob100Jun 21 at 10:23 PM\nReally fun and addictive!\n\nThis is one of my favorite rythem games on the quest. It deserves 5 stars but I have some feed back that changed that:\n\n-Plenty of levels but gets repetitive. There needs to be more variety in the art and gameplay.\n-gets hard to play for long because of all the hectic animations. What if you added a toggle in settings to dial back some of the detail. You could set it to off, mild, strong.\n-the giant face boss fights are fun but I wish there were different final bosses. Like a dragon or a snake or something\n\nI would give this game 5 stars if some of this could happen. Still an amazing game though.\n\nHelpful | 27", "Ihrie4 days ago\nQuite immersive, would recommend\n\nMy only criticism is the controls at times feel a tad wonky, it feels more designed for gamepad than a thumb stick. Doesnt really use the quest touch controllers to their fullest for a VR title. I realize this is likely due to it being a ported flat game but despite that it is still very well done. Honestly VR feels like the best medium for this sort of game.\n\nStill its a great experience and well worth snagging when on sale. Its definitely not an easy game but I do like the checkpoint system as you progress so I never got to frustrate.\n\nThumbs up I say.\n\nHelpful | 0", "MinisterofDOOMJul 23 at 6:17 PM\nOne of the best - VR or not\n\nThumper is one of my all-time favorites. It's such a well-polished, superbly-executed concept with a perfect difficulty curve (after Chapter 2...) and among the most rewarding gameplay I've ever experienced.\n\nI own Thumper on many platforms (including the Switch cartridge version) but I think on the Quest with my favorite headphones is the best theater yet for this experience. The 3D isn't world-changing in Thumper like it is in other genres, but it absolutely feels like a sensible step, and it makes the moving, breathing track feel even more visceral.\n\nI particularly enjoy the new Play + mode, where the challenge/reward cycle gets cranked up even further than in normal Thumper, and where a single mistake feels SO much more impactful even that death, as the whole world slows back down to normal speed. Scaling speed with the multiplier means you have more incentive than just points to improve, and it creates a razor's-edge balance of skill and patience that adds another layer to the game's tension and atmosphere.\n\nThumper is among the most cathartic and relaxing experiences available on any type of screen. Absolutely a must-have for Quest, even if you've already got other versions.\n\nHelpful | 6", "meduzo19 days ago\nGreat game with a lack of options\n\nThe game is fabulous and really immersive, it doesn't need to be VR but it suits awesomely well. Nonetheless, there are several things that I think could improve this to be a 5 star game:\n\n1. Can't be played without tracking: This game doesn't support to be played in the dark/without tracking which is a bummer since it clearly doesn't need to.\n\n2. Can't be played with one hand: To be able to play this one handed should be an option, it's totally possible but it doesn't have an option to do it.\n\n3. Pricey for what it is: I wouldn't recomend to get it for the full price, even though you will play this and get sucked right into it, it could benefit from a better pricepoint.\n\n4. Lack of music: The game doesn't have any music or track... it's all just the sound effects and a little bit of rhythmic patterns in the background, I get it that it's all part of the experience, but it would be nice to be able to play this game to an actual music track.\n\nAll in all it's a really well polished game, everything is shiny and pretty, but at the same time scary and eerie. I hope this game gets a sequel taking advantage of its potential.\n\nHelpful | 0", "K-otic20 days ago\nI dont get it...\n\nThis game has such great reviews, and I have seen comments like, terrifying, thrilling etc.. Maybe the game completely changes on later levels, but I played for about 20 minutes and it was one of the most boring experiences in VR I have ever had. Most of the time you stand completely still, and press the A button when prompted.. Sounds terrifying right? There is no reason for this to be in VR, as you never need to move your head or look anywhere but straight ahead. Again, maybe it changes after you put some time into it, but you couldnt force me to try it again to get to the supposed good part.. So boring! I will be requesting a refund.\n\nHelpful | 9", "garou191117 days ago\nAwesome rhythm game\n\nTrippy visuals, atmospheric music, and tight controls. If you want a legit rhythm gaming experience without a bunch of dlc pack spam, here it is\n\nHelpful | 0", "power2go3May 10 at 1:09 PM\nPretty awesome game\n\nI have fun playing with it, I really do. However something feels weird. The visuals are great and all, but sometimes when I get into the rhythm the games does something to throw me off (an unexpected turn for ex) and I kinda lose my flow.\nThere are plenty of levels and I've been playing it for a while but still haven't finished it, might be because I am not THAT attracted to it to \"binge\".\n\nOverall it's not amazing, but certainly above average.\n\nHelpful | 7", "TatsacoJun 19 at 10:49 PM\nThumper is a terrifying thriller!\n\nWow...I already knew what I was in for when I watched the gameplay video on my headset. It's just completely different than just watching it on a tv... My heart was beating so fast the entire time... sweating, heavy breathing.... You name it! I had been looking for a game that would really make me feel something. This was the game to do it. This is nightmare fuel. I'm sure my dreams will be haunted with the visuals I saw and the music I heard while playing this. LOVE IT!!! TOTALLY RECOMMEND.\n\nHelpful | 1", "billy.rockstar5619 days ago\nThumper\n\nAwesome game absolutely love this\n\nHelpful | 1", "calforbMay 9 at 8:22 AM\nPerfect for those days sitting\n\nSome days I prefer to sit and play. Thumper is a great example of a game that suits this type of play while offering amazing trippy and hypnotic visuals.\n\nI put of buying this for such a long time but finally gave in. Really happy with the purchase so far.\n\nHelpful | 6", "Guruguy6Jul 13 at 10:20 PM\nExcellent!\n\nOne of my all time favorite games!\n\nHelpful | 0", "faethflexJun 25 at 5:31 PM\nMore variety!\n\nRelease some new and imaginative content! I love the gameplay!\n\nHelpful | 0", "Nasty7512 days ago\nThumper\n\nThis game sucks and I couldnt get a refund.\n\nHelpful | 0", "qtipextraMar 20 at 5:21 PM\nTruly an awesome, thrilling ride!\n\nSee my full review on YouTube:\nIn 3D: https://www.youtube.com/watch?v=6E8fdTr8Fp4\nIn 2D: https://www.youtube.com/watch?v=x40IcPW4UmY\n\nThe controls for the game are super easy, but timing is everything, and mastering that will take some time and patience. The soundtrack is amazing! I love the feeling you get in-game, especially for the epic boss battles!\n\nAside from the actual gameplay and rhythm, this has some of the craziest visuals I have ever encountered in a sober environment. It's a one of a kind play, and I would definitely recommend you give it a full play through!\n\nHelpful | 14", "Juan-117Mar 31 at 2:15 PM\nReally Immersive!!!\n\nI highly recommend this game to anyone who enjoys rhythm games! The music is great and the visuals are psychedelic! Simple controls to use. Easy to get. There are nine levels and I just finished the first and I will redo it again to get perfect scores because thats how much fun this game is! I bought Thumper on the rift store since it is cross buy compatible and it was 50% as well so I only payed $9.99 instead of $19.99! Check it out since who doesnt like buying a game that is 50% off?!\n\nHelpful | 6", "MisterRobot69May 2 at 3:36 PM\nMy favorite vr game <3\n\nThis game was the reason to buy the quest. Love this game since day one on psvr.\n\nPls release an update for 3dof mode so we can play in the dark or in a moving vehicle like trains or cars on the back seat which is impossible in 6dof mode. Then u will get the 5th star!!\n\nHelpful | 1", "justsaewhenApr 26 at 6:57 PM\nStarts Hot\n\nI feel the game is stronger in the beginning, with the first couple of tracks being real head bangers. Much of the later game too hectic, and feels more trial and error. Still, 'tis a visual feast and meant to be a played in VR. Simple to pick up, but also easy to put down.\n\nIt is a tough one.\n\nThe bosses are quite a show.\n\nHelpful | 1", "psydzlApr 5 at 4:56 PM\nFantastic until level 3\n\nFantastic game. Loads of fun with lots of replay potential. The only weakness I've come across is that the controls are not well explained. First of all, you can use the trigger on the Quest instead of the A button, which I find easier. The biggest problem is the move called the \"ground pound.\" You have to fly into the air by holding the left joystick forward, then press A and hold it. When you fly over the next thump, pull the stick back and you will \"shoot\" down at it. At first, I was trying to land on it, which is basically impossible. You have to remember that you \"shoot\" when you're right over the thump, rather than pulling back the stick early to come down for a landing on top of it.\n\nHelpful | 4", "julian.ginesMar 1 at 12:54 AM\nGet. This. Game!!!\n\nI watched game plays. I watched the trailer. I looked at the photos and read reviews. Nothing, ABSOLUTELY NOTHING, does this game JUSTICE. This game is worth every penny. It's amazing, addictive, and intense. You start getting into a groove that, even when you die, you just keep going.\n\nHelpful | 22", "erik.wiessmannMar 28 at 5:06 PM\nI dont even want to like this game\n\nI bought this with full intent to try and return it. I do not know why but its currently my most played game. Its quite clean simple and fun. Its also unique relative to other games Ive tried. Highly recommend from a skeptic going in.\n\nHelpful | 6", "WiggstonApr 4 at 5:40 PM\nSweat while sitting down.\n\nThis game is intense. You're heart will race your palms will sweat and you'll realize you've been gripping the controllersway too hard. That is to say it's an absolute blast to play. I thought I had decent reaction time until this game put me in my place. Probably put in a solid 5-6 hours of playtime and I'm not done the campaign yet, let alone the + versions of each stage so between that and the unadulterated joy you'll get from mastering each stage it's a must get.\n\nHelpful | 2", "sukamanJun 5 at 7:02 PM\nUnderrated\n\nClassic game. Amazing experience in VR.\n\nHelpful | 0", "rehematApr 5 at 7:58 PM\nThere is no physicality-poor description\n\nThe description is deceptive. This is not a movement rhythm game like beat saber or synth riders. It came up as one recommended for me, and those are the ones that I get. Now I'm stuck with it and have wasted my money. I bought the bundle because it was like $5 more for 2 games. I did not know that they would refuse to give me a refund. There is no brutal physicality- why is that even in the description?! >8(\n\nHelpful | 5", "plasticdemonJun 3 at 11:04 AM\nyes.\n\nyes\nyes!!!!!\n\nHelpful | 0", "PropagandistPicturesJul 17 at 12:29 PM\nIncredible visuals and soundtrack\n\nThe only downside is you have to stay focussed on what moves you make and its hard to just appreciate the beautiful and intricate animations. I wish there was a mode where you could just ride the level like a roller coaster.\n\nStill very pleased with this game.\n\nHelpful | 0", "CloudTurtle27May 15 at 9:50 PM\nPure adrenaline\n\nFast paced adrenaline pumping trippy ride. Love it!\n\nHelpful | 1", "JimZMMar 25 at 11:07 AM\nAwesome, immersive, scary\n\nThe graphics is very immersive and 3D. The music and sound effects are stimulating. The gameplay/scoring rules seem simple yet the details are complex and not obvious. I had to look up the Thumper manual (thumpergame.com/manual) and a tutorial video to find out whether there's penalty for holding the jump button when there's nothing on the track, for example. However, for someone less OCD than me, perhaps the built-in tutorial is quite enough.\n\nHelpful | 1", "dor.kainMay 18 at 12:53 PM\nAmazing\n\nThis is a masterpiece!\n\nHelpful | 0", "bryan1070Mar 25 at 8:30 PM\nYes it's fun.\n\nThe visuals are awsome. You learn the game as you go. Its not hard to learn, although not simple to play. So you will get alot of fun time.\nYes it wild and I like it.\n\nHelpful | 3", "patrick.ryuxDec 26 at 3:56 AM\nAdrenaline and Speed\n\nI first of all really like the concept of this game. Let me get straight to the good things \n* Nice Graphic Style\n* Cool music and sound effects that fight the game very well\n* Out of the box game design\n* Unique Adrenaline rush after hitting combos properly\n\nNow to the things that made me rate it at only 4 stars \n* The how to part of the game is coming up while playing only for a short time and then never again, if you are not focused you might miss something that let's you get stuck in the same level forever\n* Starting from level 4 I found that I greatly have to calculate the lag of the wireless controllers into the equation to properly hit everything, running this game on a PC with a cable connected controller or keyboard for sure is an advantage\n* The final boss design is a slap in the face - all of the other design is so cool and psychedelic while the final stage bosses look like a 3 year old has designed them!!!\n\nOverall I still give a recommendation to buy it.. but a little work would have made it a perfect 5 star title\n\nHelpful | 27", "KalabonMar 27 at 7:28 PM\nPointless\n\nDon't waste your time or money. Boring and pointless. Maybe someone who's high will enjoy the psychedelic colors. You do not move your body at all. I just sit and watch.\n\nHelpful | 4", "00721Mar 11 at 8:18 AM\nGood game\n\nGreat game, but too fast for me!\n\nHelpful | 4", "DeepMellowJun 18 at 9:30 PM\nFix the low quality sound!! Update me\n\nSound quality is terrible. Very low sound quality makes the game way less immersive. Ive played this game on other platforms and the sound quality was fine. On the quest its the lowest possible quality. They never update it. Plays 10 times better on PSVR that came out 6 years ago. Should be free.\n\nHelpful | 4", "yayoubetchaJan 28 at 10:10 AM\nGo to recliner game\n\nWhen I just want to sit in my recliner, chill, and play an incredible game, this is what I pick. I love how Thumper teaches you how to play... rewards you for doing well...and punishes you for your mistakes. In my opinion, this is a must buy.\n\nHelpful | 5", "JackPingPingMar 8 at 8:31 PM\nLove it !!\n\nAnd amazing game that doesnt require to stand up , you can simply sit on the couch and then enjoy the ride !!!\nGreat music and amazing speed , fun and tensed ! Totally addicted and very well made !! Thanks !!\n\nHelpful | 8", "YT_LightningApr 1 at 3:06 PM\nJust plain hell\n\nThis game is a living hell, every level you get past the faster it gets. when you start playing play+ mode, its a nightmare. This is a really fun and addictive game.\n\nHelpful | 1", "ism1Dec 7 at 12:57 AM\nMesmerizing\n\nIve owned Thumper for awhile now, and played through all the levels. I didnt achieve an S on every level (or even close) but still had a blast. Addicting, hypnotic, unsettling, sometimes frightening, sometimes awe-inspiring, and relentlessly engaging.\n\nI was looking for a seated game to play tonight. Needed a break from pistols and sabers, and I spotted Thumper. Fired it up & it instantly drew me back in. Ill see how close I can get to filling levels with Ss this time.\n\nSome have complained that it doesnt utilize 6DoF enough to warrant its price point. Maybe the Go version would have sufficed (though I cant imagine using just one controller). But its no matter to me because Ive played this for countless hours & enjoyed every moment.\n\nHelpful | 20", "brytheguy98Jan 8 at 7:11 PM\nGood fun but feels wasted on vr\n\nEqually as fun as the console/PC versions, yet this VR version feels rather tacked-on and pointless seeing as all you do is push buttons to play just like if you were playing on a tv\n\nHelpful | 3", "freyadacMay 20 at 10:46 PM\nInsane!\n\nI'm not much for rhythm and music games, but this one I'm hooked on Love it\n\nHelpful | 0", "exjraordinaryDec 15 at 8:58 PM\ntalk about a must have\n\nI literally bought this 4 times ps vr switch iPad and oculus. and oculus so much better than ps VR tracking performance graphics and sound amazing. I think this was the best of the original ps vr line up and I still have this as a top game so many levels and so challenging. and anyone complaining about length play this huge amount of content and hyper intense you will learn to not blink lol. I'm only half way done in like 3 years really hard and fast but on quest I think its perfected and im finally getting far in it.\n\nHelpful | 3", "uiggiboyFeb 18 at 9:10 PM\n\nNice game !! Rush !!\n\nHelpful | 0", "AlexPrinzoDec 1 at 2:27 PM\nWhat in the....\n\nThats what I said to myself when I started this game. At first I was kinda meh with this one, but once you get the idea it really is challenging and fun. Id have to agree with the others that its quite the trippy game. The visuals are pretty crazy, and if you look at them too much it will cost you . Very unique idea for a game though, and to me it is worth what theyre asking imo. Im only on level 4, and Im very anxious to see how far the game can go. If I can criticize anything it would be cool if the game incorporated the entire vr experience. What I mean by that is being that youre on a fixed track, looking around is really all you can do with the headset. Youre really just performing the patterns laid out ahead of you, and looking around at the stunning visuals in between. Which dont get me wrong is still very immersive, but just something I thought about while playing. Maybe something they could incorporate into the next thumper? Overall though I think this is a title that anyone with an Oculus should most definitely invest in. Happy Thumping!\n\nHelpful | 5", "chitownguyJan 19 at 8:06 AM\nLast Level\n\nI love this game, but the last level game play goes into super slow motion. Is that supposed to happen?\n\nHelpful | 0", "debksurJan 25 at 6:52 AM\nyou seem to know whats coming but fun\n\nIt's ok but when you do a few of the games,you really know what is coming around the corner,no surprises. It is fun & colourful but getting bored after a while.\n\nHelpful | 2", "BringhurstOct 9 at 4:59 PM\nThis is MUSHROOMS\n\nHonest to god, this is a mushroom trip, intentionally, and the fact they pulled off the visuals is astounding. Those tentacles and spidery legs, the colors, are precisely what happens behind the eyelids, and it's phenomenal the energy and effects they've pulled off here. What an amazing game.\n\nHelpful | 26", "PeteyPakDec 2 at 9:56 AM\nOriginal in the best way\n\nI dont even like the gameplay. And the lack of introduction to whats going on is frustrating. But the atmosphere and the amazing visual job theyve done just blows me away, five stars because this has to be tried and recommended to others.\n\nHelpful | 2", "EyeballPrincessNov 17 at 12:46 AM\nFun enough, but not worth $20\n\nIt is a perfectly fine Simon game. It is fun enough. The music is good. As other reviewers mentioned, there is no leaning. It is all controller based movement. I don't know if this was originally a Gear or Go release, but it feels like one. If it goes on sale for $10, I recommend picking it up. It is definitely not worth $20. I played for about half an hour when I got it, but haven't picked it back up since.\n\nHelpful | 6", "galangelDec 31 at 10:57 AM\nfun to play and watch\n\ni love it, BUT, the sound quality is not so good.. i use quality headphones and the bass is kind of bad, and its a shame because the rhythm is great\n\nHelpful | 1", "atirathaNov 10 at 12:46 AM\nNice, but lots of alternatives\n\nMaybe it's time quest got a rhytm game, that's not physically demanding. I am sure there is market for that, as not everyone wants to sweat in Beat Saber. However, it still makes me feel like the game doesn't utilize Quest's potential fully. It seems to be a total port from Go, so can easily be played sitting down. Why not implement physical controls, such as leaning and jumping as options? That would really help the game.\n\nHelpful | 8", "seetoddDec 27 at 11:21 AM\nLooks great!\n\nFirst game i bought on my set up and it is awesome. Soundtrack is cool and it looks even better.\n\nHelpful | 1", "bragiAVApr 13 at 6:52 AM\nA classic gemstone - mandatory game!\n\nIf you totally lack rhythmic sense, then okay - you are excused. Everyone else - theres no excuse to exclude Thumper from your library!\nTrying to describe Thumper with words, is like trying to describe how the we would perceive the world in 4th dimensions. It need to be experienced, so I advise you to just skip reading and get the game immediately.\nPlease take the above mentioned in consideration if you still want to read my attempt to write a review (Im concerned could do more harm than good).\n\nOk, Thumper is a very different kind of game- first emphasizing the feel and atmosphere. A combination of a dreamlike rhythmic trance, deep meditation and a state of flow, as the players visual input and motoric output eventually synchronize. Neurological reaction patterns, and muscle coordination eventually fuses as an unison mental interaction.\nWithout a doubt one of my favorite games and a must buy for all fans of the music and rhythm category. Many will probably miss this gem while browsing the catalog, as it is easy to get the impression that Thumper is monotonous and repetitive. If that is the case, I think is a pity for those who potentially, unknowingly have a game love lost.\nThumper is different. Without comparison with other games in the same \"category\", eg Beat Saber, Audica, Pistol Whip etc. Thumper is unique and must be experienced. Games like Audica (my favorite game on Quest btw) and Beat Saber have the following common features and factors, which in my case provide tremendous fun and entertainment value. First and foremost is the playability / gameplay / feeling and atmosphere. That you get a sense of mastery regardless of skill level, yet a huge movement in progression and along the way, challenged and rewarded with great sense of mastery.\nHence, competitive instinct is triggered, climbing the score boards. Thumper achieve to deliver all of this with great success - seemingly small in the shadow of its large and lavish audience favorites, but brilliantly and uniquely executed. And btw ... one of the few games to be enjoyed anywhere - sitting or lying down. A sore thumb is probably the only thing I've suffered from physical discomfort. A small price to pay when youve been steering a shiny beetle for 5-6 hours through an interdimensional Bobsleigh lane - at furious speed, pounding cosmic tribal orchestral musical mayhem, pumped with adrenaline in visually stunning, amazingly terrifying trippy dreamscapes. Love it - highly recommended.\n\nHelpful | 1", "dave.s.mcgJan 4 at 4:51 PM\nIt's so fast...\n\nThis is the greatest sensation of speed on the quest.\n\nHelpful | 0", "cazbombNov 29 at 7:41 PM\nSuper addictive\n\nGreat game, slip into a psychedelic world and prepare to be come addicted! Challenging game, lots of fun. A masterpiece in terms of visuals and sound.\n\nHelpful | 2", "chaoswhistlerMar 26 at 8:41 AM\nLooks great, but not very fun\n\nIt looks excellent. It has an incredible visual style like no other game. But it doesn't feel like a rhythm game to me, and did not feel fun. I played to level 3. From other reviews, you can see many people love it. Maybe you will too.\n\nHelpful | 0", "Christopher_MFeb 2 at 1:19 PM\nInstructions\n\nThere were none. Didnt make sense how to play.\n\nHelpful | 1", "TarqiNov 27 at 5:21 PM\nSurreal Trip\n\nIf you're looking for a game to test your reflexes and suck you into a sci fi alien hellscape, this is the game for you. It's challenging, yet not frustrating, and the visuals are stunning.\n\nHelpful | 1", "youngpreciousgiftNov 12 at 9:15 PM\nEpic as f***\n\nSuch an awesome game. My favorite on the quest so far. Super creative, super trippy, super difficult!! Really rad, challenging game. Hats off to the sound designers behind this title especially, give them mfs a raise\n\nHelpful | 4", "GroovierInkMar 24 at 7:13 PM\nFun\n\nLove it so far. I enjoy that it doesnt have a boring tutorial or loading screens.\n\nHelpful | 1", "smredsoxguyOct 18 at 4:27 AM\nDark, Eerie, Musically & Visually Amazin\n\nLove this game! Its a nice break from standing and moving; u can play sitting. That doesnt mean it isnt intense. The music is pumping; and your dark view ahead really kicks off. Its a great game and you can often times find yourself getting lose in its world. Definitely recommend to Oculus Gamers....\n\nHelpful | 2", "keith.i.deeDec 22 at 10:53 AM\nLove it\n\nLove love love it.\n\nHelpful | 1", "HECK13Mar 30 at 6:49 AM\n\nGreat game\n\nHelpful | 0", "Proto_hereOct 7 at 9:56 PM\nGreat Game\n\nThumper is one of my favorite games and I own it on about 3 different devices, however this is my first time experiencing it in VR. VR is clearly the superior method of playstyle. The dread you feel as you play is exponentially higher with the immersion. It is a fantastic game in a new fantastic environment. I would recommend this game to anyone who is looking for a new arcade style game.\n\nHelpful | 2", "david.fensomOct 12 at 12:11 AM\nGreat Fun\n\nFirstly, I love this game, as you can play it sitting down. Sometimes, you cant always be leaping around the room. It starts out appearing quite simple. Just click a button to jump over a few obstacles. However, it soon becomes pretty manic! Love the visuals and music. Its even better with a proper set of headphones. One of my favourite games to date. Throughly recommend it.\n\nHelpful | 6", "UkaavanOct 31 at 3:19 AM\nEven better in VR\n\nOn other platforms I was a little meh about this game. It was fun but not great. I was hesitant to pay A$30.99 but it was 100% worth it. Easy to get into, difficult to master, just like all great rhythm games.\n\nHelpful | 3", "jeff.xu.7Nov 6 at 10:41 PM\nFeels like a theme park ride!\n\nThis is like a doomsday theme park ride that you get to take over and over again. If you are into those theme park rides where theres a projector and the seats move, this game is for you\n\nHelpful | 1", "KenyehWestOct 17 at 7:46 PM\nPut on your headphones\n\nFirst played this in PSVR, loved it so much I paid for it again on the Quest. Trippy graphics, awesome sound, challenging. Truly an experience at its best in VR.\n\nProTip, you can use the right trigger to do the jumps.\n\nHelpful | 4", "JPupRebOct 23 at 8:03 AM\nGreat immersive game!\n\nI have a broken leg at the moment, so was looking for something which doesnt need a lot of movement but is still really fun and immersive. So happy to have found this game!\n\nHelpful | 1", "polka_pandaOct 11 at 8:38 PM\nIts a trip!\n\nThis is a great game if youre looking for something you can play seated.\n\nIts a rythm game in form, but really it feels more like a trip disguised as a rythm game. The music is great, the visuals too. Highly recommended!\n\nHelpful | 1", "Keys76Nov 1 at 9:49 PM\nOne of my Favs\n\nThis is one of my favorite games on the Quest. Its a game thats addicting and can be played anywhere!!\n\nHelpful | 2", "barrychavOct 16 at 5:47 AM\nSublime Psychedelic Horror\n\nThis game is really something special. If you want an interesting (and at times frightening) experience, give this a go. The naysayers out there just don't understand what magic is.\n\nHelpful | 2", "hankyboy101Nov 9 at 10:28 PM\nAwesome\n\nAmazing visauls easy but hard game play headphones a must love it.\n\nHelpful | 1", "aliendave51Mar 26 at 3:05 PM\nNot for me\n\nIts ok but not for me\n\nHelpful | 0", "WillsQOct 15 at 3:25 PM\nDark and exhilerating\n\nThe visuals and audio are perfect - addictive when combined with the rhythm game element!\n\nHelpful | 1", "bartproctorOct 14 at 5:22 AM\nAwesome!\n\nSuperhot VR was our favorite until we got Thumper. Extremely addicting!\n\nHelpful | 1", "DrachenherzJul 10, 2019 at 1:03 AM\nThe definitive version of Thumper\n\nAs I've already bought Thumper for Steam and the Oculus Go, I was really, really torn whether to get it for the Quest or not. As I sold my Go in order to partially fund my quest, I couldn't play it on the go anymore (see what I did there? :-P ), so the itch to get it on the Quest was constantly growing.\n\nI finally caved in and got it for the Quest.\n\nAnd I have to say: Yeah, buying it again, and this time for the full price, hurt a bit. But it was worth it.\n\nGraphics are a little bit worse than the PCVR version, but not by far. But graphics are better than on the go, very fluid and a bit more detail/less aliasing. And the OLED screens do a very good job with this graphics style.\n\nGameplay is on par with PCVR, and out of the box way better than on the Go (no need for a gamepad, the touch controllers work very well).\n\nIn the end, the Quest Version is graphically almost on par with the PC version, has very good controlls without the need for an additional gamepad and it's a breeze to get into the game, just turn on the headset, don it, start up the game and you're good to go.\n\nThis is the definitive Version of this game!\n\nHelpful | 11", "jivemmAug 2, 2019 at 6:24 PM\nAwesome and Challenging\n\nYou know a game is good when you buy it on the PSVR... then on the GO to enjoy the freedom of playing it anywhere... and then again on the Quest to experience it anywhere but with better controls!! When room scale isn't an option, it is great to have a few good games that can be played in a tight space. I look forward to playing this one on my next long-haul flight. The gameplay is a simple premise but incredibly well executed and the challenge level just continues to grow. Not many VR games give you such a long gaming experience for those prepared to complete all levels.\n\nHelpful | 12", "Tummie555Jul 17, 2019 at 1:18 PM\nGaming future\n\nThis must be how gaming in 2033 feels like. Never experienced anything like it in 20+ years of gaming and I genuinely believe it's ahead of it's time. Props to the devs for delivering this to us now. Everybody who tried it seems to start breathing very deep and slow. It looks very relaxing from the outside, while inside the headset the gaming-trip is real. One of my favorites.\n\nHelpful | 18", "Darchangel3Jul 4, 2019 at 12:58 PM\nJust that much more CRISPY!\n\nThis coming from someone that first experienced Thumper on the Go. I had to buy it again cuz I COULDN'T get enough of that rhythm violence! The backgrounds look so much cleaner and the sense of scale for Crakhed felt even larger!\n\nHelpful | 11", "ruvalcaba2004May 28, 2019 at 5:16 PM\nGreat but no leaning? Really?\n\nThe visuals are amazing and the music is awesome. I especially love how the percussion is in time with your movements. BUT.... you have to use your thumb joystick to lean into turns? Really? You have so much freedom of movement and that joystick is so awkward. It seems like using your body to lean and turn is a no-brainer.\nPretty disappointing unfortunately. Hopefully they will release an update to take advantage of the ability to track your headset in order to lean around corners.\n\nHelpful | 247", "geenzcatSep 26, 2019 at 12:40 AM\nFan since the PS4\n\nNever tried it in VR, but holy crap this is a fantastic game.\n\nHelpful | 1", "dingoflingSep 15, 2019 at 5:10 PM\nThe Fear\n\nSynaptic modulation, dopamine ~45^Run8.pdf Mental Capacity, Psycocrytic S++ [] True\n\nHelpful | 3", "EdigsJul 26, 2019 at 7:26 AM\nAmazing trippy game\n\nI was playing Thumper on GO before and loved it so much that I bought it again for Quest. I'm happy to say it's a fantastic port. Graphics looks even better than on GO and it's a much smoother experience (higher frame rate). Also, Touch controllers are great for playing. No need for Xbox controller anymore.\n\nHelpful | 2", "4950ESPHRNov 10 at 1:06 PM\nAwful!\n\nNo instructions...SUCKS!\n\nHelpful | 0", "GayDukeNukemJul 17, 2019 at 12:23 AM\nOh sober up!\n\nWhen you start, their should be a screen that asks \"are you high\" and if you click NO it just gives you an instant refund\n\nHelpful | 26", "JoyOverloadJul 16, 2019 at 4:44 AM\n\ncons: not really a 360 vr experience\npros: visually stunning; super fun to play; challenging; you can play sitting down; easy control mechanics; a great pickup and play game.\nYes - you should this!\n\nHelpful | 7", "SysebosMay 26, 2019 at 1:01 AM\nOne Psychedelic Beattle\n\nThumper presents itself as another great title among the rest in VR! You guide a beetle through an intimidating and ominous yet impressive visual landscape working to avoid obstacles timed to the beat of the game's energetic soundtrack. The difficulty, complexity and speed of the obstacles will increase the further you go, forcing you to to string together a steady combination of moves which will prove to be a great challenge at times. This game is also one where you won't necessarily have to move around a whole lot, if at all, and can simply be played standing still or sitting down. It's a simple yet effective formula and makes for certainly trippy but welcome addition to the Quest's growing game library!\n\nHelpful | 21", "lethe1977Jun 2, 2019 at 2:57 AM\nAmazing but limited shelf life\n\nDefinitely an experience you must try. Highly polished and visually awesome, the initial WOW factor slowly wears off as you take that this is a very basic game with some unique bells and whistles...but what bells and whistles! I didn't really buy into the whole Lovecraftian existential horror thing u til I played it, and can say yes, there is something to this. In my opinion though, the notion of this being a \"rhythm\" game is a bit tenuous.... don't expect a beat saber or dance whatever type challenge.\n\nHelpful | 10", "Stinkfist44Jul 6, 2019 at 11:48 PM\nGet it!\n\nI was looking for a game I could just sit down, relax and play... this is perfect! I dont always feels like rearranging my furniture and going full ninja. I was hesitant to buy this at first but Im very glad I finally did.\n\nHelpful | 4", "TomatenmannMay 28, 2019 at 6:16 AM\nAlmost perfect!\n\nI already played Thumper on PSVR and Rift and was blown away by it every time. The Quest port is just as good. Only minor complaint I have is that the backgrounds look a bit grainy in this version.\n\nDescribing Thumper as a rhythm violence game is absolutely justified. Graphics, sound and gameplay harmonizing so well... it's almost like meditative tunnelvision. And please turn up the volume!\n\nHelpful | 8", "NoWhereMan1019May 20, 2019 at 9:11 PM\nTrippy rhythm game\n\nOne of the best VR rhythm games out there. Props to the devs for supporting cross buy!\n\nHelpful | 19", "andyphillips99Jul 30, 2019 at 1:23 PM\nMmmm its ok\n\nLooks pretty - gameplay is quite good, nothing to shout about.. would get 5 stars at a lower price\n\nHelpful | 0", "BEATM0NKJul 14, 2019 at 2:31 PM\nFun and easy to learn\n\nMore music variety would be nice\n\nHelpful | 2", "tacomccaSep 27, 2019 at 11:58 PM\nWeird game\n\nA trippy seated experiance that is a simple arcade game made terryifing by VR\n\nHelpful | 2", "SweepingMay 23, 2019 at 7:07 PM\nVery slick visuals and music\n\nI felt like I was in a trance sliding around in another dimension\n\nHelpful | 8", "darwins.lastJun 3, 2019 at 6:06 PM\nGorgeous Adrenaline\n\nOne of the most intense games in VR. Headphones are a must! Very fun... dream-like.\n\nHelpful | 5"]