{"App Title": "Tilt Brush", "App description": "Tilt Brush lets you paint in 3D space with virtual reality. \n\nUnleash your creativity with three-dimensional brush strokes, stars, light, and even fire. Your room is your canvas. Your palette is your imagination. \n\nThe possibilities are endless.", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contentsOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Art/Creativity, Casual, Productivity", "Languages": "English", "Version + Release Notes": "23.2-28f36f08b", "Developer": "Google", "Publisher": "Google", "Website": "https://www.tiltbrush.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Privacy & Terms\nOverview\nPrivacy Policy\nTerms of Service\nTechnologies\nFAQ\nGoogle Account\nIntroduction\nInformation Google collects\nWhy Google collects data\nYour privacy controls\nSharing your information\nKeeping your information secure\nExporting & deleting your information\nRetaining your information\nCompliance & cooperation with regulators\nAbout this policy\nRelated privacy practices\nData transfer frameworks\nKey terms\nPartners\nUpdates\nGOOGLE PRIVACY POLICY\n\nWhen you use our services, youre trusting us with your information. We understand this is a big responsibility and work hard to protect your information and put you in control.\n\nThis Privacy Policy is meant to help you understand what information we collect, why we collect it, and how you can update, manage, export, and delete your information.\n\nEffective July 1, 2020 | Archived versions | Download PDF\n\nWe build a range of services that help millions of people daily to explore and interact with the world in new ways. Our services include:\n\nGoogle apps, sites, and devices, like Search, YouTube, and Google Home\nPlatforms like the Chrome browser and Android operating system\nProducts that are integrated into third-party apps and sites, like ads and embedded Google Maps\n\nYou can use our services in a variety of ways to manage your privacy. For example, you can sign up for a Google Account if you want to create and manage content like emails and photos, or see more relevant search results. And you can use many Google services when youre signed out or without creating an account at all, like searching on Google or watching YouTube videos. You can also choose to browse the web privately using Chrome in Incognito mode. And across our services, you can adjust your privacy settings to control what we collect and how your information is used.\n\nTo help explain things as clearly as possible, weve added examples, explanatory videos, and definitions for key terms. And if you have any questions about this Privacy Policy, you can contact us.\n\nINFORMATION GOOGLE COLLECTS\n\nWe want you to understand the types of information we collect as you use our services\n\nWe collect information to provide better services to all our users  from figuring out basic stuff like which language you speak, to more complex things like which ads youll find most useful, the people who matter most to you online, or which YouTube videos you might like. The information Google collects, and how that information is used, depends on how you use our services and how you manage your privacy controls.\n\nWhen youre not signed in to a Google Account, we store the information we collect with unique identifiers tied to the browser, application, or device youre using. This helps us do things like maintain your language preferences across browsing sessions.\n\nWhen youre signed in, we also collect information that we store with your Google Account, which we treat as personal information.\n\nThings you create or provide to us\n\nWhen you create a Google Account, you provide us with personal information that includes your name and a password. You can also choose to add a phone number or payment information to your account. Even if you arent signed in to a Google Account, you might choose to provide us with information  like an email address to receive updates about our services.\n\nWe also collect the content you create, upload, or receive from others when using our services. This includes things like email you write and receive, photos and videos you save, docs and spreadsheets you create, and comments you make on YouTube videos.\n\nInformation we collect as you use our services\nYour apps, browsers & devices\n\nWe collect information about the apps, browsers, and devices you use to access Google services, which helps us provide features like automatic product updates and dimming your screen if your battery runs low.\n\nThe information we collect includes unique identifiers, browser type and settings, device type and settings, operating system, mobile network information including carrier name and phone number, and application version number. We also collect information about the interaction of your apps, browsers, and devices with our services, including IP address, crash reports, system activity, and the date, time, and referrer URL of your request.\n\nWe collect this information when a Google service on your device contacts our servers  for example, when you install an app from the Play Store or when a service checks for automatic updates. If youre using an Android device with Google apps, your device periodically contacts Google servers to provide information about your device and connection to our services. This information includes things like your device type, carrier name, crash reports, and which apps you've installed.\n\nYour activity\n\nWe collect information about your activity in our services, which we use to do things like recommend a YouTube video you might like. The activity information we collect may include:\n\nTerms you search for\nVideos you watch\nViews and interactions with content and ads\nVoice and audio information when you use audio features\nPurchase activity\nPeople with whom you communicate or share content\nActivity on third-party sites and apps that use our services\nChrome browsing history youve synced with your Google Account\n\nIf you use our services to make and receive calls or send and receive messages, we may collect telephony log information like your phone number, calling-party number, receiving-party number, forwarding numbers, time and date of calls and messages, duration of calls, routing information, and types of calls.\n\nYou can visit your Google Account to find and manage activity information thats saved in your account.\n\nGo to Google Account\n\nYour location information\n\nWe collect information about your location when you use our services, which helps us offer features like driving directions for your weekend getaway or showtimes for movies playing near you.\n\nYour location can be determined with varying degrees of accuracy by:\n\nGPS\nIP address\nSensor data from your device\nInformation about things near your device, such as Wi-Fi access points, cell towers, and Bluetooth-enabled devices\n\nThe types of location data we collect depend in part on your device and account settings. For example, you can turn your Android devices location on or off using the devices settings app. You can also turn on Location History if you want to create a private map of where you go with your signed-in devices.\n\nIn some circumstances, Google also collects information about you from publicly accessible sources. For example, if your name appears in your local newspaper, Googles Search engine may index that article and display it to other people if they search for your name. We may also collect information about you from trusted partners, including marketing partners who provide us with information about potential customers of our business services, and security partners who provide us with information to protect against abuse. We also receive information from advertisers to provide advertising and research services on their behalf.\n\nWe use various technologies to collect and store information, including cookies, pixel tags, local storage, such as browser web storage or application data caches, databases, and server logs.\n\nWHY GOOGLE COLLECTS DATA\n\nWe use data to build better services\n\nWe use the information we collect from all our services for the following purposes:\n\nProvide our services\n\nWe use your information to deliver our services, like processing the terms you search for in order to return results or helping you share content by suggesting recipients from your contacts.\n\nMaintain & improve our services\n\nWe also use your information to ensure our services are working as intended, such as tracking outages or troubleshooting issues that you report to us. And we use your information to make improvements to our services  for example, understanding which search terms are most frequently misspelled helps us improve spell-check features used across our services.\n\nDevelop new services\n\nWe use the information we collect in existing services to help us develop new ones. For example, understanding how people organized their photos in Picasa, Googles first photos app, helped us design and launch Google Photos.\n\nProvide personalized services, including content and ads\n\nWe use the information we collect to customize our services for you, including providing recommendations, personalized content, and customized search results. For example, Security Checkup provides security tips adapted to how you use Google products. And Google Play uses information like apps youve already installed and videos youve watched on YouTube to suggest new apps you might like.\n\nDepending on your settings, we may also show you personalized ads based on your interests. For example, if you search for mountain bikes, you may see an ad for sports equipment when youre browsing a site that shows ads served by Google. You can control what information we use to show you ads by visiting your ad settings.\n\nWe dont show you personalized ads based on sensitive categories, such as race, religion, sexual orientation, or health.\nWe dont share information that personally identifies you with advertisers, such as your name or email, unless you ask us to. For example, if you see an ad for a nearby flower shop and select the tap to call button, well connect your call and may share your phone number with the flower shop.\n\nGo to Ad Settings\n\nMeasure performance\n\nWe use data for analytics and measurement to understand how our services are used. For example, we analyze data about your visits to our sites to do things like optimize product design. And we also use data about the ads you interact with to help advertisers understand the performance of their ad campaigns. We use a variety of tools to do this, including Google Analytics. When you visit sites that use Google Analytics, Google and a Google Analytics customer may link information about your activity from that site with activity from other sites that use our ad services.\n\nCommunicate with you\n\nWe use information we collect, like your email address, to interact with you directly. For example, we may send you a notification if we detect suspicious activity, like an attempt to sign in to your Google Account from an unusual location. Or we may let you know about upcoming changes or improvements to our services. And if you contact Google, well keep a record of your request in order to help solve any issues you might be facing.\n\nProtect Google, our users, and the public\n\nWe use information to help improve the safety and reliability of our services. This includes detecting, preventing, and responding to fraud, abuse, security risks, and technical issues that could harm Google, our users, or the public.\n\nWe use different technologies to process your information for these purposes. We use automated systems that analyze your content to provide you with things like customized search results, personalized ads, or other features tailored to how you use our services. And we analyze your content to help us detect abuse such as spam, malware, and illegal content. We also use algorithms to recognize patterns in data. For example, Google Translate helps people communicate across languages by detecting common language patterns in phrases you ask it to translate.\n\nWe may combine the information we collect among our services and across your devices for the purposes described above. For example, if you watch videos of guitar players on YouTube, you might see an ad for guitar lessons on a site that uses our ad products. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Googles services and the ads delivered by Google.\n\nIf other users already have your email address or other information that identifies you, we may show them your publicly visible Google Account information, such as your name and photo. This helps people identify an email coming from you, for example.\n\nWell ask for your consent before using your information for a purpose that isnt covered in this Privacy Policy.\n\nYOUR PRIVACY CONTROLS\n\nYou have choices regarding the information we collect and how it's used\n\nThis section describes key controls for managing your privacy across our services. You can also visit the Privacy Checkup, which provides an opportunity to review and adjust important privacy settings. In addition to these tools, we also offer specific privacy settings in our products  you can learn more in our Product Privacy Guide.\n\nGo to Privacy Checkup\n\nManaging, reviewing, and updating your information\n\nWhen youre signed in, you can always review and update information by visiting the services you use. For example, Photos and Drive are both designed to help you manage specific types of content youve saved with Google.\n\nWe also built a place for you to review and control information saved in your Google Account. Your Google Account includes:\n\nPrivacy controls\nActivity Controls\n\nDecide what types of activity youd like saved in your account. For example, you can turn on Location History if you want traffic predictions for your daily commute, or you can save your YouTube Watch History to get better video suggestions.\n\nGo to Activity Controls\n\nAd settings\n\nManage your preferences about the ads shown to you on Google and on sites and apps that partner with Google to show ads. You can modify your interests, choose whether your personal information is used to make ads more relevant to you, and turn on or off certain advertising services.\n\nGo to Ad Settings\n\nAbout you\n\nControl what others see about you across Google services.\n\nGo to About You\n\nShared endorsements\n\nChoose whether your name and photo appear next to your activity, like reviews and recommendations, that appear in ads.\n\nGo to Shared Endorsements\n\nInformation you share\n\nIf youre a G Suite user, control whom you share information with through your account on Google+.\n\nGo to Information You Share\n\nWays to review & update your information\nMy Activity\n\nMy Activity allows you to review and control data thats created when you use Google services, like searches youve done or your visits to Google Play. You can browse by date and by topic, and delete part or all of your activity.\n\nGo to My Activity\n\nGoogle Dashboard\n\nGoogle Dashboard allows you to manage information associated with specific products.\n\nGo to Dashboard\n\nYour personal information\n\nManage your contact information, such as your name, email, and phone number.\n\nGo to Personal Info\n\nWhen youre signed out, you can manage information associated with your browser or device, including:\n\nSigned-out search personalization: Choose whether your search activity is used to offer you more relevant results and recommendations.\nYouTube settings: Pause and delete your YouTube Search History and your YouTube Watch History.\nAd Settings: Manage your preferences about the ads shown to you on Google and on sites and apps that partner with Google to show ads.\nExporting, removing & deleting your information\n\nYou can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.\n\nExport your data\n\nYou can also request to remove content from specific Google services based on applicable law.\n\nTo delete your information, you can:\n\nDelete your content from specific Google services\nSearch for and then delete specific items from your account using My Activity\nDelete specific Google products, including your information associated with those products\nDelete your entire Google Account\n\nDelete your information\n\nAnd finally, Inactive Account Manager allows you to give someone else access to parts of your Google Account in case youre unexpectedly unable to use your account.\n\nThere are other ways to control the information Google collects whether or not youre signed in to a Google Account, including:\n\nBrowser settings: For example, you can configure your browser to indicate when Google has set a cookie in your browser. You can also configure your browser to block all cookies from a specific domain or all domains. But remember that our services rely on cookies to function properly, for things like remembering your language preferences.\nDevice-level settings: Your device may have controls that determine what information we collect. For example, you can modify location settings on your Android device.\nSHARING YOUR INFORMATION\nWhen you share your information\n\nMany of our services let you share information with other people, and you have control over how you share. For example, you can share videos on YouTube publicly or you can decide to keep your videos private. Remember, when you share information publicly, your content may become accessible through search engines, including Google Search.\n\nWhen youre signed in and interact with some Google services, like leaving comments on a YouTube video or reviewing an app in Play, your name and photo appear next to your activity. We may also display this information in ads depending on your Shared endorsements setting.\n\nWhen Google shares your information\n\nWe do not share your personal information with companies, organizations, or individuals outside of Google except in the following cases:\n\nWith your consent\n\nWell share personal information outside of Google when we have your consent. For example, if you use Google Home to make a reservation through a booking service, well get your permission before sharing your name or phone number with the restaurant. Well ask for your explicit consent to share any sensitive personal information.\n\nWith domain administrators\n\nIf youre a student or work for an organization that uses Google services (like G Suite), your domain administrator and resellers who manage your account will have access to your Google Account. They may be able to:\n\nAccess and retain information stored in your account, like your email\nView statistics regarding your account, like how many apps you install\nChange your account password\nSuspend or terminate your account access\nReceive your account information in order to satisfy applicable law, regulation, legal process, or enforceable governmental request\nRestrict your ability to delete or edit your information or your privacy settings\nFor external processing\n\nWe provide personal information to our affiliates and other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures. For example, we use service providers to help us with customer support.\n\nFor legal reasons\n\nWe will share personal information outside of Google if we have a good-faith belief that access, use, preservation, or disclosure of the information is reasonably necessary to:\n\nMeet any applicable law, regulation, legal process, or enforceable governmental request. We share information about the number and type of requests we receive from governments in our Transparency Report.\nEnforce applicable Terms of Service, including investigation of potential violations.\nDetect, prevent, or otherwise address fraud, security, or technical issues.\nProtect against harm to the rights, property or safety of Google, our users, or the public as required or permitted by law.\n\nWe may share non-personally identifiable information publicly and with our partners  like publishers, advertisers, developers, or rights holders. For example, we share information publicly to show trends about the general use of our services. We also allow specific partners to collect information from your browser or device for advertising and measurement purposes using their own cookies or similar technologies.\n\nIf Google is involved in a merger, acquisition, or sale of assets, well continue to ensure the confidentiality of your personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nKEEPING YOUR INFORMATION SECURE\n\nWe build security into our services to protect your information\n\nAll Google products are built with strong security features that continuously protect your information. The insights we gain from maintaining our services help us detect and automatically block security threats from ever reaching you. And if we do detect something risky that we think you should know about, well notify you and help guide you through steps to stay better protected.\n\nWe work hard to protect you and Google from unauthorized access, alteration, disclosure, or destruction of information we hold, including:\n\nWe use encryption to keep your data private while in transit\nWe offer a range of security features, like Safe Browsing, Security Checkup, and 2 Step Verification to help you protect your account\nWe review our information collection, storage, and processing practices, including physical security measures, to prevent unauthorized access to our systems\nWe restrict access to personal information to Google employees, contractors, and agents who need that information in order to process it. Anyone with this access is subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nEXPORTING & DELETING YOUR INFORMATION\n\nYou can export a copy of your information or delete it from your Google Account at any time\n\nYou can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.\n\nExport your data\n\nTo delete your information, you can:\n\nDelete your content from specific Google services\nSearch for and then delete specific items from your account using My Activity\nDelete specific Google products, including your information associated with those products\nDelete your entire Google Account\n\nDelete your information\n\nRETAINING YOUR INFORMATION\n\nWe retain the data we collect for different periods of time depending on what it is, how we use it, and how you configure your settings:\n\nSome data you can delete whenever you like, such as the content you create or upload. You can also delete activity information saved in your account, or choose to have it deleted automatically after a set period of time.\nOther data is deleted or anonymized automatically after a set period of time, such as advertising data in server logs.\nWe keep some data until you delete your Google Account, such as information about how often you use our services.\nAnd some data we retain for longer periods of time when necessary for legitimate business or legal purposes, such as security, fraud and abuse prevention, or financial record-keeping.\n\nWhen you delete data, we follow a deletion process to make sure that your data is safely and completely removed from our servers or retained only in anonymized form. We try to ensure that our services protect information from accidental or malicious deletion. Because of this, there may be delays between when you delete something and when copies are deleted from our active and backup systems.\n\nYou can read more about Googles data retention periods, including how long it takes us to delete your information.\n\nCOMPLIANCE & COOPERATION WITH REGULATORS\n\nWe regularly review this Privacy Policy and make sure that we process your information in ways that comply with it.\n\nData transfers\n\nWe maintain servers around the world and your information may be processed on servers located outside of the country where you live. Data protection laws vary among countries, with some providing more protection than others. Regardless of where your information is processed, we apply the same protections described in this policy. We also comply with certain legal frameworks relating to the transfer of data, such as the EU-U.S. and Swiss-U.S. Privacy Shield Frameworks.\n\nWhen we receive formal written complaints, we respond by contacting the person who made the complaint. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of your data that we cannot resolve with you directly.\n\nCalifornia requirements\n\nThe California Consumer Privacy Act (CCPA) requires specific disclosures for California residents.\n\nThis Privacy Policy is designed to help you understand how Google handles your information:\n\nWe explain the categories of information Google collects and the sources of that information in Information Google collects.\nWe explain how Google uses information in Why Google collects data.\nWe explain when Google may share information in Sharing your information. Google does not sell your personal information.\n\nThe CCPA also provides the right to request information about how Google collects, uses, and discloses your personal information. And it gives you the right to access your information and request that Google delete that information. Finally, the CCPA provides the right to not be discriminated against for exercising your privacy rights.\n\nWe describe the choices you have to manage your privacy and data across Googles services in Your privacy controls. You can exercise your rights by using these controls, which allow you to access, review, update and delete your information, as well as export and download a copy of it. When you use them, well validate your request by verifying that youre signed in to your Google Account. If you have questions or requests related to your rights under the CCPA, you (or your authorized agent) can also contact Google.\n\nThe CCPA requires a description of data practices using specific categories. This table uses these categories to organize the information in this Privacy Policy.\n\nCategories of personal information we collect\n\nIdentifiers such as your name, phone number, and address, as well as unique identifiers tied to the browser, application, or device youre using.\n\nDemographic information, such as your age, gender and language.\n\nCommercial information such as your payment information and a history of purchases you make on Googles services.\n\nBiometric information if you choose to provide it, such as fingerprints in Googles product development studies.\n\nInternet, network, and other activity information such as your search terms; views and interactions with content and ads; Chrome browsing history youve synced with your Google Account; information about the interaction of your apps, browsers, and devices with our services (like IP address, crash reports, and system activity); and activity on third-party sites and apps that use our services. You can review and control activity data stored in your Google Account in My Activity.\n\nGeolocation data, such as may be determined by GPS, IP address, and other data from sensors on or around your device, depending in part on your device and account settings. Learn more about Googles use of location information.\n\nAudio, electronic, visual and similar information, such as voice and audio information when you use audio features.\n\nProfessional, employment, and education information, such as information you provide or that is maintained through a G Suite account by an organization at which you study or work.\n\nOther information you create or provide, such as the content you create, upload, or receive (like photos and videos or emails, docs and spreadsheets). Google Dashboard allows you to manage information associated with specific products.\n\nInferences drawn from the above, like your ads interest categories.\n\nBusiness purposes for which information may be used or disclosed\n\nProtecting against security threats, abuse, and illegal activity: Google uses and may disclose information to detect, prevent and respond to security incidents, and for protecting against other malicious, deceptive, fraudulent, or illegal activity. For example, to protect our services, Google may receive or disclose information about IP addresses that malicious actors have compromised.\n\nAuditing and measurement: Google uses information for analytics and measurement to understand how our services are used, as well as to fulfill obligations to our partners like publishers, advertisers, developers, or rights holders. We may disclose non-personally identifiable information publicly and with these partners, including for auditing purposes.\n\nMaintaining our services: Google uses information to ensure our services are working as intended, such as tracking outages or troubleshooting bugs and other issues that you report to us.\n\nResearch and development: Google uses information to improve our services and to develop new products, features and technologies that benefit our users and the public. For example, we use publicly available information to help train Googles language models and build features like Google Translate.\n\nUse of service providers: Google shares information with service providers to perform services on our behalf, in compliance with our Privacy Policy and other appropriate confidentiality and security measures. For example, we may rely on service providers to help provide customer support.\n\nAdvertising: Google processes information, including online identifiers and information about your interactions with advertisements, to provide advertising. This keeps Googles services and many of the websites and services you use free of charge. You can control what information we use to show you ads by visiting your ad settings.\n\nLegal reasons: Google also uses information to satisfy applicable laws or regulations, and discloses information in response to legal process or enforceable government requests, including to law enforcement. We provide information about the number and type of requests we receive from governments in our Transparency Report.\n\nParties with whom information may be shared\n\nOther people with whom you choose to share your information, like docs or photos, and videos or comments on YouTube.\n\nThird parties to whom you consent to sharing your information, such as services that integrate with Googles services. You can review and manage third party apps and sites with access to data in your Google Account.\n\nService providers, trusted businesses or persons that process information on Googles behalf, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nDomain administrators, if you work or study at an organization that uses Google services like G Suite.\n\nLaw enforcement or other third parties, for the legal reasons described in Sharing your information.\n\nABOUT THIS POLICY\nWhen this policy applies\n\nThis Privacy Policy applies to all of the services offered by Google LLC and its affiliates, including YouTube, Android, and services offered on third-party sites, such as advertising services. This Privacy Policy doesnt apply to services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nThis Privacy Policy doesnt apply to:\n\nThe information practices of other companies and organizations that advertise our services\nServices offered by other companies or individuals, including products or sites that may include Google services, be displayed to you in search results, or be linked from our services\nChanges to this policy\n\nWe change this Privacy Policy from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We always indicate the date the last changes were published and we offer access to archived versions for your review. If changes are significant, well provide a more prominent notice (including, for certain services, email notification of Privacy Policy changes).\n\nRELATED PRIVACY PRACTICES\nSpecific Google services\n\nThe following privacy notices provide additional information about some Google services:\n\nChrome & the Chrome Operating System\nPlay Books\nPayments\nFiber\nGoogle Fi\nG Suite for Education\nYouTube Kids\nGoogle Accounts Managed with Family Link, for Children under 13 (or applicable age in your country)\nVoice and Audio Collection from Childrens Features on the Google Assistant\nOther useful resources\n\nThe following links highlight useful resources for you to learn more about our practices and privacy settings.\n\nYour Google Account is home to many of the settings you can use to manage your account\nPrivacy Checkup guides you through key privacy settings for your Google Account\nGoogles safety center helps you learn more about our built-in security, privacy controls, and tools to help set digital ground rules for your family online\nPrivacy & Terms provides more context regarding this Privacy Policy and our Terms of Service\nTechnologies includes more information about:\nHow Google uses cookies\nTechnologies used for Advertising\nHow Google uses pattern recognition to recognize things like faces in photos\nHow Google uses information from sites or apps that use our services\nChange language:\nAfrikaans\nBahasa Indonesia\nBahasa Melayu\nCatal\netina\nDansk\nDeutsch\nEesti\nEnglish\nEnglish (United Kingdom)\nEspaol\nEspaol (Latinoamrica)\nEuskara\nFilipino\nFranais\nFranais (Canada)\nGalego\nHrvatski\nIsizulu\nslenska\nItaliano\nKiswahili\nLatvieu\nLietuvi\nMagyar\nNederlands\nNorsk\nPolski\nPortugus (Brasil)\nPortugus (Portugal)\nRomn\nSlovenina\nSlovenina\nSrpski\nSuomi\nSvenska\nTing Vit\nTrke\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ()\n\n\n\nGoogleAbout GooglePrivacyTerms", "Developer Terms of Service": "Privacy & Terms\nOverview\nPrivacy Policy\nTerms of Service\nTechnologies\nFAQ\nGoogle Account\nIntroduction\nYour relationship with Google\nUsing Google services\nContent in Google services\nSoftware in Google services\nIn case of problems or disagreements\nAbout these terms\nUpdates\nDefinitions\nList of services & service-specific additional terms\nHow Google handles government requests for user information\nGOOGLE TERMS OF SERVICE\n\nEffective March 31, 2020 | Archived versions | Download PDF\n\nWhats covered in these terms\nWe know its tempting to skip these Terms of Service, but its important to establish what you can expect from us as you use Google services, and what we expect from you.\n\nThese Terms of Service reflect the way Googles business works, the laws that apply to our company, and certain things weve always believed to be true. As a result, these Terms of Service help define Googles relationship with you as you interact with our services. For example, these terms include the following topic headings:\n\nWhat you can expect from us, which describes how we provide and develop our services\nWhat we expect from you, which establishes certain rules for using our services\nContent in Google services, which describes the intellectual property rights to the content you find in our services  whether that content belongs to you, Google, or others\nIn case of problems or disagreements, which describes other legal rights you have, and what to expect in case someone violates these terms\n\nUnderstanding these terms is important because, by using our services, youre agreeing to these terms.\n\nBesides these terms, we also publish a Privacy Policy. Although its not part of these terms, we encourage you to read it to better understand how you can update, manage, export, and delete your information.\n\nService provider\n\nGoogle services are provided by, and youre contracting with:\n\nGoogle LLC\norganized under the laws of the State of Delaware, USA, and operating under the laws of the USA\n\n1600 Amphitheatre Parkway\nMountain View, California 94043\nUSA\n\nAge requirements\n\nIf youre under the age required to manage your own Google Account, you must have your parent or legal guardians permission to use a Google Account. Please have your parent or legal guardian read these terms with you.\n\nIf youre a parent or legal guardian, and you allow your child to use the services, then these terms apply to you and youre responsible for your childs activity on the services.\n\nSome Google services have additional age requirements as described in their service-specific additional terms and policies.\n\nYour relationship with Google\n\nThese terms help define the relationship between you and Google. Broadly speaking, we give you permission to use our services if you agree to follow these terms, which reflect how Googles business works and how we earn money. When we speak of Google, we, us, and our, we mean Google LLC and its affiliates.\n\nWhat you can expect from us\nProvide a broad range of useful services\nWe provide a broad range of services that are subject to these terms, including:\napps and sites (like Search and Maps)\nplatforms (like Google Play)\nintegrated services (like Maps embedded in other companies apps or sites)\ndevices (like Google Home)\n\nOur services are designed to work together, making it easier for you to move from one activity to the next. For example, Maps can remind you to leave for an appointment that appears in your Google Calendar.\n\nImprove Google services\n\nWere constantly developing new technologies and features to improve our services. For example, we invest in artificial intelligence that uses machine learning to detect and block spam and malware, and to provide you with innovative features, like simultaneous translations. As part of this continual improvement, we sometimes add or remove features and functionalities, increase or decrease limits to our services, and start offering new services or stop offering old ones.\n\nIf we make material changes that negatively impact your use of our services or if we stop offering a service, well provide you with reasonable advance notice and an opportunity to export your content from your Google Account using Google Takeout, except in urgent situations such as preventing abuse, responding to legal requirements, or addressing security and operability issues.\n\nWhat we expect from you\nFollow these terms and service-specific additional terms\nThe permission we give you to use our services continues as long as you meet your responsibilities in:\nthese terms\nservice-specific additional terms, which could, for example, include things like additional age requirements\n\nWe also make various policies, help centers, and other resources available to you to answer common questions and to set expectations about using our services. These resources include our Privacy Policy, Copyright Help Center, Safety Center, and other pages accessible from our policies site.\n\nAlthough we give you permission to use our services, we retain any intellectual property rights we have in the services.\n\nRespect others\nMany of our services allow you to interact with others. We want to maintain a respectful environment for everyone, which means you must follow these basic rules of conduct:\ncomply with applicable laws, including export control, sanctions, and human trafficking laws\nrespect the rights of others, including privacy and intellectual property rights\ndont abuse or harm others or yourself (or threaten or encourage such abuse or harm)  for example, by misleading, defrauding, defaming, bullying, harassing, or stalking others\ndont abuse, harm, interfere with, or disrupt the services\n\nOur service-specific additional terms and policies provide additional details about appropriate conduct that everyone using those services must follow. If you find that others arent following these rules, many of our services allow you to report abuse. If we act on a report of abuse, we also provide a fair process as described in the Taking action in case of problems section.\n\nPermission to use your content\n\nSome of our services are designed to let you upload, submit, store, send, receive, or share your content. You have no obligation to provide any content to our services and youre free to choose the content that you want to provide. If you choose to upload or share content, please make sure you have the necessary rights to do so and that the content is lawful.\n\nLicense\n\nYour content remains yours, which means that you retain any intellectual property rights that you have in your content. For example, you have intellectual property rights in the creative content you make, such as reviews you write. Or you may have the right to share someone elses creative content if theyve given you their permission.\n\nWe need your permission if your intellectual property rights restrict our use of your content. You provide Google with that permission through this license.\n\nWhats covered\n\nThis license covers your content if that content is protected by intellectual property rights.\n\nWhats not covered\nThis license doesnt affect your privacy rights  its only about your intellectual property rights\nThis license doesnt cover these types of content:\npublicly-available factual information that you provide, such as corrections to the address of a local business. That information doesnt require a license because its considered common knowledge that everyones free to use.\nfeedback that you offer, such as suggestions to improve our services. Feedback is covered in the Service-related communications section below.\nScope\nThis license is:\nworldwide, which means its valid anywhere in the world\nnon-exclusive, which means you can license your content to others\nroyalty-free, which means there are no fees for this license\nRights\n\nThis license allows Google to:\n\nhost, reproduce, distribute, communicate, and use your content  for example, to save your content on our systems and make it accessible from anywhere you go\npublish, publicly perform, or publicly display your content, if youve made it visible to others\nmodify and create derivative works based on your content, such as reformatting or translating it\nsublicense these rights to:\nother users to allow the services to work as designed, such as enabling you to share photos with people you choose\nour contractors whove signed agreements with us that are consistent with these terms, only for the limited purposes described in the Purpose section below\nPurpose\n\nThis license is for the limited purpose of:\n\noperating and improving the services, which means allowing the services to work as designed and creating new features and functionalities. This includes using automated systems and algorithms to analyze your content:\nfor spam, malware, and illegal content\nto recognize patterns in data, such as determining when to suggest a new album in Google Photos to keep related photos together\nto customize our services for you, such as providing recommendations and personalized search results, content, and ads (which you can change or turn off in Ads Settings)\nThis analysis occurs as the content is sent, received, and when it is stored.\nusing content youve shared publicly to promote the services. For example, to promote a Google app, we might quote a review you wrote. Or to promote Google Play, we might show a screenshot of the app you offer in the Play Store.\ndeveloping new technologies and services for Google consistent with these terms\nDuration\n\nThis license lasts for as long as your content is protected by intellectual property rights.\n\nIf you remove from our services any content thats covered by this license, then our systems will stop making that content publicly available in a reasonable amount of time. There are two exceptions:\n\nIf you already shared your content with others before removing it. For example, if you shared a photo with a friend who then made a copy of it, or shared it again, then that photo may continue to appear in your friends Google Account even after you remove it from your Google Account.\nIf you make your content available through other companies services, its possible that search engines, including Google Search, will continue to find and display your content as part of their search results.\nUsing Google services\nYour Google Account\n\nIf you meet these age requirements you can create a Google Account for your convenience. Some services require that you have a Google Account in order to work  for example, to use Gmail, you need a Google Account so that you have a place to send and receive your email.\n\nYoure responsible for what you do with your Google Account, including taking reasonable steps to keep your Google Account secure, and we encourage you to regularly use the Security Checkup.\n\nUsing Google services on behalf of an organization\nMany organizations, such as businesses, non-profits, and schools, take advantage of our services. To use our services on behalf of an organization:\nan authorized representative of that organization must agree to these terms\nyour organizations administrator may assign a Google Account to you. That administrator might require you to follow additional rules and may be able to access or disable your Google Account.\nService-related communications\n\nTo provide you with our services, we sometimes send you service announcements and other information. To learn more about how we communicate with you, see Googles Privacy Policy.\n\nIf you choose to give us feedback, such as suggestions to improve our services, we may act on your feedback without obligation to you.\n\nContent in Google services\nYour content\n\nSome of our services give you the opportunity to make your content publicly available  for example, you might post a product or restaurant review that you wrote, or you might upload a blog post that you created.\n\nSee the Permission to use your content section for more about your rights in your content, and how your content is used in our services\nSee the Removing your content section to learn why and how we might remove user-generated content from our services\n\nIf you think someone is infringing your intellectual property rights, you can send us notice of the infringement and well take appropriate action. For example, we suspend or close the Google Accounts of repeat copyright infringers as described in our Copyright Help Center.\n\nGoogle content\n\nSome of our services include content that belongs to Google  for example, many of the visual illustrations you see in Google Maps. You may use Googles content as allowed by these terms and any service-specific additional terms, but we retain any intellectual property rights that we have in our content. Dont remove, obscure, or alter any of our branding, logos, or legal notices. If you want to use our branding or logos, please see the Google Brand Permissions page.\n\nOther content\n\nFinally, some of our services give you access to content that belongs to other people or organizations  for example, a store owners description of their own business, or a newspaper article displayed in Google News. You may not use this content without that person or organizations permission, or as otherwise allowed by law. The views expressed in other people or organizations content are theirs, and dont necessarily reflect Googles views.\n\nSoftware in Google services\n\nSome of our services include downloadable software. We give you permission to use that software as part of the services.\n\nThe license we give you is:\nworldwide, which means its valid anywhere in the world\nnon-exclusive, which means that we can license the software to others\nroyalty-free, which means there are no fees for this license\npersonal, which means it doesnt extend to anyone else\nnon-assignable, which means youre not allowed to assign the license to anyone else\n\nSome of our services include software thats offered under open source license terms that we make available to you. Sometimes there are provisions in the open source license that explicitly override parts of these terms, so please be sure to read those licenses.\n\nYou may not copy, modify, distribute, sell, or lease any part of our services or software. Also, you may not reverse engineer or attempt to extract any of our source code unless you have our written permission or applicable law lets you do so.\n\nWhen a service requires or includes downloadable software, that software sometimes updates automatically on your device once a new version or feature is available. Some services let you adjust your automatic update settings.\n\nIn case of problems or disagreements\n\nBy law, you have the right to (1) a certain quality of service, and (2) ways to fix problems if things go wrong. These terms dont limit or take away any of those rights. For example, if youre a consumer, then you continue to enjoy all legal rights granted to consumers under applicable law.\n\nWarranty\n\nWe provide our services using reasonable skill and care. If we dont meet the quality level described in this warranty, you agree to tell us and well work with you to try to resolve the issue.\n\nDisclaimers\n\nThe only commitments we make about our services (including the content in the services, the specific functions of our services, or their reliability, availability, or ability to meet your needs) are (1) described in the Warranty section, (2) stated in the service-specific additional terms, or (3) provided under applicable laws. We dont make any other commitments about our services.\n\nAnd unless required by law, we dont provide implied warranties, such as the implied warranties of merchantability, fitness for a particular purpose, and non-infringement.\n\nLiabilities\nFor all users\n\nThese terms only limit our responsibilities as allowed by applicable law. Specifically, these terms dont limit Googles liability for death or personal injury, fraud, fraudulent misrepresentation, gross negligence, or willful misconduct.\n\nOther than the rights and responsibilities described in this section (In case of problems or disagreements), Google wont be responsible for any other losses, unless theyre caused by our breach of these terms or service-specific additional terms.\n\nFor business users and organizations only\n\nIf youre a business user or organization, then to the extent allowed by applicable law:\n\nYoull indemnify Google and its directors, officers, employees, and contractors for any third-party legal proceedings (including actions by government authorities) arising out of or relating to your unlawful use of the services or violation of these terms or service-specific additional terms. This indemnity covers any liability or expense arising from claims, losses, damages, judgments, fines, litigation costs, and legal fees.\nGoogle wont be responsible for the following liabilities:\nloss of profits, revenues, business opportunities, goodwill, or anticipated savings\nindirect or consequential loss\npunitive damages\nGoogles total liability arising out of or relating to these terms is limited to the greater of (1) US$500 or (2) 125% of the fees that you paid to use the relevant services in the 12 months before the breach\n\nIf youre legally exempt from certain responsibilities, including indemnification, then those responsibilities dont apply to you under these terms. For example, the United Nations enjoys certain immunities from legal obligations and these terms dont override those immunities.\n\nTaking action in case of problems\n\nBefore taking action as described below, well provide you with advance notice when reasonably possible, describe the reason for our action, and give you an opportunity to fix the problem, unless we reasonably believe that doing so would:\n\ncause harm or liability to a user, third party, or Google\nviolate the law or a legal enforcement authoritys order\ncompromise an investigation\ncompromise the operation, integrity, or security of our services\nRemoving your content\n\nIf we reasonably believe that any of your content (1) breaches these terms, service-specific additional terms or policies, (2) violates applicable law, or (3) could harm our users, third parties, or Google, then we reserve the right to take down some or all of that content in accordance with applicable law. Examples include child pornography, content that facilitates human trafficking or harassment, and content that infringes someone elses intellectual property rights.\n\nSuspending or terminating your access to Google services\n\nGoogle reserves the right to suspend or terminate your access to the services or delete your Google Account if any of these things happen:\n\nyou materially or repeatedly breach these terms, service-specific additional terms or policies\nwere required to do so to comply with a legal requirement or a court order\nwe reasonably believe that your conduct causes harm or liability to a user, third party, or Google  for example, by hacking, phishing, harassing, spamming, misleading others, or scraping content that doesnt belong to you\n\nIf you believe your Google Account has been suspended or terminated in error, you can appeal.\n\nOf course, youre always free to stop using our services at any time. If you do stop using a service, wed appreciate knowing why so that we can continue improving our services.\n\nSettling disputes, governing law, and courts\n\nFor information about how to contact Google, please visit our contact page.\n\nCalifornia law will govern all disputes arising out of or relating to these terms, service-specific additional terms, or any related services, regardless of conflict of laws rules. These disputes will be resolved exclusively in the federal or state courts of Santa Clara County, California, USA, and you and Google consent to personal jurisdiction in those courts.\n\nTo the extent that applicable local law prevents certain disputes from being resolved in a California court, then you can file those disputes in your local courts. Likewise, if applicable local law prevents your local court from applying California law to resolve these disputes, then these disputes will be governed by the applicable local laws of your country, state, or other place of residence.\n\nAbout these terms\n\nBy law, you have certain rights that cant be limited by a contract like these terms of service. These terms are in no way intended to restrict those rights.\n\nThese terms describe the relationship between you and Google. They dont create any legal rights for other people or organizations, even if others benefit from that relationship under these terms.\n\nWe want to make these terms easy to understand, so weve used examples from our services. But not all services mentioned may be available in your country.\n\nIf these terms conflict with the service-specific additional terms, the additional terms will govern for that service.\n\nIf it turns out that a particular term is not valid or enforceable, this will not affect any other terms.\n\nIf you dont follow these terms or the service-specific additional terms, and we dont take action right away, that doesnt mean were giving up any rights that we may have, such as taking action in the future.\n\nWe may update these terms and service-specific additional terms (1) to reflect changes in our services or how we do business  for example, when we add new services, features, technologies, pricing, or benefits (or remove old ones), (2) for legal, regulatory, or security reasons, or (3) to prevent abuse or harm.\n\nIf we materially change these terms or service-specific additional terms, well provide you with reasonable advance notice and the opportunity to review the changes, except (1) when we launch a new service or feature, or (2) in urgent situations, such as preventing ongoing abuse or responding to legal requirements. If you dont agree to the new terms, you should remove your content and stop using the services. You can also end your relationship with us at any time by closing your Google Account.\n\nChange language:\nAfrikaans\nBahasa Indonesia\nBahasa Melayu\nCatal\netina\nDansk\nDeutsch\nEesti\nEnglish\nEnglish (United Kingdom)\nEspaol\nEspaol (Latinoamrica)\nEuskara\nFilipino\nFranais\nFranais (Canada)\nGalego\nHrvatski\nIsizulu\nslenska\nItaliano\nKiswahili\nLatvieu\nLietuvi\nMagyar\nNederlands\nNorsk\nPolski\nPortugus (Brasil)\nPortugus (Portugal)\nRomn\nSlovenina\nSlovenina\nSrpski\nSuomi\nSvenska\nTing Vit\nTrke\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ()\n\n\n\nGoogleAbout GooglePrivacyTerms", "Space Required": "314.3 MB"}



["5 stars\n74%\n4 stars\n17%\n3 stars\n4%\n2 stars\n2%\n1 star\n3%", "CheeksFlexingtonMay 29 at 8:37 PM\nA absolute must have.\n\nListen, I was like you (probably). I didnt think I had an artistic bone in my body, this app has touched my creative side in a way Ive never had anything do before (not even Minecraft). I now have spent more time in this app the most games I have downloaded on my quest. GET THIS APP NOW!\n\nHelpful | 145", "vrhopieJul 10 at 7:39 PM\n10 STARS  \n\nThis is one pretty impressive art app. I could be in it until the Oculus battery runs out. So many features to get very creative or just open the scrapbook and view all the pre drawings. This is the app to release stress, play your classical music and relax as you draw.. now if you'll excuse me, I've got some painting to do. \n\nGreat job developers. This is one impressive app.. \n\nHelpful | 14", "DarkWoofieJul 14 at 10:03 AM\nWorth every penny\n\nOver the time that I have used this app so far I have found no flaws or limits to what I want to do. I can design logos for my friends, create models for characters, design set pieces, recreate my room into a beautiful forest, and so much more. No matter what you do, get this app as your first. Its a great and comfortable introduction into Virtual reality\nitself, and the only limit is your mind.\n\nHelpful | 8", "Nairbyad16 days ago\nDiscover your inner artist\n\nExcellent choice of brushes and colours and environments to get your creative juices flowing. Today, I drew a box and sat in it! Then, I drew on the ceiling, practising drawing shapes. And I learnt how to not just think outside the box but move outside the box without moving - teleporting. I learnt how to grab my set of drawings, pull them towards me and reduce them in size, in order to erase and redraw. I lost all track of time, which is wonderful.\n\nHelpful | 2", "ansonort2 days ago\nGenius idea. Endless fun\n\nOn my iPad I have Procreate and Affinity Designer and use them a lot. I took a punt on this to see what it would be like to have a 3D painting/drawing experience. It doesnt disappoint. There are lots of tools on your palette including some nifty animated brushes. You can walk all around your creations as you create them and save them if you want to exhibit at the Royal Academy later. The painting is smooth and opens up whole worlds of possibilities.\n\nI would like to see some form of smudge and blend tools. They may exist already and I just havent discovered them in the depth of the programme.\n\nNovel and engrossing. A perfect VR experience.\n\nHelpful | 0", "AirmanAllenJul 11 at 6:58 PM\nBest investment in VR so far\n\nHands down, this is the app my children love the most. Being able to draw and create in a3d space for them had been amazing. I've been playing games for nearly 30 years, but this is the one app that made me stand in awe\n\nHelpful | 6", "spookeeMay 17 at 1:31 AM\nSo many uses\n\nIve used this app to map out the inside of my van so I can test out different configurations of cabinets and other stuff. It worked perfectly now I can fully design what I wanna do and stand inside my design to see if I have enough space and what not.\n\nOf course Ive also done lots of random drawings and doodles, like transforming my bedroom in to a rainforest or making a huge whale\n\nThis is one of my favourites on the quest and well worth the money\n\nHelpful | 21", "LiteByteJul 21 at 7:01 PM\nGreat, but high learning curve\n\nSo, this game is awesome! You can literally make anything. The only issue is with learning the controls and all the functions you are able to use. The utopian doesnt teach much. But if you push through the challenges of learning everything and trying all the tools, youll be able to make amazing art. Seriously, this is a must try game.\n\nHelpful | 1", "jonrahoiJun 26 at 7:23 PM\nINCREDIBLE\n\nThis app is a breathtaking example of the power of technology to transform something familiar into something magical. Like FaceTime compared to a phone call, Google Maps compared to asking for directions, or taking digital photos vs film.\n\nHerein you become a god, and painting and drawing become something new, insanely powerful, and infinitely fascinating.\n\nIm not even overstating it. It blows me away, still.\n\nHelpful | 3", "kevin.ching.353 hours ago\nMust have\n\nTilt is amazing. I have fun for hours messing around. Never had fun painting or drawing but Tilt changes that feeling\n\nHelpful | 0", "TCORONADO26Mar 20 at 5:22 PM\nPainting is Learning\n\nThis is worth every penny and better than any game on the Oculus store. I love how you can paint anything you can imagine, but I found another use for it. I always wanted to learn Japanese, but only got so far. With this app, I can draw all the hiragana, katakana, and kanji characters. When you can see them up close and walk around them it makes a big difference for your memory!\n\nHelpful | 287", "FeckFaceMcGeeJul 26 at 4:32 PM\nMust have for New and Veteran artists!\n\nAll I will say is.... this app is phenomenal. You will easily play until your Oculus's battery drains (Quest). The controls are fantastic, the GUI is properly done and implemented. Anyone can pick this up and start a masterpiece. Just buy it. Wellllllllll worth its price.\n\nHelpful | 1", "PaleoFossil258 hours ago\nFun to mess around\n\nI don't have any real talent, so I just like to make abstract shapes andvisuals. Seeing the things other people make is amazing too. You really can create anyhting in this game.\n\nHelpful | 0", "nish187016 days ago\nGreat for studying at home\n\nYou can create an entire library inside the app with room devoted to different chapters of a subject. You could have different libraries for each subject. Perfect for covid-19\n\nHelpful | 1", "jaehickeyJul 18 at 8:01 PM\nA New Medium\n\nThis app has me immersed completely in a new art medium. As an artist in the traditional sense, this experience opens up a whole new perspective and offers me the freedom to explore and experiment in ways that were previously unavailable.\nA whole new dimension (literally) to my art!\n\nHelpful | 1", "JonShardJun 27 at 4:04 AM\nGood but expensive\n\nIt is what it looks like. One you get into it and learn effective ways to draw, it's easy to let out your idea. Perfect for the quest with unlimited play area. Though you can also play standing.\n\nA bit expensive for what it is.\nWish there was a full tutorial with all controls.\n\nHelpful | 3", "PrimeJay45May 12 at 11:12 AM\nIn the top 3 of my favorite apps!\n\nI've dabbled in many artistic mediums (woodburning, graphic artistry, pencil/pen, etc, etc.). This app is amazing once you grasp the menus and controls.....there are no limits except for your own mind as far as what you can do. Highly recommend to anyone who has a love for artistry and a creating.\n\nHelpful | 12", "ReverendReloadJun 10 at 9:33 PM\nBroaden Your Horizons\n\nApps like Tilt Brush are so very important for the longevity factor of VR. TB on the Quest is phenomenal. It gives you plenty of flexibility and tools to bring your greatest thoughts to life.\n\nI recently had a group of friends over and they spent hours just watching me create a giant face in the environment. They said it was incredibly fun just to watch and communicate ideas.\n\nIt takes some getting used to in regards to 3D paint environments. I look forward to learning all of the ins and outs.\n\nHelpful | 2", "No3vA9 days ago\nEverything is amazing\n\n10 star game worth every penny.\n\nHelpful | 1", "TrisolaransApr 14 at 12:50 AM\nI would love some virtual tutorials\n\nThis is such an amazing app, I just wish it could have some more tutorial instruction. I would love to have 10 guided projects that you could complete. I would easily pay the cost of the software again for that.\n\nI feel like this could be one of the few apps that really gets people to buy this hardware\n\nHelpful | 49", "sebastian.kurz.583Jun 14 at 12:39 PM\nAwesome immersive roomscale painting\n\nRoomscale painting shows immediately the magic of vr. Tilt brush was already great from the beginning and gets regular updates for refinement. It's a joy to use, for just fooling around with the brushes or also really learn to use all tools properly. Big database with the creative stuff of others is accessible. Must buy for a creative person.\n\nHelpful | 1", "DRINK_MILKMay 21 at 8:51 PM\nI don't even care for art\n\nI bought this for my fiance because she paints a lot and I wanted something to get her to try vr, but instead I found myself absolutely blown away by this app, I was testing out brushes and the size mechanics feeling like iron man with holograms, this managed to not only blow me away but it also go me into art, I can't praise this enough, easily the best app in the store by far and if you don't like it just refund it, but I can safely say I won't be\n\nHelpful | 3", "Corona-Borealis7Jun 13 at 5:37 PM\nMy absolute Favorite  Me Timeenjoyment\n\nOne can actually immerse yourself into your art. I have created a world of fantasy and whimsy. I am by no means a studied artist, yet I enjoy the world I create with the wonderful tools afforded me in Tilt Brush. I find it amazing. If you enjoy creating, even at a beginners level, you will enjoy this!\n\nHelpful | 1", "deafguy079Jul 28 at 5:26 PM\nGoogle Drive\n\nI don't have a PC for Reference images. Why not use Google Drive for that?\n\nHelpful | 0", "TheKenz11Jul 5 at 6:47 PM\nInvigorating\n\nThis game is so relaxing and stress relieving. If you even kind of enjoy art or drawing, it's so worth the money!!\n\nHelpful | 2", "jAy-jOyJun 27 at 6:03 AM\nI have no words.\n\nThere's a few options missing like spheres and a couple more but other than that best app for the quest.\n\nHelpful | 3", "chocochunksJun 30 at 1:19 PM\nCool ride.\n\nEverything everyone is saying is spot on. It's a must have app. Not only can you create in 3D space but you can also manipulate the space. Purchase this app if you want to wow your friends.\n\nHelpful | 1", "Taven225 days ago\nBest app for creativity\n\nThis is the best app for if youre creative\n\nHelpful | 0", "kristyn.hodges.23Jul 1 at 8:49 PM\nArt on an EXTREMELY other level\n\nMy favorite thing is making something and scale it way up. Handling a mountain and then jumping down to squirrel level for details gives you a god like feeling like nothing else.\n\nHelpful | 0", "billbeckerartJul 9 at 4:16 PM\nLite learning curve, but not tricky\n\nI love it! Could use some more brushes, but I assume theyre coming in future updates.. overall 9 out of 10 with 0 regrets in my purchase\n\nHelpful | 0", "madninjaMay 8 at 2:03 PM\nSo much fun and lots of free content\n\nI bought this app to get creative and love it. With an intuitive set of options and the ability to import loads of free 3D objects.\n\nI mainly use blender and after creating an object I export it as an obj file with texture. Upload it to poly and you can then bring them into the application.\n\nCreating a living space that replicated my own home with added extras such as looking out of the window and seeing the moon two feet away is surreal.\n\nThe tool set is great and a perfect example of why the oculus quest is ideal for cable free VR\n\nIf you like to paint or just want to experience others art then you should definitely try this amazing application\n\nHelpful | 3", "Mister_FonzieFeb 6 at 6:52 PM\nLet go of your fears\n\nI'm no artist, but had been curious about this title. I almost opted for a refund after spending about 25 minutes with Tilt Brush. I was struggling because I could only think about painting in two dimensions. That, along with my limited art skills, really hampered any enjoyment.\n\nHowever, I just decided to let go of my fears and unlearn what I had learned. I just went wild without a care. I'm the beginning, it was mainly abstract, but as I got more acquainted with the 3D space, I started creating actual recognizable objects. Then I was hooked. It's easy for me to get lost on a piece for hours at a time. Updates keep coming to get it as powerful as the PC version. Literally, if you can dream it, you can draw it.\n\nLastly, if you \"just don't get it\" the first time you load up Tilt Brush, go to YouTube and watch some tutorials. It really opens your mind to the possibilities.\n\nHelpful | 237", "angrymarkerJul 10 at 10:00 PM\nPowerful\n\nIts awesome. There are some shortcomings, but these mostly apply to exporting the objects. It is a pain to export an object to blender.\nI will keeps this at 3 stars until one of the following:\nGoogle Blocks is brought to quest\nOr A grid system is implemented\nOr you can make custom brushes\nOr a carving feature is added\n\nHelpful | 1", "GraphicsMonkeyJul 23 at 6:10 PM\nGreat but what happened to multi users\n\nLove the app, great on every account... but we were promised multiplayer so we could create with friends and it never happened?\n\nI would recommend to more people if this could be done, but its just stayed static and very isolating.\n\nHelpful | 1", "TH3_M3D1CMay 13 at 5:03 PM\nLearning Process, But Amazing\n\nIt is a beautiful game, Im not a big artist but it is really fun to mess around in and see what you can create. My girlfriend is really good at drawing though and watching what she can create is insane. The controls take a second to learn but once you get it down, it is really intuitive. Great thing to have for your VR!\n\nHelpful | 2", "PurplemikeyMay 3 at 6:56 AM\nArt in VR takes a whole new dimension\n\nThis software really is what painting would be like if painting the air was possible. You can walk around your creation, canvas is the air around you, you can paint as many sketch you want without having to run to the store because you don't have this or that color anymore...\n\nYou can even explore others creation and dive deep in their art. Live the experience. Dive in!\n\nHelpful | 3", "klzvbtMay 25 at 6:23 AM\nAmazing creative outlet\n\nThis is the first thing I tried in VR for more than 5 minutes, and the first thing I bought when I got my Oculus Quest, and it's mostly the reason I grab my headset now.\nThe feeling of just walking around your \"painting\", scaling down up so it feels like you're flying above the mountains, or scaling up and standing at the foot of the mountain looking up.\nAnd you don't have to be an artist or anything to enjoy it, as long as you can wave your arms around while pressing a button.\n\nHelpful | 1", "Twissy-87Jun 24 at 1:09 PM\nStunning!! \n\nIt allows you to let your creativity free and flowing and also shows you other people's mindblowing creations.\nAbsolutely absorbing experience. \n\nHelpful | 1", "dr.diver.danApr 25 at 1:30 PM\nAmazing\n\nI'm new to VR. Tilt Brush is fantastic. Simple to use, and endlessly fun. A great introductory art app. It is unlikely that you will create a true masterpiece (although if you google it, people do), but you'll be impressed. My only gripe is that the tools (brushes) are based mostly on \"2D\" tools, rather than 3D. The brushes are flat, even though you use them in 3D space - \"paint\", \"paper\", \"oil\", \"ink\", etc. - although there are tools like hulls. I'm surprised there aren't 3D tools like clay, or pallet knife, inflate, deflate, smooth, etc.\n\nHelpful | 7", "Happy-BeeMar 21 at 11:06 PM\nit could be improved\n\nso my city is having a lockdown due to a pandemic, and i'm tired of being inside the house, but i couldn't go out. i loaded up TiltBrush and started a new canvas. i drew a bond fire. its not hard, start with a few sticks on the ground, stack them into a pyramid shape, then add some rocks around it, and add fire and ember... next i added a wooden canvas chair beside it...nothing fancy, you know, the foldable type people usually use for fishing. then some stars in the sky. next thing i knew, i had also camping gear around me, a tent with a sleeping bag inside, and roasting tasty food on the fire! how time flies! i'm no artist but this app is quite easy to use! now i can relax inside my little virtual camp and feel at ease. love it! albeit liking it,i felt that there can be room for improvements,like i hoped there would be some extra tools for applying just a layer of paint (colour only, not creating physical objects) onto existing stuff i've created though.\n\nHelpful | 34", "garrettfuselierMay 25 at 2:33 PM\nLove this app\n\nNot only is this a great first demo to show people, but as an artist, its amazing tool to get spatial ideas out quickly. Such an amazing prototyping tool and the art that other ppl make is just mind blowing\n\nHelpful | 2", "tommy.ligmanMar 16 at 3:29 PM\nNEED THIS FEATURE\n\nAbsolutely love this game. Ive gotten lost for hours creating things. But an extremely cool feature would to have the ability to extend your brush, like if you were holding a a pole and your brush was attached. It would be awesome to add detail to something further away from you. Just a thought that would really boost my experience . Fantastic game though\n\nHelpful | 19", "balaji.santharamJul 13 at 1:31 AM\nJust buy\n\nWorth the experience\n\nHelpful | 0", "mantisaliveMay 2 at 3:36 AM\nWell worth it!\n\nBeing free to paint whatever you like in this VR environment is really freeing. Feels really relaxing & a lot of fun. Walking around and inspecting your own art from every angle is fantastic. This feels like one of the absolute must buys for anyone with any creative spark. Great value too, painting in real life is expensive!\n\nHelpful | 2", "dalidylanJun 14 at 11:51 PM\nAmazing\n\nI call my friends and paint whatever they can imagine. It's the best way to connect to someone far away you. Love love love.\n\nHelpful | 0", "Capaninja4020Jun 23 at 11:42 PM\nFun\n\nIve had this for a day and im enjoying every minute with the quest\n\nHelpful | 0", "665shall10 days ago\n\nHuge potential if the pallate is right\n\nHelpful | 0", "TheCaptainHowdyMay 19 at 6:07 PM\nAn absolute mind blowing experience.\n\nThe world is your blank canvas and you can resize the 3D painting and edit in a 3D virtual space! This is an otherworldly experience a MUST HAVE FOR VR ARTISTS!\n\nHelpful | 2", "noonooculus13 days ago\nThis is what i came here for \n\nYes \nThe entire reason I wanted to explore Oculus Quest was to unleash some creativity.\nFive minutes into this and i know its where Ill be experiencing most of my time here.\nImmediately intuitive, easy to navigate.\nI feel like a Renaissance painter with an upgraded easel in hand.\nFun, meditative, creative, easy.\nFind a background you like and start playing!\n\nHelpful | 0", "meangamerApr 24 at 7:41 AM\nFrustrating\n\nI made a design that I liked a lot, but when I wanted to share it, it was frustrating.. The photo capture feature is useless because it takes a photo with very bad cuality and with the Tilt Brush watermark on it (if I paid for the app why I don't have the option to put my own watermark or to remove it if I want?) Then I tried to import the export file I got from Tilt Brush to Blender to render it there with no luck, I got a bonch of errors.\n\nHelpful | 13", "TR33TR3315 days ago\nNot hard to learn\n\nI just got this game a little over an hour ago (aug 9) and i was watching a few videos on what you can do and what the controls are but i got the hang of it pretty fast. If you ever get a crappy game on the oculus go store called Paint VR dont get it its bad and even on quest its bad so if you want to get a good art app on every platform get tilt brush!\n\nDevs can you please add more backgrounds like one with earth one the middle with no stars around it or a room a blank room with no textured walls or windows just an empty black,white,red,blue,rainbow,yellow,green,purple,pink and so on\n\n\n-TreeTree\n\nHelpful | 0", "silasviperJun 17 at 11:41 AM\n\n\nYou have to get this game it is the best its so fun!!!\n\n\nHelpful | 1", "cycloculusJun 25 at 6:58 PM\nAmazing\n\nJust .... amazing\n\nHelpful | 1", "ArtNinja10121 days ago\nPERFECT!! Great for creative people \n\nTilt Brush is an amazing game. I instantly fell in love with it and its one of the best way to create something right in front of you, or sketch out an idea before doing in irl. If you have an idea, you can make it! Its so simple to manage and use. All the different brushes make it easy to get all the different textures that your heart desires. Its a little on the expensive side, but its very much worth it! \n\nHelpful | 0", "TucsawnJun 9 at 12:39 PM\nAmazing\n\nWhat an amazing experience. The developers of this game are something special.\n\nHelpful | 0", "Kxcrunner73 days ago\nGreat to show friends\n\nThis game is definitely designed with the creative person in mind. You could spend hours messing with the settings and design options and then even longer actually painting. Super fun to show friends!\n\nHelpful | 0", "Greblin10 days ago\nFar exceeded expectations\n\nI thought this would be small, gimmicky and fun. It is full of useful tools (advanced mode) and actually robust enough to really get deep into. I highly recommend it.\n\nFor reference, I have experience with traditional and digital art.\n\nHelpful | 0", "GeofftreJun 2 at 2:30 PM\n\nSo relaxing and amazing! Just perfect for me and also to show people what vr is all about.\n\nHelpful | 0", "jeepdaddy1234Jun 14 at 11:10 AM\nVery cool app. Still learning\n\nMy daughter loves it. Spent hours using.\n\nHelpful | 0", "MispellzMay 21 at 5:56 AM\nAddictive\n\nHonestly super addictive. I've already spent hours on it and I just got my Oculus Quest yesterday. I would definitely recommend this.\n\nHelpful | 1", "hootie976Mar 1 at 7:16 AM\nTilt Brush is incredible\n\nI used Tilt Brush on the Oculus Rift years ago and was so excited to see it available for the Quest. Having the freedom the quest affords to draw and move in 3D space changes the whole experience for the better.\n\nThere are over 30 brush types, but theyre not regular brush types. These brushes are very unique and allow you to create art out of bubbles, moving fire, electricity, rope lights, etc. etc. It really is spectacular to see in the visor.\n\nUsing the grip buttons to change the scale of the art allows you to make small dinosaurs and dragons, then experience them from an ants perspective.\n\nIf your an Art person, you just have to get this. When people come to our house who are hesitant about trying VR or who dont play video games, this is my go-to demo app for them.\n\n100% of everyone who tries this, spends a lot of time with it, loving it.\n\nIts a cant miss?\n\nHelpful | 8", "dno440May 22 at 1:40 PM\nLove it keep adding to it plz\n\nIt would be awesome to be able to make your 3D object transferable to a room like spatial.io or paint 3d\n\nHelpful | 1", "My_40oz2freedomMay 16 at 7:28 AM\nAmazing new art!\n\nThis needs to be used for setup of vr museums based on vr artwork. The things you can do here are amazing and worth every penny!\n\nHelpful | 0", "Reina099 days ago\nI love this but\n\nOkay I love this game it has showed such an artistic side of me I never knew I had but I wish there was some sort of tutorial on how to use everything and maybe some more things were easier to use otherwise its an AMAZING GAME\n\nHelpful | 0", "mattjohnholmesJun 20 at 2:42 AM\nGreat inventive tool\n\nLovely stuff\n\nHelpful | 0", "TYDIRTYMay 28 at 11:58 AM\nGreat App.\n\nThis is a great app however it does have some sacrifices and bugs due to being ported to mobile platform. Unable to control brush width with right hand in v23.2. Please have developers work on to make this amazing app even better.\n\nHelpful | 1", "seandeeMay 21 at 9:28 AM\nAmazing\n\nDo any of the art apps have an eraser. It seems lime a very basic tool and there doesnt seem to be one on any of the art apps\n\nHelpful | 1", "stellar_the_wolf2 days ago\nAmazing\n\nIt is amazing.\nThats all..\nYeah...\n\n\n\n\n\n\n\n\n\n\n\nWhy are you still reading this?\n\nHelpful | 0", "FrozztasticMay 4 at 5:35 PM\nFantastic.\n\nThis wonderful app is tons of fun. Great for serious artists and doodlers alike, I highly recommend it, if you enjoy being creative.\n\nHelpful | 0", "ultrapcApr 21 at 4:26 PM\nSuperb for creative gamers\n\nI very much like this, you can create your own worlds, ive created the island from Lost, the plane on the beach and all, a very interesting experience, infinite playabilty in these creative games.\n\nHelpful | 0", "TieGuyAndyMar 28 at 12:00 AM\n\nPersonally, at first I didn't enjoy this game. I just tried doing dmstupid doodles. But now I've started trying to actually make \"\"\"art\"\"\" in the biggest quotes, and it's very fun! I would 100% reccomend for anyone good or mildly good at art!\n\nHelpful | 2", "skyashJun 5 at 4:48 PM\ngood but how do I start a new sketch?\n\nWhere is the new document option to start from blank. Maybe I dont understand this artist thing but I would expect File->new blank document tyoe option somewhere...\n\nHelpful | 0", "demianstine123Jun 15 at 1:52 PM\nDisappointing\n\nI find the lack of spacific erasing and snap to grid powerful frustrating. Also we can't make our own backgrounds.\nCan't use paint can on guids.\n\nMany small failures.\n\nHelpful | 0", "TransJenderGalApr 23 at 3:27 PM\nAmazing\n\nEasy to use. Gives you everything you need to feel like a Virtual Bob Ross!\nHappy trees= Happy Me\n\nHelpful | 2", "bryanloApr 19 at 10:56 PM\nFun, beautiful tool to learn painting.\n\nI can not do drawing or painting but with this, I want to learn. Because it is fun and joyful to do.\nCan a mp3 music file import into my drawing as background music if possible.\nThank you\n\nHelpful | 0", "ZekeBrancoJul 3 at 12:46 AM\nBoring\n\nYou play this game for 2 minutes then theres nothing left to do, its very hard to be detailed and just limits you in every way.\n\nHelpful | 1", "ray.blair.7103 days ago\nTilt Brush\n\nI am absolutely blown away at the creation levels on this\n\nHelpful | 0", "LW2024Apr 8 at 12:24 AM\nZERO customer support\n\nI have spent over two hours trying to get answers why I keep getting \"Error can't save\". I've gone to emails and websites for Tilt Brush and Oculus Contact Us and Community Support pages ( only got as far as headlines with questions, no answers ). I don't have the patience to try into the 3rd hour.\n\nHelpful | 7", "TheVengefulOneMar 30 at 5:56 PM\nvery relaxing\n\nI give it full stars because this game is relaxing and let's me forget about my problems and the scary problems of the world I dive right in, I am starting to get use to his app and brushes and I finally added images to my lab book, this app is awesome sauce and worth the money\n\nHelpful | 1", "Lazer241May 19 at 10:02 AM\nReally fun and relaxing\n\nI didnt really have a use for this until I made a Mothers Day card and she loved it.\n\nHelpful | 0", "alon.sabiMay 11 at 10:02 PM\nBest drawing app\n\nI tried others, this one is the best. Magical! \n\nHelpful | 0", "Alejandro_AntonioJul 1 at 10:07 PM\nUnlike anything I've seen before\n\nTiltBrush was a game I've been wanting to play a while now. From the get go the graphics and asthetic are all very pleasing. The use of tactics like in Ibis paint mapped onto a 3d plane we're demonstrated perfectly. Overall, a great game/resource for anyone, regardless of skill level.\n\nHelpful | 0", "stale_memes101May 24 at 3:54 PM\nLag\n\nIts laggy for me and i cant refund it even tho i haven't played it for 2 hours and not even close to 14 days\n\nHelpful | 2", "rmib200May 25 at 1:30 PM\nGreat but lacks features\n\nIt could have some new features.\n\nHelpful | 0", "rbhamricApr 29 at 4:41 PM\nOne of the best apps for VR\n\nSo much fun! Take it outside and play in a huge area. So much fun!!!\n\nHelpful | 0", "Wafflyknave7126May 5 at 5:01 PM\nLove this app\n\nThis app is amazing and really intuitive, only thing I would add is a smoothing feature for the 3D brushes\n\nHelpful | 0", "ax3artistFeb 21 at 4:42 PM\nI really love it!\n\nIm an artist and I love this app! Its so much fun immersing yourself into a 3D space and controlling your creation. Two suggestions off the top though .. create a tool bar for realistic style brushes and pallets knifes and\nsecond suggestion is add a forward button in case you go back too many moves and erase your work by accident. Overall though I love it!\n\nHelpful | 5", "miko.gillen12 days ago\n\nAbsolutely Amazing! A must get!\n\nHelpful | 0", "nathan.knappenburgerMay 14 at 9:08 AM\nDrafting would be nice\n\nIt is a neat program with so much potential, it would be nice to be able to draw accurately, and paint primitive objects solid colors. I am sure others enjoy it for what is can already do so we'll.\n\nHelpful | 0", "ItsBathWaterApr 11 at 12:51 AM\nThe Freedom We Get\n\nIt's really fun not going to lie its nice to have the option to make anything you want and i love to draw but in VR it's even better I gotta give it a 5 Stars\n\nHelpful | 0", "RissaMarieJun 17 at 10:15 PM\nVery impressed!\n\nIm a beginner with this and tried it reluctantly as I cant get Quill on Quest, but Ive been pleasantly surprised with its capabilities. I spent a few hours in it already learning the ins and outs of it and now Im looking forward to going through some YouTube tutorials to discover what else it can do. I can already see stories unfolding in my mind, and I feel like I now have another great medium to play in even though Im not technically an artist. Canvas for the non-artist? I think yes!\n\nHelpful | 0", "TaliysinApr 16 at 5:45 PM\nImmediately immersive\n\nI am having friggin blast walk around my drawings in a 3D space. I wish there were more tutorials, but its ace!\n\nHelpful | 0", "PeteyPakNov 30 at 6:26 AM\nSo good, so limited!\n\nOkay firstly and most importantly: This is amazing. Two weeks into owning a Quest and basically bugging friends and co-workers to see it, I always start by loading up Tilt Brush, starting them outside the guardian, showing them the trigger, and having them walk into the VR world where suddenly they can leave a glowing trail of sunlight with one hand. It gets a good reaction every time, it is amazingly compelling.\n\nBut the limitations of this are so frustrating.\n\nNo copy/paste! Certainly not between sketches and man would that be powerful. The only copy options require you to move your selected brushstrokes out of place before you can spawn copies. Selected objects cant be recoloured in one go. Selected objects cant be stretched or adjusted.\n\nTheres no option to just create a plane, a flat square or circle. You can import (some) Poly objects, but theres no option to create a triangular mesh yourself (Id love that, clicking to create new vertices would be so good, the hull objects are not close enough).\n\nYou can view a limited list of other peoples sketches, but you cant mark them as favourites (or am I missing something?). You have to go via the web. And it would really help for there to be a distinction between leaving a like on a sketch, or adding it to a list of sketches youd like to keep to look at or reference.\n\nThe first question almost always from others, is whether another Quest user could see you painting, it would be so cool! But no. And you cant show someone directly even off not live. You have to upload it, and publish it, and then log in in a browser, and get the link, and then they need to receive and view it while logged in, and then they can favourite it, and only then can they open Tilt Brush themselves and go hunting in their favourites. If theres a better way someone tell me what Im missing!\n\nAnd its all so sad because it feels like this is another great project headed for the famous Google Graveyard, I dont see a big user base, new work on the app, or any serious work on the website. Maybe the influx of new users from the Quest will help. I hope so because this is awesome.\n\nHelpful | 147", "Jaxoy5Jul 13 at 11:08 AM\nART\n\nThis is the best game for everyone and if you dont know yo yo do art or anything pull up a picture then try I did and I did great \n\nHelpful | 0", "artracc20 days ago\nAmazing!\n\nI love it!\n\nHelpful | 0", "17thArchitectJun 6 at 12:17 PM\nWorth all the money.\n\nAround $20, and its endless fun. For a lot of those who Gave it a one star probably didn't have the part right equipment or had issues with the game at the time period no doubt they have fixed the issues, I have had no problem. If you are an artist or have artistic ideas this game is for you, I am not an artist.\n\nHowever I have had nothing but endless fun!! Its soothing!\n\nIf you are reading this! Buy it, try it\n\nHelpful | 0", "andrevegaVRApr 23 at 11:37 PM\nBest app yet\n\nVery well made\n\nHelpful | 0", "NonaloolooJul 2 at 8:02 PM\nFun drawing and saving\n\nFun, the Google image exporter for the drawings is trash compared to the SketchFab, which is 200% cooler than expected. SketchFab should be the only choice.\n\nHelpful | 0", "aroncoopeyApr 7 at 1:00 PM\nGood\n\nA simple but addicting game which is quite professional and artistically pleasing\n\nHelpful | 0", "Tenkaichi06Apr 7 at 9:01 PM\nGreat creativity app\n\nYou can really lose yourself in this, and that's what it comes down to it VR.\n\nHelpful | 0", "sarcasteriskMar 3 at 10:49 AM\nUndeniably cool\n\nThis has to be the coolest drawing program around. To be able to \"feel\" the volume of your brushes and see them render right in front of your very eyes is so revolutionary. A must app - even if you don't draw. You will want to learn to draw after noodling around with Tilt Brush.\nThe only reason for lack of 5 stars is the lack of screen saving and other \"labs\" features that should be a part of this app.\n\nHelpful | 1", "blablargonApr 9 at 12:18 AM\nBasic Review\n\nThis application is whatever you make it. Get it. Thank you developers. You rock!\n\nHelpful | 0", "FallingCoyote81Jun 23 at 8:33 PM\nLove it but\n\nI loved the game but it didnt let me save my first sketch so I had to cast it on my phone and screen record it so I could show it to people. Hope this was helpful:)\n\nHelpful | 0", "OtherbitsJan 28 at 2:19 AM\nI don't understand it, but I like it\n\nI'm extremely impressed with the overall level of polish in this app. The interface is excellent and, once you get used to the way scaling/rotating works, it doesn't take long to start creating something beautiful in a way that could only ever work in VR.\n\nBut I have to admit, some of the brush options are quite perplexing. In a lot of cases, you're simply not going to have the right tool for the job. For example, there's a shaded/unshaded/toon wire tool, and a shaded/unshaded/semitransparent/metalic hull tool. Why the inconsistency? What if someone wanted a toon shaded hull, or a semitransparent wire?\n\nMeanwhile, there are some brush options that aren't very useful at all, and seem more like tech demos. The Christmas Lights tool is cool, sure, but its only ever going to be useful if I actually want to draw Christmas lights. I'd love it if they spent some time ensuring the brush options were more robust and less gimmicky. Having fewer brushes but giving them customisable settings, as in many 2d paint programs, would be a dream.\n\nBut I suspect there aren't going to be too many more major updates for this app. So I'd recommend buying it only if you're ok with improvising when what you need isn't an option, and creating art which ultimately has a bit of a messy, sketchy appearance\n\nHelpful | 5", "HePE27Feb 9 at 8:50 PM\nGreat app..no easy way to print though\n\nI bought this after watching https://youtu.be/zXJtxSpFdro (this is an artist being able to make a printed sculpture of himself) and thought that extracting an OBJ file for 3d printing would be straight forward after uploading it to Poly.. boy was i wrong.. i scoured the internet and found various ways people advise you to do this with no success. This process should be made easy by the devs... Or at least do not use that video for advertising. Maybe i just havent found the proper way to do it yet. I promise to update this review if i do.\n\nThe app without the 3D printing concern is AMAZING.\n\nHelpful | 3", "bennwuestFeb 5 at 9:08 PM\nVery good, needs more.\n\nCall me crazy. This app has several neat things about it, but it doesnt feel like enough. Ideally, Id love this but also with an option to animate things, a better cursor to more accurately predict where my drawing begins (especially for the more particular details), and new environments. Those wishes aside, its a great way to experience creativity + VR all in one.\n\nHelpful | 3", "lilinandoMar 29 at 1:53 PM\nMuch fun\n\nI have no artistic ability but I have fun playing around in this app especially for the 3d aspect of it\n\nHelpful | 0", "hfmm99Apr 15 at 7:19 PM\nGreat App\n\nPlease keep adding more tools for modeling like gravity Sketch\n\nHelpful | 0", "Peiji.xoApr 21 at 8:07 PM\n\nAwesome\n\nHelpful | 0", "CloudedWisdomJun 17 at 2:02 PM\nTilt Brush\n\nIntuitive and Mindblowing.... well worth investing some time on this.\nHopefully updates will provide even more brushes and effects, but the platform is truly magical.\n\nHelpful | 0", "alysamadridJun 30 at 8:59 AM\nAwesome!\n\nIts honestly amazing what you can do with this app. If you like painting this is a must have.\n\nHelpful | 0", "TheIVCrowingNov 20 at 11:31 PM\nShould be included with all Quests\n\nThis app is such a beautiful way to showcase the capabilities of the device while allowing users creative freedom and infinite possibilities. It rekindled the artist in me and it's seriously so crazy the kind of art you can make with this. The various tools extend far past marker and paint brushes but they also have movement with particle effects on smoke and electric flows and more. It took me by surprise but it adds a whole nother element to the art that made me go \"Whoa\". I chose the title because it seems like the perfect app to have included on the headset. Every owner given a magic paintbrush able to share their creations with the world. It sells itself at that point imo. Idk if that's ever possible but just a thought haha. Seriously. Awesome app to have fun and relax with.\n\nHelpful | 53", "serpe.massimoApr 11 at 10:54 AM\nOttimo\n\noption for left-handed people?\n\n\n\nC'e' l'opzione per i mancini?\n\nHelpful | 1", "GLORYVR25Mar 25 at 6:13 PM\nGreat but difficult\n\nThis is really soothing and fun but I wish it was just a BIT easier for beginners\n\nHelpful | 0", "akshanshMar 15 at 5:11 AM\nMy lifeline inside VR.\n\nIve been on it ever since I bought it. A must have. Im a designer and I create VR experiences inside Tilt Brush.\n\nHelpful | 0", "MERRYOLDESOULMar 25 at 12:01 PM\nGreat Game! Lots of ways to paint\n\nThere are so many ways you can paint! It is really awesome\n\nHelpful | 0", "Wyrd_TrapezoidJan 27 at 12:35 PM\nspectacular unlimited possibilities\n\nI can come here and explore and create without limits. As an artist, I find Tilt Brush to be a tool both to create in new wondrous ways as well as a method to look inwards through uninhibited expression.\nEven if you are not an artist, Tilt Brush gives you a bunch of art tools to unwind as you create whatever you can imagine in an unlimited expanse.\nGreat for reducing stress and brain storming too!\n\nHelpful | 3", "Wild_FrostMay 10 at 12:05 PM\nExcellent and room for improvement\n\nI always loved to doodle for the heck of it but this app... is next level amazing. I love the variety and ease of use. My only complaint is that there is a lack of basic 3d shapes. I was hoping this would help my wife design cakes but you can't just select to make a cylinder (at least not on the Quest). Other than that, I really enjoy being able to be creative in 3d\n\nHelpful | 0", "ismael.aurayJul 4 at 5:22 AM\nGreat!!\n\nVery nice VR experience.\n\nHelpful | 1", "nubin01Jan 16 at 12:05 AM\nEasy to learn, difficult to master\n\nThis is a great app, it's simple enough to pick up and learn the basics. You can jump straight on and start drawing. Controls are simple to use and within 20 mins you will be flicking back and too between menu's and brushes.\n\nThe reason I didn't give 5 stars is I feel like there could be more brush options, a simple thing like a rubber to rub a small section rather than just the one that removes the whole section that you brushed on that one stroke.\nIt only explains the basics, I learnt a lot of what can be done through watching YouTube videos.\nYou can't upload it to Google poly and social media directly from the app\n\nOverall it's an amassing app, would have given 4.5 of I could\n\nHelpful | 4", "vernalthedeerMar 1 at 8:19 AM\nJust as amazing as I had hoped\n\nTiltbrush was why I wanted a VR set for the longest time, and my God is it worth it. I love being able to change and do anything in this form of art.\n\nHelpful | 0", "RoachMomentumJun 2 at 4:12 PM\nEpic.\n\nI was a bit hesitant at first but this app is amazing!!!! Its super easy to use and a must have  especially if you like to draw or create. Definitely an experience.\n\nHelpful | 0", "BadGamerKatJan 26 at 8:29 AM\nThis is Amazing!\n\nI popped in to the Tiltbrush app last night before bed just to check to see what brushes were available. Next thing I knew I had painted a snowman in a snowy field with actual falling snow. I added some hills and trees and some snow covered bushes and didn't realize 2 hours had passed in the blink of an eye. I LOVE this app. It felt amazing to be able to make the scene big and then turn it into a miniature scene, to turn it around and move through it at different angles. I love that I can do this room scale or while sitting. Unlike most other games and apps, there is endless replayability on this one. Thank you so much, Devs. I love this.\n\nHelpful | 1", "PapaPollo04Jun 14 at 5:57 PM\nBest oculus game ever!\n\nI just got this game about an hour ago and it is already one of the best experiences ive had so far.\n\nHelpful | 0", "danchey.oculusMay 12 at 1:05 AM\nEpic\n\nA must have. Wonderful control. A variety of options. My favorite parts are the sphere grids and the animated affects put into this master piece. A true visual wonder that captures whatever your mind and imagination can create. Beautifully done. Worth every penny.\n\nHelpful | 0", "M.M.1189Jun 25 at 2:09 PM\nAutism-8 year old\n\nMy daughter who has autism and is 8 years old enjoys it. She is having a problem understanding the basic controls, but getting there.\n\nHelpful | 0", "HootyfoxJan 25 at 3:41 PM\nAmazing game! I've had lots of fun!\n\nThis is an amazing drawing game, to inspire creativity in young minds. My friend and I have had a lot of fun playing the creative game! I love all of the color schemes and textures to draw with. I dont see any reason someone that likes drawing wont like this game. The only reason I think someone might say negative things, is that you might not be able to export the sketch to some file formats. I dont need to export it as a file. If you just want to have lots of fun creating fun things, this is the game for you!\n\nHelpful | 0", "penbarrageFeb 17 at 12:05 PM\nEasy to get the hang of\n\nEasily a five out of five stars, Tilt Brush is honestly a great game, once you get the hang of it. It takes you away from reality and time feels as fast as Usane Bolt. Worth every penny, you wont be disappointed with this... experience.\n\nHelpful | 2", "KoolCat99Feb 25 at 3:01 PM\n\nA nice application. As a user I would like to be able to define a flat surface and draw upon that. When I choose different brushes, I would like to be able to see a proper paint brush in my hands.\n\nHelpful | 0", "edwilliFeb 29 at 5:34 AM\nNo talent for art, and Ive spent hours\n\nI dont have any artistic talent. And I can even tell you why, but Im having a blast. Well worth the $20.\n\nHelpful | 0", "clagaresMar 12 at 4:05 AM\nExcellent tool\n\nOne of the most useful tool for paint artist\n\nHelpful | 0", "DevSpacerFeb 17 at 7:11 PM\nSo much potential\n\nThis is so much fun and very adaptable for many styles, i draw in cartoon styles and it provides perfect tools to make them three dimensional, so great Five stars.\n\nHelpful | 0", "freddiegreen72Jun 21 at 11:09 AM\nOmg\n\n200/200 great game BUY IT DO IT\n\nHelpful | 0", "wwaveJun 4 at 10:53 AM\nGood, but hard for beginners\n\nNot the best in game tutorial, I recommend looking a few up online:) other than that its very immersive\n\nHelpful | 0", "brooklynn.baker.3Jun 25 at 5:13 PM\nBest app!\n\nThe graphics is so realistic!!\n\nHelpful | 0", "ARK-20Mar 4 at 11:08 PM\nWonderful!\n\nI'm poor at painting but I have very good time in this app. Thanks!!\n\nHelpful | 0", "BizzareSauceFeb 26 at 4:20 PM\nGreat App/Tool Overall\n\nI've been using this for about 1 hour approximately and as a person with artistic ablities already this allowed me to use a 3 dimensional plane for the first time.\n\nHelpful | 0", "TLITC.DiabFeb 24 at 4:28 PM\nWatch Tutorials\n\nMany people will find this game daunting but if you watch tutorials you will find it to be a great app\n\nHelpful | 0", "Ill_InkDec 11 at 11:01 AM\nWill be amazing in time\n\nMy first and only game that I play in VR is Tilt Brush. Im an artist with experience in Photoshop, Illustrator, Corel Painter, After Effects, and Final Cut Pro, so I have big expectations for a VR painting experience. So far, Ive been captivated by the euphoria of being in another reality with your own art as you create it. There is absolutely nothing like it and you really have to try it to comprehend how incredible and even therapeutic an experience like this really is. In that regard, making art in VR in general deserves 6 stars.\n\nI rated Tilt Brush lower as a 3 only in regard to its limitations at this time of review, which is December 2019, and is solely while working with an Oculus Quest. I dont know whether or not the version that Oculus Rift has results in better features or not, but it seems like that could be the case due to the higher quality device.\n\nHere are a list of some of the major limitations that Tilt Brush in the Oculus Quest has at this time, which you will want to prepare yourself for if youve worked at all in Photoshop or something similar and thus have certain expectations of available tools.\n\n1. No feathering/blending tool. This is my biggest disappointment with the software. There is currently no ability to blend colors or textures together. Thats a big hang up for someone that thrives on blending pixels/data. You can work around this by creating at very large scales and juxtaposing similar colors on the color wheel and then scaling down to reduce the ability to see the divisions of color next to one another, but its a long process and a blend tool would be highly useful in this 3D space.\n\n2. There needs to be a painting snap-to function for at least the hull brush content. (Hull brushes are really just 3D brushes that create 3D shapes based on where your brush strokes occurred in space. Hull brushes create volumes instead of brush strokes, allowing you to create sculptural content.) More often than not, I use the hull brushes as a base for my object creation, and then paint over them for texture and colorization, however anyone thats worked in Tilt Brush knows the near impossibility of painting a flat stroke onto a flat plane or surface. Hand movement in 3D space is so sensitive that its quite near impossible to paint over the exact series of vectors twice. What is truly needed is the ability to select an area or series of strokes (particularly with the hull brush content) for mapping brush strokes onto as if one were actually painting onto a surface in real life. A snap-to on non-flat objects/surfaces. (There does exist three rudimentary shapes - a sphere, cube/rectangle and a pill - that you can manipulate and then snap-to but that is very limiting.) This and number 1. alone would make Tilt Brush a 5 star VR painting experience.\n\n3. Higher quality gifs. Tilt Brush currently allows you to create either snapshots (screenshots essentially from any viewpoint or scale in your art work) or 5 second gifs. The snapshots are gorgeous and just as high quality as the content you see when youre in the program. They are great. However the gifs are not even worth sharing on social media at this point, as they do an injustice to how beautiful things look in VR. They are low quality both in color and in resolution. They arent currently a good advertisement for Tilt Brush. They could be so gorgeous. If they could look like the quality of the snapshots but in video form, they would be all over the internet by now. Furthermore, there really needs to be an option for longer gifs. 10, 20 and 30 seconds would be amazing.\n\nThere are other smaller issues I have but they arent worth mentioning so early on in its development.\n\nI will change my rating and update my post if any of these three major things become a reality. No pun intended. :)\n\nOtherwise, this is still worth buying and learning if youre an artist of any kind or even dabble in art making as a hobby. Any visual artist worth their salt really needs to try this and give it a fair shot.\n\nHelpful | 34", "5tanFeb 25 at 9:07 AM\nIts amazing BUT..\n\nI absolutely love this game and i watched tutorials wich helped me alot but everyone uses pictures to help them paint something but well on the quest it doesnt work you need to connect your oculus quest to your pc to even get a image to help you wich is kinda stupid.. the quest has wifi to?! Why connect it to a pc if that gets implemented so it is really wireless i would give it a 5 star but for now its a 3\n\nHelpful | 0", "Liamo.studioFeb 28 at 3:00 PM\nGreat fun\n\nA really intuitive and fun experience and a great intro into 3D creation.\n\nHelpful | 0", "joehenry11Feb 21 at 5:58 AM\nSo cool and fun\n\nI dont know what im doing but its so much fun 10/10. More than just a paint you can get lost for hours\n\nHelpful | 0", "K_Doll13Mar 11 at 3:23 PM\nGreat for art, just a little lacking\n\nFun for art but still feel like it could use a little something to be great.\n\nHelpful | 0", "M3-NGJan 8 at 9:01 AM\nThe best disappointment\n\nYou literally cant take this app seriously, and its a good thing.\n\nI bought this app expecting a software for design purposes, what it turned out to be was bubble, glitter and all that shiny stuff.\n\nI was a little bit disappointed at first, but still decided to give the features a try, and wow, I had the time of my life, I felt like a little kid again, it was truly magical.\n\nIn the end, I realized that maybe this app wasnt supposed to be taken seriously from the very start, just unleash your creativity and have some fun!\n\nHelpful | 0", "jukaszJan 17 at 3:32 PM\nLove it, as an art therapist there is...\n\nA huge potential for tilt brush to be used with art therapy.\n\nAS AN ARTIST, I love this. It takes a bit to get a hang of the controls but its amazing to spend more time inside it and realize new things you can do and I feel accomplished. Id still recommend looking up YouTube videos on some tips and tricks..I was trying to create a pool of water and spent a lot of frustration trying to figure it out..\n\nI gave it 4/5 because of some features that werent ported over from the rift. I was really excited to see that you could animate some brushes along with music youre listening to..only to find out its not supported on the quest.\n\nHelpful | 2", "bridgette.ewing.1Apr 26 at 8:26 PM\nWorth every cent!\n\nI was hesitant buying this because how could an app for drawing be worth the money. Well let me tell you....WORTH EVERY CENT! Stop wondering if you would enjoy it and buy it now!! We played for hours our first night after downloading it!\n\nHelpful | 0", "VictorVanNedFeb 10 at 8:03 AM\nMake it left handed please\n\nGreat app! But I'm left handed... Please make it so I can draw with my left hand and have the options on my right hand.\n\nIt would make my day! Thanks!\n\nHelpful | 5", "leonid.korobov.ethFeb 1 at 4:36 PM\nMy favorite vr app right now\n\nOnly imagination is limiting factor with tilt brush. Would be nice to do some animated things. Hopefully google will add this feature in future.\n\nHelpful | 1", "Zombie_KidJan 1 at 3:33 AM\nCould use small fixs / Awesome app\n\nI got this game a while ago and right now its my go to, but Ive slowly picked up some minor inconveniences such as: the selection tool doesnt select my strokes fast enough, like if I am creating an animal, and I need to relocate it, I zoom out, then put the whole sketch in the bubble, but it selects single strokes instead of everything touching and inside the bubble. if there was a option for selection speed in the options that would be awesome.\nIRL I reference images to create my own unique sketch, and the process of connecting my oculus to a computer and finding the tilt brush media library is inconvenient because I dont have a computer. If there was an app that I can download, on my phone, that can import photos and view my sketches away from home, and the oculus headset.\nThanks for reading this\n\nHelpful | 1", "OldmangamesJan 31 at 7:14 AM\nMust Need!\n\nThis game is super fun drawing professionally or just for fun! Its a must need app if you have any interest in any kind of art!\n\nHelpful | 1", "charlesmaurerspookyFeb 18 at 8:22 PM\nGreat for any age\n\nThe artistic do whatever you want to\n\nHelpful | 1", "NoodlesyaboiFeb 21 at 11:19 PM\nGood for relaxing\n\nIt a great game/app to relax all that is missing is music and more conventional brushes\n\nHelpful | 1", "RFGRavenJan 18 at 5:59 PM\nNice game but...\n\nIts overall a good game the only problem I have with it is that its hard to find a brush imo that is actually like normal all of them have some sort of special property but otherwise its a amazing game and is definitely worth its price.\n\nHelpful | 1", "misterzagDec 31 at 11:11 AM\nIncredible experience!\n\nThis is really one, if not my favorite thing about the Quest. It's not as easy as it seems and there's certainly a depth to it. As I keep trying to build worlds, spaceships and learn how to use all the tools provided, I'm really starting to make cool sketches.\n\nHelpful | 0", "pyrodeanFeb 15 at 10:36 PM\nBest\n\nGets the job done\n\nHelpful | 1", "mac54321Jan 25 at 5:40 AM\nMind blowing\n\nIts the most incredible thing Ive ever seen. I just got started with it and already Im very impressed. Great App!\n\nHelpful | 1", "PikminifiedDec 18 at 3:58 PM\nNearly perfect\n\nMy only criticism is that you cant use the eraser like an actual eraserat least, as far as I know. It erases the whole brush stroke, which is frustrating when only a little bit of it needs to be removed. Other than that, its amazing. So much fun, even as someone who isnt particularly gifted with digital art. Highly recommend for anyone and everyone, novices and professional artists alike.\n\nHelpful | 1", "Firerabbit66Jan 31 at 6:44 PM\nAmazing\n\nWoah\n\nHelpful | 2", "allessandro20Dec 14 at 12:37 AM\nSuper Immersive\n\nImagine being able to create anything you want, whole worlds if you wanted. Then imagine being able to walk through those worlds. Tiltbrush allows you to do all that and much more. With good graphics that immerse you in whatever you design, the only problem youll have is not being able to believe your eyes, when you see what you can create.\n\nHelpful | 2", "Rogue598May 18 at 5:27 PM\nLove it\n\nDraw to your hearts content\n\nHelpful | 0", "SUSIGAMESMay 23 at 9:11 AM\nIts okay and nice idea\n\nBut the quest hardware is still crap and pixie \n\nHelpful | 0", "Nicky.P.SmalleyDec 8 at 3:45 PM\nHas awoken my artistic side\n\nAt school I drew a little, but I couldnt paint, or anything like that. I tried, I wished I had the talent, however it wasnt to be.\nThen I discovered tilt brush and suddenly I feel like Van Gough. Im painting simple thing, complex things, beautiful things, and bizarre things.\nIm overjoyed with what Im doing, and I couldnt be happier.\nDont get me wrong, there are some aspects of the controls Id change if I were developing this app, but it does the job and helps me be more mindful.\n\nHelpful | 3", "SedateWingsMay 10 at 12:37 PM\n\nSo much fun!! Easy to useand worth the price!!\n\nHelpful | 0", "Deathfang2341Dec 25 at 11:11 PM\nCreative\n\nI love this app, it is my favorite in VR. For an artist & animator its a dream come true. For the future I would love to see more options, brushes, textures and 3D brushes. If you are and artist you will love it.\n\nHelpful | 1", "Fire9BallMar 19 at 11:37 PM\nAmazing!\n\nWhen I first got this game, I didnt really enjoy it much, but after about an hour of playing I started enjoying it and got hooked with making 3d art! One suggestion is to add a brush to create a polygon like shape, like the sculpt feature of blender. Other than that great and fun app!\n\nHelpful | 0", "wisejellybean13Dec 6 at 2:04 PM\nFrom your dreams\n\nIve been waiting a long time to get access to this game, and it has been 100% worth it. Tilt brush brings out the kid and me and allows me to create beautiful dream worlds. There are tons of brushes, tons of settings, and I couldnt ask for anything better. Thank you oculus!\n\nHelpful | 2", "milo-vrJan 16 at 4:38 PM\nWORTH IT\n\nIf youre an artist and you like detail this is the thing you need to make illustrations easy\n\nHelpful | 0", "NOVACrunchNov 30 at 5:23 AM\nPlease add more features\n\nI hoped that i can use not a paper ribbon like brushes but also thick 3D strings kinda brushes too, its a 3d painting app, not a 2d painting app so i guess it should act more like it. Also, erasing is very bad, i wish it would have a brush kind of eraser not an erasing tool that erase the whole stripe i drew. And there r two more things, moving scaling and moving objects r kinda hard to use, i want to be able to move and scale the whole canvas and rotate it too! Not only scale the canvas, and i dont want to SELECT every single stripe i drew so i can scale it, move it and rotate it, simple fix to that enabling layers or objects, in each layer u will be drawing whatever thing u want then u can select the entire layer scale it, move it, rotate it as a whole layer. With that if i draw a bird and a cat, each one of them will be on its own layer and i can mover the bird how ever i want, rescale it and rotate it without affecting the cat and without having to SELECT every single line i drew for the bird\n\nHelpful | 16", "miclai316Dec 18 at 8:17 AM\nI never write reviews\n\nbought oculus quest for 2 weeks, finally found the app that makes this device totally worth it.\n\nThis is the only game that I could spend 2 hours non stop having so much fun and creating so many cool stuff.\n\nWorth every penny\n\nHelpful | 1", "DinnydoDec 30 at 6:12 PM\nIts really good!\n\nI feel like it needs an auto save option in the settings so you can turn it off or on because the first time I played tilt brush on my oculus quest it went flat and it did not save and I did heaps on my creation but its still really good\n\nHelpful | 0", "HeatedLearnerJan 10 at 9:16 AM\nLove it and all my family loves it\n\nEveryone who's played it seemed to enjoy the game. Only thing I would add is google photos support and hand tracking\n\nHelpful | 0", "LucidDexterityDec 26 at 12:27 PM\nThis the reason\n\nThis is the reason I bought the quest... I love this application. Cant wait till my portfolio grows so I can reach out to the makers of Tiltbrush for a project I have in mind\n\nHelpful | 1", "Pyro572Jan 18 at 5:56 AM\nBest way to show new people the quest\n\nFor those who want slow and non violent this is perfect\n\nHelpful | 0", "redx939Dec 28 at 6:02 AM\nNice and very satisfying application.\n\nIt has nice brushes and tools. I wasn't expecting to have in a 3d painting app but this is one of the best experience i had so far in oculus quest.\n\nHelpful | 1", "skeletonkieJan 7 at 10:57 PM\nIncredible and expansive\n\nThe ability to create entire worlds in a seemingly boundless virtual room is incredible! I. am. addicted.\n\nHelpful | 0", "Yankee_wit_no_brimMar 27 at 10:31 AM\nGoogle tilt brush review\n\nI use it to recreate famous paintings in VR while my brother practices mandarin characters on this app because it helps him.\nLearning mandarin or just want some stress relief, but this app\n\nHelpful | 0", "TheFreddyGamerJan 12 at 12:57 PM\nSuper good.\n\nIt's like when I'm in this app, I know how to draw perfect portraits!\n\nHelpful | 0", "jadamsartApr 16 at 6:38 PM\nGreat production\n\nCant wait to throw it into unity and make experiences. I feel like a new man!\n\nHelpful | 0", "JeepersTheCrazyAug 26, 2019 at 3:44 AM\nNOT actually a limited version!\n\nI see a lot of reviews saying that this version of Tilt Brush is missing a lot of the essential components. Actually, you just have to turn on Advanced Mode and you will get many more tools such as reference images and shape tools. It may not be everything, but its more than you start with.\n\nHelpful | 48", "kalnaellisDec 12 at 2:16 PM\nTilt Brush\n\nI love Tilt Brush, but please could you update Quest version so that we can customize our prefered brush palete? I find that there is too many brushes, I dont need them all. That would be great additional feature.\n\nHelpful | 0", "jking015Nov 29 at 9:48 AM\nJRTV (Reviews): Tilt Brush\n\nTruly immersive tool. The ability to use room scale or not is clutch with the zoom features. 3D drawing is a mind blowing experience and worth buying with this app.\n**I would love to see some type of native music added, though its easily solved with a phone and headphones.\n\nHelpful | 0", "cj.searsNov 1 at 1:15 PM\n\ngood experience and a nice bit of kit ...it could do with a better eraser that would allow more controll of what is being erased ......a blending tool....an air brush ...probably basic tools that are found in most drawing software..............could also do with a bigger memory for the drawings/sketches as currently it is too small and soon fills up just drawing a few trees NEEDS TO BE BIGGER awaiting response please\n\nHelpful | 18", "JSE71Apr 23 at 4:53 AM\nAwesome\n\nAwesome, 4 stars cause.... nothing is perfect and i cant wait to see whats around the corner for this app\n\nHelpful | 0", "dylan.sulleyJan 14 at 9:58 AM\n\nReally good just wish there was more brushes and environments like a solar system one or a city one \n\nHelpful | 0", "jman64Dec 28 at 5:27 PM\nLOVE IT\n\nTHIS IS AMAZING FOR DESINING CHARICTERS AND MAKING HOUSES !!!!!!!!! Buuuuit how do I switch hands because Im not sure if I can bee left handed on it soo plz help\n\nHelpful | 1", "ioi1000Jan 14 at 9:02 PM\nGood but missing a few tools\n\nIt would be nice to have different shapes for the guides. Like cylinders, cones, etc.\n\nHelpful | 0", "LoganSmashJan 2 at 10:05 PM\nIt's great\n\nYou can draw/ sculpt in and manipulate a fully 3D environment. So cool!\n\nHelpful | 0", "dmcnair8Nov 17 at 8:05 AM\nAwesome fun times\n\nIt doesn't pretend to be a Serious Artist Tool, and succeeds as a fun time to be creative. I found the controls, such as they were, easy to access and understand after the 5 second intro the app gives you your first time. My family members got even less intro than that! \"Here it is kid, wave your hands around and have fun\" was more than enough for the younger members of the fam. We've had a blast making environments, figures, shapes, and sharing and enjoying.\n\nHelpful | 0", "Rozzie_BugDec 25 at 2:05 PM\nFun\n\nFunnest game EVER!! As someone who loves drawing I can say that his game was like a dream come true! 5 stars!!\n\nHelpful | 0", "Ulrik.jonssonJan 18 at 7:00 AM\nOk\n\nThe game is ok but to expensive for what it is.\n\nHelpful | 1", "sturwersgodDec 25 at 5:25 PM\nMagic\n\nIt feels so unreal when you first go on and start to create your imagination this is a 5 star game for sure\n\nHelpful | 0", "MasterAirscrachTGDec 28 at 4:51 AM\nGreat painting tool\n\nAn essential to any artist.\nHowever there needs to be tools for 2 and 3D shapes.\n\nHelpful | 0", "gabe.leisticoJan 2 at 8:47 AM\nOne of the best games\n\nIt is a good game to draw and have fun\n\nHelpful | 0", "BryanMelugin1977Nov 10 at 3:36 PM\nThis is amazing!\n\nWhile admittedly limited in some aspects, this tool still offers an amazing range of options for tools and materials and control over the work space. I love this program, and the fact that you can share your creations on the Google poly site. For the price, it's totally worth it, and a great creative tool that takes 2D art into another dimension!\n\nHelpful | 2", "domingoriveravelezDec 25 at 4:34 PM\nAwesome\n\nAs part of the available apps for Oculus and for a beginners it's great!\n\nHelpful | 0", "JockywebJan 26 at 7:27 AM\nIt's good, but frustrating\n\nThe screenshot tool is absolute trash, which also stains your image with a tilt brush logo.\nOther then that it's great.\n\nHelpful | 1", "Fritz_the_dog_narwhaApr 3 at 10:43 PM\nVery fun!\n\nThis game is very fun and theres alot of options on how to paint!\n\nHelpful | 0", "Evan.LushDec 17 at 8:17 PM\nPretty darn good\n\nWish you could do more sculpting and more with 3D brushes instead of flat ones.\nAlso wish you could erase without erasing the whole line, just a part of it.\n\nHelpful | 1", "Masaru.KatoNov 6 at 7:48 AM\nAmazing app with endless possibilities\n\nThere's so much you could do and experience in this app. Theres good set of tools to draw whatever you want in 3D, from a tiny incet to a giant elephant and then share it online. You can also import 3D models and images.\n\nYou could step into other people's creations. Not very often you can stand next to a life size iron giant or face to face with a superhero, and this app let's you do that and more. Sometimes it gives you warning when loading complex drawing due to the limit of the Quest, but I haven't encountered anything that it can't load yet.\n\nThe title is also cross buy so you could get the app from the rift store as well without paying extra.\n\nHelpful | 0", "gentch707Mar 11 at 7:58 PM\nGreat game, some bugs tho\n\nThe experience so far has been great, no problems using the interface because it is very user friendly. My only complaint is that occasionally the app crashes. This was a big problem when an hour and a half of work gets deleted.\n\nHelpful | 0", "sadie.plantDec 26 at 3:40 PM\nGreat\n\nNot a lot to say its really good\n\nHelpful | 0", "RoBNewManDec 25 at 4:58 PM\nBrilliant fun\n\nBlown away within the first 10 minutes!\n\nHelpful | 0", "Kalibaba66Dec 12 at 4:43 PM\nAwsome\n\nthis app is an awesome way to explore your creativity. This is how you show VR off and it is a\n\nHelpful | 0", "Alex_ScovilleMar 14 at 1:22 PM\nAwesome\n\nI've never tried the original PC powered version of this app but this quest version is pretty awesome for what it is.\n\nHelpful | 0", "Dr.OpenheimerDec 6 at 5:49 AM\nI love it but I could love it more\n\nSo far a very enjoyable experience easy to create large or small scale world's to enjoy.\nThe only problem is the quest doesn't support all the features the game is capable of.\nMy wish list is\nSaving and umpiring your own made objects.\nA spray can, cause I can't for the life of me make a decent set of eyes in 3d just let me paint on the excusing surfaces with spray.\nCopying and pasting.\nGive quest those things and I'll rate it 5 stars straight away.\nThis game is the while reason I spent 700aus on vr and im a little but disappointed but mostly happy\n\nHelpful | 2", "solarsinDec 23 at 11:48 AM\nCan not do perfect cycle\n\nYou can draw straight line but you can not do perfect cycle. It is the most important shape out universe. Please try to fix it . Thank you\n24 12 2019\nupdate with I can make the perfect cycle now thank you so much but i los the ability to painting onbthe guidelines.\nplease check on it I hope it just a small bug. honestly I put all my money on this program, It is making art to another level. thank you\n\nHelpful | 1", "jeffalbrightMar 23 at 6:16 AM\nMy wifes favorite\n\nConvinced her VR is amazing. She loves it as much as I do now.\n\nHelpful | 0", "JoeKin6Nov 26 at 4:02 PM\nReviews are dumb\n\nSome a-hole, is giving it a 1 star because of a missing feature, and if he gets it he'll cough up the five stars. F that dude\n\nGREAT EXPERIENCE, HOPE THEY KEEP ADDING TO IT.\n\nHelpful | 5", "ejpahlsNov 9 at 12:33 PM\nJust would like a few updates\n\nThis app really gets my creative juices flowing. I love it. My biggest project that I would like to do would require more precise lines, though. If ever there was an update that included a 3D grid, or a measuring tool, that would help. Maybe make an environment that had a 3D grid, then when I was done, I could change the environment. The straight edge tool, and those gridded templates are great, but not everyone can get 90* angles perfect.\n\nHelpful | 0", "Impro5Nov 30 at 5:59 AM\nIts a Must have\n\nIf you have a VR headset you need to have this, its an amazing must have. Thanks google very cool\n\nHelpful | 2", "summer.f.zhengDec 6 at 2:09 PM\nlove it !\n\nbeing a painter for decades - i am feeling a big difference in 3d and 2d paintings :)\n\nHelpful | 0", "Gabel.oneNov 27 at 5:13 AM\nBest one\n\nNew way to make Art!!!! Wonderful!\n\nHelpful | 2", "futur.passe.soiDec 5 at 12:03 AM\nIt's pretty good\n\nWould be cool if there were more poly files to upload, would be cool to import sound & or video from mac.would also be cooler with more environment to chose from. I like the idea of building my own VR game... In time I guess. Tilt brush is cool for what it is... Needs more updates\n\nHelpful | 1", "UhluhtkNov 9 at 10:52 AM\nRequires patience\n\nI love this game personally and have invested many hours into it, but I would not recommend this game to someone without patience.\n\nHelpful | 2", "jeremy.holbrook.925Dec 6 at 9:48 AM\nLove it!!!\n\nFantastic tool! Very user friendly!\n\nHelpful | 2", "ivangranolaMar 15 at 5:52 PM\n14 day trial!?!\n\nHow do I get a refund? I've played less than 2hrs\n\nHelpful | 0", "SysebosOct 21 at 10:50 PM\nGreat Art App!\n\nA fine app that can be used to create and share artworks using a variety of tools, colors, and brushes! While it may seem overwhelming with what it's presenting to you at first due to a lack of an in-app tutorial (tutorials are offered via YouTube videos), it's still a wonderful app through and through!\n\nHelpful | 5", "CybexxOct 17 at 12:14 AM\nGreat Quest Experience\n\nThis is a really impressive cordless version of Tiltbrush with nearly all the features you would expect\n\nBeing able to paint freely without managing a cord is revelatory. I feel like only the craziest power users are going to disappointed by the complexity and model limits and theyll have to stick to desktop for now.\n\nHelpful | 0", "ChimeraFenixxOct 16 at 9:52 AM\nAmazing.\n\nThis app is amazing and will give me and people like me thousands of hours probably has amazing painting experience. I agree with another reviewer that the people that say it doesn't have enough tools or but it lacks most common capabilities haven't spent enough time playing with it. Duplication for example was really hard for me to figure out at first once you have it down though, it's perfect. Just amazing.\n\nHelpful | 0", "drockenatorNov 24 at 8:57 PM\nGreat creativity app\n\nA lot of fun in basic mode, unlocking the advance mode setting brings it to a new level\n\nHelpful | 0", "EternaTeaOct 12 at 8:47 AM\nMy first VR game\n\nMaybe Im biased? I loved the immersive experience. Im not artistic, but I loved playing with the different textures. The first thing I drew was a smiley face. Then a flower, followed by a burning log fire.\n\nAs I painted these things with a space backdrop, I couldnt help but marvel at how far humanity has come on this planet. What did the first humans paint on cave walls? Images of themselves? Their environment? Really incredible to think about this connection with our past and the small similarities we share with our ancestors today.\n\nHelpful | 0", "MaryamFrogNov 28 at 6:33 PM\nAmazing\n\nI still cant believe how AMAZING is this app...WOW\n\nHelpful | 1", "TeranoxisDec 6 at 3:07 AM\nVery nice but could get better\n\nReally enjoy it but tt can be improved with more 3d tools\n\nHelpful | 1", "MoulderFaulkerOct 13 at 6:00 PM\nNot the best experience\n\nI thought there would be some kind of tutorial, but you need to figure things on your own. It would be nice to be able to upload your Google Photos pictures. If there is a way, it's not obvious enough for me to see that option. It is nice to upload other people's creation. That is pretty cool. I guess I can look online to figure out how to use the functions, but it would be nice to have a tutorial like any other game. It would be cool to be able to create still animations.\n\nHelpful | 9", "Draig-talamh-AdhNov 24 at 8:53 PM\n\nExcellent tool for Artists, and People that just want to create something Amazing. Thanks.\n\nHelpful | 2", "brettdrumOct 25 at 11:40 PM\nMost impressive art tool ever made\n\nThis is the most impressive art tool Ive ever seen . Mind bogglingly brilliant . Ive literally dreamed about being able to do this . Pure magic really\n\nHelpful | 3", "HutchFam1205Dec 25 at 6:16 PM\nIts great but some disabilities\n\nWish there was a copy and paste feature would make a 1 hour long painting take 15 min\n\nHelpful | 0", "KappaxbetaNov 8 at 4:10 PM\nI feel lock\n\nSo many possibilities to create things, its overwhelming. A lot of brushes and a throw though utility make it worth to pay for it.\n\nThe only thing is that all what can create will be in the google universe, so my motivation is not screaming to put to put more effort in.\n\nHelpful | 2", "Steve_BamburyOct 29 at 2:46 AM\n\nQuest version is actually better than I expected. Really missing the camera tool but from what I hear its on the way hopefully\n\nHelpful | 1", "MAG2019Oct 9 at 9:08 PM\nAmazing\n\nI love how i can make almost anything i want including clothing art and many more things. The only small thing i wish was a thing would be stuff like new brushes and cool tools and diffrent things like that.\n\nHelpful | 2", "StaticCloudOct 9 at 12:12 PM\nGreat Tool Google!\n\nReally well made google drawing app. Has all the tools you'll need like guides to make flat pictures or spheres, supports reference images by connecting your headset to a pc and to everyone that's saying a lot of features are missing, *click the badge icon on the left controller. It's called advanced mode*\n\nHelpful | 0", "AE5NLSep 23, 2019 at 11:05 PM\nWOW I just can't get over it\n\nInitially I stayed away from this. I thought I just want to play games and other VR type activities. I love to draw and am OK at it. Adding the 3rd dimension has just blown my mind. Along with the ability to zoom in and out to create tiny detail, this is simply amazing. I would like to see where I can smooth / blend objects to almost sculpt for lack of a better word. I will continue to enjoy and create.\n\nHelpful | 0", "mikelovesdogsNov 9 at 12:55 PM\nGreat if you like art\n\nIf you dont like art you will waste your money\n\nHelpful | 1", "Darkcgi101Oct 6 at 5:01 PM\nA must have on VR.\n\nI would recommend this to everyone. This app is what got me to get the quest. I love it. Lots of updates with new features and many more coming.\n\nHelpful | 2", "txlcobraOct 10 at 7:54 PM\nGreat app\n\nI'm not even an artist and I have a great time with this and even made a pretty good piece but I also have a question I would like to have a sculpting option on here or put oculus medium. On the quest\n\nHelpful | 0", "katlinmathisonNov 8 at 8:54 PM\nWorth The Price of Admission\n\nA beautiful, easy to pick up new medium. Incredible!\n\nHelpful | 1", "CoradrosVDOct 5 at 5:09 PM\n\nEver since they re added the feature to view reference images, tilt brush has been fun again. I'm just missing the video recording feature. I would also love it if you could set the base platform to be solid. Don't know if it's possible but want it to be.\n\nHelpful | 1", "321MartianDesignAug 30, 2019 at 1:45 AM\nLimited version!!!!!!\n\nTilt Brush for Quest is STILL missing many, important features that the PC version contains, even after the latest Aug 2019 update. Still missing the ability to make videos (such a key feature for this app). Missing the various selection tools. Missing the ability to make spheres and other objects. Missing the ability to make art move to music. Missing direct export to social media. Constant Out Of Memory issues really limits what you can make. Also, Id like to see exports and reference photo imports via Google Drive so you dont need to constantly connect to your computer. Please update this app again soon!\n\nHelpful | 36", "CharredToastOct 14 at 12:21 AM\nA Lot of Fun\n\nIt feels amazing to write and paint in the air and make three dimensional art that can be viewed from all angles. There is nothing else quite like this.\n\nHelpful | 0", "westy24Sep 28, 2019 at 12:55 AM\n30 minutes in and Im an artist\n\nI was a little worried painting in 3D .but I must say within minutes I was testing out all the brushes and other tools,Im not arty at all but after 30mins Id managed to paint something I was proud of . I think there is room for improvement. I cant seem to find some colours (black ) in the colour box . And I think it needs a trimming (delete ) tool to trim whats been painted instead of it deleting a hole section . Apart from that , I really lost myself in this . Which is what I want to get away from everything\n\nHelpful | 0", "BringhurstSep 16, 2019 at 7:49 PM\nThe thrill of building a confined space.\n\nBuilding an open cave with a fire place and the trees outside, a moon you can touch and a fire that licks the rocky ceiling. There's nothing like this anywhere else.\n\nHelpful | 3", "youmnaosseiran_Nov 24 at 4:16 AM\n\nwe should be able to download an image or export it from a MacBook, iPhone or just from oculus gallery\n\nHelpful | 2", "GirlGeek101Oct 20 at 12:03 AM\nblew my mind\n\nThank you for an awesome experience. Could you art tutorials to the palette please?\n\nHelpful | 1", "larsonmattrOct 2 at 9:32 AM\nBest drawing app for Oculus Quest?\n\nI just discovered how to make solid objects in Tiltbrush and more advanced 3d features. I now realize how fantastic this app is on the Quest. Its a blast!\n\nHelpful | 2", "Azazel08May 22, 2019 at 3:09 PM\nThe most surprising Quest app IMO\n\nI wasn't expecting much from this because I owned it on my Rift and I really didn't get much use out of it, but now that I am free to pull up other people creations and walk around without a cord it is much better. I enjoyed creating my own art as well for the first time in a long time. I actually created something I am proud of and my family can now get inside a small world that I created.\n\nHelpful | 245", "ssSnakeSlayerOct 20 at 8:48 AM\nGreat a few glitches\n\nWhen I am playing a part of my left hand comes off and has a few tracking errors but otherwise it is a great game.\n\nHelpful | 2", "Olibrrr2005Oct 6 at 10:15 PM\nReally fun\n\nI expected this to be ok at best, but it's amazing. Lots of tools and very convenient. It's also fun to see other people's sketches!\n\nHelpful | 0", "Old-ManOct 1 at 6:33 PM\nNeeds casting feature for Quest\n\nThey also need to make it clear on their website that the oculus quest isnt currently able to hook up to your pc unless you apply for a developer account (which forces you to appear on the occulus store page). As a creator, not being able to edit my works using apps available only on PC is a huge limitation, and this needed to be made clear BEFORE I bought the Oculus Quest for use with this program. Especially since the only reason I bought VR at all was to use this program. The software itself runs beautifully, though it could benefit from a smoothing feature and a preselect list of colors, most especially things like skin tones.\n\nHelpful | 3", "aaron.sommers.1253Oct 24 at 7:18 PM\nLove it\n\n.\n\nHelpful | 0", "cliv3devOct 24 at 9:42 AM\nExcellent!\n\ngreat graphic tool!\nEasy to pick up, event for children under 8 yo.\n\nHelpful | 0", "seechimiSep 26, 2019 at 3:32 PM\nLove it but...\n\nLoving it so far made some good artwork! Im just sort of getting bored..? Idk it just I feel like theyre could be more tools and brushes. Still a good art app though! Do recommend! :)\n\nHelpful | 0", "ZadyLeeJun 1, 2019 at 2:41 AM\nAmazing... but no reference photos? \n\nWhat an amazing painting app. I took my guardian off and made 3 different worlds that I can walk in all over my home.  That being said, no reference photo feature? Why? I thought there would be an option to import your own photo for reference just like the PC version. Hey google update app please \n\nHelpful | 49", "JedislowpokeOct 11 at 1:31 AM\nA must have for the quest\n\nI cant wait for more tools,and maybe even some kind of drawing game as a multiplayer option?\n\nHelpful | 1", "Blue_JelloOct 1 at 4:06 PM\nA must have VR app\n\nThis app is the best. It only needs background music and the devils lettuces\n\nHelpful | 0", "JforssbladOct 13 at 3:19 AM\nCool\n\nReally great app but it's hard to paint in 3d\n\nHelpful | 3", "12vdcSep 1, 2019 at 7:50 AM\nSo much potential but\n\nDon't get me wrong I am using this app and I do enjoy it very much however their is a great deal missing as I know Google is very well aware of 3d design having a stand alone program. Why would you not add gravity basic animation. Also it would me so much more immersive if you could sculpt with hands. I'm not really sure how this program would be useful as of yet but I do look forward to the updates.\n\nHelpful | 5", "skabeck_xSep 28, 2019 at 6:49 PM\nA Must Buy!\n\nIf you are creative in any way, than you need to buy this game\n\nHelpful | 0", "RiftmasterTVAug 10, 2019 at 2:45 PM\nBeautiful Port\n\nI honestly expected to end up refunding it. I thought it would never be able to look at pretty as the PC version.\nOh boy was I wrong.\n\nThe bloom is amazingly executed. The glow just slowly fades as you draw more.\nI could not perceive any aliasing either, which was a major suprise for me.\n\nOnly thing I would add is the ability to start a new project right after you save your current one.\n\nI rate 94/100\n\nHelpful | 0", "terraskOct 20 at 11:49 AM\nCool\n\nVery cool\n\nHelpful | 0", "cjesqipSep 12, 2019 at 8:46 PM\ngreat, but needs a more granular options\n\nAmazing tools & concept. But see sculptrVR for how to improve the experience with more granular control & multi-user support, etc.\n\nHelpful | 0", "xman7Aug 9, 2019 at 10:00 AM\nI love it now\n\nAt first I was intimidated with all the buttons and the layout in general. The other night I put my fears aside and tried all of the features. I must say this is a fantastic app. I feel like Tony Stark doing things to his suit in virtual reality but now with art. I love that I can make my creation very small or very large. I can spin it around or walk around it. Simply put, I am no artist or can even draw good, but this is a cool app.\n\nHelpful | 0", "mlhopeMay 27, 2019 at 7:40 PM\nExcellent port!\n\nThe mobility of the Quest makes Tilt Brush all the more accessible. It performs very well considering the hardware. Some features that I think would really elevate the product are:\n\n- Reference image support\n- Back face culled brushes for view dependent lines\n- Lateral axes rotation\n- Inverse scaling (for duplicating and mirroring selections)\n- Moving selection along a single axis\n\nI realize there are a lot of UX challenges in those requests, so feel free to take them with a grain of salt. Great works, folks!\n\nHelpful | 48", "mauriceonvocalsAug 15, 2019 at 6:20 AM\nMoe Z\n\nAmazing unlimited especially for someone who is artistic I lost track of time while creating a masterpiece. I could shrink it enlarge it pink small huge fill in details this is definitely worth the money I am living inside this app highly recommend.\n\nHelpful | 2", "Witcher.IIIAug 12, 2019 at 7:39 PM\nA great piece of artwork\n\nI bought a Quest for this software! This was my chance to create on the go and it has served me very well. I would like to import reference images or export objects, but it doesnt detract from what I CAN DO inside. I highly recommend this to artists of all ages and I hope it updates to allow those small requests. Then Ill give it 5 stars!\n\nHelpful | 3", "psbAug 19, 2019 at 7:34 AM\nA Quest standard\n\nThis is a very polished app with virtually unlimited usage possibilities if 3D painting is your thing.\nIt isn't for me ... expect to use it about as much as you use the paint software on your PC after the first hour's excitement has waned off. Still, a very good app.\n\nHelpful | 2", "hankymanJun 26, 2019 at 7:47 AM\nExcellent purchase\n\nTilt Brush is the ultimate in replay value. I spend hours at a time in this.\n\nThe only things it's missing are a slightly better range of 'realistic' brushes (eg. pencils, charcoal) and the ability to import an image for reference. Then it would be 6 stars out of 5.\n\nSeriously though, buy this. You won't be disappointed. I'm not particularly artistic but I LOVE Tilt Brush.\n\nHelpful | 10", "TNTTimSep 4, 2019 at 1:31 AM\nGreat app.\n\nIt's great creating anything you want, there are lots of brushes and tools to choose from. Your imagination is the only limit.\n\nHelpful | 0", "NovelMakerAug 25, 2019 at 7:41 AM\nMind blowing\n\nThis blew my mind when I first tried it. You can get really absorbed. I even did it on a transatlantic flight (in business class, so I had a bit of privacy).\n\nHelpful | 0", "mason.letotoAug 2, 2019 at 8:02 PM\nIncredible Art Experience!\n\nWow, how fun it is to write/draw in 3D! I also have a 3D pen/printer and the feeling of drawing like this virtually is absolutely one of the funnest way to lay down some cool art! Never before could we create such imaginative and vivid worlds with such ease!\n\nHelpful | 1", "siopao_Jul 5, 2019 at 5:08 PM\nHow to Export to FBX and OBJ\n\nI wish there was an easy way, buy here's a workaround for those who want to use their 3D model on other apps. Upload your art to Google Poly (should be an option inside Tilt Brush). Download Unity (free for personal use). Download the 2018 version. Then download Google Poly Toolkit from their asset store. Find your art. Then download FBX Export plugin. Export your art as FBX.\n\nHelpful | 18", "simbr77Aug 23, 2019 at 2:40 PM\nIntuitive VR painting app\n\nLove it, 5 stars if it gets reference image import on quest\n\nThey just added ref image import with the latest quest update \n\nHelpful | 1", "HelloAlice2019Jul 20, 2019 at 9:08 AM\nA must if you ever enjoyed an art class!\n\nI have probably played over 30 titles on Rift and Quest and this is one of my favorites. I do have to mention that my son lost interest in it pretty quickly, but I love this. Something so satisfying and relaxing about drawing and painting in 3 dimensional space all around you. If you even enjoyed painting/drawing on 2 dimensional surface even a little bit, I'd say Tilt Brush is a must have.\n\nHelpful | 0", "yonamayJan 10 at 4:25 AM\n\n\nIt wont start...\n\nHelpful | 4", "quicksilver524May 26, 2019 at 9:22 AM\nA Legitimate review\n\nI love how people are harsh because its missing some feature here or there and its automatically 1 star haha. People who are so harsh are not giving worthwhile reviews, just complaining.\n\nI have a rift and I have played now both the quest and the rift versions. There is a larger RAM level on the rift and obviously translates to larger productions sizes... but... the quest lets me play when Im out and about. You can also tweak your oculus resolutions higher on the quest to boost the visual quality and it makes an impact on this greatly.\n\nPersonally, in comparison, the quest version feels near identical, I dont feel I lost a great deal from the rift to the quest. Granted Im painting for fun and enjoyment and not apparently as serious as these 1 star folks but as far as fun factor its 5 stars, as far as replay ability its 5 stars, as far as graphics on the first wireless device its 5 star even without the resolution boost, and as far as the price, you buy the future support that I want in order for this to become as good as the rift version. Worth the price from my perspective and is a 5 star game especially if it continues to get the same level of support that the rift still receives!\n\nOnly thing I can suggest is adding features even if at an add on price for special brushes, and more pre drawn artifacts. Love personally looking at the publics saved art. Thanks!\n\nHelpful | 23", "Jackrabid77Aug 5, 2019 at 12:41 AM\nGreat App\n\nMy first purchase on the Quest. I considered buying gravity sketch but for the price and my skill level Tilt Brush was a great choice. I love it. However its lacking a bit in terms of tools. Overall amazing app, Great work.\n\nHelpful | 0", "SkyArcherJun 1, 2019 at 10:59 AM\nTheres games, and then theres this\n\nI am amazed at how they managed to port Tilt Brush on Quest considering the complexity some scenes can reach. This app is like a happy place where you can escape from all the frenetic fuss when you really need a break.\n\nSuddenly having a third dimension where to draw can be a little overwhelming at the beginning, but its just a matter of trying and grtting the hang of it. From there, it will be a crazy journey.\n\nHelpful | 5", "Tylers_CornerAug 18, 2019 at 11:38 AM\nGreat app but...\n\nI think gravity sketch has more possibilities with the ability to 3D print your drawings, if that can be done then I would give it 5 stars.\n\nHelpful | 1", "uggie2016Aug 31, 2019 at 11:52 PM\nLeft handed!\n\nOk so maybe I'm missing something, but I can't seem to change this app to left handed, as I'm left handed and this is an art program it's a no brainer I need this.\nIf this is possible then I can do a proper review!\n\nHelpful | 0\nDeveloper ResponseSep 5, 2019 at 9:43 AM\n\nHello! Tap the bottom of the controllers together to switch handedness.", "adam.roberts.37266Aug 11, 2019 at 2:05 AM\nRelaxing\n\nA great app to relax and unwind. Create your own small world and see other people's ideas for inspiration.\n\nHelpful | 0", "PalomedesJul 1, 2019 at 6:35 AM\nMissed Opportunity\n\nI love tilt brush on my rift, unfortunately tilt brush on the quest is a missed opportunity. If like me you want to export your creations then tilt brush is not for you however, if you are happy with only creating on the quest then this is a five star app. I will continue to use tilt brush but only on my rift.\n\nHelpful | 10", "vgregory6Jul 5, 2019 at 10:45 AM\nGreat, with one major flaw\n\nI love this! I just wish the eraser would be like an anti paintbrush instead of a delete. I'll try to fill in a spot, overshoot and then have to do it all over again. It's the same function as undo.\nOther than that, its immersive, calming, and you can make some really cool stuff with it.\n\nHelpful | 7", "jrandallartJul 23, 2019 at 3:42 AM\nLove it but...\n\nwould have appreciated more clarity on the missing features compared to the PC version. Namely the camera, spheres and no image importing.\n\nHelpful | 1", "benkesmithMay 27, 2019 at 2:28 PM\nI have been waiting for this for years..\n\nFinally, I can paint in 3D space without wires!!! :-) I tried CoolpaintrVR on PSVR but it wasn't the real deal... This app is sooo great, even my 5-7 year old nieces loved it very much!! Recommended to everyone!!!\n\nHelpful | 6", "xmorkxJun 30, 2019 at 12:58 AM\nSteep learning curve\n\nOverall Im really enjoying this app. Even for someone who is not particularly artistic, I have created some cool pictures. there is a lot of tools to use and it can be quite daunting in the beginning, I am starting to get there.\n\nOne thing that I really would like is for it to be easier to move around your painting. Ive created some landscapes and it will be great to be able to go into walk mode and walk around my landscape.\n\nHelpful | 1", "JTubbrittMay 25, 2019 at 10:11 AM\nA must have app.\n\nHighly recommended even if your drawing sucks as bad as mine does. Tile Brush is beautiful and very relaxing even if you do not have good drawing skills at all. Just an amazing experience. Feels like your own hooodeck playground.\n\nHelpful | 5", "Alpha601May 27, 2019 at 12:22 PM\nThe future of art\n\nAbsolutely amazing software. For an artist, this is an absolutely must buy. I literally spent over 8 hrs just fooling around in my sketchbook and lost track of time. With advancements in resolution and VR I could see this concept blowing peoples minds more then it already has.\n\nHelpful | 10", "kikapoowaysonJun 9, 2019 at 6:29 AM\nVery BASIC, needs MORE options\n\nAt first I was blown away, the different environments, colorful patterns, color pallet. However, after a while, I found it annoying and amazing (not in a good way) that there isn't a basic shape creator. Like if I wanted to make a sphere or a cube, I want to be able to select the shape and contort and size it with the same motion as when you zoom in and out of your sculpture. And also make the eraser erase a portion of a line, not the entire brush stroke to where I have to draw the entire line. I'm really thinking about trying to get a refund on this, it will be a first refund for a game in 9+ years. If they update or something with MORE options then I'll rebuy.\n\nHelpful | 11", "Ken.DuckJul 9, 2019 at 7:54 AM\nGreat but...\n\nThis is an amazing art application for beginners. But you cant really do realistic art creations. This medium is more for abstract art and doodling.\n\nHelpful | 0", "chris.prynoskiMay 22, 2019 at 7:45 AM\nAmazing!\n\nI was early on the Tilt Brush train. Ive always loved TB but I havent picked it up for a while. This Quest translation makes me feel like its 2016 again! Im inspired and invigorated! Im painting fire brush doodles in outer space and rainbow scribbles in the endless void. This is still my all time favorite VR activity and this version is everything I hoped it would be. Its a reason to pick up a Quest, whether youre an artist or just want to have fun. Worth every penny.\n\nHelpful | 10", "VR2050Jul 25, 2019 at 5:51 PM\nAmazing!\n\nA must buy! Looks amazing on the Oculus Quest.\n\nHelpful | 1", "Danny_TomiczekJul 13, 2019 at 2:36 PM\nGreat\n\nAmazing game(?) Thats perfect for a creative mind, my only issue is myself, the game itself has no issues.\n\nHelpful | 0", "ParticularPeteMay 21, 2019 at 2:51 PM\nThe madmen did it\n\nIt's Tilt Brush running on a mobile headset... even with the hull brushes and lights... amazing!\n\nHelpful | 19", "SirRealDealMay 27, 2019 at 7:04 AM\nMy Wait is Over..\n\nI've wanted Tilt Brush since it's inception. Alas, I'm not the PCVR type.\n\nThankfully Quest brings it to the masses. I can't comment on missing features, obviously.\n\nWhat this version has is plenty for me. Very much look forward to creating.\n\nThis is the type of app that inspires me to seek out videos of others creations just to learn.\n\nAnd they're are some excellent videos out there. Hopefully I'll get one of my own out there.\n\nHelpful | 4", "Pat_MagroineJun 21, 2019 at 1:22 AM\nIntuitive & Innovative\n\nThis really is an incredible tool for artists or designers! Im so impressed and blown-away that an app like this is accessible at a reasonable cost...it really makes me wish I was better at drawing.\n\nHelpful | 1", "MeowformebabyMay 23, 2019 at 4:34 AM\nMagical\n\nI wasnt sure if this was going to be the app for me, as Ive never been that great at drawing. But wow, just wow. You dont really have to be with the tools they give you.\nI just made a basic psychic reader scene and was quite proud of myself.\nIts extremely intuitive. I was gobsmacked looking through the sketchbook and watching how other creations were made.\nWhat a beautiful app. Well and truly worth the money.\n\nHelpful | 5", "mannamedfredJun 3, 2019 at 3:17 AM\nAmazing experience!\n\nI would really recommend this for anyone who seeks a space to be creative in any way! So far the best VR experience I have seen. Only your own imagination limits the possibilities with this tool. You live your paintings and creation in VR! It is a big difference in watching someone else and experiencing it yourself! This tool makes it accessible for anyone to express themselves. You loose track of time when you immerse yourself with your work!\n\nHelpful | 0", "jaytmekJun 9, 2019 at 2:13 AM\nAmazing\n\nI bought Tilt Brush as one of my last \"must try\" release experiences for the Quest and was surprised to learn that it is my favourite so far. I'm not artistic, infact I'm terrible at drawing but tilt brush makes it so easy to create something to be proud of.\n\nIt would be nice to be able to capture a high resolution 2D image a creation from the headsets perspective, and sometimes the resolution makes finer lines, or finer sections of lines invisible until you get close but other than that I love it.\n\nHelpful | 3", "SoulhikeMay 21, 2019 at 1:51 PM\nGreat tool but ...\n\n... I am missing the ability to export OBJ to the internal drive of the Quest. Please implement that essential function. Thanks a lot. Then i will give 5 stars. I bought that only for quick scatch and import to the PC over USB cable.\n\nHelpful | 566", "joekinney100Jul 1, 2019 at 9:34 PM\nAmazing\n\nBetter then i thought. I cant draw or paint but you really dont have know how to have fun with this. Its awesome.\n\nHelpful | 2", "GTHobbesJul 4, 2019 at 4:41 AM\nIncredible Experience\n\nJust wish I were more creative. But even just checking out others creations is Amazing. Highly recommend.\n\nHelpful | 0", "tripleh3lixJun 8, 2019 at 5:41 PM\nGreat, Ill keep it - needs work\n\nNeeds work and a serious res bump. Its amazing that this is possible on mobile, but hopefully a resolution update comes sooner or later as its really blurry. I understand this is mobile VR and its a technical masterpiece.. but I believe this should look clearer for an art program. Its super blurry and makes me not want to use it until its updated.\n\nHelpful | 5", "keebzJul 10, 2019 at 2:09 AM\nIt's tiltbrush!\n\nSeriously, it's tilt brush... On the quest. It's great. Nothing more to be said.\n\nHelpful | 0", "simon.dsouzaAug 27, 2019 at 2:50 AM\n\nGreat idea but having issues with memory and crashing\n\nHelpful | 1", "BigelowedJun 2, 2019 at 1:57 PM\nBeautiful work Google!\n\nTiltbrush was on my prayers for Quest because I know it's an amazing new way for artists to Express themselves with VR. I'm no artist, but I enjoy messing around almost as much as viewing the beautiful works people upload daily!\n\nHelpful | 2", "D00GIEJun 30, 2019 at 8:57 PM\nThe only reason I bought oculus quest\n\nThe only thing I wanted oculus quest for was for tilt brush. It was worth every penny.\n\nHelpful | 3", "Chris_StaceyJun 4, 2019 at 5:18 PM\nPaint and sculpt in VR!\n\nShooting robots and zombies is fun but it gets old after a while. If you're even a little bit creative this is a must-have app! Still playing around with the controls and options but having a great time - sure I'll spend hours on this. Agree with other reviewers that a reference photo option would make it nearly perfect.\n\nHelpful | 1", "gem2113May 28, 2019 at 1:27 PM\nWow\n\nIts incredible how even I (the least creative person in the world) have managed to create something in this game easily and be really proud of it!! The controls are great, the brushes are beautiful and so inventive. I feel like I could create an entire tilt brush world and just sit in it for hours. Its fun to try out all the different things and its amazing that you can save and come back to it later. Only problem I have is that it tends to be really blurry. Ive tried adjusting the headset but it makes no difference. I dont have that problem with other games so I dont know whats up. But the awesomeness of the whole game makes up for the blurriness. Love it!!!\n\nHelpful | 4", "Kcire72Jun 2, 2019 at 7:14 PM\nLove it!\n\nI seriously underestimated how fun & engaging drawing in vr/6dof can be. Glad I came around to it & decided to give it a try!\n\nHope Tilt Brush adds some new tools soon, though. Couldn't help but want some sculpting tools\n\nHelpful | 1", "TheMichaelScottJun 10, 2019 at 7:43 PM\nMust buy\n\nThis was one of the first games I bought when I first got my Vive. I loved it then and it is even better on the Quest. Turn off the guardian and map out your house. So cool!\n\nHelpful | 0", "LamestGamrJun 14, 2019 at 11:58 AM\nLove It on Quest!\n\nI have little artistic ability but love losing myself doodling in this. Also, like seeing art in it created by truly talented digital artists.\n\nHelpful | 0", "rasamayaMay 21, 2019 at 10:45 PM\nSome missing features\n\nI guess to export obj you could save to poly. Then open later in the desktop version to export obj? Really miss that. Will update review if this changes\n\nHelpful | 22", "sundaybaitoMay 26, 2019 at 2:35 PM\nKiller app for artists\n\nThe reason I bought my quest. It's full of features and well optimized. The limit with this is your imagination\n\nHelpful | 3", "R3DROOKJun 12, 2019 at 7:26 PM\nKinda Disappointed\n\nI was really excited to get into this app and start crafting things but the app is lacking a bunch of basic features and it could just be me but I am having problems with the tracking. It's kinda hard to focus in when your brush starts randomly twisting in your hand. I really wish this had more of a clay feel to it then some kind of a 3d version of the retro Microsoft paint. You have to brush in everything instead of just molding it, and the brushes dont help you make 3d objects. Another thing that is frustrating is you have to delete full strokes you made instead of just part of it. I wish there where solid blocks you could use to build off, we have templates but they are hollow and if you want to use it you have to paint the crap out of it and it's hard to make look solid.\n\nHelpful | 8", "yvptmtMay 26, 2019 at 10:53 PM\nGreat fun\n\nTotally enjoy the art in this app. Could the developer add some music to the app? Would make for greater immersive experience and a relaxing time just painting and drawing away!\n\nHelpful | 4", "garlichbreadMay 21, 2019 at 9:27 PM\nMagical\n\nReally great app. It makes art crazy fun and interactive. My kids love it as well. Walking around your art is great and makes it come alive.\n\nHelpful | 10", "VRMillyMay 23, 2019 at 11:32 PM\n\nFantastic app to inspire your creativity. Sketching in 3D space is great fun and revolutionary for artists and designers. The 3D UI is excellent making it easy to find and use the tools.\n\nHelpful | 4", "jjugglerMay 29, 2019 at 3:53 AM\nThese are the apps were looking for\n\nThis is magical and so immersive and fun. Amazing upgrades compared to what I experienced two years ago. Thank you for the tools! Keep up the great work and well keep creating!\n\nHelpful | 2", "hinowaitMay 31, 2019 at 3:25 PM\nTracking issues\n\nThis is my first experience with VR and Tilt Brush so maybe I wasnt sure how its suppose to work. The tracking seems all over the place small little jumps when walking around are making me nauseous. I like the idea but I think it needs more work.\n\nHelpful | 4", "YeahWowCoolJun 5, 2019 at 5:41 AM\ngreat app!!\n\nWill use it for my concept sketching and brainstorming. I wish there were more productivity/ creative apps like this one.\n\nHelpful | 1", "satishgodaMay 23, 2019 at 4:29 PM\nTilt Brush + Oculus Quest = AWESOME\n\nThank you Google for porting Tilt Brush to Oculus Quest. This is a very important art creation tool that will help newcomers to VR feel comfortable.\n\nHelpful | 4", "darwins.lastJun 2, 2019 at 7:58 PM\n3D Amazement\n\nWonderful fun. I'm not an artist but love creating pictures in space... being able to walk around them and save them... showing others.\n\nHelpful | 0", "twistednipsJun 16, 2019 at 10:24 PM\nMissing Labs\n\nGreat port of a fantastic app, I would love reference image support, especially with Oculus knocking out Virtual Desktops hmd feature.\n\nHelpful | 0", "AquAtWinkJun 2, 2019 at 6:48 AM\nShut off??\n\nI love the OQ and i love TIlt Brush, but it happend allready 2 Times after 1 Hour drawing that my screen pop up Black and i couldnt do nothing and the most thing piss me on was their is no Autosave on TB\n\nHelpful | 2", "L.E.D.BLUEJun 9, 2019 at 12:06 PM\nCross-buy\n\nThank You\n\nHelpful | 2", "MAVERICKSHEBA1Jun 13, 2019 at 2:16 AM\nUpdates\n\nAre you going to update the program at some time\n\nHelpful | 2", "Tristan6776Jun 13, 2019 at 6:40 PM\nBuy\n\nOne of the first games you should buy. So cool for anyone.\n\nHelpful | 0", "TraeduxJun 9, 2019 at 6:18 AM\n\nIt's sculpting with light.\n\nHelpful | 0", "Majestic76Jul 3, 2019 at 1:41 PM\nWill Not Download\n\nI don't want to request a refund yet any suggestions on how to fix this I have plenty of space left\n\nHelpful | 2", "checkminerMay 22, 2019 at 9:00 PM\nWorks perfectly\n\nTilt brush feels the same as it does on the PCVR editions and it runs very well.\n\nHelpful | 2", "BansTTJun 3, 2019 at 4:30 AM\nAmazing\n\nLove this app!\n\nHelpful | 2", "Freshjazz49Jun 7, 2019 at 11:29 AM\nReally good...\n\nSame price like the Steam Version.\n\nHelpful | 1\nDeveloper ResponseJun 7, 2019 at 11:08 AM\n\nTilt Brush is $19.99 on the Steam store, just like it is on the Oculus store. An early version of Tilt Brush was bundled with the HTC Vive when it first came out, so perhaps that is the reason it is showing up as free for you on Steam.", "KabuayMay 30, 2019 at 7:23 AM\nGood start\n\nThe actual painting is great but to be a creation too, we need the ability to export and import. This is Google, right? Connect to Drive, Photos, etc. Poly alright but it's no Sketch\n\nHelpful | 1", "MiloszFRMay 28, 2019 at 1:46 PM\nWaiting for the full features\n\nGreat wireless version of Tilt Brush. Still need the functionalities of the PC version like .fbx export and video export - even as offline rendering.\nThen Ill give a 5 stars\n\nHelpful | 1", "taylor.huynh2Jun 5, 2019 at 3:34 PM\n\nI like everything but theres No music.\n\nHelpful | 3"]