{"App Title": "Time Stall", "App description": "Welcome aboard the Fantastic Leap, Earth's only crowdfunded, luxury escape craft! As the only human serving alongside a robotic crew, your job is to keep the ship safe using TIME STALL, the ship's time-bending safety protocol.\n\nWhen disaster strikes, Time Stall temporarily freezes time aboard the ship, allowing you to manipulate objects, divert projectiles and combine various objectswhatever it takes to save the ship and her Captain from destruction!\n\nManipulate objects in stalled time to save the crew.\n\nExperiment with physics, allowing you to find creative solutions to the catastrophes happening onboard the ship.\n\nSet up crazy situations just to see what happens when time goes back to normal.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Puzzle, Space/Universe", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico)", "Version": "1.0", "Developer": "Force Field Entertainment B.V.", "Publisher": "Oculus Studios", "Website": "http://www.timestallvr.com/", "Release Date": "August 15, 2019", "Developer Privacy Policy": "None", "Space Required": "1.71 GB"}



["5 stars\n67%\n4 stars\n22%\n3 stars\n6%\n2 stars\n3%\n1 star\n3%", "KnightHood31Jun 20 at 12:05 PM\nGreat game but short\n\nWhen I bought this game I thought you would be a crew member on the ship and you get notified where an issue is happening and it would be an open game where you can walk around all over the ship and I also thought at the end you could go through the captains shield and interact with him and Dave. Thought it didnt live up to my expectations I still found it enjoyable and it was amazing and hilarious that the pizza had physics and the worm dog and this is amazing but the main issue is that it is short if it was longer and there was more exploration throughout levels this would be a 5 star review, overall great game and I give this the title of epic, to every game I like anyway.\n\nHelpful | 69", "Mattplus097 days ago\nDone Buying Quest Software\n\nThis is an interesting, fun title, especially if you catch it on sale. However...I won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\n\nHelpful | 4", "chuck.art.3Jun 22 at 1:03 PM\n2nd best puzzle game on quest\n\nIve never written a review for an oculus game, but I had to come and throw this game 5 stars. This game is loads of fun and about half the price of most other games on quest. Id still say the Room VR A Dark Matter takes the top spot for quest puzzlers, but if you do the extra challenges you really get a lot of nicely polished bang for your buck with this one. Highly recommended!\n\nHelpful | 20", "obi2kenobi4 days ago\nCute game but nothing earth shattering\n\nThe graphics, audio, and narration all feel very polished. The scenes you play are also very diverse.\n\nIn each level you have to save the captain to progress, but there are 2 other robots you can save each time as well as random goals you can unlock. So there is some replayability to each level beyond 1 play through.\n\nThe levels are quick if you just want to play a few minutes at a time vs some other games where levels require greater time commitment.\n\nOverall it is a very small game. However, it is priced appropriately so that shouldn't be a detractor.\n\nEven if it is a bit on the simple side for me, it is a very polished experience that I have no problem recommending if someone is looking for a calm and friendly puzzler.\n\nHelpful | 1", "StaticCloud24 days ago\nImpressive but short\n\nWhile yes, the game itself only took me about an hour and a half to beat there's still extra challenges to do in each level which could maybe add on another hour or two if you're not using a guide.\nBut the main reason I like this game so much is because of how well made it is. All objects have physics and can interact with the world without phasing through walls, the textures are high quality and look great and the puzzles may take one or two attempts to figure out but were never too hard.\nThe quality of the game definitely makes up for the length and is worth a buy imo.\n\nHelpful | 2", "RaJu70516 days ago\nEnjoyable\n\nMy son and I really enjoy this game and the different scenarios. Graphics are great and I have not had any glitches. My only problem is my oculus battery life not lasting long enough for me to keep playing!\n\nHelpful | 2", "dvc2112Jun 18 at 8:59 PM\nWorth Every Penny\n\nI can't imagine the # of hours, and meetings, that went into programming this, but it's a ton-o-fun. There are numerous ways to solve each puzzle so, despite being only 7 levels + 3 challenges each, be creative and enjoy the ride... you can make it last as long as you want.\n\nReally solid graphics, humorous tidbits, and a phenomenal game for the $. Thanks, devs!\n\nHelpful | 16", "blablargon17 days ago\nroomscale fun perfection\n\npolished and uses roomscale to its fullest by having vertical interactions as well as everything else I could think about putting into a game. Satire about modern culture that's so dark and well written. Silly but deep dialogue are what this game is about and I love it! My favorite level is the second. The object interaction makes the experience feel real. The exploration is amazing and makes me reminiscent of the demo that the quest comes with in the best ways. I've played so much and this is the game I reccomend to all who just picked up a Quest and want to take full advantage of its capabilities.\n\nPRO: best experience yet on the Oculus Quest as of August 2020. Youve never experienced realistic graphics until you see theze PINEAPPLE PIZZA SLICE!!\n\ncon: standards held high by the average consumer are insane sometimes. for some, the Fast Food they eat is never fast and/or cheap enough because of the ridiculous stands held by that individual. to anyone complaining about the price or length of this game, i can not relate. This game has no cons. You just have insane standards.\n\n\nYOU ROCK DEVS!\n\nps please make another thing\n\nHelpful | 1", "BeldarakJun 11 at 3:01 PM\nOne of my favourite VR games\n\nThe dialogs are super funny, the gameplay is original and you really interract with the different items and the environnement like with your own hands, the controls are very solid.\n\nThe graphics looks great, especially for the quest and it's long enough for the price, it's a little longer than most VR games in that price range, especially if you try to complete it at 100%.\n\nIt's one of the very best games on the Quest.\n\nHelpful | 13", "lorgan3Jul 23 at 11:09 AM\nFun game with lots of detail\n\nI was a little worried because many people mention it's very short but actually there's a fair bit of content. Sure you can rush through, but if you take your time to figure out all the challenges you'll spend quite some time.\n\nHelpful | 3", "Firefan264Jul 27 at 4:19 PM\nWayyyyy too short\n\nThe game is great, that goes without saying, that every level I enjoyed and each crazy scenario made me laugh to myself as the captain ran for his life. However, ONLY 8 LEVELS!!!!!!! I get that most VR games are short, but dang thats really short, because each level your given a short amount of time(which I do like) it makes for really short game play. However with 3 people to save along with 2 extra challenges(technically three but one is the same in every level) adds a really nice touch to the game, but even like 2 bonus levels that are really hard or something idk.\n\nHelpful | 1", "GungaGinga2Jul 27 at 12:00 PM\nReally good game, but....\n\nTime Stall is a super good game. Very fun and the characters are so funny. But there is one flaw to this game. Its so short! We need more levels so we can have more fun in this game! The game will become very boring if we have to replay the same 8 levels over and over again.\n\nHelpful | 1", "Tim.DowdingJul 22 at 12:37 PM\nFantastic zany physics puzzle game!\n\nThis game was loads of fun and I enjoyed the unique puzzle solving I had to do to get to the end.\n\nWhile short, its a very polished experience that I thought was well worth the time I put into completing the game to 100%.\n\nIf I could change one thing about the game Id add more stuff to mess around with in the main hub.\n\nHelpful | 1", "PhilDchamp14 days ago\nA bit quick\n\nThe story is really not long. There's only 8 levels to this game, beating the game takes anywhere between 30 min - 2h. Overall the game is fun and the levels are challenging enough.\n\nHelpful | 1", "Carkey101Mar 16 at 12:19 PM\nThis should be more popular\n\nI was just looking for a game to play in my free time and upon finding this game and watching the trailer, I decided to buy it. Honestly this should be worth more, the simple concept of stopping time and messing about sounds awesome but playing with a fully interactive environment in a game with good graphics, good story, good animations, sound design, secrets, and far more than I am capable to explain, is absolutely incredible! I can't wait to keep playing!\n\nHelpful | 238", "surfdragon79May 5 at 8:46 AM\nAmazing Game!\n\nI want you to enjoy the game like I did.\nThe comedy is funny and the art perfect.\nThere are a few Easter eggs scattered around and I had fun finding them all.\nYou are on a spaceship and your goal is to save the captain from ridiculous situations.\nIt is a physics based puzzle game using all aspects of vr. There are loads of ways to solve different puzzles.\n5/5 stars.\n\nHelpful | 16", "DrTimmyTacoJul 18 at 10:51 AM\nAmazing game but it is so short\n\nThe game is my favorite game in my library that is if it was longer, dont get me wrong great game but it is so short they NEED to make a part two maybe even three. BEST GAME but two short\n\nHelpful | 1", "Mattattack242Jun 8 at 3:20 AM\nVery Good, but Very Short\n\nEven including all of the extra challenges you can beat after beating the main game, this game still isnt very long. It is a great puzzle game and it is fun while it lasts, but there are only 8 levels. Its a great game but overall more content should be added. I would say its worth the $15 though.\n\nHelpful | 2", "whoisashleyMay 20 at 1:17 AM\nEpic little puzzler\n\nYour main mission is to save the captain from each disaster. Then as a side mission you need to save two helper bots. Plus each level has bonus objectives which are only revealed if youve saved the captain once. Each level is very immersive and the mini bonus objectives add extra fun as some are obvious, and some need a real hard look around to work out what you need to do. Im only 6 levels in and loving it.\n\nHelpful | 4", "Ender17898Jul 16 at 2:47 PM\nAwesome game\n\nIt a awesome game short, but everything was well done. I was very enjoyable and had little challenges for it. I loved it hope they make another one, but longer.\n\nHelpful | 1", "evandaganApr 7 at 10:41 AM\nClever spatial puzzles\n\nLots of \"puzzle\" games on quest involve simply collecting objects, and enjoying the scenery. This is not one of those: these puzzles actually make use of the virtual space in inventive ways, and solutions often involve multi-step thinking, and a little luck. It's all a little chaotic, which I think adds to the appeal: this isn't a very precise game, which means solutions can be forgiving, and the resulting action quite funny whether you win or lose. There's a lot of replayability, and multiple ways to solve each scene. Tons of fun. Because each scene is timed, this is a great one to hop into for 5-10 minutes at a time.\n\nHelpful | 34", "Day90Jul 16 at 3:07 PM\n\n\nAlot alot alot better then I expected and much more to do then I thought too.\n\nHelpful | 2", "pillmigillJul 16 at 4:21 PM\nGreat game\n\nI love this game and got it for 9.99$. I think its pretty short tho and has not a ton to do. Still recommend and its a great game!!\n\nHelpful | 1", "nr6542May 16 at 10:46 AM\n\nThis game is a really great exploration of what can be done in terms of exploration and puzzling in VR. Every object around you can be grabbed and is examinable. And with many of them, it's necessary to complete objectives. At times, it is up to you to decide what object to use to achieve a goal.\nIt is precisely what I've found lacking in many puzzle/adventure games over the years. Most games expect you to interact with objects A and B and even if other objects can be examined, it's very noticeable that they're just props. But like I already mentioned - not so in Time Stall.\nThere's also a decent amount of content and at times tough optional objectives also provide great replayability.\nAnd to top it all off, the writing is hilarious and the visuals are gorgeous (there are some odd flaws here or there, such as low resolution textures in very prominent places that had me wonder how they could've overlooked that but - that's rare)!\n\nHelpful | 4", "Awful_WaffleMay 14 at 9:12 PM\nOne of my favorites!\n\nId played about a dozen other games prior to Timestall, but this one still blew me away. The most immersive experience which had me walking into walls and tables (unfortunately in reality). I truly felt a part of the environment. Being able to manipulate everything is so much fun. With challenging yet solvable puzzles, its kept me busy for hours and Im still only halfway through it. It definitely should be a more popular game. Buy it!\n\nHelpful | 4", "R_I_L_E_SJul 17 at 1:33 PM\nAnazing\n\nEven though it only has 6 levels they are exciting and fun with more stuff to do then you would expect. Definitely recommend\n\nHelpful | 1", "MaDDoGGeR22Jun 8 at 7:01 PM\nNot bad but Not amazingly Good\n\nI thought the game would be fun but when I got to the 4th level I started to get bored plus a headache. This game gives me extreme headaches. If you like humor, puzzles, and freezing time then this is for you. If you dont like standing it will be hard for you. Overall pretty good!\n\nHelpful | 0", "Morgus123Jul 18 at 9:51 AM\nGreat but could be a little better\n\nThis game is fun like the idea but there there is one problem I have a bit too short\n\nHelpful | 1", "3NCRYPT3D5Apr 6 at 9:09 PM\nGet the game\n\nIt is very rare that I replay puzzle games to perfect each and every level but there is something to this game that makes you want to do so. It is super addictive and makes you lose track of time in the real world as you stall time in the game. I definitely recommend it.\n\nHelpful | 26", "iguagofernando25 days ago\nAmazing!\n\nA must to have, definitely\n\nHelpful | 1", "kristiansigstonMay 22 at 11:13 AM\nSuch great fun\n\nThis game is so much fun. I felt, initially, like i wanted to give four star as I think they could have done more with it.\nBut that isn't fair because what has been done with it is fantastic. The team can do more next time.\nI greatly look forward to more time slowed physics fun in an expansion pack, DLC or a second game.\nHopefully for the second iteration we can have a larger area to move around in.\nAwesome game.\n\nHelpful | 2", "stabbbzaJul 9 at 1:48 AM\nAmazing\n\nSuper fun and wacky but super short and not very challenging but great concept and could really see it going somewhere\n\nHelpful | 0", "StegalinMay 18 at 6:08 PM\nVery fun!\n\nYou wont regret your purchase of this! The time stop (but not really just really slowed down) is a great mechanic. You will fail, mostly because there was a threat you didnt see until time restarted! Use your point to see trajectories, used sticky stuff to grab things far away, hurry before the object slowly moves out of the way! Find shortcuts to solving issues while you go through. Lots of whats this do? moments as you try to find solutions. I refused to get help from the phone but finished it 100% in about a week of playing, but I love these kinds of puzzles. The phone doesnt help with challenges though. This game is so worth the price. Grab it and have some fun! Just dont reach outside your guardian! Use whats around you!\n\nHelpful | 2", "solarstormflare3Apr 12 at 9:10 PM\nGod Tier Game\n\nI love Time Stall. My sister loves it. My dad loves it because it is kind enough to allow multiple saves. For the price this game is a steal. The humour is a+ and it's so much fun to blow up balloons, steal and wear a sailor hat and find a lucky cat in an overhead locker: and of course, save the captain. If the trailer interests you at all, please buy the game and support the devs, you won't regret it.\n\nHelpful | 12", "Tony.DiIuorioApr 14 at 6:34 PM\nI would give it 4.5 if I could\n\nI wish there were decent settings, to better accommodate your play area. They warn you it's a roomscale game only, but if you could adjust settings you could probably play sitting most of the time. But it's not even offered.\n\nThe whole game is a frantic race against time - it says you can stop and restore time, but it's more accurate to say you can SLOW time but it still moves. And you only get to slow it for a certain fixed amount.\n\nIn that time, you must change the room such that nothing will result in the death of the crew. It's quite amusing and a lot of fun.\n\nThey give plenty of hints if you need them, but it's still up to you to place items just right, and skillfully arrange for objects to interact with each other once time resumes its normal flow.\n\nAnimation style cartoon graphics are sharp, and the voices are well done. It's definitely a stylish and fun game.\n\nHelpful | 9", "TheJabawackJun 18 at 5:41 AM\nGreat concept\n\nThe idea is great, manipulating objects in a \"time freeze\" is fun.\n\nPity the challenges are a bit obtuse in their hints, aome clearer indications would have made it more fun\n\nHelpful | 0", "capnseagullMay 8 at 3:26 PM\nFunny and Charming\n\nAs what I feel a tribute to Portal; this human helping the Captain, is not what GLADoS would have wanted. But its charm brings it back! Have fun manipulating the most random objects and let er rip! Have fun with this one! Try your luck to get through the level or save all crew! This was one of my first purchases after getting a VR. I do not regret it!\n\nHelpful | 2", "1ZiP1Jul 18 at 7:43 AM\nCool! Wery Coooool!)\n\nI liked very much!\n\nHelpful | 1", "myarmy9168 days ago\nfun game but short\n\nfun game but short\n\nHelpful | 0", "derekseApr 19 at 8:59 PM\nHow's this not WAY MORE popular???\n\nHonestly get this over job simulator or vacation simulator. I feel like this game should be WAY more popular than it is and I only heard of it because of the Stay At Home Sale Occulas ran.\n\nThe graphics are actually incredible, voice-overs, music and humor in this game are incredible, gameplay and puzzle mechanics are super unique and you guessed it... incredible!\n\nYou'll definitely have to play through each level more than a handful of times to get 100%\n\nJust buy it!!\n\nHelpful | 4", "BubbIeZ.May 19 at 1:55 PM\nThis game is great\n\nThis game is amazing. The story is great and the graphics are amazing. I love the game but the only problem is there aren't many levels. It was so fun I was really sad when I finished. Add more levels. Overall an amazing game\n\nHelpful | 2", "EFloe14Apr 23 at 10:37 PM\nAmazing game!!\n\nThis is easily one of my favourite VR games on the Oculus Quest! Its fun and challenging, but not too hard. There were many moments where I had to really think to resolve a puzzle and when I finally got it, it felt really satisfying! Its also filled with many funny moments that make the game really fun and adorable. Perfect for anyone who want a cute and simple game that makes you think!\n\nHelpful | 3", "LucasDSurvivorJun 7 at 8:26 AM\n\nGreat \n\nHelpful | 3", "BossloreyMay 23 at 10:40 AM\nPretty good\n\nSome surprisingly good things about this game, such as visuals and physics tailored to the Quest. A lot of interaction on the telephone. I wish there were more levels, challenges, and different ways to complete missions. Minimal content, but I enjoyed it\n\nHelpful | 0", "krabo74Jul 5 at 3:55 AM\nAmazing game\n\nI really loved this game it was really fun\n\nHelpful | 1", "Steven4121980Apr 17 at 2:31 PM\nWell done puzzle game\n\nA great experience that makes full use of 6 degrees of movement. Multiple ways to solve each problem and multiple goals per level makes this game very replayable. The interactivity in the levels and tiny hidden secrets keeps the game fresh as you retry levels trying to achieve each goal. I recommend this for any fans of puzzle games the like of Portal.\n\nHelpful | 3", "KermitSmurfMay 12 at 10:58 AM\nNeeds more levels\n\nIt was a pretty good game. I enjoyed it thoroughly but it was kinda short. I beat the game in a day. And it wasnt all that hard. If the developers are reading this please add more levels. Thanks.\n\nHelpful | 2", "IkeTheKnight25May 8 at 4:12 PM\nPretty dang good!\n\nThis game is worth the money for sure, there are secrets to find and a fun story. But It can get repetitive especially on difficult levels, and a second run is fine. Cant complain for a 15 dollar game though!\n\nHelpful | 2", "jenny.hernandez.5832May 11 at 4:22 PM\nAwesome game!\n\nThis game is so fun! The puzzles are unique with more than one way to solve, it allows you to be creative. The mechanics are awesome and you are able to manipulate almost anything you see. Highly recommend!\n\nHelpful | 2", "tidyboy72May 4 at 10:54 PM\nFUN\n\nI really enjoyed this! It's a good solid game with fun graphics and good physics. You can definitely play this in a smaller space as you can move around with the controllers but roomscale is definitely my favourite. (I did nearly take out a light in my lounge when I forgot I didn't have much room ) the puzzles aren't MENSA difficult but they're fun and if you do get stuck there is plenty of help to point you in the right direction. It won't blow you away but it's a good game to have in your library to pop in and have a giggle.\n\nHelpful | 1", "MykifaMar 30 at 11:33 AM\nEntertaining\n\nIt's entertaining, if you like going back and trying to perfect each level. You can beat a number of achievements per level, but if you want to only save the captain everytime, you'll beat it quickly. I think it's well worth the money though. Thanks devs.\n\nHelpful | 9", "ben9809Jun 18 at 12:33 PM\nFun\n\nFun a challenging but can someone give me a guide to beat The Core.\n\nHelpful | 0", "ChrisJoshNowMay 5 at 12:54 PM\nSo much interactivity\n\nThere are so many hidden little items to interact with. The puzzles are challenging. The price is low but the content is high. Lots of replay Ability. Robots are adorable.\n\nHelpful | 3", "BertHalfpintFeb 21 at 2:57 PM\nWhat is not to like ?\n\nPlay it for a while then check out the TV show, Avenue 5 on Sky , ( actually just watch episode 1 ) then come back to the game.\n\nVR imitating TV or visa-versa ?\n\nUncanny resemblances or what  but obviously without the poor language ( oops! )\n\nA very funny VR experience that demonstrates the potential of VR on the casual gaming front. Enjoy \n\nHelpful | 33", "JokingbananaMay 10 at 11:25 AM\nGreat game but\n\nI loved being able to stop time but it did seem to utilize the time stalling to its fullest potential and had very few levels but definitely a great game and worth playing\n\nHelpful | 2", "Redalt99Jun 23 at 5:26 PM\nGood\n\nGood\n\nHelpful | 1", "JokidumApr 10 at 3:03 PM\nAbsolutely Fantastic\n\nNo other game has matched the level of fun and excitement that this game offered me. Playing this game has been an unforgettable experience that I believe everyone should take part in. Get this game, trust me, you won't regret it.\n\nHelpful | 4", "ericjmyerssrApr 24 at 7:56 PM\nSo fun!!\n\nThis game is cool! Its exciting to try and beat the clock and save everyone while thinking outside the box. Highly recommend\n\nHelpful | 5", "BGPabloMar 21 at 8:34 AM\nSpace job simulator\n\nAn excellent puzzle playground game. While their are objectives to complete, there are many different ways to interact with the environments. The situations are nicely varied and the visuals are quite enjoyable.\n\nHelpful | 10", "sek3175Jul 19 at 6:27 AM\nIt was very short\n\nIts fun but short\n\nHelpful | 0", "stitch96Jun 25 at 10:16 AM\nGood but to short\n\nThere was enjoyable levels but they were to easy and to short I thing it should have more content or at least be more content\n\nHelpful | 0", "TheRealSMCparkApr 17 at 4:57 PM\nDude I cant uninstall or reinstall\n\nIt's like caught in limbo between being on my system and uninstalling\nLike\nIt's on my quest,\nBut I cant click on it to play it.\nAnd I cant open it with the oculus app.\nIt wont delete, but I cant reinstall it.\nGreat game when I could play it.\nIdk if this is an issue with the game, or my headset.\n\nHelpful | 1\nDeveloper ResponseApr 20 at 2:26 AM\n\nNo issues like this on our side. If you are still having problems, send us an email at support@forcefieldxr.com and maybe we can help.", "scorponxlytMay 2 at 1:48 PM\nAwesome game but...\n\nIts a fun game but it is a bit short I beat the game in 30 minutes\n\nHelpful | 3", "aresius16Apr 18 at 9:35 AM\n\nIf you liked \"I expect you to die\" you should definately give this game a shot.\n\nHelpful | 6", "thealantamMay 22 at 3:18 AM\nTime does not stall!\n\nI have never had experience with disliking such a highly rated game. First of all, it is not a time stall game. Time slows down 10x but doesnt freeze as described. This has huge implication: if I replay it, I cannot redo exactly what I did, because object placement depends on the exact time you did it. Not sure why this is not a problem for others but I am never able to shoot correctly at something far away. Also it takes ridiculous amount of delay to replay the current level. After 20 attempts of aiming either too high or too low on the same level, it gets boring soon and I just gave up. I am not event aiming to get 100%, merely to get past the level to finish the game. So disappointed.\n\nHelpful | 0\nDeveloper ResponseMay 25 at 2:01 AM\n\nHey there thealantam, Sorry to hear you are having so many problems with the game. Remember that there are many different ways to solve any of the puzzles. If one way doesn't work, try experimenting with other objects and see what happens. There is also a way to quickly play and replay levels with the gloves. If you need more help, send us an email at support@forcefieldxr.com.", "TriangledFeb 16 at 4:17 PM\nFun to Play Intermittently\n\nIts nice to have a game or two in the library that invites you to check in for ten minutes at a time. This fun, lighthearted and playful game invites just that sort of pace. If youre sensitive to motion sickness, this is a great title as views are mostly static and movement is really comfortable. Characters are charming and funny. Recommended.\n\nHelpful | 7", "BLZDPraetorianJan 26 at 9:48 AM\nSAVE THE BOBS!!!\n\nI did not think this game would have me so involved. I mean there are a lot of great games but this one is so well done... So incredibly immersive. I wish i had gotten this a long time ago! Silver lining is i get to play it now =) you will have a better slow motion cinematic movie experience here, then any other game on the quest in my opinion. YOU HAVE TO SAVE THE CAPTAIN!! You will find new ways of doing each scenario allowing good replay value. I wish we got dlc, or even a custom scenario creater! That would be crazy!!! If your wondering how much fun you will have, or if its worth it? Yes, a thousand times. Fun for all ages. Great puzzle game that deserves ultimate praise!\n\nHelpful | 20", "manusoriano9May 14 at 4:04 PM\nGreat game\n\nLoads of fun and a great game I just wish it was longer.\n\nHelpful | 1", "DISTROJARApr 16 at 8:28 AM\nA good game\n\nI liked this game but there wasent no challenge only time I failed is wen I trow somting badly and the game is super short\n\nHelpful | 1", "paperdongMay 10 at 1:19 PM\nGood value\n\nPre good value. Interesting puzzles and a good amount of replayability. Likeable cast\n\nHelpful | 0", "jamescodesthingsApr 11 at 12:33 PM\nWitty and fun\n\nPretty cool game. Love robuts in games. Felt a little short-lived but theres definitely replayability.\n\nHelpful | 3", "kimbiecookieFeb 12 at 9:42 PM\nExtremely fun but challenging!\n\nThis is what VR games are supposed to be! Very immersive and realistic graphics. I love when you actually feel like you're in another place and time. The puzzles are challenging to get timed just right but with some practice it gets easier. A very enjoyable VR experience. Younger kids will have some difficulty with the challenges just an FYI but the experience on the spaceship will be fun for them. Great job development team for creating such a fantastic game!\n\nHelpful | 7", "DeepMellowJun 2 at 6:45 AM\nVery boring and repetitive puzzle game\n\nIf you like the same old puzzle game that the quest is full of where you have limited space movement then you might like this. Worth about $5 at most. These games are all the same on here. Gets old. Makes me wish I kept my PSVR\n\nHelpful | 1", "Tox1cEggApr 30 at 2:08 PM\nIf your short I do no recommend this\n\nI was so excited for this game, and it was really fun to play, until u got to level 6 I know what to do but Im not tall enough to do it. Im 4 ft 5\n\nHelpful | 4\nDeveloper ResponseMay 6 at 1:50 AM\n\nHello Tox1cEgg I am curious where you were having issues. Could you send an email to support@forcefieldxr.com and give us some more details? Maybe we can help.", "grilleater1021Apr 10 at 5:59 AM\nIt's fun but...\n\nIt's a good game but it felt short and it's more of a personal opinion but I didn't like the story mode and level type in this but it was a good game, I would recommend it to my non existing friends\n\nHelpful | 1", "NotVeryMoeApr 9 at 3:51 PM\nFantastic game\n\nTime Stall is unquestionably one of the best puzzle games currently out there for VR.\n\nHelpful | 3", "h3hl33tApr 12 at 5:51 PM\nGreat and unique gameplay.\n\nMy wife and I really have a fun time playing this. The premise is very unique. A real hidden gem IMHO.\n\nHelpful | 2", "BelowDustFeb 26 at 8:42 AM\nFun title beginnings to start\n\nThis is a good title for those who have just begun their transition to vr. It's not overly complicated but the puzzles do ramp up in difficulty with added challenge to those who want to get all the objectives.\n\nHelpful | 6", "ItsMrSmoothDec 30 at 9:22 AM\nMUST GET\n\nI love all adventure and puzzle type games, so if you do to, this hame is just for you. Solving puzzles by saving your captain in multiple levels and having the ability to slow down time is SUPER cool! I would recommend this game to newcomers to VR and to experienced players as myself. Great concept of a game, and I loved it! Good job to the devs.\n\nHelpful | 53", "Aurora.ZaneMar 28 at 8:52 AM\nthis game is pure amazement\n\ngraphics: good\nstory: good\ngameplay: good\ntime stall: amazing\nthis game: pure amazement\n\nHelpful | 4", "carter.a.cabralApr 9 at 7:02 PM\n5/5\n\nReally makes you feel like Quicksilver\n\nHelpful | 3", "ThePcPandaMay 5 at 1:33 PM\n\nAs expected\n\nHelpful | 1", "CoolcatmanMay 8 at 11:06 AM\nGod Tier\n\nGod god\n\nHelpful | 1", "Goat6802May 2 at 12:04 PM\nFun\n\nVery fun puzzle game\n\nHelpful | 1", "theoryofeverywhereJan 4 at 8:30 AM\nSuch a fun game!\n\nThis game is awesome. Anyone who says it is too short is just saving the Captain each time and not doing any of the optional challenges. These optional challenges are super fun and rewarding and add a ton of depth and length to the game. This game also has oodles of charm and is very funny. This is one of my favorite games on Quest so far along with I Expect You to Die and Pistol Whip.\n\nHelpful | 18", "yre0Apr 27 at 10:14 AM\n10/10\n\nGood puzzles good replayability 10/10\n\nHelpful | 1", "simplyshimmeringJan 24 at 1:31 PM\nAmazing Animations\n\nAmazing animations and gameplay. Well thought out and delivered, the plot and challenges offer entertainment for all ages depending on your skill level. A little more instruction on challenges would of been helpful. No 2 games are the same, they all vary depending on your actions. I enjoyed the option that you can save different games/ players. As a relatively new gamer like myself I found it challenging and Immersive, however for the very skilled and seasoned gamer I believe may not be as gripping.\n\nHelpful | 6", "Incognito69Apr 25 at 6:03 AM\nGood game but shorter than expected\n\nI think Time Stall what a very well made puzzling experience unfortunately it just wasnt long enough for me\n\nHelpful | 2", "Boom564Jul 16 at 12:21 PM\nGreat game, but could use more\n\nI only played for a few hours and I am already done with the story. Hopefully there is an update\n\nHelpful | 0", "RandomCnuckApr 2 at 11:49 AM\nGreat use of free time\n\n\"Time\" we'll spent\n\nHelpful | 3", "sadel.all.dayJun 30 at 12:29 PM\nAmazing! It's a must buy!\n\nOnly issue is that after a few hours im already halfway done. Wish it was longer but that's definitely not a bad thing. Really great game.\n\nHelpful | 0", "Patpat820Mar 30 at 7:58 PM\nI was very unsatisfied and want a refund\n\nI got this game thinking it was a fun puzzle game and saved up money to get $15.00 dollars! So I bought it and started playing it was great and all but then it just ended, apparently there are only 8 levels!! I got furious and depressed when I thought Wow... you saved up $15.00 and spent hard work just for this game... but then I remembered I can refund it. So I hit refund and it said the refund was requested. So about 2 days later and I went to look if I got a refund but it still said nothing so then I looked to see if I still had the game and I didnt. And then went to go look if I could buy the game and I could buy the game. So then I thought I got a refund but it just hasnt showed up yet. So I got 5 more dollars and bought a $20.00 combo pack that had two games for the price of one thinking I had a refund. I loved it and was very happy. About a day later I got on my oculus and then I saw Time Stall as one of my games I can play. Then my heart dropped. I looked to see my purchase history.... BOOM! It said that my refund was declined!! I got on the ground and started crying and was furious at the same time somehow. I was thinking  I spent a flipping $35.00!!! And now PLEASE OCULUS, GET ME A REFUND. I need it so I can put this money in to my savings. Im going to need it to pay for college. So please get me a refund and get back to me ASAP.\n\nPS: I also have already wrote one review and you guys said you didnt understand so I hope this is good enough.\n\nHelpful | 27", "SlopbassJan 17 at 2:39 AM\nNear, Far, Wherever you are...\n\nTake Futurama's episode A Flight To Remember... Splice in the last 45 minutes of Will Smith's Irobot.. add a little Timecop, a little bit of that Quicksilver scene from X-Men. This is that game with all that stuff beaten together like fluffy eggs. Kill some robots, save some robots, throw some champagne around, and look out for falling objects. Now hit fast forward and play it already!!\n\nHelpful | 5", "WalterFrenchMar 21 at 6:32 AM\nGreat\n\nVery fun definitely worth it\n\nHelpful | 3", "poyrazzzaa12Apr 2 at 5:37 AM\nGood\n\nBut short\n\nHelpful | 2", "Jakey445Apr 17 at 12:50 PM\nIts not that good\n\nThe game feels like a mobile game and you can finish the game in 2 hours, its gets boring super quickly.\n\nHelpful | 3", "CyberFernJan 19 at 7:32 AM\nReally awesome VR experience\n\nI always wanted this game, due to how funny the physics is. The future and Titanic is a great combination for this game. I love the cast of characters like the Captain, and all BOBS in the Main Menu and credits. Really great experience for all people to try! Recomended!!\n\nHelpful | 5", "SwagStar59May 11 at 10:50 AM\nDog****\n\nOk these reviews are all bots cause this game sucks its a heaping pile of ****. Im sorry but its true\n\nHelpful | 2", "ChronicleRealmJan 11 at 11:53 PM\nGreat game\n\nAmazing game, the visuals are stunning for the quest, and you feel like a superhero, slowing down time and moving things to protect the captain. If I were to complain about one thing, its the lack of levels. As there are only twelve levels, you can finish this game within an hour. Overall, a great game, I would definitely recommend it.\n\nHelpful | 4", "mrb.jmbMay 11 at 11:13 AM\nSwagstar59 is right\n\nif you put this on most recent the comment under me is correct\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nwhat the actual FRICK\n\nHelpful | 1", "OkurRoJan 19 at 1:44 PM\nOne of the best I own!\n\nReally great game, it made me want bigger playspace so I could just run around to save my captain! Only thing i missed was some hints on challenges, it started being a little frustrating when I couldnt figure out what to do to fulfill the challenge.\n\nHelpful | 4", "rae999Apr 11 at 5:35 AM\nToo repetitive\n\nTedious iterative problem-solving. Repetitive droning music. Childish mundane humor. Just awful.\n\nHelpful | 3", "s-ynthFeb 8 at 5:31 PM\nFun and challenge\n\nIve really enjoyed this game. Good graphics, puzzles not too hard not too easy, tons of laughs... I would like it to be longer but its very good for the price. A must in Oculus Quest.\n\nHelpful | 2", "unapedraMay 9 at 1:12 AM\nHard to complete, incredibly funny\n\nIf you want to complete it to the 100%, it will take your time. The fact that they are individual levels which you can revisit make this game perfect for short game sessions (although you may find it very addictive). The characters are very lovely, and each situation is equally funny.\n\nThe only thing that I would say is a little bit frustrating is to throw object at a specific direcrion. As most VR games, it is not very precise so an object thrown to the wall may end up flying directly to the floor. The rest of the game: just perfect!\n\nHelpful | 1", "carlschiftMar 23 at 3:40 PM\n\nIt was ok kinda like all the other games on here way too short\n\nHelpful | 5", "ZapWap132Mar 2 at 11:25 PM\nIt's awesome!\n\nThis is one of the best games I own on my Quest.\n\nHelpful | 2", "titustheturtleMay 7 at 8:26 PM\nI want. A refund please\n\nI liked the game I just want a refund it wasn't that fun\n\nHelpful | 0", "BrooksProctorJan 5 at 8:48 PM\n\nThe game is very funny and has some extra challenges, the game designers are very clever and the game is extremely well made. They also have some nice touches such as index finger and thumb tracking which makes it better for recording videos. About 2 days of casual play not including the extra achievements which take a while to figure out :). The only main issue that I see is that the game is fairly short and would be such an amazing game if they added more levels. 4 Stars\n\nHelpful | 2", "Pwhite6Mar 1 at 7:25 AM\nNice\n\nFun.\nCasual.\n\nHelpful | 2", "perrolegoMay 29 at 3:07 AM\nOk\n\nIts a good game. It is pleasant to feel like flash. But after a few level the game begins to become impossible.\n\nHelpful | 0", "ChimiedelameFeb 3 at 3:09 PM\nDisappointing...\n\nFor a puzzle game they are absolutely not complicated to solve.\nBut once you understand what needs to be done, have the patience to implement the solution.\n\nPersonally, repeating the same action 10 times to try to obtain a result does not enchant me. I am looking for puzzle games to break my head and not to do the same thing by changing a small detail that ultimately changes everything.\n\nToo bad, a lot of potential misuse!\n\nHelpful | 4", "FwakJan 13 at 4:24 PM\nExcellent!\n\nVery polished, excellent gfx, beautifully detailed levels, lovely characters, good variety of puzzles and levels.\nInteresting twist on escape rooms.\nHighly recommended\n\nHelpful | 3", "BROHONKYJan 3 at 9:01 PM\nHigh quality but uninteresting puzzles.\n\nThe game is high quality and the mechanics are great, but the most important part \"the puzzles\" are not interesting. They all are just \"make sure nothing is moving towards the captain. I breezed through the game in an hour and a half, until the last level. The last level is a massive difficulty spike and not because it was more challenging, I flat out couldn't see why I was failing because they did not make it clear. Just play I Expect You to Die, it costs $5 more, but has better and more interesting puzzles, better writing, and more length.\n\nHelpful | 12", "haveyisbackMay 27 at 6:38 PM\nGreat game I would replay it\n\nThis is the kind of game that makes your mind work or I'm just dumb. There is a lot of challenges and you would want to replay it to achieve all the goals and see if you can do better. It'll get boring for me one day but right now I might replay it all again :D\n\nHelpful | 0", "coolishboot55Jan 29 at 9:16 AM\nLove it\n\nLove it\n\nHelpful | 7", "ZoobleyNov 7 at 12:50 PM\nGreat concept and polished production\n\nGame is great. Its basically a combo of a puzzler physics sandbox game that also utilized bullet time. Its well done and I spent 10-15 hours working to complete it to 100%. Definitely worth the money and the production value was excellent. A very polished game and I found they did a good job with the humor. Not too over the top but made you like the characters. I own quite a few games but this is the first one Ive completed to 100% so far.\n\nHelpful | 21", "Papa_GrapeDec 22 at 7:49 AM\nGreat Game, But Too Short.\n\nThis game has great graphics, little to no glitches, and each level has the perfect amount of challenges. Although, there is only a handful of levels, if there were some non story levels, maybe even a level creator that would make this game a lot better.\n\nHelpful | 3", "gmb9191967Feb 3 at 12:04 PM\nHard\n\nThis app is so funny and hard! i love it its a must get for all puzzle lovers\n\nHelpful | 2", "ParadiseDecaySep 6, 2019 at 6:01 PM\nControl time, save the bots!\n\nEXCLUSIVE 1st Look Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=YRU4yLL9PEQ\n(Please Note: Links might not work from Oculus so please search YouTube for 'Paradise Decay VR Time Stall')\n\n A BIG THANK YOU TO THE DEVELOPER FOR THE REVIEW KEY!\n\nMy Quick Thoughts:\nShort but sweet..........\nThis game looks and plays so well at times I thought I was playing on my Rift S.\nThe amount of attention to detail and polish in this title makes it really stand out. I can see myself having a lot of fun solving the various ways and methods to save the bots.\nTo say I was impressed is an under-statement and I have to admit I am also a big fan of the developers who made 2 of my favorite VR games so far 'Landfall' and 'Coaster Combat'.\nSteller stuff!\n\nHelpful | 83", "phillipxsalasJan 2 at 6:24 PM\nIts great!\n\nAt first you gotta get used to it like any game, but I love the challenges. Its one of the first games that Ive spent most of my time on trying to complete it 100%. Sometimes the graphics and collision of some items are wonky, but its not THAT bad.\n\nHelpful | 1", "psully4114Dec 11 at 10:34 AM\nIts a good kids game\n\nI say its a good kids game because while I think its a good game for anybody that likes a good puzzle the story and the humor seems to be largely aimed at children and I didn't get that impression from watching the advertisement for it so I went in as a 30 year old dude that like puzzle games and had a pretty nice experience with it overall. Had a nice impromptu dance party with some cartoon robots at the end *spoiler alert* Theres certainly a reasonable amount of challenge to keep it entertaining for a while without being obnoxiously difficult and a few easter eggs to look for. Over all its a good clean experience for anybody that likes physics puzzles or has kids that are getting into the quest.\n\nHelpful | 8", "SerpulaJan 4 at 3:34 AM\nIts good but needs true roomscale\n\nThe presentation and level design is great, this is a high quality game. My one big complaint is that the game makes poor use of your play space. Despite the levels being room-sized and walkable, teleporting is the only consistent way to move around, even when your playspace is large. The developers should look at Vacation simulators use of the playspace - teleport to one room and walk around freely - its so much more immersive.\n\nHelpful | 2", "oscarfl123Dec 5 at 10:19 PM\nGreat game\n\nAs I said it is a great game, its story is fun but yet intriguing and the characters are so well done I had my self feeling like I had to save them all, but this game has some flaws. I was playing on my vr while I bought it so I must have been playing an hour before and when I got the game I played it strait away but I found my self finished the game within thirty minutes, I just thought I will go through them again and save them all. Also my game glitches out like I zoomed of into space and I had to restart the game from the beginning of the level, but all in all a good game, just needing some more levels and or some patching\n\nHelpful | 6", "morlanmemeMay 1 at 6:06 PM\nBruh\n\nThis game is great but not the best so 4 stars but would recommend and a bit of a broken story\n\nHelpful | 0", "Invisible_BillyJan 14 at 1:46 PM\nShort\n\nIt was an amazing game and experience but it's really short and you can beat it in a day\n\nHelpful | 6", "Koda6699Nov 26 at 12:04 AM\nSmooth gameplay\n\nIn this game you will find yourself saving a captain in very smooth gameplay. Shooting boxes with wine bottles, beating up robots and throwing them out a spaceship. I just wish that there was more things in the shuttle. Like more things to collect over time. Also more levels and dlcs but other then that i really enjoyed playing this game. 10+ hours of gameplay here!\n\nHelpful | 6", "HelloAlice2019Aug 15, 2019 at 2:08 PM\n\nThis game is like the movies Alien and Titanic were combined with Job and Vacation Simulator. I love the concept of moving in frozen time to move around things to change very dynamic scene outcome. My favorite parts in last 2 X-men were Quicksilver (lightning fast kid) moving things around in a cool and funny way. This game lets you become Quicksilver. So much fun!\n\nOnly problem: there is no height adjustment for shorter person like in Rick and Morty VR or Vacation and Job Simulator. So my very short son who also loves this game can't reach a lot of stuff.\n\nAny chance of Developers adding height adjustment for very short players, please?\n\nHelpful | 302", "greasykiwiDec 25 at 5:33 AM\nPretty fun\n\nAbout 1 hour in, really good concept, no glitches, objects are kind of hard to throw precisely but thats to be expected with VR. Would definitely recommend\n\nHelpful | 1", "mikesgames_ytJan 17 at 1:08 PM\nIts ok.\n\nThis isnt the best game but its not bad\n\nHelpful | 1", "TmanfooDec 17 at 11:25 AM\nPretty great game\n\nFeels like it is targeted at a younger audience but is still pretty darn fun for adults. I enjoyed it and my friends that played it also enjoyed it. Has a minimal amount of replayability though.\n\nHelpful | 1", "captaincatMar 13 at 3:10 PM\nDo not buy!\n\nOnly 8 levels could not get refund!! I rate this Game zero DO NOT BUY\n\n(-) BAD game \n\nHelpful | 6", "shawnersDec 30 at 11:08 AM\nFun Physics Game\n\nThis is a great game and the environment is very immersive. Fun puzzles to figure out and the story/world is a lot of fun.\n\nHelpful | 2", "DogArmyNationYTFeb 12 at 2:24 PM\nMakes Me Dizzy\n\nI do not recommend this game if you get frequent headaches like me.\n\nHelpful | 0", "anhaagNov 29 at 3:08 PM\nSuper Fun - Long Gameplay\n\nThis game is entertaining and has many levels/goals/challenges, so I see it being a game Ill play for several weeks instead of 20 minutes like a lot of the other games - really well done!\n\nHelpful | 6", "Aidan1013Oct 20 at 7:59 PM\nCould be five stars with a few changes\n\nI love this game, I definitely recommend this game to people who like calm games that still have that indescribable feel of milled intensity. I think it could be a little bit longer with more levels or maybe a free play mode where you could explore the ship in slow motion ,or even,now this might seem a little out there, you could fight the rouge robots in separate levels.\n\nHelpful | 12", "Sick_SquidwardDec 20 at 11:55 PM\nAmazing\n\nI played it a lot, it is easy but it also has some difficult parts to it. Great starter-game.\n\nHelpful | 1", "GoldenGunXJan 3 at 10:43 PM\nLove this game!\n\nI played till my battery ran out!\n\nHelpful | 1", "zack.slotkowskiDec 27 at 9:14 PM\nAwesome\n\nSuper challenging but that is what makes it fun! Love it!\n\nHelpful | 1", "UDontHaveMyNameNov 25 at 6:06 PM\nWow!\n\nThis game has AMAZING visuals for a self contained VR headset, and it was SO much fun. I loved the slow-motion aspect. Do not overlook this game!\n\nHelpful | 2", "Lil-WolfieJan 6 at 4:05 PM\nGood idea\n\nIts a good idea but Im not sure it really works when you can only stay in a small box area. Theres also no easy way to reach objects.\n\nHelpful | 1", "DioABDNov 1 at 12:40 PM\nVery nice game, subtitles need adjustmen\n\nThe game overall is pretty nice, good physics and I had a lot of fun. Hoping for more such nice Titels. Only flaw I saw is on the german subtitles, when there is a longer line of text, it is too far left, resulting in the first 1-2 words being hard to read. Not really centered. Because the first 1-2 words are almost out of sight or at least in the blurry corner. Maybe an easy thing to fix. It appears however only on the long text lines in German subs. The shorter one are fine.\n\nHelpful | 0", "HollywoodDR0Nov 10 at 12:07 AM\nFun creative puzzle solving!\n\nGreat graphics fun challenging puzzles that can be solved creatively. Its definitely a good one when showing off the Quest to new users. Would love more puzzles but the challenges from these still have me busy for now.\n\nHelpful | 4", "VKGAMINGJul 16 at 12:11 AM\nFun and immersive\n\nEnjoying every second of the game, theres so much to interact with allowing for a great amount of replayability. After completing a chapter, I find myself coming back and finding other ways to save the captain and having a blast while doing so. Physics, graphics are all great. Its games like this that make you forget its running on a mobile chip and feels like a full pcvr game. WE NEED MORE OF THESE!!\n\nHelpful | 3", "jm1228Nov 30 at 6:55 AM\nOnly complaint is too short!\n\nThis is an excellent puzzle game thats been a lot of fun for everyone thats tried it.\n\nHelpful | 4", "FloopthegodOct 11 at 3:21 PM\nGreat game\n\nI love this game. Its graphics are fantastic and the idea is too. Time stopping for you to solve puzzles is great although the physics can be a little strange at times. The levels are fun and challenging. If you try to do the challenges at once for a level you have to move lightning fast. I wish this game had more levels because it is pretty short. In all a great game to play normally or just mess around with the time stall.\n\nHelpful | 3", "MJRsurgeNov 30 at 2:05 PM\n\nGreat game fun to play and recommend buying it.\n\nHelpful | 3", "fernando.vazquezjrSep 29, 2019 at 3:30 PM\nFun but hard and challenging\n\nNot going to lie graphics are amazing it does not glitch out.. but I warn you it is very challenging very hard you have to really use your brain to save everybody.. you'll see what I mean go ahead and try it out and enjoy.. I left about 20 different people that don't have VR play this game and they loved it.\n\nHelpful | 8", "AlabasterSlimOct 16 at 4:30 AM\nGreat use of room scale\n\nWhat a fun amazing little gem. The use of room scale is incredible. Anytime a game has me reaching down and moving vertically rather than just pointing at things I want to interact with is a huge win for me. Incredibly immersive.\n\nHelpful | 7", "KGB_GaMeZNov 18 at 8:32 AM\nClean Up After An Incompetent Captain\n\nOverall the game was amusing. What bothered me was we never found out WHY the robot crew was out to murder the oblivious captain throughout the game.\n\nI'm not sure why people find it enjoyable, but you're basically cleaning up after his mess the whole way through and he get's off scot free at the end.\n\nIt would have been nice to see character development from the captain or that you as a player end up like the robot crew out to murder him because of him endlessly putting the entire ship at risk. Some kind of plot twist would have been nice.\n\nI can't complain about the mechanics or visual aspects of the game, they're good.\n\nHelpful | 2", "Th3_C0ll3ct3rNov 23 at 7:54 PM\nWhat fun...\n\nI had a blast playing this and so did my 8 year old son. Well done.\n\nHelpful | 2", "TeamTame10Dec 4 at 9:42 PM\nVery fun\n\nGood play\n\nHelpful | 2", "eltaco362Oct 28 at 6:31 PM\nFantastic\n\nThis game is:\nWell scripted\nRealistic both in physics and graphism(for the quest)\nAnd has alot of possibilities to solve the puzzles\nI really recommend this game\n\nHelpful | 3", "wyattangelxOct 24 at 4:03 PM\nBest game ever.\n\nThis is absolutely by far one of my favorite games. Enjoy the fun of space travel while trying to protect your captain! I would definitely recommend this game to everyone.\n\nHelpful | 4", "SatYr_Sep 29, 2019 at 1:33 AM\nGorgeous graphics, great puzzles + funny\n\nA must buy for Quest.\nReally enjoyed maxing out all the levels,\nfinding all the hidden jokes. Dev's thank you for creating a game that looks stunning, I found myself just looking around gazing at all the details in great resolution. My wife's favourite game.\n\nWhen you make your next game with the same engine, visual fidelity, humor I'll be sure to buy it.\n\nHelpful | 3", "Ryanjs1020Aug 16, 2019 at 7:20 AM\nEndless possibilities\n\nThere are so many ways to solve puzzles. It's ridiculously fun. I was laughing my head off while I built a makeshift rocket out of a box, paste, and air tanks to save the captain. It's like the Just Cause of VR. It's one of the best looking things on the quest as well.\n\nHelpful | 27", "Butternut_PaladinOct 21 at 10:55 AM\nAlmost a 5\n\nGreat idea and execution, but the menus are clunky. Specifically, retrying a level requires navigating several tedious screens before getting back in the action.\n\nHelpful | 3", "Crazy_SaneSep 24, 2019 at 11:54 AM\nVery high quality game\n\nGreat, well thought out game. It's not as long as some games, but you'd get many hours out of it if you went for 100% completion. It's funny, original and has good gameplay. Makes you feel like the fast dude in xmen. It's Superhot crossed with I Expect You To Die crossed with job simulator. The graphics are excellent and the sound is great with headphones. Worth it, so just get it. Go on... like now. Press \"purchase\". I haven't got all day.\n\nHelpful | 3", "TheJellyDinoAug 26, 2019 at 4:27 AM\nAn interesting concept\n\nI really like the concept of slowing down time to save your fellow crew members. Every Level introduces new problems, which you have to think fast to save your captain. It does feel a little short if you play in one sitting, There is some replayability to the game,such as trying to save everyone and complete all the challenges.I would still recommend this to anyone who likes to think fast and solve puzzles.\n\nHelpful | 4", "atirathaOct 13 at 12:57 AM\nHaving fun so far\n\nLove to explore the game. Would love a sandbox mode. With this engine, you could have tons of fun. Maybe even a level editor of sorts to give it more longevity?\n\nHelpful | 5", "Champ15002Aug 16, 2019 at 4:43 AM\nGraphics Are Amazing!\n\nI didn't know Graphics could get this beautiful on the quest. Gameplay is replayable. Each new challenge is fun, exciting, and different. Time Stall was and is completely made for the Quest.\n\nSince all the prices for quest games are so much money and it adds up quickly. I only have about 4 or 5 Quest games. That were bought slowly over the course of several months.\n\nI feel Time Stall is one of the only games that is actually worth its price at $14.99. $9.99 would have been the perfect price for the game especially since their's no gameshare available. So I could buy more games with somebody and pay less.\n\nHelpful | 15", "l1SanchoAug 20, 2019 at 6:23 PM\nGreat visuals and concepts\n\nI mean this is a great game from a playability and visual stand point I really can't fault it in this regard and my hat is off to the Devs / all the people involved in the creation of this game.\n\nThe only real thing I take issue with its the amount of content / play time. I finished this game in two sittings, the first of which lasted around 35 minutes which unknown to me at the time actually got me 50% of the way through the game. The second lasted a bit longer as there was a lot more head scratching and failed attempts at saving the captain! But this only accounted for approximately 1 hour.\n\nWhen the credits started rolling I was genuinely saddened to find out there where only 8 levels totaling 1h30m of game time. Part of me thinks it's much less time if I were to have gone all out in one sitting.\n\nSo be aware, while this is a really great and fun game which I do recommend, the fun doesn't last as long as you might want. Hopefully there will be future content updates though!\n\nHelpful | 16", "GamerMomentNov 6 at 3:50 AM\nBeautiful and cute\n\nloved every second of it\n\nHelpful | 0", "wikidangerSep 6, 2019 at 12:36 PM\nToo short, too easy\n\nConcept is good but not really used to its full potential. Very few of the main objectives require much thought to achieve and the secondary objectives are largely a question of figuring out what you've got to do based on a vague prompt, rather than how you're going to do it.\n\nHelpful | 7", "dantheman1433Aug 15, 2019 at 4:23 PM\nVery fun and challenging puzzle game\n\nI love this game for many reasons the main being its fun.\nThere are plenty of things to do and see and I enjoy the humor in the game. It just seems polished with the graphics looking amazing to the world design and voice acting 10/10.\nThe one thing is that it seems a little short which I realise is a common thing in VR games but the amount of depth in each level on its own makes it worth it.\n\nReally enjoying so far\nHope future updated adds more levels.\n\nHelpful | 13", "IIEarlGreyIISep 1, 2019 at 6:19 PM\nGood, Could Have Been Great\n\nThis game has a lot of the style and quirkiness that almost reminds you of the Portal series, but it falls terribly short of that greatness. The actual time stall mechanic is brilliant for VR, and the visuals are perfect for this. However, there are a few technical problems holding this game back.\n\nThe main issue for me is that they didn't include a sitting option in the settings. Now, if you had to stand for this game I would understand and not be bothered. But here's the thing, I sat down for this entire game. It was really annoying at times, but I wanted to see if I could do it. It was unnecessarily frustrating, but I did it. So clearly you can play this game sitting down, all they really had to do was slightly raise up the player model. I would have twice as many hours in this game if they had included this option.\n\n\nSecondly, the space you can actually move around in is extremely limited. Why? There are several cool open levels where I want to walk around and get a better look at things, but I am stopped from moving a few feet in any direction. Let me go over there! If there's nothing there then I will just turn around and come back! And i'm not saying let me wander all over the level, I just mean like me walk five feet from where I started maybe?\n\nThe dialogue is decent enough, the level design is great. I liked it enough that I am glad I played it. But I doubt I will replay it, and I didn't go out of my way to 100% it. I am not sure if I would recommend this game to friends.\n\nHelpful | 6", "Ph4ntomProph3tSep 25, 2019 at 1:57 PM\nHilariously awesome!\n\nThis game is a hidden gem! Wish it was a little longer and allowed more freedom to explore the ship. If youre still on the fence here is a great gameplay video https://youtu.be/tYP1M5CsqQs\n\nHelpful | 2", "skavankSep 9, 2019 at 7:12 AM\nMost fun I've had on Quest\n\nFantastic game. Great humorous writing, superbly balanced challenges, and full of enjoyable exploration and easter eggs. It also looks fantastic and is very immersive.\n\nAt 14.99 it is a steal. I would gladly pay twice the price!\n\nHelpful | 2", "1ndridC0ldAug 19, 2019 at 9:43 PM\nHow to enjoy the cruise from hell\n\nFirst off I absolutely love this game. I bought it and casually playing it over a weekend I beat the game. But beating isn't good enough. The captain deserves 100% completely finished game, unlike his ship. I worked through the game and then went back and completed all of the challenges. This was an excellent buy. I can't wait to see what they come out with next. Maybe a space station will be the Captain's next posting. I'll come along for the ride.\n\nHelpful | 8", "turbosteeleAug 23, 2019 at 9:26 AM\nSo far, mostly good\n\nMy kids an I have been having some fun with this one. The quirky captain is amusing. The gameplay is fun. Wed like it a little more challenging, but its still been fun!\nBut one thing were having an issue with is the bonus objectives. Maybe were just missing something, but it would be nice to see a description as you are about to enter a level, just under the objective, what requirements there are to complete the bonus objectives. For example, weve played that first level a couple dozen times and knocked down the cardboard guys, all of them, and made a robot fly. However, it doesnt say weve completed them. So it would be nice to see requirements for completion. Not all bonus objective names are apparently self explanatory!\n\nHelpful | 5", "firedevAug 23, 2019 at 3:56 AM\nReloading is slow and annoying\n\nThe game is really nice. Each level is 90 seconds or less where the time freezes and you have to save the day. The only problem is then you are taken out to a floating menu room when you have to press restart wait a little, then some more. Or press continue, wait for the cabin to load press the next level button and wait again.\n\n\nIt would be great if it was more dynamic. Go, restart, again, 100%, next, next, next.\n\nHelpful | 2", "Echo_TangoAug 16, 2019 at 1:27 AM\nFun and enjoyable!\n\nMaybe it's a little bit short ! But the dev's kan always create more dlcs for the game so no worries !\nThe game itself is enjoyable and fun, I'm obsessed with completing every lvl 100% before i go on to the next :) and its many ways to complete each puzzle !\n\nI really like the humor, and the acting is great !\nKeep up the good work dev's :)\n\nHelpful | 6", "wolfman944xNov 11 at 3:54 PM\nEh\n\nThe game needs to be longer considering the price more levels should be added\n\nHelpful | 0", "TemplarianAug 28, 2019 at 5:21 PM\nHilarious to watch others play\n\nBeat most of the secrets, and watched my bro try to find weird ways to beat some of the levels. Fun physics that work as one would expect. Make sure you have a good play area.\n\nHelpful | 3", "PhylosssAug 22, 2019 at 6:38 PM\nVery fun, but too easy\n\nI had a lot of fun, the concept of. Frozen time is really cool, and the caracters are funny. I really enjoyed it.\nbut there is not much replayability.\nIts a 2 hours game.\nSome puzzles are a little hard, but mostly easy\n\nHelpful | 9", "NovelMakerAug 25, 2019 at 7:38 AM\nFun\n\nI only played the first two scenes, but found them very amusing and enjoyable. I'm sure I'll be playing the rest eventually. I like these sorts of puzzles more than the ones in Red Matter, in a way (even though I loved playing Red Matter as well, mostly because of the great graphics).\n\nHelpful | 2", "Mango_plays_vrAug 17, 2019 at 12:12 PM\nVery fun\n\nTime stall is one of the most polished games Ive ever seen on quest\nIve only played this game for a couple days\nOnly problem is that the base game is kinda short but with all the side missions youll have fun for hours\n\nHelpful | 11", "DiamondbackDave069Oct 13 at 8:08 AM\n\nGreat game, tons of fun!!!!\n\nHelpful | 2", "DophoAug 15, 2019 at 11:09 AM\nIts the Gucci to my gang\n\nReally good, like a mix of I expect you to die, super hot, and budget cuts!\n\nHelpful | 14", "OrdinaryWorldAug 18, 2019 at 3:14 PM\nFun dynamic puzzle game\n\nI've only played the first few levels but have played them several times to explore different solutions. That there are multiple solutions is a credit to the game and that extra dimension increases playability and repeatedly. Certainly worth the budget price.\n\nHelpful | 5", "sebastian.kurz.583Aug 27, 2019 at 12:28 PM\nUnique and awesome :-)\n\nUnique game concept focused on the Quest. Great visuals, very immersive, funny ideas. Love that :-)\nFor solving the sub quests you really have to use your brain and think creative!\nIf you like unique puzzle games with a bit weird humor, get it :-)\n\nHelpful | 4", "sinkkingMay 9 at 1:04 PM\nNo.1 Game to instil faith in the Quest\n\nThis game is very short and only lasted about 2 - 3 hours. I have no idea why they made it so short.\n\nHelpful | 7", "VanaRoseAug 15, 2019 at 2:59 PM\nAWESOME\n\nSaw this was avaliable and nabbed it immediately lol\nSo grateful I did, it's been super fun so far and I'm about 30-40 minutes in. The physics are great and I never knew I could come to appreciate champagne bottles so much!\n\nHelpful | 10", "vin_the_tacoAug 17, 2019 at 12:24 AM\nAmazing\n\nI love this game. By far my favorite I just wish the play space didnt need to be so big. After all there is a locomotion\n\nHelpful | 6", "IhrieJan 26 at 2:19 PM\nCute, humorous and fun\n\nSo far quite enjoying myself with this title. Visually its really very good and Im liking the humor too. So far the environmental puzzles have been interesting and I definitely appreciate the additional goals per mission, adds a little replay value to boot.\n\nHelpful | 4", "alan.trulySep 30 at 5:53 PM\nFunny and challenging puzzle game\n\nWorth buying.\n\nHelpful | 2", "kevinnicolAug 26, 2019 at 9:51 PM\nFUN!\n\nReally fun game.\n\nI would prefer an option, after completing the game, to have an no time limit mode.\n\nHelpful | 4", "Kimber923Aug 16, 2019 at 4:27 PM\nFun game\n\nJust started playing and Im really enjoying it. I seem to be moving through the levels really quickly so Im hoping it gets harder.\n\nHelpful | 4", "freddiej1909Aug 15, 2019 at 4:24 PM\nOutstanding\n\nI love this game and its funny characters. Its challenging but amazing. I highly recommend this game!!!\n\nHelpful | 6", "erasmushurtAug 16, 2019 at 3:27 AM\n\nThis is a very cool game. Only gripe is that there is no height adjustment. My kids couldn't reach things.\n\nHelpful | 6", "VinziusAug 15, 2019 at 11:35 AM\nFun and worth its price\n\nA puzzle game where you need to save robots from themselves!\n\nThe theatrical music plays a big part in the ambiance.\n\nWell done team!\n\nHelpful | 16", "jarett.frazierAug 25, 2019 at 9:04 AM\nBasic and uncomfortable\n\nI purchased this for the puzzle aspect of the game. The puzzles arent challenging, and to make things worse it gives me the most intense motion sickness. Ive played several games that are labeled uncomfortable, but Ive never been motion sick even a little bit.\n\nHelpful | 3", "Godislove4uAug 19, 2019 at 4:46 AM\nA excellent game with a original concept\n\nJust found out the quest has the same specs as the valve, the HTC pro and the odyssey plus.My Lord and Savior God's Son,Jesus Christ delivered me from alcoholism and suicide.God saved my life and soul !\n\nHelpful | 8", "PugstonAug 15, 2019 at 8:27 PM\nIts so much fun\n\nThis game is amazing it like if you combined expect you to die and super hot to get the best game ever\n\nHelpful | 5", "dylpickle1321Aug 25, 2019 at 7:51 PM\n\nThis game is so fun and awesome the only downside is that if you are short you cant really reach anything and it is a really hard and makes your brain grow and the graphics are really good\n\nHelpful | 2", "SebtacularAug 15, 2019 at 6:46 PM\n\nShort but well worth the money!\n\nHelpful | 8", "Wunderwulf2319Aug 30, 2019 at 10:00 PM\nMoney well spent\n\nThis was definitely worth the $15. It was a pretty quick game to beat but it was incredibly fun and absolutely love replaying just for laughs\n\nHelpful | 4", "TuvivavalAug 17, 2019 at 4:30 AM\nGreat\n\nA must have title on the oculus quest!\n\nHelpful | 7", "FriendsHaveXboxAug 28, 2019 at 10:53 PM\nVery fun!\n\nI love this games mechanics, being able to stick objects together to make them longer and all that is great. I just wish it had smooth turning\n\nHelpful | 2", "KarmaMoleAug 31, 2019 at 11:03 AM\nFun Puzzler and a Great Playground!\n\nTime Stall was a very pleasant surprise with a great concept, marred only by a short campaign. You can read our full review of it on 6DOFReviews.com :)\n\nHelpful | 2", "ZakimationsSep 12, 2019 at 5:37 PM\nWell worth it\n\nCompared to other releases this stands among one of the best values.\n\nHelpful | 3", "NatureHootAug 21, 2019 at 1:15 PM\nQuirky, fun and amazing puzzle game.\n\nI'm not a massive puzzle game but I had a smile throught the game because of how quirky and funny the characters are and the situations you get in. For me, it's a must buy VR game.\n\nHelpful | 3", "MellowSupremeAug 26, 2019 at 12:21 PM\nGood starter game\n\nIf you like games like angry birds but you want a little more interaction, this is your game. Cool mechanics, good graphics, and overall fun experience.\n\nHelpful | 2", "DeadLikeMeAug 22, 2019 at 1:56 PM\nFun puzzle adventue\n\nReally enjoyed playing this game. Fun puzzles good graphics and humour throughout. Would highly recommmend this\n\nHelpful | 2", "agitokazuAug 19, 2019 at 3:11 AM\nGreat Title\n\nThis Game is very Job Simulator like :), loving the gameplay and some cheesy commentary. However I wish the game had more levels... anyways cant wait for future projects from this dev\n\nHelpful | 3", "enigma01Aug 19, 2019 at 6:17 AM\nCant pick up objects from floor?\n\nThis is a fun game, but I cant pick up objects from the floor, they are below the physical floor. My guardian settings are fine and I dont have this issue with any other game. Not sure if its to do with my height or something perhaps?\n\nHelpful | 5\nDeveloper ResponseAug 19, 2019 at 7:31 AM\n\nI know you have said your guardian is set up perfectly so I wonder what else it can be. Send an email to support@forcefieldxr.com and we will see if we can find you a solution.", "DAX_QcAug 30, 2019 at 10:35 AM\nGreat concept. But too short.\n\nLost all 3 stars when i hit the end at only level 8. Are you s*iting me, 8 levels? 1 to 6 took me 20 min. REFUND\n\nHelpful | 12", "koolskelton328Aug 15, 2019 at 6:58 PM\nAmazing game\n\nWords cant describe how good this game is its a must buy the only problem that you The only problem is that it doesnt have any short people mode\n\nHelpful | 6", "ThevrcatAug 31, 2019 at 9:35 PM\nThe best of the best\n\nIt was the greatest Quest game Ive played! Funny,a tiny bit difficult but not too much\n\nHelpful | 4", "Arnold73Aug 19, 2019 at 2:59 AM\nA real, great game for Oc. Quest!\n\nI have nothing to add to the other positive comments: Time Stall is an excellent game, very polished, the kind of game you want to come back to. Please, release some DLCs!!!!\n\nHelpful | 2", "jomey102Aug 15, 2019 at 1:04 PM\nUnique puzzle game\n\nPolished and funny experience, maybe a bit too short, but a great game to demonstrate to others.\n\nHelpful | 11", "PolemarxosAug 16, 2019 at 3:38 PM\nI love that game!\n\nYou can finish every stage with different ways.\nI love the freeze time effect!\nGraphics are very good.\nGameplay is fun.\n\nHelpful | 7", "AtomFlame001Aug 19, 2019 at 2:03 PM\nincredible\n\nan amazing concept of a game mixing Justin Time with superhot vibes my only wish is that it was longer I hope the developers keep working on it\n\nHelpful | 3", "aPARTtimeASTRONAUTMay 21 at 11:06 PM\nBeen playing a few days\n\nIts an ok game, sight and sound is great but seems very dragging and boring at times, a soundtrack would really help this game out\n\nHelpful | 3", "matteo311Aug 20, 2019 at 8:29 AM\nI expected more\n\nAfter watching the trailer I expected job simulator meets I expect you to die. Unfortunately it's much less than that. Here is my full review https://youtu.be/m9B9KPZ6bKg\n\nHelpful | 1", "sammyhinxAug 16, 2019 at 7:23 AM\n\nI cancelled my pre order and never got my money back\n\nHelpful | 8\nDeveloper ResponseAug 16, 2019 at 9:22 AM\n\nHey Sammyhinx, We're sorry to hear you are having issues with your pre-order! Sadly, I don't think there's anything we can do about a refund. Could you please try contacting Oculus Support to see if they can?", "GlimpsyVRAug 16, 2019 at 2:05 PM\nTrash\n\nAbsolutely trash\n\nHelpful | 8"]