{"App Title": "Titans of Space PLUS", "App description": "Just how big is big? Discover the answer as you tour through this holographic miniature Solar System, then venture beyond to visit some of the largest known stars.\n\n Rated 5/5 by UploadVR    \"This project belongs on every headset and comes with the highest recommendation Ive ever given VR software.\"\n Nominee for UploadVR's \"Best Quest Game/Experience of 2019\"\n\nIn this newly-upgraded adventure, you can:\n\n Take your time with a guided tour:\n  This tour stops at every planet, the major moons and dwarf planets, and other huge stars!\n  \n Spacewalk in the Zero-Gravity mode:\n  Give your favorite moon a hug!\n  \n Let your knowledgeable Tour Guide talk your ear off:\n  Two hours of fact-checked content! (Note: voice and subtitles are English only at this time)\n  \n Share a quick tour with family & friends:\n  Choose your tour using the map.\n\n Feel comfortable & immersed:\n  Innovative comfort mode for those sensitive to motion, easy-to-use dashboard controls.\n\n\nRift Cross-Buy:", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Educational, Space/Universe, Travel", "Languages": "English, Chinese (China), French (France), German, Japanese, Portuguese (Brazil), Russian, Spanish (Spain)", "Version + Release Notes": "1.0", "Developer": "DrashVR LLC", "Publisher": "DrashVR LLC", "Website": "http://www.drashvr.com/titansofspace.html", "Release Date": "December 19, 2019", "Developer Privacy Policy": "None", "Space Required": "1.12 GB"}



["5 stars\n80%\n4 stars\n13%\n3 stars\n5%\n2 stars\n2%\n1 star\n2%", "Bender_2112Jul 4 at 7:21 PM\nLove this title\n\nIve always had a mild interest in the planets and space. This wonderful app gives you a sense of flying from one planet to the next. I like having the little professor guy to give info of each heavenly body. Highly recommended.\n\nHelpful | 4", "Ayeandus15 days ago\nGreat learning tool\n\nNot so much of an upgrade over the cellphone mobile vr version (first played on the Razerphone 2 at 120hz crystal clear high def) but enough to still be worth a ride through because..... well truthfully there is nothing and it was free before. If you like space and learning about it then this is good to have. I actually found it harder to go to each moon of some planets on this version but still having hand control is good i guess\n\nHelpful | 0", "FamilyVRFunJun 6 at 12:40 PM\nWonderful\n\nInformative. Relaxing. Click around your flight deck so you find all the features. I most enjoy listening rather than reading everything through a journey. As others have said it would be nice if updates extended through the Milky Way and to other galaxies.\n\nHelpful | 5", "vanz.kimJun 6 at 2:32 PM\nGreat App. Korean Language please\n\nThis was the App that turned me into a VR enthusiast with Such a spiritual experience. I thank you for making this. But I remember that rift version had a Korean language option. could you revive that in this quest version too?\n\nHelpful | 5", "HiggsX15 days ago\nKnowlegde\n\nIf you like knowledge this is for you calm and relaxing and wow have fun\n\nHelpful | 0", "ImHotrodJul 18 at 6:06 AM\nTitans of Space\n\nGreat app, almost feels like your right there floating around the world. Had 1 small problem when quitting, it froze and would not go Back to main menu. Had to shut down Oculus.\n\nHelpful | 2\nDeveloper ResponseJul 19 at 12:35 PM\n\nThank you for checking it out! Sorry to hear about your quit issue, first I've heard of it but I will keep an eye out for this.", "jurisenMay 23 at 10:08 AM\nSo immersive and impressive!\n\nA really fun VR experience, makes you really aware of how amazing space and planets are. Wish there was an option to venture around the solar system at your own pace and have a freedom of movement instead of being on a guided trajectory.\n\nHelpful | 5", "gregc222Mar 4 at 6:55 AM\nSimply outstanding - VR at it's best\n\nI've had Titans of Space in one version or another since I first got into VR, and it was always a favourite. With the latest Plus version, and it's arrival on the Quest, the experience has reached a whole new level.\n\nThe TL:DR version of this review is: just buy it, it's great!\n\nThe new voiceover, alongside the addition of an avatar to embody it, is joyful right down to the occasional slip of the tongue (gives the VO a nice genuine quality - it feels more like being talked to by a friend, than lectured by a teacher). The obvious enthusiasm for the subject shines through, and the knowledge presented is both accurate and plentiful.\n\nAdd the high quality presentation (graphically it's great, even on Quest) and the sense of incredible scale as you get a feel for the vastness of space, and you have a VR experience that anyone with even the slightest interest in space should try.\n\nMy only criticism really is that I would like to see the VO and avatar continue beyond the confines of the solar system (I seem to remember the old version had some voiceover while exploring the Really Big Stars element - could be wrong).\n\nFrom an additons and improvements point of view, it would be nice to see the superdense side of things covered - neutron stars, black holes and the like would be fascinating.\n\nOverall though - just superb. Great job DrashVR.\n\nHelpful | 39", "Oskars.SnowJul 3 at 10:46 PM\nFuture of education\n\nGreat example how things should be taught at school. Super good story for many hours.\n\nHelpful | 1", "terrencejamesApr 27 at 7:39 AM\nThe future of documentaries\n\nThis was a really fun and informative experience. It's about 25 minutes long but it's pretty immersive. You find yourself looking around at the curiosities of the solar system as the narrator talks. Honestly it made me feel like a kid again. You know that feeling when you couldn't pay attention in class because you were too interested in the subject and your mind was wondering everywhere with a thousand questions. I'd definitely love to see more content like this for different subjects. Given that it's an application and not a video they can always add content based on the feedback they get from users. I really hope this is a big part of the future of learning.\n\nHelpful | 3", "Lady_MelMay 10 at 7:39 AM\nWow. Just wow.\n\nI wish I could give this experience (not really a game...) ten stars. It is without a doubt the best thing on VR. It absolutely blew me away. Fingers crossed there will be DLC content in the future to show us more of the nearest constellations and stars.\n\nIf you want to see what VR is capable of, buy this game.\n\nHelpful | 1", "klaatuverataApr 22 at 1:11 PM\nAwesome experience of the solar system\n\nI used Titans of Space on Android cardboard for the first time and I loved it. When I saw version for Oculus I bought it without thinking and I wasnt disappointed. Great tour of solar at system including most important moons. I was nicely surprised by being able to get out of the spaceship. Also, nice audio commentary. Good job with availability of other languages. It would be great if you also had audio for those. Overall very recommended.\n\nHelpful | 1", "gregory.i.hayesApr 6 at 12:26 PM\nVery Great Space Education App\n\nI cannot give this app anything other than a 5 out of 5 rating. It's fantastic! It was one of my favorites on the Gear VR and it's great it is also on the Quest. The extention of information on the Quest welcomed. The only thing I miss from the version on the Gear VR is the voice (with its tone and mood). I really liked the narrator on the Gear VR better. That being said. The app takes you on an unforgetable experience!\n\nHelpful | 2", "gvreg10 days ago\nBlew my mind.\n\nIve watched just about every universe size comparison video on YouTube. As good as those are, nothing has ever given me the sense of scale of stars like this experience. I cant wait to take the tour again.\n\nHelpful | 0", "ChrisFromNZApr 25 at 4:51 PM\nNot worth paying to be honest\n\nNZD10 for a 30 minute tour of space (only our solar system) where you can't even control your aircraft. I've watch at least 2 VR360/180 videos on YouTube VR that are probably more immersive and informative. Information about those planets are readily available online anyway more indepth.\n\nHelpful | 8", "CharredToastApr 12 at 7:26 PM\nFantastic!\n\nWe need more educational VR apps like this. This is amazing. Its fun and interactive and highly detailed. You can fly around the solar system or take a very detailed tour. This is so much better than looking at 2D pictures in a book. I want more eduction VR programs like this. Great Job!\n\nHelpful | 0", "Juan-117Apr 28 at 5:15 PM\nA Must Have For Space Enthuasists!\n\nIf you love space exploration then you will enjoy this app! It is amazing being able to get up close with the planets! The graphics are really nice! I definitely recommend this app to everyone!\n\nHelpful | 1", "luann.sutton.7518 days ago\n\nWow, wow! So beautiful,fun and relaxing. Oh, and did I mention educational? I have always been a space enthusiast. This is perfect.\n\nHelpful | 0", "GozasanMar 29 at 12:51 PM\nIncredible experience\n\nTruly mind blowing app to see scale of solar system objects. Enjoyed the zero-g movement mechanic to get close to planets. Also enjoyed the instructor guide, but somehow find myself struggling to focus when on. Perhaps an abbreviated version would be helpful?\n\nAltogether a fantastic experience and educational tool...I suspect this will be a pioneer app for VR education.\n\nHelpful | 1", "DrKotulakDec 31 at 3:30 PM\nSpace Nerds and Curious Cats Alike\n\nThis game is beautiful. The information from my checks so far has been correct and its functionality is on point. Its an educational game that wont bore you and really gives you a sense of our solar system (and beyond). Music was very relaxing - the voice over might have been a bit better. At 9.99 this is a fair price. Also - I have heard hand tracking will be added which will only be an added bonus and add to the experience.\n\nI had a lot of fun exploring and learning about the many gems through out the solar system and the full tour was very well put together. Get this! Good work\n\nOh and Epstein didnt kill himself!\n\nHelpful | 102", "NukemarineDec 19 at 6:21 PM\nThe app to prove VR in education works\n\nTitans of Space was one of the first \"Wow!\" moments during the resurgence of VR with the Oculus Rift DK1 back in 2013. It demonstrated that VR can give a sence of scale while educating the user/student on these heavenly bodies. Instead of leaving it there, DrashVR continued to add to this app in visuals, interaction, and information over the years to keep up with the improvements in VR headsets.\n\nI've played each iteration as I've upgraded my headsets, and felt DrashVR has outdone himself each time. This one for the Quest is no different. The major change (at least for me) is the addition of the floating teacher that goes into deep detail about each planet, moon and star on the tour. It feels so natural watching this floating set of head and hands flit about as he points out areas of interest during his lecture. It would be amazing if this type of lecturer is applied to other learning apps, such as for zoos, wonders of the world, biological, sub-atomic, and everything in between. It was that engaging.\n\nNot only do I look forward to sitting through the full tour and lecture this time around, I am excited to show off this program yet again to put a sense of awe in the young and old alike trying VR for the first time. Titans of Space and the Apollo 11 experience are VR education apps to get.\n\nHelpful | 32\nDeveloper ResponseDec 19 at 6:25 PM\n\nThat is an amazing review. Thank you for taking the time to write it, and for being there to play each iteration of this title as it grew up!", "YajieJul 15 at 12:18 PM\nFantastic\n\nIll write a long comment after finishing the whole journey. Already love it after experiencing the Earth and the Moon:)\n\nHelpful | 0", "caleb_geeDec 19 at 12:43 PM\nOne of the best VR experiences!!!\n\nI had this on GearVR and gladly paid for this version that adds so much like 6dof, and a free flight mode. A good showcase on how small we are in the solar system let alone the universe. A great showcase for VR newbies and veterans, and a glimpse of the future of education. My only gripe is that I'm sure the Gear VR version has a different voice over, it would be nice to have that one in this version.\n\nHelpful | 22\nDeveloper ResponseDec 30 at 11:47 PM\n\nThanks, I'm really glad you took a chance and liked it! Indeed, in this PLUS version the old voiceover has been replaced by two hours of the Flying Professor Alien tour guide, which I know is very different. I sincerely hope you will still find value in it as it is jam-packed with the latest fact-checked information and extra insights. Have a good day!", "Winter1989Feb 3 at 2:20 PM\nAbsolutely fantastic!\n\nReally enjoyed this. Have played it a few times now. Love all things space. The info is what you can get online or in a book, but seeing it in such an interactive way makes it really enjoyable.\nI think for the value this is a great buy, and both children and adults can enjoy.\nOne of my favourite games Ive got.\n\nHelpful | 2", "DewandoJun 24 at 7:35 PM\nSuper cool\n\nReally cool experience, lots of options on how you want to conduct your VR experience. Very informative and educational. Great value for the money.\n\nHelpful | 0", "cantennaFeb 19 at 5:45 AM\nIt's actually an awesome experience!\n\nI was a bit upset at first having purchased this before on the Go but after having tried the Quest version, they're is actually a substantial amount of content that has been added to warrant the additional asking price. The narrative is very informative and I learned a lot.\n\n\nIt's a great experience worthy of its asking price.\n\nHelpful | 1\nDeveloper ResponseFeb 15 at 4:03 PM\n\nThanks for your review! If you can email me at support (at) drashvr.com to let me know where the narrative breathing is, please do so I can make adjustments for the next update! I do remember your comment from before, but I've been having trouble identifying these, and no one will tell me anything specific about it.", "ElyrthalMay 24 at 6:27 AM\nWaouh...\n\nSorry, I couldn't find better to comment this experience.\n\nI first thought that the Quest probably wouldn't be able to render the gigantism of our solar system, but the devs have made an incredible job and I am so happy they proved me wrong (even beyond our solar system actually!).\n\nThat is definitely the support to be used for teaching astronomy to kids (and knowledge-lacking adults like me ;-) ) from now on!\n\nThank you so much for this great experience, what's more at such a kind price: Must-have on Quest, to show-off people its power and interest but also simply to learn.\n\nHelpful | 0", "WavePubApr 10 at 12:50 PM\nA very short tour\n\nIts a short tour of the solar system that lasts for about an hour. The sun and planets appear on a much smaller scale so its not really awe inspiring. There are much better alternatives like Discovering Space 2 on the rift.\n\nHelpful | 1", "TheFuturist47Feb 23 at 8:16 AM\nMy favorite app so far\n\nI'm really into educational uses of VR, more than games, and I'm obsessed with space stuff. This app is absolutely fantastic. Visually it's just amazing, and the tour is fascinating. I see people complaining about the tour guide but I actually like him. He isn't AI, he doesn't have some voiceover actor vibe, he comes across as a regular person (despite being a floating orb with arms).\n\nThe main thing that I'd really like to see fixed (or if I missed it, feel free to point it out) is that there doesn't seem to be any way to rewind segments of the tour. You can only skip ahead or start over. But the segments are like 20 minutes long. I don't want to rewatch the whole thing if I only need to rewind 60 seconds. There's already a pause button, so there should be a rewind and probably fast-forward button.\n\nUpdate: One additional thing I'd really love is some added tour guide content for the moons. There are quite a few stops where we look at various planets moons, and it seems really interesting, but the tour guide is absent. I love the tour guide and the script is so well written, it would great to have this added.\n\nAlso during the Mars stop, at one point the tour guide says Mars could be covered by 1.1 meters of ice, and at another point he says 11 meters of ice. That bugs me every time I hear it lol.\n\nThis remains my absolute favorite VR app and I desperately want Drash to make more educational apps like this.\n\nHelpful | 1\nDeveloper ResponseFeb 23 at 8:19 PM\n\nThank you for your review! I've put finer control of tour guide playback on the list for the next update. EDIT: Regarding the \"1.1\" vs \"11\" meters of ice coverage, those are actually referencing two different things: 1.1m from the glaciers around the globe, and 11m from the ice buried under the CO2 ice caps. I'll take a look to see if I can clarify further - thank you!", "prelude2824Feb 16 at 7:14 AM\nA peek at our neighborhood\n\nThis is a great lil app for any would-be astronomers, astronauts or lay people alike. It gives you a great sense of just how big the universe is and how special our place is in the blue little marble we call earth. I do not believe it is worth the $10 admission price, however, as after you see the entire tour the first time there really isn't much incentive to keep using this app except for that one time. Also, the animated tour guide is HORRIBLE! The character's sound of voice is very annoying and the voice acting skills (or lack thereof) leaves lots to be desired and takes away from the immersion it's trying to connect. It sounds hastily recorded with subpar equipment in someone's kitchen. You can even hear the guy take breaths between each word. No bueno. I give it 3 earth-sized stars (compare it to the size of VY Canis Majoris and you'll get my reference).\n\nHelpful | 4\nDeveloper ResponseFeb 16 at 6:12 PM\n\nGosh I had no idea anyone was picking up on any breathing sounds until these last couple of reviews. As I told someone else, I'm going through these to figure out where they are to take them out in the next update. Thank you!", "phillyg2020Jun 25 at 9:14 PM\nWait a minute...\n\nI thought the earth was flat....lol. This is a must if you know any flat earthers...\n\nHelpful | 0", "ZachZentFeb 3 at 12:21 AM\nAmazing but limited\n\nI love the premise of a vr space tour and what is there now is spectacular. I know what I was getting into with 30 minutes of gameplay, but I wish there was a bit more. Reminds me of universe simulator. Prehaps options to bring up known exo planets and stars will give this more game time and more educational value\n\nHelpful | 2", "billy.rockstar56Feb 16 at 10:03 PM\nTitans of space\n\nLove it ,would like to see sun spots on the sun planets further apart travel to them at light speed stars blured while traveling, two seats, be able to invite a friend to join you update this or some of it please \n\nHelpful | 0", "Vibranium_KingFeb 13 at 12:41 PM\nGreat taster of whats to come\n\nOverall I loved the immersion of being up close to planets in space!\n\nIt was very scary to see the size of the Sun and other stars, and it suddenly makes you realise that there must be a God who created the Universe.\n\nOnly reason this wasnt 5 stars was due to the graphics, after watching films like the Martian and Gravity, I believe we can go one level further.\n\nFor the price this is a great experience, that I will no doubt share with friends and family.\n\nWould love to visit the asteroid belt.\n\nHats off to the developer.\n\nHelpful | 3", "FatLeaderApr 9 at 9:50 PM\nTop educational app!\n\nSuper interesting\n\nHelpful | 0", "dignifiedwebDec 22 at 6:56 AM\nAn awe inspiring required purchase!\n\nDon't even read this review, just buy it! Titans of space has existed for all of the oculus platforms and I've personally demoed it to over 100 people over the years. Over half are left with joyful tears after experiencing this classic vr masterpiece. It does a great job of scale and gives you a new perspective in how small we are in the universe. With the added bonus of a voiced tour guide and a beautiful original score/soundtrack, just buy it, you wont regret it.\n\nHelpful | 6", "Brenthas1Feb 17 at 2:45 AM\nDid you know mars has volcanos?\n\nAND ONE IS THE SIZE OF FRANCE! Lol. This game is a fun and engaging learning experience. The visuals are great, and it really puts a perspective on just how small we are in the universe.\n\nHelpful | 0", "Tummie555Jan 15 at 7:36 AM\nBought blind\n\nExactly what I was hoping for. Scale, information, create some sort of understanding through visualization. (Much better than the other option we have here in the Oculus Quest store...)\n\nOnly wish free flight would be an option. Hopefuly an update. I understand it would mean you're going through vast empty space for 90% of the time, but still would like to have that freedom!\n\nHelpful | 18", "At.KalinaFeb 20 at 11:11 AM\nExceptionally well crafted\n\nSeemingly simple premise, but try it and find an immense attention to detail in both content and presentation. Humane in its entirety.\n\nHelpful | 1", "RauelRualbeMar 5 at 2:38 AM\nInspiring\n\nBeen disappointed in things like this in the past. But not this time. The price is on point, it's visually stunning and seems well made.\n\nHelpful | 0", "larenzagerDec 21 at 10:57 AM\nMy Only Concern\n\nStunning, and a bargain at twice the price. My sole concern is, unlike a game that can be re-played often, just how many times can one take this tour without it going a bit stale? Perhaps future additions? All I know is I would pay $10 for a one-time tour with this, so I guess my concern is academic. No regrets here. Well done!\n\nHelpful | 13\nDeveloper ResponseDec 21 at 11:43 AM\n\nThanks a lot, I appreciate it. And honestly? If this ends up doing really well here on the Quest store, then I might be compelled to keep the momentum going by building out significant updates to it to increase its replayability. I have some other projects I'm looking at taking further, but you never know. Have a nice day!", "McSpankeyFeb 16 at 5:13 PM\nAmazing Experience\n\nI dont normally write reviews for stuff but OMG this experience was amazing....i highly recommend this to everyone...it is well worth the money\n\nHelpful | 0", "OrcusMaximusApr 3 at 1:01 PM\nGood, but needs a black hole!\n\nInteresting tour of the solar system. It's a bit pricy for 30 mins entertainment though.\n\nHelpful | 1\nDeveloper ResponseApr 3 at 1:56 PM\n\nGreat to hear! In case you missed it, there is an additional 2 hours of Tour Guide content on top of the tour itself. It can be turned on via the big orange button at the lower left corner of your dashboard.", "SYNAPSEONJan 16 at 3:14 PM\nCosmonaut\n\nI added this to my library and it's among my top picks when demonstrating virtual reality to newbies. Its a great addition to my space collection with ISS and Apollo 11 being other masterpieces. I liked how there's an option to use less motion for 'motion sensitive' people.\n\nHelpful | 2", "idxdnappsJan 30 at 4:32 PM\nGreat game but needs better voice over!\n\nI love the game and the interactive element of learning about outer space. The only thing I wish the developers would update is the voice over recording of the tour guide. It sounds like it was recorded in someones bedroom and by a non voice actor. If the right voice actor reads the script I would have a much better experience!\n\nHelpful | 4", "FinnyWiggenDec 19 at 6:06 PM\nA decent experience\n\nThis is not the space app I have been waiting for, but it is still a good experience. I appreciate the time and effort that have gone into making it. And I do not want to discourage future development, because this type of app seems to be very hard to get right. This is certainly much much better than the other similar one in this category.\n\nWhat I like:\nThat you can see the Solar System.\nThat you can travel around and explore.\n\nWhat I am still waiting for:\nI have yet to see good scaling in one of these apps. I do realize that the size of the Solar System is tremendous, and real scaling is perhaps a challenge, but I really should not see Mercury when I am next to the Earth. Or rather the Mercury that I do see should be just a star.\n\nLikewise, the planets are placed in your view at about the size large weather balloons. I want an app where they fill the entire view and are truly humongous.\n\nGood:\nThat you can explore a solar system filled with weather balloon sized planets that are all next to each other in space.\n\nWould be better:\nIf it were more realistic, the planets felt larger, and the distance between them were greater.\n\nAll in all, not what I have been waiting for, but still a much better implementation than the other app in this category.\n\nHelpful | 6\nDeveloper ResponseDec 19 at 6:17 PM\n\nThanks for your thoughtful review! I definitely get what you are saying, and there is definitely a place for full-sized planets. The toy-sized planets in Titans are definitely an intentional design choice to enhance the 3D effect, to make it easier for our human eyes to perceive volume, and to make better use of VR. And they are all relatively close together to make it easier to compare their sizes, and their positioning is only there to reinforce the order in which you'd encounter them as a function of distance from the Sun or from a given parent body. Have a good day!", "Morpheus2199May 12 at 6:17 AM\nA Beautiful Experience\n\nThis was one of the neatest VR experiences I have done so far. It was educational, but it was interactive and beautiful enough so that I was sad when it ended.\nIt makes you feel very human.\n\nHelpful | 0", "StephenVDec 20 at 7:51 AM\nMore Epic than ever!\n\nWow, the experience that keeps on giving! I've been using this since the early days of (the new) VR era to show newcomers the glory of what VR can do. It's converted many a skeptic and is now better than ever! Drash has done a fantastic job porting this to the Quest. It's such a polished experience and I can't wait to start showing it off again to others. At this price point, it's a complete no-brainer. Grab it today!\n\nHelpful | 2", "MalteseDadDec 29 at 3:21 AM\nNot to scale\n\nA big surprise element of the solar system are the large distances between planets and moons. A pity that seeing the distance between planets and moons to scale throughout the game is not an option. The space craft could be made to accelerate either through autopilot or under my command to make light of the sheer distance between celestial bodies. Suggestion for improvement.\n\nHelpful | 7\nDeveloper ResponseDec 29 at 10:28 AM\n\nThanks for your suggestion! It is certainly intentional to keep the planets close together for comparison purposes, but you are not the only one to bring this up and Im working out a way to make everyone happy in the next update. Also note that toward the end of the tour, it does show distances at proper scale already!", "craig352Dec 25 at 9:04 AM\nStunning\n\nI've not written many reviews but felt compelled to add one. This is simply stunning. Flying over the rings of Saturn blew my mind. Amazing. This is really nicely presented. I'm only half way through the tour so I may not have seen everything yet. It might be nice to have the option to explore a system? My hats off to the developer. Impressive work.\n\nUpdated: have completed the full tour. Increasing my review to 5 stars. Very impressed by this experience.\n\nHelpful | 5\nDeveloper ResponseDec 24 at 8:46 AM\n\nThank you for your review! I would love to know what you mean by the option to \"explore a system\". Do you mean you wish you could explore a planet's moons? If so, be sure to check out the Full Tour, not just the Short Tour. Otherwise if you're wishing you could freely roam around, be sure to check out the Zero-Gravity EVA mode (via the \"0g\" button on your cockpit's dashboard). Have a good day!", "imaginationstationJan 7 at 5:50 PM\nMESMERIZING, BRILLIANT, AWE INSPIRING\n\n5 stars all the way around!! This is SSOOOO beautiful I cried! Absolutely INCREDIBLE from start to finish!!! I absolutely LOVE the 0g flight option. Holding the earth, well, the entire galaxy in my hands was so powerful to me! Reintroduces the beauty all around us that we all take for granted every day! Absolutely amazing. I never wanted to get out of it. Much love dev team!!!\nPlease please please make more stimulating apps like this one. A must have for everyone!\n\nHelpful | 3", "ParadiseDecayDec 31 at 8:31 AM\nNot to be MISSED!\n\nMy Initial Thoughts:\nI first experienced this GEM of a title 2 years ago on the Oculus Rift CV1 and I have to say its had a massive 'modern day' boost in quality and clarity thanks to the Oculus Quest amazing lenses.\nIf you have any love for space, do not miss this!\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=6ZTHm6HoMS0\n(Please Note: Links might not work from Oculus so please search YouTube for 'Paradise Decay VR Titans Of Space')\n\nHelpful | 1\nDeveloper ResponseDec 31 at 10:24 PM\n\nThanks for the review! It was a delight seeing your kid play the older version at the end of this video, and I'm very glad to hear he did well in class. :)", "gramoflavaJan 10 at 7:41 AM\nJust wonderful\n\nAstonishingly beautiful game. It is educational and simply mind blowing. If anything can be added, thats free movement or at least free movement between planets, etc. And also  galaxies, black holes. But what it is now  already a wonder.\n\nHelpful | 0", "LusoWolfDec 30 at 2:48 AM\nAmazing experience\n\nThis is an amazing experience, the sense of scale is unbelievable, fill with lots of valuable information, this is VR in its best. A must have for everyone who wants to know more about our solar system. As others already said, it would be also interesting to have an option to travel the distance among different celestial objects. The 0G option is very interesting, I only wish it was possible to have a free flight through the universe. I'm really enjoying it a lot and highly recommend it to everyone.\n\nHelpful | 0", "philg7onr123Dec 28 at 10:34 PM\nAstronomy feast\n\nA very detailed and informative experience, well worth the money. It's a really absorbing tour of the planet's, but I also like the option to turn things on and off allowing a guide free look around at your own leisure.\nThe only problem I have, I understand why the sun is so large to make comparisons, but it can be a bit annoying at times. Am I missing something ? Or are we able to reduce the sun size when freely looking around ?\nOtherwise, an excellent experience, factually and graphically amazing.\n\nHelpful | 0\nDeveloper ResponseDec 29 at 1:53 PM\n\nThanks so much for your review. I'm glad you are enjoying it, and will work on a solution for you to get that big bright Sun out of the way!", "DeefohJan 12 at 7:07 PM\nBreathtaking\n\nWhat a fantastic experience. Im only 14% in and have already spent maybe an hour checking out the planets. I thought I had an okay idea of the scope of these stellar bodies but nope. If youre into space, youll love this.\n\nHelpful | 0", "ZombiedonkeyDec 19 at 11:29 AM\nStunning!!\n\nCant wait to use this as an intro to vr for the family and friends. Can see the work and knowledge that was put in to create it and find it fascinating. Well done.\n\nHelpful | 5", "izzatzubirDec 25 at 5:53 AM\nMust have Astronomy app\n\nAs an amateur astronomer, I would recommend this for those that enjoy the planets and the stars. Since I do regular stargazing, I would let others to try this app too, together with Mission:ISS. It is worth the price.\n\nEverything in the app is good enough. However if the developers were to add anything else, I would recommend adding well-known exoplanets, a trip to black holes, nebulae, comparison of the distances to other galaxies.\n\nThanks so much for such a wonderful app.\n\nHelpful | 1", "richard.mellerDec 23 at 2:49 PM\nAstonishingly good\n\nThis is the best money I have spent on a VR experience by a long way and I have seen lots of amazing VR. It is educational yet absorbing. I love watching space documentaries on TV but experiencing this in VR brings everything to life in an incredible way.\n\nI knew the solar system was vast but actually seeing the scale of things blew my mind. Especially toward the end. It feels so peaceful and slightly eerie to be travelling out in space like this but in a good way. The narrator does a great job too.\n\nIf this isnt the blueprint for the education of the next generation of kids then Ill be shocked and humanity will be the worse for it.\n\nIt is truly exceptional. Would love more content to be added in the future (comets would be cool).\n\nHelpful | 2", "boroboymattDec 25 at 10:54 AM\nSo much knowledge\n\nTo say how much I <3 this app would be impossible for me to articulate. The narration harkens back to my favorite professors. You can hear the narrator's excitement about all of the topics he discusses and it is infectious! This is great for kids and adults alike! I just hope he makes other sciencey apps, like maybe the oceans or wildlife/insects of different regions, or constellations and stargazing :)\n\nHelpful | 1", "geoffers4321Dec 19 at 12:34 PM\nFantastic experience....\n\nAbsolutely love this experience, this is what makes vr and have been waiting for its arrival since the release of the quest..love the Graphics, the music and the immersion....well done\n\nHelpful | 4", "siberian7x7Dec 21 at 12:55 PM\nMade with love and it shows\n\nVisuals are great. You'll learn a ton about the solar system, and also about the missions and methods that have made it possible to arrive at our current understanding the composition and topography of the planets.\n\nThe narrator/guide has this sincerity and subtle charm that captivated me. You can tell he cares, and that inspires you to care as well.\n\nI absolutely recommend this to anyone who wants to gain a bit of perspective and learn at the same time.\n\nHelpful | 2", "beachmark50May 14 at 12:49 PM\nSimplistic\n\nA nice tour, but 30 minutes and youre done. Reference made to several constellations, but nothing about them. How about a quick tutorial explaining the stars in various groups, and how they align with the earths night sky. Give me a planetarium experience from eighth grade. Then it might be worth the $10.\n\nHelpful | 0\nDeveloper ResponseMay 22 at 10:37 PM\n\nHello, and thanks for your review! Just a quick reminder that there is an additional two hours of content via the Tour Guide function, available via the orange button on the lower-left of your virtual dashboard. Regarding constellations, yeah I'd love to go into more detail about Orion one of these days! Putting that on my list. Have a good weekend.", "5HR3DD3RDec 20 at 4:33 PM\nMesmerizing Experience\n\nTitans of Space Plus is a really enjoyable and educating experience. I played this about a year ago on the phone vr and loved it, so the second this was released I purchased it without hesitation, and I can tell you I was not disappointed with this new and improved revamped application. There's plenty to see and learn thanks to the well educated tour guide that talks to you and guides you through your journey. He's very well informed and knowledgeable and he did an outstanding job, and personally the tour guide made this experience even better than I had experienced it before. Thank You tour guide for educating us! And Thanks Dev's for such a cool app. \n\nHelpful | 2", "NerfensteinJan 7 at 1:04 AM\nA charming tour of the solar system\n\nJoin Flying Professor Alien as he guides you through the solar system and beyond in this clever educational app. Though everything isnt to scale, its an enjoyable jaunt from planet to planet, with both written information as well as the fun narration of the professor.\n\nJust remember this is an experience and not a game, everything here is informative and guided, though you do have various options. If youe into astronomy in any way, this is a great app to try and also show friends. Thoroughly enjoyed the charm and enthusiasm of the narrator.\n\nHelpful | 0", "fishermanrichDec 20 at 4:16 PM\nAbsolutely essential app\n\nAs the dev knows, I have had this since the first samsung Gear VR and use it at the York Astronomical Society to give people a quick tour of the solar system, their mind is literally blown, especially when you realise our sun is big but by comparison, relatively small. The sense of scale, the sheer amount of information and now the added bonus of better control makes this an absolutely essential app for your Quest headset!\n\nKeep up the fantastic work\n\nHelpful | 1", "4robotDec 20 at 8:10 PM\nReally nice\n\nOverall very well done. Really nice graphics. Great job on the Earth, from satellite imagery I've seen, a very realistic depiction. Using real-time satellite imagery would improve it, so clouds would be up to date.\n\nAfter going through the tour, it doesn't have a lot of replay value. I would have loved to have been able to fly the \"ship\" on my own. Obviously faster than light capabilities would need to be provided to the ship, but exploring the solar system would be awesome.\n\nNice job!\n\nHelpful | 2", "Aqua-VRDec 27 at 10:36 AM\nGreat but not what I was looking for\n\nI'm refunding, not because it's bad. It actually delivers on what it intended to I think. I just wanted to be able to experience the scale of planets and to be able to fly around freely. Unfortunately it has you on a predefined path, and your spaceship is bigger than most planet so it feels like you're looking at up close models of planets sometimes, rather than approaching massive planets and moons.\n\nHelpful | 4\nDeveloper ResponseDec 27 at 1:42 PM\n\nThanks for your review! I hoped Id made it clear in the description and video exactly what to expect. A miniature Solar System means that its easier to sense the size of things in VR. When planets shown at real size in VR, they are so big that they appear 2D unfortunately. Ill see what I can do to clarify things further!", "maddogDec 30 at 12:06 PM\nNot very impressive\n\nI had this on the original rift, development kit...\n\nIt was super cool back then... but not anymore.\n\nThis was one a go to app to impress friends.. but I think its now slow and dated... I had high hopes for the quest release.\n\nThe planets look really undetailed.. and the sense of scale is lost..\n\nOthers may enjoy.. but its not the update I was looking for..\n\nNick\n\nHelpful | 3", "stachowiDec 19 at 9:15 PM\nVery educational\n\nIf youre into learning about space (or just how were all just a speck of dust floating in the universe), this is a fascinating and beautiful experience.\n\nThis is not a free form game, its a guided tour. Keep that in mind before giving this your rating.\n\nHelpful | 2", "henryvelezDec 20 at 10:58 AM\nAmazing\n\nAn emotional experience that transcended culture nationality age and gender. This experience is a reminder of what it truely means to be human. A VR staple.\n\nHelpful | 3", "OlivierJTDec 20 at 8:04 AM\nMust have, indispensable.\n\nVery few VR content deserve to be called a must have.\nThis is such a title.\nNot only for you, but also to show your friends & family what \"that VR\" is all about.\nZero hesitation, just buy it.\n\nHelpful | 2", "YaBoiNubJan 19 at 4:33 AM\nAmazing for the price!\n\nIf you want to learn about most things space, play this. It is a bit restrictive but it's amazing for the price. Must have for any people who love learning or if you just are bored!\n\nHelpful | 0", "BlkHartDec 19 at 10:33 PM\nFeed my Brain! =)\n\nWe need more education like this available in VR. My kids got so excited to learn about all the planets and moons. 2020 is going to be a great year for VR. Great work Devs!\n\nI could be over looking it, but is there a free roam?\n\nHelpful | 2\nDeveloper ResponseDec 19 at 11:15 PM\n\nFeeding all the brains is why I do this! To answer your question: the only free roam here is in the form of the Zero-Gravity EVA mode. It's the gray \"0g\" button on the dashboard that first shows up at the last stop in front of Earth. It's only free roam for that area around a given tour stop, but it's enough for you to get your hands on the planets, see surface labels, and see them from new angles, and so on.", "sdleventDec 20 at 2:42 AM\nGreat Visuals, and Educational as well\n\nAbsolutely loving this. The free flight mode is great and the narration keeps you engaged. Great visuals on the quest.\n\nIf you love space, then this will not disappoint.\n\nHelpful | 2", "juraj.mikuska.1Feb 5 at 6:27 AM\n\nBeautiful\n\nHelpful | 0", "MrSpreadsheetDec 21 at 5:47 AM\nExcellent experience\n\nIf you are only going to get one \"experience app\" that you can show to your family, get this one. My only problem was that the english narrator audio has not been cleaned from very disturbing and distracting sounds of narrator's breathing. Something that should be easy for the devs to fix, but possibly got overlooked.\n\nHelpful | 1\nDeveloper ResponseDec 21 at 9:06 AM\n\nI'm glad you said something! I actually thought I went through and cleaned those out. I will get some outside help to identify the rest and address in the next update.", "blueteddy00Jan 11 at 7:09 AM\nBest Space App on the Quest\n\nI pretty much tried every Space Education App on the Quest and this one is by far the best and most interesting one. Love it!\n\nHelpful | 1", "slickwilly1021Apr 10 at 11:00 AM\nNice little break from gaming\n\nI really enjoyed this app. A lot. If you have any interest in learning about the solar system this one's for you . In-depth info about each planet , excellent graphics makes learning fun . My one gripe the narrator sounds kinda funny .\n\nHelpful | 0", "ChillenThaMostJan 5 at 11:50 AM\nFun and educational\n\nThis is a great app. Lots of interesting info and the visuals are pretty good. If you have any interest in our solar system you will enjoy this.\n\nHelpful | 0", "SupradonDec 28 at 2:56 PM\nVery informative\n\nGreat game! Well not really a game but a detailed teaching on our galaxy! I thought I know quite abit on the subject but far from it, absolutely loved it so did my family, thanks\n\nHelpful | 0", "VirtuaMeDec 20 at 11:46 AM\nLove this tour of space\n\nVR really gets across the scale of planets, moons and suns well. I hope a new chapter may be available later showing more suns and including the insanely enormous UY Scuti.\n\nHelpful | 2", "shaun.walmsley1Jan 17 at 10:26 AM\nAwsome !!\n\nGreat app 5 stars 5*****, love it \n\nHelpful | 0", "mark.burton22Jan 1 at 8:28 AM\n\nExcellent really good. Learned a lot I didn't know before. Highly recommend\n\nHelpful | 1", "archiemcbApr 15 at 1:02 PM\nAmazing\n\nAbsolutely out of this world.... literally\n\nHelpful | 0", "QuestFractalDec 19 at 8:23 PM\nVery nice\n\nJust one problem, there is some particles floatings between celestial objects and it is distracting.\n\nHelpful | 2\nDeveloper ResponseDec 19 at 8:43 PM\n\nOh you can actually turn those off if you like! During the tour, open the options menu (use the green gear button on the dashboard), then find \"MISC OPTIONS\" on the left, and turn off the \"Debris Field\" setting. Hope that helps.", "iceyiceybabyDec 19 at 11:11 AM\nActually very good\n\nVery pleased with this as a fun educational experience 8)\n\nHelpful | 6", "jamesmwaddingtonApr 5 at 8:56 AM\n\nBrilliant\nSo much to learn and really interactive\n\nHelpful | 0", "jaumemussons79Dec 20 at 1:28 PM\nAbsolutely top\n\nWorth every cent. And I can tell you that this is not my first VR\n\nHelpful | 2", "GKGFILMar 15 at 9:18 PM\nWhy I bought VR\n\nApps like this is why I bought an Oculus. There are very few I would put in that category, so purchase this one when you can.\n\nHelpful | 0", "humanbeing789Dec 25 at 8:42 PM\nMenus are frustrating + black square\n\nDont understand what is going on with this and the quest, see no hands, the menus were frustrating to select simple things like english and continue then there is a huge black square in the middle of the view. Unplayable , disappointment.\n\nHelpful | 1\nDeveloper ResponseDec 25 at 9:13 PM\n\nOh man, I've heard of this happening to other devs from time to time. It's a temporary graphics driver glitch that you can resolve by restarting the headset, I believe. Hope that helps!"]