{"App Title": "Traveling While Black", "App description": "Traveling While Black is a cinematic VR experience that immerses the viewer in the long history of restriction of movement for black Americans and the creation of safe spaces in our communities.\n\nAcademy Award winner Roger Ross Williams and Emmy Award-winning Felix & Paul Studios' film transports you to historic Ben's Chili Bowl in Washington DC. The viewer shares an intimate series of moments with several of the patrons of Ben's as they reflect on their experiences of restricted movement and race relations in the U.S. \n\nConfronting the way we understand and talk about race in America, Traveling While Black highlights the urgent need to not only remember the past but to learn from it, and facilitate a dialogue about the challenges minority travelers still face today.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Documentary & History, Movie, Narrative", "Languages": "English", "Version": "1.00.4", "Developer": "Felix & Paul Studios", "Publisher": "Felix & Paul Studios", "Website": "https://www.felixandpaul.com/", "Release Date": "September 13, 2019", "Developer Privacy Policy": "ALEGRA\n\nA SPARK OF LIGHT\n\nGYMNASIA\n\nTRAVELING WHILE BLACK\n\nMARSHALL FROM DETROIT\n\nJURASSIC WORLD\n\nBLUE\n\nSPACE EXPLORERS\n\nNARRATED BY BRIE LARSON\n\nISLE OF DOGS: BEHIND THE SCENES\n\nTHE CONFESSIONAL\n\nCIRQUE DU SOLEIL\n\nTHROUGH THE MASKS OF LUZIA\n\nMIYUBI\n\nTHE PEOPLE'S HOUSE\n\nINSIDE THE WHITE HOUSE WITH BARACK AND MICHELLE OBAMA\n\nCIRQUE DU SOLEIL\n\nDREAMS OF 'O'\n\nCIRQUE DU SOLEIL\n\nK\n\nTHROUGH THE AGES: PRESIDENT OBAMA\n\nCELEBRATES AMERICA'S NATIONAL PARKS\n\nINTRODUCTION TO VIRTUAL REALITY\n\nLEBRON JAMES\n\nSTRIVING FOR GREATNESS\n\nPRESIDENT CLINTON\n\nINSIDE IMPACT: EAST AFRICA\n\nJURASSIC WORLD\n\nAPATOSAURUS\n\nINSIDE THE BOX OF\n\nKURIOS\n\nNOMADS\n\nSEA GYPSIES\n\nNOMADS\n\nMAASAI\n\nNOMADS\n\nHERDERS\n\nWILD\n\nTHE EXPERIENCE\n\nCIRQUE DU SOLEIL\n\nZARKANA\n\nSAMSUNG GEAR VR\n\nINTRO TO VR\n\nSTRANGERS\n\nWITH PATRICK WATSON\n\nALEGRA\nGYMNASIA\nTRAVELING WHILE BLACK\nMARSHALL FROM DETROIT\nJURASSIC WORLD\nSPACE EXPLORERS\nISLE OF DOGS\nCONFESSIONAL\nLUZIA\nMIYUBI\nTHE PEOPLE'S HOUSE\nDREAMS OF 'O'\nK\nTHROUGH THE AGES\nINTRODUCTION TO VIRTUAL REALITY\nLEBRON JAMES\nINSIDE IMPACT\nJURASSIC WORLD\nKURIOS\nSEA GYPSIES\nMAASAI\nHERDERS\nWILD\nZARKANA\nSAMSUNG GEAR VR\nSTRANGERS\nABOUT\nTEAM\nPRESS\nJOBS\nCONTACT\nPRIVACY POLICY\nLICENSE\n \n\nFelix & Paul Studios Inc.  Privacy Policy (the Policy)\n1. Introduction & Overview\nIn general, Felix & Paul Studios Inc. collects personal information from the following sources:\nOur website\nCommunications with our company by telephone, email, etc.\nOur apps\nThe information we collect is of two types: information which you personally provide, such as via a web form or personal communications (User-Provided Data) or which is automatically collected, such as information sent by your web browser or our application (App Data).\n\nFelix & Paul Studios Inc. will use User-Provided Data only for the purpose for which you have provided it, as specified in the applicable web page, application screen, or other medium of communication. For example, if you contact us via a link or form on any of our websites or distribution platforms we will use the information you provide to respond to your request.\n\nMinors (people under the age of 18 in most jurisdictions) must obtain the consent of their parent or guardian before providing any personal information.\n\nApp Data does not identify you as a user, nor is App Data associated or stored with your User Data (except when you specifically ask us to do something which requires that combination, such as for troubleshooting).\n\nFelix & Paul Studios Inc. will use App Data for the purposes above and for other purposes relating to the business of the company, such as (but not limited to) understanding how users make use of our Experiences, evaluating and improving our technology, etc.\n\nFelix & Paul Studios Inc. does not generally share any personal information and uses appropriate security and technology measures to protect your information. Exceptions and details are listed below.\n\n2. Information Collection\nFelix & Paul Studios Inc. collects and stores User-Provided Data only as that information is explicitly provided or approved by the user. For example, if you send us an email, we collect the email address and content of that email. Similarly, if you fill out a web form, we collect the information you provide on that form.\n\nExcept for purposes of billing (see below), any payment information, such as credit card, billing or similar information will be treated as User-Provided Data.\n\nFelix & Paul Studios Inc. collects App Data from your web browser and from your use of our Experiences, which is likely to include some or all of the following: the IP address, current status (including for example processor performance and temperature), technical characteristics of your device, your use of our Experiences (including performance data, your viewing direction and other user behavior) and software. These are examples of the information we may collect; we may collect additional information as our content, software, or analytics develop.\n\nWith your explicit consent, we may also collect information about you from social media or other sources, such as Facebook, Twitter, etc. We will treat such information as User-Provided Data and/or App Data under this Policy.\n\n3. Cookies\nOur website uses cookies, a mechanism through which our website is able to identify you when you return to our site. This allows us to provide a more personal experience, such as helping us provide content relevant to your prior use of our site.\n4. Information Use\nWe will use User-Provided Data for the purposes communicated as part of the web form, app screen or other communication with the user. Examples include responding to user requests and/or providing personalized content to the user.\n\nWe may use User-Provided Data for marketing purposes. You may opt out of such use by contacting us (see below). We will use App Data to understand our users interaction with our Experiences and to improve our Experiences.\n\n5. Information Sharing\nFelix & Paul Studios Inc. does not ordinarily share personal information with any other party. The following are exceptions where Felix & Paul Studios Inc. will share personal information:\nWhere we are required to do so by law, regulation, or when sharing is part of our response to a legal claim or action.\nWhere we believe, in good faith, that sharing is appropriate to protect the rights of others, such as (but not limited to) the rights of other Studios Flix & Paul Inc. clients, third party intellectual property rights, etc.\nAs to Billing Data, as may be reasonably required for us to receive payment, such as sharing Billing Data with our bank or credit card processor.\nFelix & Paul Studios Inc. may use the services of third parties for the collection, storage, management, and analysis of personal information. If Felix & Paul Studios Inc. uses the services of a third party, it will use reasonable efforts to assure that the third party substantially complies with this Policy.\n\nIf Felix & Paul Studios Inc. is acquired by or merges with another company or otherwise transfers part of its business, it is likely that the personal information held by Felix & Paul Studios Inc. will be combined with that of the other company.\n\n6. Compliance with Law, Contact Details, Disputes.\nIn any case where applicable law requires us to deviate from this Policy, we will, of course, follow the requires of such law.\n\nIf you which to contact us in regard to a privacy issue, please write to us at our Montreal office or email privacy@felixandpaul.com.\n\nThis Policy is governed by and construed in accordance with the laws of the Province of Quebec and the laws of Canada applicable therein. In case of any dispute with Felix and Paul Studios Inc. in regard to or arising from this Privacy Policy, you agree that the exclusive venue for any such dispute will be the courts of the Province of Quebec, judicial district of Montreal.\n\n7. Changes\nWe may modify this Policy at any time by posting a new Policy at http://www.felixandpaul.com/privacy. If you disagree with any such modifications, contact us immediately and we will use reasonable efforts to remove any User-Provided Data being understood that we may then continue to use any App Data in accordance with the then-governing Policy.\n8. Definitions\nFelix & Paul Studios Inc. means the Canadian corporation bearing this name and having its head office at 350 rue le Moyne, Suite 100, Montreal, QC, H2Y 1Y3, Canada.\n\nExperiences means content, software, and/or other materials created by or for Studios Flix & Paul Inc.\n\n \n \nEN \nFR", "Developer Terms of Service": "ALEGRA\n\nA SPARK OF LIGHT\n\nGYMNASIA\n\nTRAVELING WHILE BLACK\n\nMARSHALL FROM DETROIT\n\nJURASSIC WORLD\n\nBLUE\n\nSPACE EXPLORERS\n\nNARRATED BY BRIE LARSON\n\nISLE OF DOGS: BEHIND THE SCENES\n\nTHE CONFESSIONAL\n\nCIRQUE DU SOLEIL\n\nTHROUGH THE MASKS OF LUZIA\n\nMIYUBI\n\nTHE PEOPLE'S HOUSE\n\nINSIDE THE WHITE HOUSE WITH BARACK AND MICHELLE OBAMA\n\nCIRQUE DU SOLEIL\n\nDREAMS OF 'O'\n\nCIRQUE DU SOLEIL\n\nK\n\nTHROUGH THE AGES: PRESIDENT OBAMA\n\nCELEBRATES AMERICA'S NATIONAL PARKS\n\nINTRODUCTION TO VIRTUAL REALITY\n\nLEBRON JAMES\n\nSTRIVING FOR GREATNESS\n\nPRESIDENT CLINTON\n\nINSIDE IMPACT: EAST AFRICA\n\nJURASSIC WORLD\n\nAPATOSAURUS\n\nINSIDE THE BOX OF\n\nKURIOS\n\nNOMADS\n\nSEA GYPSIES\n\nNOMADS\n\nMAASAI\n\nNOMADS\n\nHERDERS\n\nWILD\n\nTHE EXPERIENCE\n\nCIRQUE DU SOLEIL\n\nZARKANA\n\nSAMSUNG GEAR VR\n\nINTRO TO VR\n\nSTRANGERS\n\nWITH PATRICK WATSON\n\nALEGRA\nGYMNASIA\nTRAVELING WHILE BLACK\nMARSHALL FROM DETROIT\nJURASSIC WORLD\nSPACE EXPLORERS\nISLE OF DOGS\nCONFESSIONAL\nLUZIA\nMIYUBI\nTHE PEOPLE'S HOUSE\nDREAMS OF 'O'\nK\nTHROUGH THE AGES\nINTRODUCTION TO VIRTUAL REALITY\nLEBRON JAMES\nINSIDE IMPACT\nJURASSIC WORLD\nKURIOS\nSEA GYPSIES\nMAASAI\nHERDERS\nWILD\nZARKANA\nSAMSUNG GEAR VR\nSTRANGERS\nABOUT\nTEAM\nPRESS\nJOBS\nCONTACT\nPRIVACY POLICY\nLICENSE\n \nIMPORTANT  PLEASE READ CAREFULLY BEFORE USING FELIX & PAUL MATERIALS (AS DEFINED BELOW). THE DEFINITIONS ARE SET OUT AT THE END OF THIS AGREEMENT.\n\nFor all licensing inquiries, please contact licensing@felixandpaul.com\n\n1. Parties\n\nThis Agreement is between you (You or Your) and Felix & Paul Studios Inc. (Felix & Paul). You must agree to the terms of the Agreement in order to Use the Felix & Paul Materials. This Agreement is not available to any corporation, partnership, or other form of business entity. This Agreement sets forth the entire understanding and agreement between You and Felix & Paul with respect to the subject matter hereof.\n\n2. Users, User Items, and the Experiences\n\nFelix & Paul grants You a limited, non-exclusive and non-transferable licence to Use the Felix & Paul Materials, in accordance with the terms set forth in this Agreement. You may not Use the Felix & Paul Materials (directly or indirectly) for any commercial purpose and You are not allowed to provide the Felix & Paul Materials to any third party (except that you may allow others to experience a Felix & Paul Experience on your personal User Item without charging a fee). For the avoidance of doubt, any public exhibition of Felix & Paul Experiences is prohibited. You acknowledge that You will not Use the Felix & Paul Materials in any way or for any purpose that is unlawful or prohibited by the terms of this Agreement. Felix & Paul reserves the right to terminate Your Use of the Felix & Paul Materials at any time if you do not abide by these conditions. You agree to obtain any Felix & Paul Materials (including Experiences) only through a Distributor or Felix & Paul and to comply with terms and conditions set by the Distributor, as applicable. The Experiences require User Items, such as specialized hardware, software, and/or other items (usually specified by the Distributor). You are solely responsible for selecting, obtaining, maintaining, and using the User Items. Patches, updates, upgrades and other modifications to the Felix & Paul Materials will be installed on the User Items in accordance with terms and conditions set by the Distributor. This Agreement is effective from the moment you first Use the Felix & Paul Materials until it is terminated. This Agreement is terminated automatically by Felix & Paul if You fail to comply with the terms and conditions of this Agreement.\n\n3. Fees\n\nYou agree to pay the published fees for the Felix & Paul Materials, as those fees are shown on the web store, app store, or other distribution point operated by either a Distributor or Felix & Paul. You agree that You will not make any claim against Felix & Paul in regard to any fee or related matter and that Your claim will be solely against the Distributor. You agree to pay any taxes and/or other costs (such as bandwidth, equipment, or other expenses) associated with Your Use of the Felix & Paul Materials.\n\n4. Intellectual Property\n\nYou agree that all IP in the Felix & Paul Materials is owned by and/or licensed to Felix & Paul (except as explicitly otherwise stated by Felix & Paul pertaining to specific elements of the Felix & Paul Materials), and that you have no rights in that IP. You agree not to Use any part or element of the Felix & Paul Materials except in connection with the private exhibition of an Experience as contemplated by this Agreement. Except for the non-exclusive rights to view the Experiences (including the right to Use Software in connection with viewing the Experiences), you do not have and do not obtain any IP rights whatsoever in the Felix & Paul Materials or Experiences. You agree not to or attempt to (1) reverse engineer, decompile, disassemble the Felix & Paul Materials; (2) distribute, transfer, sell, lease, sublicense, assign or otherwise make available, directly or indirectly, the Felix & Paul Materials, in part or in whole; (3) copy, reproduce, modify, adapt, translate, or create derivative works from the Felix & Paul Materials; (4) remove any copyright or other proprietary notations from the Felix & Paul Materials; (5) obtain any information about any aspect of the IP in the Experiences and/or Felix & Paul Materials; or (6) extract any portion or element of the Felix & Paul Materials for any purpose whatsoever. In some cases, the Software contains free and/or open source software (FOSS), which is identified as appropriate to each licenses terms. You agree to comply with any applicable FOSS terms. In some cases, the Experiences and/or Felix & Paul Materials include the IP of other parties. You agree that you will comply with the rights of such other parties.\n\n5. Updates and Changes\n\nThis Agreement may be changed and/or updated from time to time by posting the changes on the Felix & Paul website. You agree to accept such changes unless you (1) stop using any Felix & Paul Materials and/or Experiences at the time of the change and (2) notify Felix & Paul that you reject such changes.\n\n6. Privacy Policy\n\nYou agree to the terms and conditions of the Felix & Paul privacy policy, located at http://felixandpaul.com/privacy, and to the privacy policies of any Distributor which you use.\n\n7. Health and Safety\n\nYou are solely responsible for the health and safety of owning and operating the User Items and/or the Experience, including the selection of a safe location and set-up. Felix & Paul makes no warranty whatsoever of any kind or nature with regard to the Experiences and/or Felix & Paul Materials including (but not limited to) personal injury, illness or property damage of any kind or type.\n\n8. Indemnification\n\nYou hereby agree to defend, indemnify and hold harmless Felix & Paul, its shareholders, affiliates, directors, officers, subsidiaries, employees, agents, suppliers, licensees, Distributors, successors and assigns and other users of the Felix & Paul Materials, from all damages, liabilities, claims and expenses, including without limitation attorneys fees and costs, arising from relating to any breach of this Agreement by you, or from your Use of the Felix & Paul Materials and/or Experiences, except regarding the IP in the Felix & Paul Materials.\n\n9. Limited Warranty and Limitation of Liability\n\nFELIX & PAUL ASSUMES NO RESPONSIBILITY FOR THE SELECTION OF THE FELIX & PAUL MATERIALS TO ACHIEVE ANY INTENDED PURPOSE, FOR THE PROPER USE OF FELIX & PAUL MATERIALS OR FOR THE RESULTS OBTAINED FROM USE OF THE FELIX & PAUL MATERIALS. FELIX & PAUL LICENSES THE FELIX & PAUL MATERIALS, INCLUDING USE OF THE FELIX & PAUL MATERIALS, AS IS. FELIX & PAUL MAKES NO WARRANTIES, EXPRESS OR IMPLIED, AND EXPRESSLY DISCLAIMS AND NEGATES ALL OTHER WARRANTIES, INCLUDING WITHOUT LIMITATION, IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. FURTHER, FELIX & PAUL DOES NOT WARRANT OR MAKE ANY REPRESENTATIONS CONCERNING THE ACCURACY, LIKELY RESULTS OR RELIABILITY OF THE USE OF THE FELIX & PAUL MATERIALS OR OTHERWISE RELATING TO THE FELIX & PAUL MATERIALS OR ANY MATERIAL ON ANY WEBSITES LINKED TO THE FELIX & PAUL MATERIALS. FELIX & PAUL DOES NOT WARRANT THAT THE FELIX & PAUL MATERIALS WILL BE UNINTERRUPTED, SECURE OR ERROR-FREE OR THAT THE FELIX & PAUL MATERIALS ARE FREE OF COMPUTER VIRUSES OR OTHER HARMFUL MECHANISMS. IF YOUR USE OF THE FELIX & PAUL MATERIALS RESULTS IN THE NEED FOR SERVICING OR REPLACING EQUIPMENT OR DATA, LICENSOR IS NOT RESPONSIBLE FOR THESE COSTS. IN NO EVENT WILL FELIX & PAUL, ITS OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, SUB-CONTRACTORS OR THIRD-PARTY SUPPLIERS, BE LIABLE FOR ANY INDIRECT, SPECIAL, INCIDENTAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT LIMITED TO, ANY DAMAGES WHATSOEVER RESULTING FROM LOST DATA OR THE MISUSE OF DATA OR PERSONAL INFORMATION, HOWEVER ARISING, WHETHER FOR BREACH OF CONTRACT OR OTHERWISE, INCLUDING NEGLIGENCE, INCURRED BY YOU OR ANY THIRD PARTY, IN ANY CASE, REGARDLESS OF WHETHER FELIX & PAUL OR ITS OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, SUB-CONTRACTORS OR THIRD-PARTY SUPPLIERS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. YOU AGREE THAT, IN ANY EVENT, THE MAXIMUM AGGREGATE LIABILITY OF FELIX & PAUL, ITS OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, SUB-CONTRACTORS AND THIRD-PARTY SUPPLIERS UNDER THIS AGREEMENT, OR OTHERWISE IN RESPECT OF THE SUBJECT MATTER OF THIS AGREEMENT, FOR DAMAGES, REGARDLESS OF FORM OF ACTION, WILL BE EQUAL TO THE GREATEST OF (1) CDN $100.00, OR (2) FIVE TIMES THE AMOUNT RECEIVED BY FELIX & PAUL FROM YOU IN RELATION TO THIS AGREEMENT. BECAUSE SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR LIMITATIONS OF LIABILITY, THESE LIMITATIONS MAY NOT APPLY TO YOU. THESE PROVISIONS WILL APPLY TO YOU TO THE MAXIMUM EXTENT PERMITTED BY LAW.\n\n10. Governing Law and Forum\n\nTo the fullest extent permitted by applicable law, this Agreement shall be governed by and construed in accordance with the laws of the Province of Quebec and the federal laws of Canada applicable therein. Any actions at law or in equity arising out of or in relation to this Agreement may be filed only in courts located in the Province of Quebec, Canada and You hereby consent and submit to the personal jurisdiction of such courts.\n\n11. Definitions\n\n1. Content means the images (including moving and virtual reality images), audio, text, logos, and/or any other files and creative output (in any form whatsoever, including any derivatives), other than Software, owned and/or controlled by Felix & Paul.\n\n2. Distributor means any business entity which provides distribution of the Felix & Paul Materials and/or collects fees for such distribution (such as, but not limited to, Oculus VR, SONY, YouTube, Microsoft, etc.) in accord with an agreement with Felix & Paul.\n\n3. Experience means the virtual reality experience as created by Felix & Paul, including all video, audio, and other elements, and implemented through User Items. Experience includes Felix & Paul Materials.\n\n4. Felix & Paul Materials means the Software and Content provided or made available to You, whether by Felix & Paul or by Distributors.\n\n5. IP means all intellectual property rights of every type and nature, including (without limitation) all inventions, patents, trademarks, trade secrets, copyrights, moral rights, or other intangible rights.\n\n6. Software means the computer code and/or software (in any form) which is used for the creation, delivery and/or exhibition of the Experiences, owned and/or controlled by Felix & Paul.\n\n7. Use means to install, use or to possess the Felix & Paul Materials on the User Items.\n\n8. User Items means the hardware, software, and other items necessary for the viewing and use of the Experience.\n \n \nEN \nFR", "Space Required": "35.4 MB"}



["5 stars\n67%\n4 stars\n5%\n3 stars\n2%\n2 stars\n3%\n1 star\n22%", "TheSpyHunt3rMay 29 at 2:59 PM\nTruly Seeing Yourself In Another's Shoes\n\nI can't say I've been there. In my own skin, I am white. In my heart, there is no defining skin tone. But that isn't the way it is for everyone, and sadly, so many people are mistreated still yet on the basis of their outwards appearance, on the color of their skin. I can never understand this without living it first hand, but this experience increases my awareness of the issue and helps me to get a glimpse of this glaring problem that unfairly plague a people just trying to get by like the rest of us. I hope we finally start to see the changes taking place that will eradicate this issue.\n\nHelpful | 113", "ronhomeminiJun 8 at 9:50 AM\nMust See!\n\nThis is a fantastic overview of the issues that were faced and are still being faced today. I loved to be able to sit beside the patrons in the diner and listen to their stories. Being a Caucasian male, I am saddened by what I heard and quite frankly embarrassed. Everyone needs to watch this and sit back and think about these issues and do something about it so things can change, now!\n\nHelpful | 16", "360VRcreatorJun 6 at 4:18 PM\nAmazingly well done\n\nHave heard and read about the Green Book before, and seem to remember \"Traveling while Black\" being the title of a article some years back, not sure if there is a connection.\n\nThe message is strong, and clear, served up without judgement, and leaving it up to the viewer to take away lessons. This should be a required 360 watch in schools.\n\nProduced with the New York Times - strong journalistic content and well edited storytelling.\n\nAside from the story, the mixed media presentation is spectacular, the blending of 2D content, into 3D spherical conversations.. one of the best 360 documentaries I have ever seen.\n\nHelpful | 9", "Banja78Jun 1 at 4:23 AM\nUseful\n\nI really like the work from this studio and will watch everything I can find from them. We should have more documentary in VR. This is perfectly realised.\n\nNow on the messages, I read on the other reviews some controversy on the story. It makes me think that maybe everything is not solved in USA, whether it is about racial discrimination or gun usage. That is why I believe documentaries and debates are more than useful. There is still a lot to do to build a better world.\n\nUpdate June 2020 - considering actual situation in USA - this is a must seen\n\nHelpful | 18", "Juan-117Apr 28 at 5:02 PM\nAn Amazing Immersive Story!\n\nIt is unfortunate that there are some bad reviews on here that gives it a low rating. This app is a 5.0 for me. It is deep and personal in todays world where we are still dealing with racial injustices. There will always be trolls on here bashing this app but everyone should download this free app which is around 30 minutes long. It will open your eyes to a different perspective.\n\nHelpful | 49", "marksteelz3Jun 27 at 12:22 AM\nEveryone with access to VR must see this\n\nThis experience pushes the boundaries of conveying the struggle of being black and I think that everyone who has a VR headset should show this experience to every person they can that doesn't have their own headset to use.\n\nIt is horrible to see so many nasty, bigoted reviews from people who clearly completely missed the point of this experience and simply wish to try to combat the black lives matter movement. Unless you experienced technical difficulties or discomfort, if you support the black lives matter movement then you should leave a 5 star review! The percentage of negative reviews should not be this high!\n\nHelpful | 3", "rashaad.motleyMay 16 at 4:57 AM\nAwesome and very Vivid\n\nThis is a FREE App which was solely meant as a learning and understanding tool about the history of African Americans (especially in regards to a safe haven like the diner the interviews take place in). Its not meant to be interactive, everything on the OCULUS is not to be a game and especially what is still going on today in the U.S., this short story is very relevant (think Ahmad Arbury)\n\n5-stars for the raw emotion, the visuals, the story line, etc (in most parts, I felt like I was actually sitting in the interview along with the other participants)\n\nHelpful | 13", "webb.louiseMay 23 at 5:27 AM\nEmmersive experience\n\nThis was very well done and very interesting. I learned a lot. I didnt realise just how bad things were for black people in America, it makes me feel sad they they are treated like this. Everyone should be treated the same regardless of the colour of their skin.\n\nWell done to the creator of this, brilliantly told and visually excellent.\n\nHelpful | 6", "evandaganJun 15 at 4:49 PM\nNon-interactive 3D documentary\n\nThis is a compelling and timely documentary about racism, presented in 3D, 360 degree video, 3DOF. There's no interaction. I wish Oculus would add a store/library category for this type of non-game content.\n\nMinus a star because it seems like this could have easily been updated to 6DOF to aid comfort while viewing.\n\nHelpful | 1", "randomheroguy125 days ago\nGreat Experiance\n\nJust looking at ratings, i'm glad it triggers something in people. I like the extreme in in ratings based on content some probably never even finished watching.\n\nHelpful | 1", "XozmicMay 31 at 5:00 AM\nTravelling while black\n\nBrilliant! Wish there were more like this beauty !\nIn my humble opinion...Well written well executed.\n\nDid get a tiny bit of motion sickness but fought through, film was to good to let go.\nFor me the documentary is saying nothing has really changed from past to present.\n\nHelpful | 4", "ryleeblueMay 20 at 12:23 PM\nThe most immersive experience I've seen\n\nOof this app is getting review bombed by racists. And it's a shame because even outside of the content it's really well made.\n\nThis experience depicts segregation and more specifically police brutality. It was interesting being next to the people talking I felt a warm feeling like they were actually next to me. I wish the review bombers waited till the end to see that racism still goes on today.\n\nAnd police brutality largely affects MEN regardless of color though obviously men of color are profiled. The legal justice system also discriminates against men of color AND white men. Overall men are more harshly criminal sentences compared to women. I don't understand the racists when the issue usually affects them too.\n\nHelpful | 10", "lookforevJun 20 at 8:08 PM\nAn unexpected VR Pleasure\n\nI commend the creators of this experience. I can only imagine the push back and doubt they receive for such a project. Not only was this succinctly curated and exquisitely visual, but it drew me in emotionally. Racism is not a game. For many people, its quotidian reality. Therefore this was the perfect format to tell a story.\n\nPersonally, anything less than five stars is made from simply made from someone who has varying views on racism. From a technical standpoint, this is the epitome of VR.\n\nHelpful | 1", "Puerto-the-RicoJun 26 at 10:07 AM\nA must see experience\n\nNo words I can type here will do this tale justice. It brought me to tears. We need to be our brothers keeper. I encourage you to take the time and experience what it means to travel while Black.\n\nHelpful | 1", "JumanaAndMellaMay 3 at 5:10 PM\nAmazing!\n\nI personally loved this In every way. So far my favourite experience. I felt I was there at the table with these guys. More short films like this please. Fantastic. Full stars from me \n\nHelpful | 6", "ddowns509Jun 21 at 1:49 PM\nMoving and Personal\n\nMake time for this. It will stir your heart and engage your perspective.\n\nHelpful | 2", "CaedmonmJun 4 at 11:49 AM\nThought provoking and incredibly moving\n\nReally recommend this it's a beautifully shot series of interviews. Heartbreaking at times but also really informative and immersive.\n\nHelpful | 2", "akwalsh3May 14 at 1:06 PM\nDocumentary with immersive artistry\n\nIncredible artistry and curation of a powerful message. Superbly directed and crafted. And perfect duration as well.\n\nHelpful | 4", "Blantoure212 days ago\nA must see!\n\nAll I can say is WOW! This is the best VR experience I have had. I was totally immersed in the movie. The subject matter hits home for me as a black woman with sons. I will watch this again and share it with all my friends. Not sure why it's free because I would surely pay for this experience.\n\nHelpful | 0", "canrul3sJun 1 at 10:51 PM\nTouching and relevant story\n\nThis is the future of movies\n\nHelpful | 2", "TiffanyB00May 23 at 9:06 PM\nVery Touching\n\nThe stories were very well told and definitely touched my heart. Please make more content like this in the future!\n\nHelpful | 1", "QilJun 5 at 8:46 PM\n\nI love this it mostly teaches you about the history of black.\n\nHelpful | 0", "robmontanezMay 16 at 1:24 PM\nPoignant and Timely\n\nNot a game, but an experience. Loved this film, as it touches the black experience. More like this please.\n\nHelpful | 1", "DisBishFeb 27 at 6:02 PM\nTouching\n\nI'm not a very emotional person, but this made me cry. It's an important lesson on understanding others backgrounds and a reminder that we all are one and how important it is to treat others with respect.\n\nHelpful | 5", "HardcoreHarlowJan 15 at 7:27 PM\nPowerful Medium\n\nI thought I'd give this a try and present to my 7 y/o daughter on MLK day for a little education. I read some of the reviews here previously and wanted to screen it first to ensure there was no political indoctrination going on or whatnot. We are a cool family and I did not want her walking away feeling guilt for something she has nothing to do with. That said, this thing brought me to tears, several times. Enough so I had to tilt my head back because we all know you aren't supposed to get the lenses wet. Pretty strong stuff. I'm not sure if my daughter is ready for it, or if maybe it's exactly what everyone should hear. All in all, this was a great watch. I wish this had been a longer film and greatly expanded on. 5 stars for the story telling. There were some technical things that got to me, particularly how motion tracking was handled. The movie kinda drifts in a sickening way if you move up and down in your chair. It's not really VR, per se, but it's not like watching a static screen. It's some kind of weird 360 3D. I just think it could have been smoother in that regard. The environment was great though, really well done. You can tell attention to detail wasn't spared. I hope we see more movies like this in the future. It's a powerful medium.\n\nHelpful | 14", "FusionWarnerCenterMar 14 at 8:30 PM\nAmazing!\n\nI love this! Im a teacher and I use this with my students regularly and it is wonderful.\n\nHelpful | 4", "LaCasa225Jan 11 at 10:56 PM\nMorgan Freeman is not our spokesperson\n\nMorgan Freeman is not the spokesperson for all African Americans! When you read these reviews you quickly realize the ones who have suffered this in some way and the ones who casually skim across stories of racism from time to time. Some continue to hide behind the shame.. some say let it go some applauds Morgan Freeman statement.. but fail to realize the context of his statement!! Uggg!!! We should stop talking about it??  This is the thinking that halts any progress towards changing hearts and minds of those who truly hate. One review is so uninformed as to believe all of these events happened in the 50s & 60s. On 22 November 2014, 12-year old African-American Tamir Rice was shot by 26-year-old police officer Timothy Loehmann in Cleveland, Ohio. Rice was playing with a toy gun; Loehmann shot him almost immediately after arriving on the scene. I encourage you to watch it again and this time stay awake. This film should be part of every schools curriculum.\n\nHelpful | 49", "linkinprkmxNov 21 at 12:42 AM\nI am filmmaker and I loved it\n\nI got my Oculus Quest for work on my VR creations, I was not in to this kind of stuff in VR, then I got to see this and my jaw dropped, (probably is my age 47) but I am highly impressed by the amazing way of telling a documentary and immersive one, I really, really enjoyed it, I want to work in projects like this in the future so there will be more options like this on Oculus, bravo!\n\nHelpful | 80", "harvey.cobb.77Jan 24 at 4:17 PM\nA Must see!\n\nI really enjoyed this, everyone should watch. The VR effects were outstanding, like you were really there. You can still tell a lot of the racism, spoke about in film is still alive today and with all one & two star ratings. A lot of people want to pretend like it never happened, but it did and wasnt that long ago.\n\nHelpful | 4", "SATactSKYPEtutorDec 29 at 6:33 PM\nworth watching but kinda steers offroad\n\nVR as a medium will be hugely educational, this and the anne frank experience is better than anything ive seen before.\nwatching tamir rice's mother talk almost gave me tears, as i was sitting right in front of her as an observer\n\nwith that said, that part felt very straying from the whole topic of traveling while black, and should be it's own documentary.\n\nHelpful | 4", "DeAnte513Dec 10 at 8:39 AM\nInteresting\n\nI read reviews where people said this is the past let it go. Obviously they didn't watch it, because Tamir Rice story came up and that was in Nov 2014. I like this, very informative just wish it had more content and cases. Will show my family and friends. Also the graphics was on point\n\nHelpful | 14", "raylene413Dec 21 at 1:45 PM\nLess than honest\n\nThe film is 20 minutes long, i really enjoyed the transitions, as well as the stories in the diner.\nThe reason I gave 2 stars is for 2 reasons.\n1. I would of liked to see more reenactments of the the things they were talking about to truly immerse myself into the stories and\n2. The story about Jamir Rice is a sad and tragic event. I couldn't fathom the heartbreak as a mother. My issue is that they only told half of the story when making a documentary about being black. The police were dispatched to the location and told that a young black man at the park was brandishing a gun as people walked by. When the police pulled up, they told him to put his hands up and he reached for the arisoft gun that looked like a real gun. They shot him.\nThe documentary never once mentioned a gun, never mentioned why the police rolled up like that.\nThey made it seem like a little boy was playing at the park and the police saw a black boy so they shot him.\nI want to be educated. I was to empathize with those discriminated against. I also want the whole story. I don't think that specific story should of been shared. There are so many legitimate heart wrenching stories about crimes that have been committed against the African american community in the US.\nLike Eric Garner who was confronted by police over selling single cigarettes and was put into a choke hold after resisting. Eric said over 10 times he could not breath until he took his last breath.\nTo sum up my feelings on the documentary, I walked away feeling upset with the half truth, it was an injustice to the rest of the film.\n\nHelpful | 152", "drakeyasJun 7 at 2:43 PM\n\nTerrible and racist\n\nHelpful | 46", "bk227865Dec 26 at 9:23 AM\nMisleading.\n\nI can't see how bringing a story in this fashion is going to change anything for the better. At around the 12 minute mark the \"experience\" truly abandons it's subject and starts to show it's true colors, at that moment it has nothing to do anymore about \"traveling while black\" and at that moment i also began to sense a real negative direction in the way the conversation was being guided.\n\nBut we also should not stop speaking and remembering our past : \"Those who can't remember the past are condemned to repeat it\".\n\nHelpful | 92", "intelligentsiaDec 8 at 4:54 PM\nExcellent, shocking and poignant\n\nThis is actually really well done and a good use of technology.\nThis VR project does make people aware of Americas own Apartheid and how awful and ignorant certain types of human being are. Segregation and racism are some of most ugly aspects of human civilisation. A good reminder that knuckle draggers need to be accountable for their past.\n\nHelpful | 6", "Vader4Feb 9 at 12:24 PM\n\nGreat wish it was longer\n\nHelpful | 4", "Channel.XiroNov 30 at 10:03 AM\nAn amazing experience\n\nYou'll see alot of negative reviews based on the content, but that is more about ignorance than the experience. This documentary styled experience shows VR isn't just about gameplay it's also about immersion. Alot of the negative comments just prove why experiences like this are necessary. There are still places in America where racism and discrimination are the norm. Sharing that experience in VR isn't a history lesson, it's a wake up call\n\nHelpful | 16", "Big_Boy87Jan 25 at 11:28 AM\nTo everyone who's complaining about this\n\nITS A FREE GAME WHO CARES\n\nHelpful | 6", "PrettyPoisonNov 17 at 4:10 AM\nNever Forget!!\n\nThis was an excellent short movie of what we went through. For people to say move on and forget this are crazy. This still exists today and Ill make sure my children know and never forget whats still going on. This was very real and very informative. Please make more. Ill alway purchase.\n\nHelpful | 18", "PolyImpact.3DNov 4 at 9:01 AM\nPrerequisite: Empathy\n\nTo be seated at the table, as people tell what it was like to endure the cruel biases of other human beings... To turn and look right at them as they talk about the loss of a child or the fear of simply traveling by car or by bus...\nIf after seeing this, you cant imagine what it must feel like to live your life that way, if you wont allow yourself to imagine what that would be like, then youre part of the problem.\n\nHelpful | 16", "Drako6187Jun 2 at 7:27 PM\nRace baiting\n\nThe county is divided enough.... but please lets be racist and do it some more. Please divide everyone more and more.\n\nHelpful | 54", "jdpruittMay 18 at 11:09 PM\nVictim mentality horse crap\n\nTamir Rice had a replica of a Colt M1911 handgun that had the orange cop warning on it removed. In the video in VR, it clearly shows him reaching for it. Anyone, of any race, who is reaching for what appears to be a deadly handgun (right after a police report of a person in the area carrying a gun) is at risk of being shot.\n\nIm sorry the kid died, Im sorry awful stuff happened in the past. Gheghis Khan was also awful. Humanity is an endless trail of bad stuff happening.\n\nBut lets move on and stop pretending everything in the world has to do with race. Most of these events happened before we were born. Why pick at old wounds that are trying to heal? A VR experience like this is not helpful ... at all. I felt the worst for the kid in the diner listening to the stories being told by the older guy. Imagine receiving that message over and over again, that you are involved in some kind of struggle against oppressive forces. What a horrible frame to go through life with in a land full of opportunities.\n\nHelpful | 109", "stlredbird97Feb 29 at 6:11 PM\nGreat documentary experience\n\nI wasnt going to write a review, even though both my wife and i thought this was great. But then i saw all the racist reviews so i felt i had to put my 5 stars in.\n\nHelpful | 7", "wolverinealumDec 6 at 2:30 PM\nTRY TO NOT BE FRAGILE AND TRIGGERED\n\nOf course there are a couple of fragile yt guys who are offended and triggered that theres a VR experience that provides a view into the experiences of people unlike them. Ignore their trash and undeserved, unearned privilege and educate yourselves.\n\nHelpful | 19", "teddelerSep 15, 2019 at 9:51 AM\nAwesome looking VR documentary\n\nThis is what VR documentaries should look like! It is great watching as VR develops in both story telling and documentary work. Felix and Paul have done some amazing stuff. The images are sharp, the fading from one scene to another done very well, the mirror work was very creative. Realizing that while I was sitting in the modern cafe the historical cafe was in the mirror 'reflection' was an awesome moment. Having the narrators talking to someone else works better (IMO) than having them look at the viewer (as has been done in other VR documentaries). It makes you feel more like a 'fly on the wall' and free to look around and take in the details without feeling rude. I hope we have many more VR documentaries of this quality to look forward to in the future.\n\nI took one star off because I disagree with the premise of the documentary. It implies things are just as bad for the black community now as it was when the traveling handbook was published. We have made great progress in the last half century. Statistics show that given a dangerous situation or environment police are just as likely to shoot a white person as a black person. But we perceive things through the lens of our experience and history as it is taught to us. When it happens to a black person racism is assumed but our problems are different now than they were fifty years ago. I hope we have the wisdom and patience to forgive our past and move forward.\n\nHelpful | 19", "crazymurdock77Oct 6 at 1:01 PM\nAwesome\n\nIt's sad but still true. I'm white but know, as a gay man I still have to check my holiday destinations in order to make sure the people there won't want to kill me.\n2019, and still only white heterosexual people can feel safe everywhere??\nI've seen the downvotes, saying this is dragging up problems that have gone away. That is not true. There is still discrimination and hatred. More now than a decade ago. Great experience. Enjoyed isnt the right word, but this is something everyone should watch.\n\nHelpful | 25", "Lambo-BenSep 14, 2019 at 3:53 AM\nWell produced\n\nA 20 minute story about the struggles black people had to face in the early 20s . For a video stream/download app I was pleasantly surprised at how smooth and engaging the visuals were. Great transitions and well produced. The only thing that I personally didnt like was how it goes on to say that that black people are still treated unfairly in modern times which, although there are cases of racism, I thought is not a good thing to be saying. If people keep blaming their skin colour for all their problems in life they will never have time to reflect on themselves and see how they can improve. Anyway that is just my opinion what really matters is the fact that I found the experience very interesting And would recommend anyone reading this to give it a watch. Well done to the producers for the great quality.\n\nHelpful | 37", "darkvertexSep 13, 2019 at 10:59 AM\nSuperb!\n\nHandling the topic of race can be a heavy subject to cover but this experience really puts you in the shoes to see things from that particular perspective. I found the direction and editing tasteful and in benefit of the story. Felix & Paul knocks it out of the park again! This deserves the Emmy it's nominated for.\n\nHelpful | 146", "carlostm67Sep 14, 2019 at 9:16 AM\nKnowing the past, improves the future.\n\nFantastic historical insight! \"Those who cannot remember the past are condemned to repeat it.\" And as we see by recent social media postings, racial bias and fear of blacks has never ceased...it's just less universally overt.\n\nHelpful | 72", "mcwhorterbryanSep 28, 2019 at 2:15 AM\n\nA must-see. This is a documentary that reveals a problem in America that is still very prevalent today. I am a 61-year-old white man. I have never been the target of racism, but I have seen it many times throughout my life. It is so common, those that dont see it, are simply ignoring it. This issue affects all of us. Either you are taking a stand against the injustice of racism or you are condoning it through indifference.\n\nThe comments here on this documentary are evidence of how alive racism is and what a hot topic it is. You can find plenty of current documentaries and studies verifying the issue of racism in America.\n\nAt least here, you can tell who the racists are, they give this documentary just one star.\n\n'Truly I tell you, whatever you did for one of the least of these brothers of Mine, you did for Me.'  Mathew 25:45\n\nHelpful | 115", "swaggoner21Sep 14, 2019 at 7:47 AM\nBest 3D Camera Work Ive Seen\n\nIve never really enjoyed any 3DoF 360 video experiences in vr before Traveling While Black . Theyve been too pixelated and frankly ugly. Much of the time, they are actually difficult for me to watch. Until this experience, I thought it should be abandoned as a concept.\n\nWithin the first couple minutes, my gaping my mouth ate my former opinions about the impact a couple 360 cameras can create. From a mere practical perspective, the lighting makes many things possible and even enjoyable to look at extensively.\n\nFrom an emotional standpoint, the creators transported me into the past, across the country, and back again. I felt connected and welcome with all of the people I sat next to and learned from. And in some particular shots, they take dream-like elements and make them feel real rather than stunts trying to spice up the camera work.\n\nI went with five stars because I want all the other owners to try this free experience too. I dont really feel the story ended strongly, and I didnt feel that they werent saying anything particularly new that wasnt already a part of our cultures conscience. A little hope could have been helpful, but the hope was communicated through how close they brought you to the experienced and suffering people in the story. And Im grateful for that.\n\nHelpful | 39", "SloppySeconds8PDec 11 at 9:30 AM\nGreat\n\nI was pleasantly surprised by this experience, its worth checking out.\n\nHelpful | 1", "Ng3HuiDec 1 at 4:47 AM\nEye opener\n\nPart of U.S history that is interesting and seldom brought up in mainstream media.\n\nHelpful | 4", "MacPhyleOct 14 at 2:54 AM\nExcellent.\n\nAn excellent look at what life was and still is like for people of color. This is not entertainment but an education that everyone should have.\n\nHelpful | 8", "MR.KING.KJan 22 at 9:36 AM\nNothing more\n\n\n\nHelpful | 47", "h.r.gargiSep 13, 2019 at 11:23 PM\nWords cannot express my feelings\n\nI only can say: everyone on this planet must see this and it is more then time to stop racism. Great work you did! Edit because of some negative comments: I did not hold the film as a statement against the USA. It is more a warning because of today's development. Building walls between cultures in real and in the head of people. We in Germany teared down a wall after cruel years of racism in WW2. But people are starting to forget seeing elected parties here in Europe the last years. It is uprising racism again - a nightmare returning to us - and such kind of movies are saying it is not over. And not talking about is a wrong solution. We have to shout loud to prevent rasicm!\n\nHelpful | 213", "roulitopOct 1 at 4:37 PM\nBeautiful and tragic\n\nDespite the tragic of this testimony, this makes me really enthusiastic about the future of story telling in VR. Thanks to Felix and paul. The fact that they used ultra slow motion in the scenes is something really smart and I really think that we must experience more stuff like this in VR. The 360 video shootings are so well produced. First time a 360 video gives me such feeling of presence. There are so many subjects we could treat this way...I wish more developers would follow that path between observation and sensitivity instead of shooting games and all those games that are missing the point...but still, it gives me hope for the rest of the journey.\n\nHelpful | 14", "JoeCalarcoOct 26 at 7:18 PM\nExcellent. Educational.\n\nOnly slight negative is the video portions are a little tough for motion sickness peeps. Dont listen to the loathsomely ignorant chuds giving this one star because it hurts their wee feelings.\n\nHelpful | 9", "hargisssSep 17, 2019 at 12:56 PM\nPowerful and Innovative\n\nOften I wander around my town enjoying the outdoors, and I feel a sense of security as I do so. In all likelihood, I'm not as safe as I think, but the point is I can take the risk of feeling safe. I don't need constant vigilance.\n\nMany, perhaps most people in the country don't dare feel that sense of security and safety - particularly if they are not a white man like myself. I understand this fact intellectually, but can sometimes feel a little distant from it. Now that I've (virtually) sat across from Tamir Rice's mother at a restaurant, the unthinkable risks which many Americans are forced to keep in mind feel closer to home.\n\nDid I mention it's beautiful? Often the camera is very slowly moving, giving the film a sense of depth and motion. The directors were industrious, even shooting period recreations of various locations. I loved how the film used reflections as a window into the past. Brillant! If you want to make VR content, TWB is a must-see.\n\nHelpful | 20", "HalocraftSep 27, 2019 at 9:52 AM\nReally\n\nIts another political film thats trys to guilt trip you. Yes some parts are good like one of the interview you can see a bus back on the wall which was good. But the shooting part, I feel bad for the mother but if you look up the shooting the kid had an air soft gun and was pointing it at people police came and the kid pointed the gun at the police and the police shot the kid. Its sad but if you look from the police prospective its justified. Its ok. If you want a good interactive movie check out notes on blindness.\n\nHelpful | 63", "Brittato_Nov 18 at 6:23 AM\nThe low reviews speak volumes.\n\nYou have no right to complain about an issue that hasnt affected you or your family in any way, shape or form. This is informative, and necessary to teach and warn those about ignorant people like you. Which is exactly what you are proving. With that being said, this documentary is a great way to weed out the racism and hatred that still exists in our country. And it most certainly looks to be doing its job. 5/5 stars!\n\nHelpful | 6", "kiwisoupDec 22 at 6:32 PM\nSnowflake reviewers.\n\nIt's amazing how many white people are triggered by a game that teaches important history and basically say to forget about it and get over it in a much more passive-agressive way. There's a saying about those that forget history... Seems these days privileged people are offended by everything that puts anything but a positive spotlight on themselves, quick to call anything else political pandering. I'm wondering how many of them downloaded it just to leave a bad review without even playing it?\n\nHelpful | 6", "spicyjalapeno-Sep 21, 2019 at 8:36 AM\nMust see\n\nMy words cannot express how deeply moving this experience is. If it does not move you to tears I dont know what to say. Sitting at the table at Bens Chili Bowl in DC you witness testimony past and present drawing a direct line from the life threatening experiences Black Americans face moving around the country and just being in public. As is stated, there is no Green Book today but Black youth carry one around in their heads because they have to. This production is one example that sets the VR experience apart from other visual media, to be placed in the middle of such an intense exchange and sharing of stories, so affecting.\n\nHelpful | 15", "WonderDingoSep 25, 2019 at 9:56 PM\nPowerful and enthralling\n\nLooked in the reviews to see a bunch of right-wing snowflakes and NPCs complaining that racism exists. Guess what guys, it still exists, and this documentary provides an excellent glimpse into how, if you're willing to pull your head out of the sand for five seconds to actually watch it. Anyways, for people who aren't dullards, this is an excellently produced doc that has very clever implementation of 360 degree video. It's only 20 minutes, so watch it while you cool down from Beat Saber.\n\nHelpful | 17", "ArtsaberSep 19, 2019 at 3:05 PM\nHQ & Free / 1 Star Racist's Reviews\n\nNice to see the racists 1 starring this app validating the precise need for it's existence. It doesn't surprise me that the Quest community is stuffed full of people who verify through their own public racist outting that they have garbage parents. Some even suggest that pretending an issue does not exist will make it not exist. Akin to ignoring cancer would cure cancer, you'd just wake up healthy one day. Or that we had a black dude as president before, so all racism magically disappeared when he was sworn in office. People actually support racism because they are comfortable with being racist or around racists.\n\nSome random quotes to think on:\nPrivilege is when you think something is not a problem because it's not a problem to you personally.\nWhen you are accustomed to privilege, Equality feels like oppression.\nIf you are comfortable with my oppression, then you are my oppressor.\n\nHigh quality production value and educational with a low cost of free. So, truth be told, it's highly likely that only a racist would 1 Star this app. Scroll through the comments to see them on display, it's like a racist zoo. Truth can be uncomfortable or offensive, especially to those who wallow in lies.\n\nHelpful | 27", "AlnilamAlnitakOct 31 at 1:20 PM\nPretty good\n\nOkay, but yes, people have to forget the past and make sure this never happens again. Not anywhere in the world !!!\n\nHelpful | 2", "Black_NapalmJan 24 at 2:50 PM\nDO NOT WANT\n\nPeople play VR specifically to get AWAY from politics!\n\nWe do not need it or want it in our apps!\n\n-5 Stars     \n\nHelpful | 110", "KingclearyDec 31 at 11:05 PM\nBruh I thout this was a game\n\nDude are you kidding me I thout this was a game idk why I barely watched the preview Im so mad\n\nHelpful | 32", "nicolas.munoz.7359Oct 6 at 1:49 PM\nNausea\n\nI guess it has decent content, but it's basically just a bunch of 360. No special experience and I got extremely nauseated after 5 minutes in this.\n\nHelpful | 13", "ezimoOct 6 at 2:25 PM\nAmazed\n\nA real eye opener in terms of what the quest is capable of achieving. For me this was the first time I could really appreciate the effort and quality of what virtual reality should be like. I have played heaps of VR content on my PSVR Pro, but apart from Moss, nothing compares to this experience so far. Well done thank you.\n\nHelpful | 5", "chaoswhistlerSep 21, 2019 at 10:05 AM\nBoring\n\nI watched 15 minutes if this waiting for it to become interesting. It's just a documentary, and not a very good one.\n\nHelpful | 23", "SoulinaNov 22 at 2:44 PM\nBlack History is American History\n\nTheres only one group of people in this country that are constantly being told to let it go, or move on from history. Everyone else is encouraged to \"Never forget\". Well if people of color could forget they would but they are constantly being reminded by banks and real estate agents and employers and yes the police in certain areas TODAY. The civil rights movement was within our parents lifetimes. The kid getting shot was a fee years ago. This video is just an educational tool, to show people who wouldnt understand what it was and sometimes IS like for the other half. Just watch it and take away what you can. It may not be about you. But you can learn something from it.\n\nHelpful | 7", "anomannymousSep 20, 2019 at 4:11 AM\nAll these yt boys TRIGGERED by reality.\n\nJust because racism isnt happening to you or anyone immediately around you doesnt mean its not happening to millions of black Americans. Stop making everything about you - as usual. Yall are so privileged and entitled, its disgusting. Imagine being so fragile and delicate that you feel like to have to downvote and post negative reviews about an educational VR video game on the history of race and the African-American experience. Imagine being so entitled that you feel like you have to contribute your opinion on an issue you have no lived experience in. Just shut up and go back to your mothers basement.\n\nHelpful | 61", "shane.chandler71Sep 15, 2019 at 7:26 PM\nWalk a mile in someone elses shoes\n\nAmazing. Must watch for everyone. Understanding is just a part of the journey.\n\nHelpful | 13", "Dragonvang87Oct 1 at 3:49 AM\nWaste of time\n\nBoring and a waste of time I regret watching it. The world has moved on from those day seriously. Forget the past and start focusing on making the future better.\n\nHelpful | 106", "PublicDragoniteOct 6 at 9:49 AM\nAlright for What it Is\n\nWill probably use in my classroom during Black History Month, but thats about it. Cant complain too much because its free.\n\nHelpful | 2", "pimlotbSep 19, 2019 at 11:18 AM\nPowerful\n\nVery moving, so sad to see not much has changed.\n\nHelpful | 10", "Woo2019Oct 24 at 4:47 AM\nAmazing!!!\n\nGlad this was made for the Oculus. It gives people that perspective\n\nHelpful | 3", "SneakyCactusOct 10 at 7:42 AM\nI agree with the 1-3 star reviewers\n\nThis is informative but it's dividing. Anything above 3 stars are from guilty white people. And they shouldn't have to be guilty. Most of those white people weren't alive during those times.\n\nHelpful | 103", "Yah_Yeet2713Oct 9 at 6:56 PM\nWow..\n\nThis game is very racist and that is all. I dont see what the developers got out of making this game. People get very offended by this type of stuff. I dont respect this and Im sure other people dont either. Dont recommend this game at all.\n\nHelpful | 96", "brasiliansoxfanSep 14, 2019 at 10:20 PM\nInexcusable comment section\n\nEssential viewing, proves that VR can do more than just provide video game entertainment for smelly, overweight neck beardy white dudes who only care about themselves\n\nHelpful | 28", "KingFukiNov 2 at 2:31 PM\npropaganda\n\nTwo things i dislike seeing on the oculus quest : asking me a facebook account and propaganda of this sort .\n\nHelpful | 78", "relentlessoneNov 2 at 6:44 PM\nOutstanding VR Narrative\n\nThis really opened my eyes to a way of experiencing a powerful and painful history. Very well done and its something that will make some people very uncomfortable about their views on relations in the US. Would very much like to see more of these types of stories both about black experiences and other cultures.\n\nHelpful | 5", "ASamLoomisGuyNov 10 at 9:04 PM\nVictim Mentality is Loser Mentality\n\nThis film categorizes people based on race and pushes a slanted, antiquated narrative. I'm willing to bet that most of the 5 star reviews came from college liberals who watched this film for extra credit. Shamefully, that extra credit means nothing because \"gender studies\" will land you a salary equal to a manager at Taco Bell. This isn't even an app. It is a film. It doesn't belong here. Free is way too expensive for this garbage.\n\nHelpful | 72", "kinsarc0Oct 9 at 7:18 AM\nAbsolutely Beautiful and Informative\n\nMan, theres a lot of hate and open racism in these reviews. If you dont think racism and the systematic oppression of black people is still going on in America, you really need to take a look in the mirror and make sure your eyes arent sewn shut. This is a beautiful and informative piece of VR storytelling and deserving of the praise it has received.\n\nHelpful | 8", "KingMb22Sep 25, 2019 at 11:31 AM\nAmazing\n\nThis was very informative and important.\n\nHelpful | 8", "DjMrLee94Sep 25, 2019 at 5:45 PM\nYour racism is showing\n\nGoing thru these comments it's always interesting how people who haven't been thru it want to tell people to \"get over it\"\nSo allow me to clear this up... the foundation of this nation was build on the backs of free labor, that was followed by segregation, then mass incarceration, then the lie of being in a \"post racial society\"... The fact is some the country reaps the benefits of slavery, while others suffer from it, and that w followed by Jim crow, mass incarceration... Here's a current example... When heroin was running rampant thru the \"Ghettos\" it was crime... but now that the users have become white, it's an \"Opioid Epidemic\" and a \"public health emergency\" But here is the biggest truth... I AM NEVER ALLOWED TO FORGET I'M BLACK! No matter how much money I make, no matter how successful I am... Obama was President of the United States and they still called him a NI99ER!\n\nHelpful | 25", "jessie.ray.777Sep 19, 2019 at 1:38 PM\n\nNeither entertaining or educational, this app only serves to reopen wounds that are generations old and to divide Americans against Americans based on race\n\nHelpful | 135", "UntoldSlaughtaOct 5 at 9:58 PM\nOutstanding\n\nExcellent and informative with education comes enlightenment in what we have to endure great app especially with racial tensions rising due to political corruption and manipulation great app the world could use more things like this.\n\nHelpful | 6", "gOtHiCm3rCyDec 31 at 8:07 PM\nRidiculous\n\nSlavery in the US was horrible.... slavery in any form is horrible. However, still basically saying a type of person isnt \"free\" in the USA today, is ridiculous, and everything wrong with media in 2019. This is political correctness gone mad.\nLike Morgan Freeman states, the only way to get past all this is STOP TALKING ABOUT IT\n\nHelpful | 36", "NatureHootSep 14, 2019 at 12:58 PM\nMust download\n\nIt's funny that white people in the comments would leave you to believe racism doesnt exist anymore or that minorities are specifically targeted for being black or being persecuted for the color of their skin. It's easy to ignore it when you dont have to worry about driving, walking or living while being white.\n\nDownload it and experience it for yourself\n\nHelpful | 23", "tatsu123Sep 22, 2019 at 5:04 PM\nThe reviews reveal something\n\nYes, lets complain about THIS being divisive, but the Diary of Ann Frank has 93% user reviews. I see through most of yall.\n\nHelpful | 17", "dwrathallSep 18, 2019 at 1:12 PM\nInforms through empathy\n\nThis documentary is an excellent resource for all Americans. Even those who are rating this app poorly due to prejudice or ignorance\n\nHelpful | 17", "StormyPinknessSep 13, 2019 at 6:00 PM\nI get why some reviewers can't handle it\n\nTwitter and youtube have shown me this kind of stuff, this was way different. It hasn't gone away.\n\nHelpful | 28", "eric.reid.9421Sep 15, 2019 at 10:10 AM\nAnthony\n\nThese type of things still happen all over the country every day. You wouldn't see it unless you were riding with a black man while he was driving within the boundaries of the law.\n\nHelpful | 14", "DiameroOct 26 at 9:40 PM\nRacist content\n\nRacist stuff like this should not be on VR especially exposed to children God forbid. This has been going for so long... JUST STOP.\n\nHelpful | 59", "devinbrosephSep 17, 2019 at 12:12 PM\nRacist itself and counterintuitive\n\nBy making an entire VR experience youre furthering the wedge between races. The only way to truly get past racism is to just stop talking about race and skin color.\n\nHelpful | 156", "MisterSmoothFeb 16 at 10:41 PM\nYawn\n\nQuite boring and silly. Now, make one titled 'Travelling While Black in Backwoods 1940's Georgia' and I might be interested. Sh*t would get real... real fast.\n\nHelpful | 17", "LiberalsAreNutsSep 18, 2019 at 7:36 PM\nEncourages racism towards whites\n\nI went in expecting something controversial, but this was extremely inaccurate.\n\nVery disturbing that this is nominated for an Emmy as it is poorly made on top of all the racism.\n\nThis film kinda sucks, I wouldn't waste your time\n\nHelpful | 76", "SpookySpiritsSep 19, 2019 at 2:46 AM\nGreat way to keep racism alive...\n\n1 star for helping keep racism alive and giving modern black folks an undeserved sense of entitlement. In 2019 nobody cares about skin color unless they've got something to gain from it. Only behavior causes you to be treated differently. If you want to be treated equally... BEHAVE EQUALLY!\n\nHelpful | 88", "colezilla74Sep 17, 2019 at 12:03 PM\nWhat in the world??\n\nNothing like keeping the racist theme going in this world. Pot stirring uselessness. This is the quest not the go.\n\nHelpful | 66", "aaron.sommers.1253Sep 14, 2019 at 10:14 PM\nNot for me\n\n.\n\nHelpful | 65", "Gunner42Sep 15, 2019 at 3:23 PM\n\nLeave the race baiting to the politians and media I do not want it here.\n\nHelpful | 81", "XVinoRossoXSep 29, 2019 at 8:16 AM\nEvery race persecuted..\n\nThe only difference? The other ones stopped feeling sorry fir themselves.\n\nHelpful | 41", "tbhatnagar01Sep 16, 2019 at 4:34 AM\nGood\n\nNice App\n\nHelpful | 12", "donnyf68Sep 14, 2019 at 2:06 PM\nGarbage\n\nSeriously? This race-baiting garbage might work on the low IQ liberals, but not for the rest of Americans. Were sick of this.\n\nHelpful | 98", "cbrady2kSep 19, 2019 at 10:50 AM\nVery funny\n\nThe game has you start out in a stolen car. I LOLd!\n\nHelpful | 39", "God_hates_lagsSep 15, 2019 at 5:38 AM\nPropaganda\n\nAccording to FBI data, blacks are over represented among perpetrators of hate crimes by 50%, and whites are under represented among the actual perpetrators of hate crimes by 24%, so the narrative that youre trying to push is false.\n\nHelpful | 89", "lanoh89Sep 15, 2019 at 8:22 AM\nI am a white male!\n\nAs i am white and have a dong my opinion means nothing but for those who don't mind me being white, and having a dong, don't waste your time ;) it's only for the racists who like to clam everyone else is racist.\n\nHelpful | 68", "SugarDipSep 18, 2019 at 2:51 PM\nI hate being black\n\nThere is a not a lot of character customization, for example it forces me to be black, this game is also very racist making me sit in the back of the bus\nVery racist game, dont play it\n\nHelpful | 56", "ouweRammerSep 14, 2019 at 4:15 AM\nThis promotes rasism\n\nThere is only one way to overcome racism: Stop talking about it.\n- Morgan Freeman\n\nHelpful | 136", "TrevorkianSep 14, 2019 at 3:03 PM\nThanks for the free propaganda\n\nThis sjw crap makes me want to throw my oculus in the trash, not sure why you feel the need to push propaganda on us, i probably wont buy anything from you again now that i know youre a bunch of liberals trying to brainwash society. Btw since it seems like you're so concerned about what black people went through 60 years ago I assume that we're going to get a video about what black people are going through right now in Africa since they're killing each other by the Millions right.....\n\nHelpful | 102", "CovfefeMAGAOct 9 at 8:54 PM\nWorst, dumbest game ever. Complete trash\n\nWhenever is in charge of approving games for Oculus needs to seriously kill them selves.\n\nHelpful | 37", "VirgilColeSep 13, 2019 at 8:00 PM\nTime to let it go\n\nIm not surprised that all the 4-5 star reviews are from white people. Its as though they feel guilt for what happened decades ago. Weve elected a black man president, (twice) There are African Americans being elected to leadership roles all across the country. Everyone has the same chance to succeed today regardless of race. Its time to move on. This mockumentary is just another example of picking a scab. It will never heal if you dont let it.\n\nHelpful | 499", "lee.anthony.372Sep 13, 2019 at 12:02 PM\nNominated for an emmy?\n\nWhat happened in the states in the early 20th century was not right but by the end of this video you would think these sort of things were still going on. It only seeks to divide blacks and whites by stirring up hatred on both sides. Qoute by Morgan freeman. The only way we are going to get by race is by not talking about it.\n\nHelpful | 996"]