{"App Title": "Tribe XR: DJ in VR", "App description": "Become a VR DJ and mix your tracks in Tribe XR.\n\nTribe XR is a community for beginners looking to learn how to DJ and professionals looking for something fresh and fun. Feel the rush of performing and get lost in the joy of mixing. Immerse yourself the VR DJ community. \n\nAccess a near-perfect replica of the DJ equipment professionals use in clubs across the globe. Practice on your own or with a virtual instructor. Take weekly lessons, live on Discord with an experienced DJ. \n\n- Go through tutorials with our DJ Quickstart Guide\n- Upload your own tracks and learn how to mix\n- Invite your friends to start rocking the room\n- Perform epic, back-to-back sets with other Tribe users\n- Party with weekly events hosted by Altspace and Sansar\n\nJoin the conversation on Discord. https://discord.gg/tribexr", "Purchase section": "$29.99Add to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User, Co-op", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Educational, Music, Simulation", "Languages": "English", "Version + Release Notes": "0.08.9", "Developer": "Tribe XR Inc", "Publisher": "Tribe XR Inc", "Website": "https://www.tribexr.com/", "Release Date": "September 19, 2019", "Developer Privacy Policy": "HOME\n \nFEATURES\n \nDJ QUICKSTART\nWELCOME\nLOADING YOUR TRACKS\nCOUNTING BEATS\nTRANSITIONS\nRECORD A MIX\nMIX YOUR MUSIC\nEQS PART 1\nEQS PART 2\nHOT CUES\nBEAT MATCHING\nCUE, FX AND ENERGY\n \nFAQ\n \nTWITCH\n \nBLOG\n \nABOUT\n \nDISCORD\n Tribe XR Privacy Policy\t\nLAST UPDATED: SEPTEMBER 17,2019\n\nThis Privacy Policy explains our practices regarding the collection, use and disclosure of information that we receive through our services. This Privacy Policy does not apply to any third-party websites, services or applications, even if they are accessible through our services. Also, please note that, unless we define a term in this Privacy Policy, all capitalized terms used in this Privacy Policy have the same meanings as in our Terms of Service. So, please make sure that you have read and understand our Terms of Service.\n\n1. Revisions to this\tPrivacy Policy\n\nAny information that is collected via our Services is covered by the Privacy Policy in effect at the time such information is collected. We may revise this Privacy Policy from time to time. If we make any material changes to this Privacy Policy, well notify you of those changes by posting them on the Services or by sending you an email or other notification, and well update the Last Updated Date above to indicate when those changes will become effective.\n\n2. Information\tCollected or Received from You\n\na. Account Information     \n\nIf you create an Account, well collect certain information that can be used to identify you, such as your name, phone number, email address, and postal address (if you choose to provide one) (PII). If you create an Account using your login credentials from one of your social networking accounts like Facebook, Twitter, etc. (each, an SNS Account), well be able to access and collect your name and email address and other PII that your privacy settings on your SNS Account permit us to access. If you create an Account through the Site or your SNS Account, we may also collect your gender, date of birth, zip code, age and other information that is not considered PII because it cannot be used by itself to identify you.\n\nb. Information You Voluntarily Provide\n\nYou control what information, including PII, you submit via the Services. We will collect all the information that you submit to the Services including, via email queries, online inquiries, trade show attendee cards, and in any other manner.     \n\nc. Information Collected Using Cookies and other Web Technologies\n\nLike many website owners and operators, we use automated data collection tools such as Cookies and Web Beacons to collect certain information. \n\nCookies are small text files that are placed on your device by a web server when you access our Services. We may use both session Cookies and persistent Cookies to identify that youve logged in to the Services and to tell us how and when you interact with our Services. We may also use Cookies to monitor aggregate usage and web traffic routing on our Services and to customize and improve our Services. Unlike persistent Cookies, session Cookies are deleted when you log off from the Services and close your browser. Although most browsers automatically accept Cookies, you can change your browser options to stop automatically accepting Cookies or to prompt you before accepting Cookies. Please note, however, that if you dont accept Cookies, you may not be able to access all portions or features of the Services. Some third-party services providers that we engage (including third-party advertisers) may also place their own Cookies on your device. Note that this Privacy Policy covers only our use of Cookies and does not include use of Cookies by such third parties. 2 34166/00600/FW/9882028.2 \n\nWeb Beacons (also known as web bugs, pixel tags or clear GIFs) are tiny graphics with a unique identifier that may be included on our Services for several purposes, including to deliver or communicate with Cookies, to track and measure the performance of our Services, to monitor how many visitors view our Services, and to monitor the effectiveness of our advertising. Unlike Cookies, which are stored on the device, Web Beacons are typically embedded invisibly on web pages (or in an e-mail). \n\nLog Data means certain information about how a person uses our Services, including both Account holders and non-Account holders (either, a User). Log Data may include information such as a Users Internet Protocol (IP) address, browser type, operating system, the web page that a User was visiting before accessing our Services, the pages or features of our Services to which a User browsed and the time spent on those pages or features, search terms, the links on our Services that a User clicked on and other statistics. We use Log Data to administer the Services and we analyze (and may engage third parties to analyze) Log Data to improve, customize and enhance our Services by expanding their features and functionality and tailoring them to our Users needs and preferences. We may use a persons IP address to generate aggregate, non-identifying information about how our Services are used. We may also correlate your IP address with other information we collect about you. \n\nd. Financial Information    \n\nWe (or our third party payment processor) may collect your payment information such as credit card number, bank account number, expiration date, and billing address in order to charge you for any Subscription Fee and any other payments you owe us in connection with the Services. e. Information Sent by Your Device. We collect certain information that your device sends when you use our Services, like a device identifier, user settings and the operating system of your device, as well as information about your use of our Services. \n\nf. Location Information  \n\nWhen you use our Services, we may collect and store information about your location by converting your IP address into a rough geo-location.     \n\n3. Use of Information Collected \n\nOur primary goals in collecting information are to provide and improve our Services, to administer your use of the Services (including your Account, if you are an Account holder), and to enable you to enjoy and easily navigate our Services. We will use your PII to: \n\nProvide Services, administer your Account, communicate with you and provide customer support in relation to the Services; \n\nResolve disputes and troubleshoot problems; \n\nCustomize your experience and otherwise measure and improve our Services; \n\nSend you relevant emails and communications (including keeping you informed about our products, offerings, and any promotional offers) that might be of interest to you. If we use your personal information to market to you, you will be able to opt out of such uses as described below; \n\nEnforce our agreements, terms, conditions, and policies, and send you notices and alerts.   \n\n4. Information that We Share with Third Parties \n\nWe will not share any PII that we have collected from or regarding you except as described below: \n\na. Information Shared with Our Services Providers     \n\nWe may engage third-party services providers to work with us to administer and provide the Services. These third-party services providers have access to your PII only for the purpose of performing services on our behalf. We may share your PII and any necessary payment information, such as credit card number, expiration date and billing address, with our payment processing services providers in order to complete transactions that are initiated through the Services. If you dont want us to use your PII for these marketing purpose, you can opt out by contacting us at info@tribevr.io.    \n\nb. Information Shared with other Third Parties\n\nWe may share anonymized or aggregated data we collect from the use of the Services, such as de-identified demographic information, deidentified location information, information about the computer or device from which you access the Services, market trends and other analysis that we create based on the information we receive from you and other users.\n\nc. Information Shared with Web Analytics Services Providers   \n\nGoogle. We use Google Analytics, a service provided by Google, Inc. (Google), to gather information about how users engage with our Site and Services. For more information about Google Analytics, please visit www.google.com/policies/privacy/partners/. You can opt out of Googles collection and processing of data generated by your use of the Services by going to http://tools.google.com/dlpage/gaoptout. \n\nObserver Analytics. We use a service provided by Observer Analytics, Inc. (Observer) to provide us with analytics data regarding users interactions with our Site, VR Product and Services. You may opt-out of Observers automatic retention of data that is collected while using the Services by visiting https://support.observeranalytics.com/hc/en-us. \n\nFacebook. We may use certain tools offered by Facebook, Inc. (Facebook) that enable it to collect or receive information about actions users take on: (a) our Site and elsewhere on the internet through use of Cookies, Web Beacons and other storage technologies; or (b) our App and other mobile applications, in order to provide measurement services, targeted ads and other services. For more information regarding the collection and use of such information by Facebook, please see the Facebook Data Policy, available at: https://www.facebook.com/policy.php. \n\nOpt out of Ad Tracking. You can opt out of the collection and use of your information for ad targeting by going to http://www.aboutads.info/choices or http://www.youronlinechoices.eu/ to limit collection through the Site or by configuring the settings on your device to limit ad tracking through the Services.    \n\nd. Information Disclosed in Connection with Business Transactions     \n\nInformation that we collect from our users, including PII, is considered to be a business asset. Thus, if we are acquired by a third party as a result of a transaction such as a merger, acquisition or asset sale or if our assets are acquired by a third party in the event we go out of business or enter bankruptcy, some or all of our assets, including your PII, may be disclosed or transferred to a third party acquirer in connection with the transaction.     \n\ne. Information Disclosed for Our Protection and the Protection of Others\n\nWe cooperate with government and law enforcement officials or private parties to enforce and comply with the law. We may disclose any information about you to government or law enforcement officials or private parties as we, in our sole discretion, believe necessary or appropriate: (i) to respond to claims, legal process (including subpoenas); (ii) to protect our property, rights and safety and the property, rights and safety of a third party or the public in general; and (iii) to stop any activity that we consider illegal, unethical or legally actionable activity.    \n\n5. Your Choices\n\nWe offer you choices regarding the collection, use and sharing of your PII and well respect the choices you make. Please note that if you decide not to provide us with the PII that we request, you may not be able to access all of the features of the Services.    \n\na. Opt-Out     \n\nWe may periodically send you free e-mails and push notifications that directly promote our Services. We may also contact you to alert you to new features that weve added to our Services. When you receive such promotional communications from us, you will have the opportunity to opt-out (either through your Account or by following the unsubscribe instructions provided in the e-mail you receive). We do need to send you certain communications regarding the Services and your Account and you will not be able to opt out of those communications  e.g., communications regarding updates to our Terms of Service or this Privacy Policy, transactional notices, or information about billing.     \n\nb. Modifying Your Information    \n\nYou can access and modify the PII associated with your Account by editing it within your Account. If you want us to delete your PII and your Account, please contact us at info@tribexr.com with your request. Well take steps to delete your information as soon we can, but some information may remain in archived/backup copies for our records or as otherwise required by law.    \n\n6. Responding to Do Not Track Signals\n\nOur Site does not have the capability to respond to Do Not Track signals received from various web browsers.    \n\n7. The Security of Your Information\n\nWe take reasonable administrative, physical and electronic measures designed to protect the information that we collect from or about you (including your PII) from unauthorized access, use or disclosure. When you enter sensitive information on our forms, we encrypt this data using SSL or other technologies. Please be aware, however, that no method of transmitting information over the Internet or storing information is completely secure. Accordingly, we cannot guarantee the absolute security of any information.\n\n8. Links to Other Sites\n\nOur Services may contain links to websites and services that are owned or operated by third parties (each, a Third-party Service). Any information that you provide on or to a Third-party Service or that is collected by a Third-party Service is provided directly to the owner or operator of the Third-party Service and is subject to the owners or operators privacy policy. Were not responsible for the content, privacy or security practices and policies of any Third-party Service. To protect your information we recommend that you carefully review the privacy policies of all Third-party Services that you access.    \n\n9. International Transfer\n\nYour PII may be transferred to, and maintained on, computers located outside of your state, province, country or other governmental jurisdiction where the privacy laws may not be as protective as those in your jurisdiction. If youre located outside the United States and choose to provide your PII to us, we may transfer your PII to the United States and process it there.     \n\n10. Our Policy Toward Children\n\nOur Services are not directed to children under 13 and we do not knowingly collect PII from children under 13. If we learn that we have collected PII of a child under 13 we will take steps to delete such information from our files as soon as possible.    \n\n11. Your California Privacy Rights\n\nCalifornia residents may request and obtain from us, once a year, free of charge, a list of third parties, if any, to which we disclosed their PII for direct marketing purposes during the preceding calendar year and the categories of PII shared with those third parties. If you are a California resident and wish to obtain that information, please submit your request by sending us an email at info@tribevr.io with California Privacy Rights in the subject line or by writing to us at 500 3rd St, San Francisco, CA 94107, USA.     \n\n12. Questions? \n\nPlease contact us at info@tribexr.com if you have any questions about our Privacy Policy.\n\nFAQ            DJ Quickstart\n\nPRESS KIT\n \nCAREERS\n \nCONTACT\n \nPRIVACY POLICY\n \nTERMS OF SERVICE\n \nCOMMUNITY\n \nHIGHLIGHTS\nTRIBE XR INC, 500 3RD STREET, SAN FRANCISCO, CA, 94107, UNITED STATESINFO@TRIBEVR.IO", "Developer Terms of Service": "HOME\n \nFEATURES\n \nDJ QUICKSTART\nWELCOME\nLOADING YOUR TRACKS\nCOUNTING BEATS\nTRANSITIONS\nRECORD A MIX\nMIX YOUR MUSIC\nEQS PART 1\nEQS PART 2\nHOT CUES\nBEAT MATCHING\nCUE, FX AND ENERGY\n \nFAQ\n \nTWITCH\n \nBLOG\n \nABOUT\n \nDISCORD\n Tribe XR Terms of Service\t\nLAST UPDATED: FEBRUARY 24,2020\n\nEnd-User License Agreement (EULA) of Tribe XR DJ School\n\nThis End-User License Agreement (\"EULA\") is a legal agreement between you and Tribe XR Inc\n\nThis EULA agreement governs your acquisition and use of our Tribe XR DJ School software (\"Software\") directly from Tribe XR Inc or indirectly through a Tribe XR Inc authorized reseller or distributor (a \"Reseller\").\n\nPlease read this EULA agreement carefully before completing the installation process and using the Tribe XR DJ School software. It provides a license to use the Tribe XR DJ School software and contains warranty information and liability disclaimers.\n\nIf you register for a free trial of the Tribe XR DJ School software, this EULA agreement will also govern that trial. By clicking \"accept\" or installing and/or using the Tribe XR DJ School software, you are confirming your acceptance of the Software and agreeing to become bound by the terms of this EULA agreement.\n\nIf you are entering into this EULA agreement on behalf of a company or other legal entity, you represent that you have the authority to bind such entity and its affiliates to these terms and conditions. If you do not have such authority or if you do not agree with the terms and conditions of this EULA agreement, do not install or use the Software, and you must not accept this EULA agreement.\n\nThis EULA agreement shall apply only to the Software supplied by Tribe XR Inc herewith regardless of whether other software is referred to or described herein. The terms also apply to any Tribe XR Inc updates, supplements, Internet-based services, and support services for the Software, unless other terms accompany those items on delivery. If so, those terms apply. This EULA was created by EULA Template for Tribe XR DJ School.\n\nLicense Grant\n\nTribe XR Inc hereby grants you a personal, non-transferable, non-exclusive licence to use the Tribe XR DJ School software on your devices in accordance with the terms of this EULA agreement.\n\nYou are permitted to load the Tribe XR DJ School software (for example a PC, laptop, mobile or tablet) under your control. You are responsible for ensuring your device meets the minimum requirements of the Tribe XR DJ School software.\n\nYou are not permitted to:\n\nEdit, alter, modify, adapt, translate or otherwise change the whole or any part of the Software nor permit the whole or any part of the Software to be combined with or become incorporated in any other software, nor decompile, disassemble or reverse engineer the Software or attempt to do any such things\n\nReproduce, copy, distribute, resell or otherwise use the Software for any commercial purpose\n\nAllow any third party to use the Software on behalf of or for the benefit of any third party\n\nUse the Software in any way which breaches any applicable local, national or international law\n\nuse the Software for any purpose that Tribe XR Inc considers is a breach of this EULA agreement\n\nIntellectual Property and Ownership\n\nTribe XR Inc shall at all times retain ownership of the Software as originally downloaded by you and all subsequent downloads of the Software by you. The Software (and the copyright, and other intellectual property rights of whatever nature in the Software, including any modifications made thereto) are and shall remain the property of Tribe XR Inc.\n\nTribe XR Inc reserves the right to grant licences to use the Software to third parties.\n\nCopyright Policy\n\nWe respect the intellectual property of others and require that those who access and use our Services do the same. In connection with our Services, we have adopted and implemented a policy respecting copyright law that provides for the removal of any infringing materials and for the termination, in appropriate circumstances, of accounts who violate our terms or infringe on intellectual property rights, including copyrights.\n\nTribe is virtual reality software that allows users to play audio content and transmit the audio content to other Tribe users a multiplayer context. Tribe includes the ability for one user to transmit music to between 1 and 16 other users. In accordance with the Tribe copyright policy, you agree to follow all copyright protection laws and obtain licenses for your music. You agree that your use of the multiplayer music transmission features are for private performance use only, are for non-commercial use or are for educational use. You agree not copy or perform music beyond the extent of private use or private performance. If you use Tribe for public performance, you agree to obtain the necessary performance rights. You agree that you are responsible for the content that you transmit to another person. You agree to not perform certain tracks if you receive a takedown notice. Tribe reserves the right to block your ability to connect to other users or perform particular music. Tribe is not liable for any of the content transmitted.\n\nDIGITAL MILLENNIUM COPYRIGHT ACT (DMCA).\n\nIf you are a copyright holder and believe that content on the Services violates your rights, you may\n\nsend a DMCA takedown notice to our agent:\n\nRick Chapo\n\nDMCAAgentService.com\n\nP.O. Box 373\n\nPine Valley, California 91962\n\nPhone: (800) 804-7260\n\nEmail: complaint@dmcaagentservice.com\n\nFor more information, including the information that must be included in a DMCA takedown notice, see the text of the DMCA, 17 U.S.C.  512.\n\nOur Business Information:\n\nTribe XR Inc.\n\n5410 Wilshire Blvd\n\nLos Angeles, CA 90036\n\nTribe XR DJ School\n\nTribeXR.com\n\nGeneral Prohibitions\n\nYou agree that you will not contribute any User Content or otherwise use the Services in a manner that (i) infringes or violates the intellectual property rights or proprietary rights, rights of publicity or privacy, or other rights of any third party; (ii) violates any law, statute, ordinance or regulation; (iii) is harmful, fraudulent, deceptive, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, libelous, or otherwise objectionable; (iv) involves commercial activities and/or sales without Tribes prior written consent such as contests, sweepstakes, barter, advertising, or pyramid schemes; (v) impersonates any person or entity, including without limitation any employee or representative of Tribe; or (vi) contains a virus, trojan horse, worm, time bomb, or other harmful computer code, file, or program. Tribe reserves the right to remove any User Content from the Services at any time, for any reason (including, but not limited to, upon receipt of claims or allegations from third parties or authorities relating to such User Content or if Tribe is concerned that you may have breached the immediately preceding sentence), or for no reason at all. You, not Tribe, remain solely responsible for all User Content that you upload, post, email, transmit, or otherwise disseminate using, or in connection with, the Services, and you warrant that you possess all rights necessary to provide such content to Tribe and to grant Tribe the rights to use such information in connection with the Services and as otherwise provided herein.\n\nDispute Resolution\n\nApplicability of Arbitration Agreement. All claims and disputes (excluding claims for injunctive or other equitable relief as set forth below) in connection with the Terms or the use of any product or service provided by Tribe that cannot be resolved informally or in small claims court shall be resolved by binding arbitration on an individual basis under the terms of this Arbitration Agreement. Unless otherwise agreed, all arbitration proceedings will be held in English. This Arbitration Agreement applies to you and Tribe , and to any subsidiaries, affiliates, agents, employees, predecessors in interest, successors, and assigns, as well as all authorized or unauthorized users or beneficiaries of services or goods provided under the Terms.\n\nNotice Requirement and Informal Dispute Resolution. Before either party may seek arbitration, the party must first send to the other party a written Notice of Dispute (Notice) describing the nature and basis of the claim or dispute, and the requested relief. A Notice to Tribe should be sent to: 5410 Wilshire Blvd, Los Angeles, CA 90036. After the Notice is received, you and Tribe may attempt to resolve the claim or dispute informally. If you and Tribe do not resolve the claim or dispute within thirty (30) days after the Notice is received, either party may begin an arbitration proceeding. The amount of any settlement offer made by any party may not be disclosed to the arbitrator until after the arbitrator has determined the amount of the award, if any, to which either party is entitled.\n\nArbitration Rules. Arbitration shall be initiated through the Judicial Arbitration and Mediation Services, Inc. (JAMS), an established alternative dispute resolution provider (ADR Provider) that offers arbitration as set forth in this section. If JAMS is not available to arbitrate, the parties shall agree to select an alternative ADR Provider. The rules of the ADR Provider shall govern all aspects of the arbitration, including but not limited to the method of initiating and/or demanding arbitration, except to the extent such rules are in conflict with the Terms. The JAMS Streamlined Arbitration Rules governing the arbitration are available online at http://www.jamsadr.com/. The arbitration shall be conducted by a single, neutral arbitrator. Any claims or disputes where the total amount of the award sought is less than Ten Thousand U.S. Dollars (US $10,000.00) may be resolved through binding non-appearance-based arbitration, at the option of the party seeking relief. For claims or disputes where the total amount of the award sought is Ten Thousand U.S. Dollars (US $10,000.00) or more, the right to a hearing will be determined by the Arbitration Rules. Any hearing will be held in a location within 100 miles of your residence, unless you reside outside of the United States, and unless the parties agree otherwise. If you reside outside of the U.S., the arbitrator shall give the parties reasonable notice of the date, time and place of any oral hearings. Any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction. Each party shall bear its own costs (including attorneys fees) and disbursements arising out of the arbitration and shall pay an equal share of the fees and costs of the ADR Provider.\n\nAdditional Rules for Non-Appearance Based Arbitration. If non-appearance based arbitration is elected, the arbitration shall be conducted by telephone, online and/or based solely on written submissions; the specific manner shall be chosen by the party initiating the arbitration. The arbitration shall not involve any personal appearance by the parties or witnesses unless otherwise agreed by the parties.\n\nTime Limits. If you or Tribe pursue arbitration, the arbitration action must be initiated and/or demanded within the statute of limitations (i.e., the legal deadline for filing a claim) and within any deadline imposed under the JAMS Rules for the pertinent claim.\n\nAuthority of Arbitrator. If arbitration is initiated, the arbitrator will decide the rights and liabilities, if any, of you and Tribe, and the dispute will not be consolidated with any other matters or joined with any other cases or parties. The arbitrator shall have the authority to grant motions dispositive of all or part of any claim (including any claim regarding the enforceability of this Arbitration Agreement or any unconscionability in connection with these Terms). The arbitrator shall have the authority to award monetary damages, and to grant any non-monetary remedy or relief available to an individual under applicable law, the JAMS Rules, and the Terms. The arbitrator shall issue a written award and statement of decision describing the essential findings and conclusions on which the award is based, including the calculation of any damages awarded. The arbitrator has the same authority to award relief on an individual basis that a judge in a court of law would have. The award of the arbitrator is final and binding upon you and Tribe.\n\nWaiver of Jury Trial. THE PARTIES HEREBY WAIVE THEIR CONSTITUTIONAL AND STATUTORY RIGHTS TO GO TO COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR A JURY, instead electing that all claims and disputes shall be resolved by arbitration under this Arbitration Agreement. Arbitration procedures are typically more limited, more efficient and less costly than rules applicable in a court and are subject to very limited review by a court. In the event any litigation should arise between you and Tribe in any state or federal court in a suit to vacate or enforce an arbitration award or otherwise, YOU AND THE TRIBE WAIVE ALL RIGHTS TO A JURY TRIAL, instead electing that the dispute be resolved by a judge.\n\nWaiver of Class or Consolidated Actions. ALL CLAIMS AND DISPUTES WITHIN THE SCOPE OF THIS ARBITRATION AGREEMENT MUST BE ARBITRATED OR LITIGATED ON AN INDIVIDUAL BASIS AND NOT ON A CLASS BASIS, AND CLAIMS OF MORE THAN ONE CUSTOMER OR USER CANNOT BE ARBITRATED OR LITIGATED JOINTLY OR CONSOLIDATED WITH THOSE OF ANY OTHER CUSTOMER OR USER.\n\nConfidentiality. All aspects of the arbitration proceeding, including but not limited to the award of the arbitrator and compliance therewith, shall be strictly confidential. The parties agree to maintain confidentiality unless otherwise required by law. This paragraph shall not prevent a party from submitting to a court of law any information necessary to enforce this Agreement, to enforce an arbitration award, or to seek injunctive or equitable relief.\n\nSeverability. If any part or parts of this Arbitration Agreement are found under the law to be invalid or unenforceable by a court of competent jurisdiction, then such specific part or parts shall be of no force and effect and shall be severed and the remainder of the Agreement shall continue in full force and effect.\n\nRight to Waive. Any or all of the rights and limitations set forth in this Arbitration Agreement may be waived by the party against whom the claim is asserted. Such waiver shall not waive or affect any other portion of this Arbitration Agreement.\n\nTermination\n\nThis EULA agreement is effective from the date you first use the Software and shall continue until terminated. You may terminate it at any time upon written notice to Tribe XR Inc.\n\nIt will also terminate immediately if you fail to comply with any term of this EULA agreement. Upon such termination, the licenses granted by this EULA agreement will immediately terminate and you agree to stop all access and use of the Software. The provisions that by their nature continue and survive will survive any termination of this EULA agreement.\n\nGoverning Law\n\nThis EULA agreement, and any dispute arising out of or in connection with this EULA agreement, shall be governed by and construed in accordance with the laws of California.\n\nDISCLAIMERS\n\nYOU EXPRESSLY UNDERSTAND AND AGREE THAT TO THE EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN AS-IS AND AS AVAILABLE BASIS, AND COMPANY (AND OUR SUPPLIERS) EXPRESSLY DISCLAIM ANY AND ALL WARRANTIES AND CONDITIONS OF ANY KIND, WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING ALL WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, QUIET ENJOYMENT, ACCURACY, OR NON-INFRINGEMENT. WE (AND OUR SUPPLIERS) MAKE NO WARRANTY THAT: (1) THE SERVICES WILL MEET YOUR REQUIREMENTS; (2) YOUR USE OF THE SERVICES WILL BE UNINTERRUPTED, TIMELY, SECURE OR ERROR-FREE; OR (3) THE RESULTS THAT MAY BE OBTAINED FROM USE OF SERVICES WILL BE ACCURATE OR RELIABLE. Except as set forth in Section 9 below, Company will have no liability with respect to any injury, property damage, or death that arises from any activities in connection with your use of the Services, or any advice, information or recommendation contained thereon.\n\nLIMITATION ON LIABILITY\n\nYOU UNDERSTAND AND AGREE THAT IN NO EVENT WILL THE COMPANY BE LIABLE FOR ANY LOSS OF PROFITS,REVENUE OR DATA, INDIRECT, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR IN CONNECTION WITH THE SERVICES, OR DAMAGES OR COSTS DUE TO LOSS OF PRODUCTION OR USE, BUSINESS INTERRUPTION, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, WHETHER OR NOT COMPANY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, ARISING OUT OF OR IN CONNECTION WITH THESE TERMS OR THE SERVICES, ON ANY THEORY OF LIABILITY, WHETHER BASED ON WARRANTY, COPYRIGHT, CONTRACT, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR ANY OTHER LEGAL THEORY. OUR LIABILITY TO YOU FOR ANY DAMAGES ARISING FROM OR RELATED TO THIS AGREEMENT (FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE FORM OF THE ACTION), WILL AT ALL TIMES BE LIMITED TO THE GREATER OF (A) THE FEES, IF ANY, PAID BY YOU TO COMPANY UNDER\n\nTHIS AGREEMENT IN THE SIX (6) MONTHS IMMEDIATELY PRECEDING THE EVENT FIRST GIVING RISE TO THE CLAIM, (B) FIFTY US DOLLARS (U.S. $50), AND (C) THE REMEDY OR PENALTY IMPOSED BY THE STATUTE UNDER WHICH SUCH CLAIM ARISES. THE EXISTENCE OF MORE THAN ONE CLAIM WILL NOT ENLARGE THIS LIMIT. YOU AGREE THAT OUR SUPPLIERS WILL HAVE NO LIABILITY OF ANY KIND ARISING FROM OR RELATING TO THIS AGREEMENT. THE FOREGOING LIMITATIONS ON LIABILITY WILL NOT APPLY TO LIABILITY OF COMPANY FOR (A) DEATH OR PERSONAL INJURY CAUSED BY ITS NEGLIGENCE; FOR (B) ANY INJURY CAUSED BY ITS FRAUD OR FRAUDULENT MISREPRESENTATION; OR (C) ANY OTHER LIABILITY THAT\n\nCANNOT BE EXCLUDED OR LIMITED BY ENGLISH OR EU LAW. THE LIMITATIONS OF DAMAGES SET FORTH ABOVE ARE FUNDAMENTAL ELEMENTS OF THE BASIS OF THE BARGAIN BETWEEN COMPANY AND YOU.\n\nFAQ            DJ Quickstart\n\nPRESS KIT\n \nCAREERS\n \nCONTACT\n \nPRIVACY POLICY\n \nTERMS OF SERVICE\n \nCOMMUNITY\n \nHIGHLIGHTS\nTRIBE XR INC, 500 3RD STREET, SAN FRANCISCO, CA, 94107, UNITED STATESINFO@TRIBEVR.IO", "Space Required": "432.1 MB"}



["5 stars\n75%\n4 stars\n11%\n3 stars\n6%\n2 stars\n2%\n1 star\n6%", "Red_Ronin18 days ago\nLast night a DJ saved my life\n\n*Review by a guy with zero DJ experience*\n\nWas looking for a VR \"experience\" away from gaming. Love getting my groove on to great tunes, but have never been behind the decks, and this looked intriguing. Wasn't sure what to expect, but was encouraged by the positive reviews and the fact the Devs are so hands-on and responsive - always a great sign.\n\nAll I can say is, this is PHENOMENAL and has quickly become one of my favourite VR experiences. In addition to a brilliantly crafted DJ decks experience, The Tribe is one of the most supportive communities I've ever been in. You are initially set up with DJ \"missions\" (video tutorials) that take you through the basics, and these are posted on Discord, where they are assessed / given constructive feedback by a professional DJ. In addition, DJ Ozan also runs weekly \"hands on\" sessions where players can join the room and learn new skills \"in person\".\n\nThe roadmap of new upcoming features looks incredible - looking forward developing my skills and seeing where the Devs take this.\n\nHighly recommended.\n\nHelpful | 5\nDeveloper Response7 days ago\n\nSo awesome to hear this Red_Ronin, glad you're having fun in Tribe!", "robokendallJun 7 at 2:23 PM\nSave 2750.00 with this app.\n\nAs a DJ for over 15 years in clubs and bars, I was intrigued and also skeptical about the functionality and premise of this app. Well after only a day, all I can say is WOW and thanks to the guys at Tribe, especially Ozan.\n\nBefore I bought this app, I had a few questions and decided to contact them through Discord. Ozan responded straight away and answered all my questions. The support and community surrounding this game is awesome and everyone gets welcomed when joining on Discord, which is a nice touch.\n\nAs for the app itself, it's the next best thing to actually owning a set of CDJ's and I'm glad I bought this app instead of forking out hundreds on a sub par controller. All the features anyone needs are all there. You can map your tracks on Rekordbox of transfer all your tracks and maps of your tunes straight to your headset. The CDJs and mixer feel as natural as possible considering its all VR and is only going to get better as the technology progresses. My mixing style is full of cutting and chopping which requires fast hand movements and this is still possible using this app.\n\nIf you're considering learning to DJ, honestly don't hesitate to buy this. If it can satisfy my needs, then I'm sure it will satisfy any DJ of all abilities. 5*+++\n\nHelpful | 89\nDeveloper ResponseJun 9 at 9:16 PM\n\nThis is awesome to hear robokendall. Super encouraging. Thanks for the shout-out to the community. That's what it's all about for us. We'll also keep improving the interaction to support cutting and chopping and eventually scratching. You da best, robokendall. -Ozan", "franklinsoundsJun 28 at 1:55 PM\nAmazingly accurate! Although a missed op\n\nI absolutely love this app. As a dj this is really second to none. I had to get rid of my dj equipment due to space but this allows me to spin tunes anywhere in the world.\n\nA missed opportunity though.. why can't you play to a crown full of people?!?! I feel this would take the app to the next level, it always a bit dull djing in a quiet room why not use vr to the full and allow people to play in different clubs all over the world. That would be amazing.\n\nImagine setting the scene as Glastonbury pyramid stage to 100 thousand people as the sun sets, or burning man... THATS what VR is all about.\n\nGuys hit me up, I'm a digital producer and an avid VR fan. Would love to help make this a reality.\n\nHelpful | 21\nDeveloper ResponseJul 1 at 5:42 PM\n\nHey Franklinsounds! It's great to hear that we restored your access to the DJ kit. I hear you about playing to crowds. That's our ultimate vision also. We just need to get there. We're starting with building the best equipment possible and then layering in the social features. DM me (ozan) on Discord and we can Pow Wow more about the road map. Cheers homie. https://discord.gg/tribexr.", "jeshajah.israel13 days ago\nThis is too Futuristic !\n\nI really gotta give it up to those who created Tribe! It can help with being able to mix wherever you want with your own music library!! Rekordbox also included  perfect!!\n\nIt can analyze all your tracks just like if your mixing on Industry Standard Pioneer CDJ media players. Just amazing! Also it helps to keep those skills together! scratching is still gonna be a hard one to get around but it still can rock a crowd!!!\n\nHelpful | 2\nDeveloper Response8 days ago\n\nThanks Jeshajah.israel, you're too kind! We're delighted that you're enjoying Tribe!", "Mister_Fonzie10 days ago\nBecome a DJ Superstar\n\nI'm no DJ, but with this app, I'm becoming one. This is no toy or game, but a solid set of tools to learn the hardware and techniques used by real DJs. On top of that, it's just fun.\n\nWhen I first started, I was just loading tracks, setting the EQ, and pushing play. Now I'm actually mixing tracks together. The multiplayer is really cool, whether I'm just playing my favorite tunes, or mixing my music to someone else's.\n\nIn addition to a great app, there is tons of support from the developers on Discord. They are quick to answer any question I've asked. The community is also active. I've received tips on mixing, music selection, and more from experienced DJs.\n\nHelpful | 1\nDeveloper Response8 days ago\n\nThanks so much for the review - we really appreciate it! Looking forward to see more awesome mixes from you! The Tribe XR Team"]