{"App Title": "Trover Saves the Universe", "App description": "From the co-creator of Rick and Morty comes Trover Saves the Universe. Your dogs have been dognapped by a beaked lunatic who stuffed them into his eye holes and is using their life essence to destroy the universe. You're partnered with Trover, a little purple eye-hole monster who isnt a huge fan of working or being put in the position of having to save the universe. Only you and Trover can save everything in this bizarre comedy adventure filled with combat, platforming, puzzles, and morally questionable choices  created by Justin Roiland! -Control Trover's movements, but not his mouth. Hes got a lot to say about whats going on in the game. -Travel the cosmos to experience a variety of weird alien planets and characters with big personalities. -Upgrade Trover AND YOURSELF with new abilities while evading awkward situations. -Immerse yourself in weirdness.", "Purchase section": "$29.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Adventure, Narrative", "Languages": "English, French (France), German, Italian, Spanish (Spain)", "Version + Release Notes": "1.0", "Developer": "Squanch Games, Inc.", "Publisher": "Squanch Games, Inc.", "Website": "http://trover.site/", "Release Date": "June 18, 2020", "Developer Privacy Policy": "None", "Space Required": "3.40 GB"}



["5 stars\n88%\n4 stars\n8%\n3 stars\n2%\n2 stars\n1%\n1 star\n0%", "calforbJun 26 at 4:33 AM\nFor those with a sick sense of humour\n\nI love Rick and Morty and Accounting + brought a taste of that when I got the quest; but this is a proper full length game with all of the same humour.\n\nThe reviews from other platforms have all been excellent and this version is no different apart from a little graphics downgrade. I hope future upgrades and tweaking can maybe push the quest to make them even better but the gameplay is brilliant.\n\nHelpful | 171", "aaron.sommers.1253Jun 25 at 3:07 PM\nTROVER\n\nAnother great game for our glorious Quest. Supper funny, and an awesome campaign. This game is quality, you cant go wrong, but not for kids. Have fun Questers  One thing Development PLEASE TURN UP THE VOLUME. Thanks\n\nHelpful | 274", "Grandpuppy1Jun 25 at 6:13 PM\nI can't stop laughing!\n\nWith all the turmoil that's currently going on this is such a refreshing and humorous game. I've been a longtime fan of Rick and Morty, accounting plus and this game far exceeds what I was expecting for humor. It's much more than a game, it's a Non-Stop comedy show. You control trover with his walking jumping and sword slashing. I've been playing it for 2 hours, only because I don't wish to rush through the game. I find myself sitting there and listening to the dialogue from trovor. I am definitely glad I bought this since I was starting to get into a deep state of depression. This game snapped me right out of it.\n\nHelpful | 54", "Winter.Wolf21A day ago\nWhat the actual F***\n\nI was in a cartoon world with foul mouthed little as*****s who I murdered left and right via my purple accomplice/avatar (yup...you make your purple friend kill people). Hilarious game, was laughing as much as I was having fun playing through. I never watched the Rick and Morty show or whatever its called, but I was still able to enjoy this game. Spoiler Alert!!!! When you get to the guy in the bathtub, DO NOT drop the tv in there with him! Learned that one the hard way. If you dont like adult humor this is not the game for you, for all the non-Karens you should definitely play this game.\n\nHelpful | 2", "DaDansterJun 25 at 2:20 PM\nBest platformer, ever...\n\nPlatformers are freaking sweet in vr, this is no exception. But unlike normal, stale platformers this has the humor of Rick and Morty that we all know and love. LOTS OF IMPROV. Most of it, is pretty hilarious. If liked this companies other game, Accounting+ you will LOVE this game. Since instead of being 15 minutes long, its 5 to 6 hours. Same quality, just much more content, is what im getting at. Game is a great value too. I cant believe how funny it is. Probably the best Quest game out rn. A must buy.\n\nHelpful | 45", "steve871Jun 27 at 9:04 AM\nOK Trover\n\nWhen it comes to playing games I'm pretty useless. In fact I can't think of many games I've actually completed over the last 30+ years (yes I'm that old). However this game looks to be the one to break that duck, I've only played for 20 minutes but enjoyed it immensely so far.\n\nHelpful | 31", "Rickpick9810 days ago\nBest game ever\n\nFirst, I thought this game wasnt going to be that good but when I started playing it I was instantly hooked....finished the game in 2 days and wish there was more. THIS IS THE FUNNIEST GAME OF ALL TIME!!! trust me. BUY THE GAME!\n\nHelpful | 3", "Izzy9pJun 26 at 3:31 PM\nPretty awesome! R&M fans will appreciate\n\nI really like it.\nBut I like all things Rick & Morty.\nIt's probably as close as a game will get with their characters (unless there is already a VR game I'm not aware of )\nImportant thing to note,\nYour VR headset IS one of the controllers.\nSo play the game like the headset is a third controller. Practice this in the game intro.\nIt's challenging, fun, and funny.\nIt's hope to see more from them!!\nOh, and watching Utube vids on how to play is for hacks.\nPlay it and enjoy the challenges.\n\nHelpful | 16", "wrayban14 days ago\nBanger!!!\n\nThis game is amazing!!! I was genuine so happy and enjoyed this game so much!!! Its super funny! You build a bond with Trover, and I find myself making jokes out loud from the commentary of this game! A++++++++ I was sad and equally happy with the ending! Lets get a sequel for sure!????\n\nHelpful | 1", "MammaBob16 days ago\nIt's like being inside Rick & Morty\n\nI love this game. Then again, I love Rick & Morty so it was a given. It really takes all the features of VR and incorporates it into a well put together game. Game play is really comfortable. None of that weird movement that makes you feel sick. You just teleport from one place to another, but still have the advantage of a moveable character that can explore. Love it! (And I know some people are slamming the graphics but really? With game play and storyline you'll soon forget about graphics - and they really aren't that bad anyway)\n\nHelpful | 1", "hansokarlsson18 days ago\nThe best of it's kind\n\nI'm not a huge fan of shooters and battle games but this was a battle I thoroughly enjoyed - a battle against the bizarre. By far the most addictive game for me. I also very much enjoyed Red Matter, which in a way is a thriller version of this experience. Lots of fun puzzles to solve, tricky but not too hard. Trover made me laugh but also feeling utterly frustrated because of the stress the characters put on you. Still, it was an enjoyable stress and it made me come back because I could not accept failing in a puzzle. Five stars!\n\nHelpful | 0", "evagoldthwaite19 days ago\nIncredible\n\nAbsolutely hilarious, great story line, and the puzzles arent too hard! I struggled and had to give up on some other apps because I couldnt get past the puzzles. Some of the quests will take you some time but youll get there and youll be proud of yourself! Very few glitches and an overall great experience!\n\nHelpful | 0", "DiggyP8921 days ago\nAmazing\n\nThis game is great especially because the style used. Cool to hear voices from rick and morty.\n\nCool mechanics smooth game play and colorful areas to explore even if its only teleporting atleast so far. Im half way into the game and I would definitely recommend playing. More so if you like rick and morty possibly even moss\n\nHelpful | 1", "evandaganJun 25 at 5:42 PM\nMoss 2\n\nIf you're looking for another diorama-style action-adventure puzzle platformer like Moss, this is it.\n\nSeriously, the exploration, battle sequences and many of the environmental puzzles are very similar. Where this goes above and beyond Moss is in the ability to change camera position, and scenes/levels that are full 360-degree environments.\n\nAnd that's just the gameplay - of course the voice acting and humor adds a whole other layer, and if you're a fan of Rick and Morty (or Accounting) you won't be disappointed.\n\nMy only complaints: I wish there was an option for free-spinning the chair by actually rotating your headset/body. I realize that this option would conflict with the \"interact\" function that is gaze based, but feel like some more effort could have gone to remapping controls for quest. But once you get used to it this is not a deal breaker.\n\nGreat game!\n\nHelpful | 8", "cwillenbrock22 days ago\nThink you'll like it? You'll love it.\n\nIf you're like me, this game immediately sounded interesting and like something I'd enjoy. Simply put, if you enjoy Rick & Morty, or even just dry off-beat humor, you're going to love this game. Honestly, beyond the humor (which is great) the game mechanics are great too. The way they took into account the stationary nature of the player as a core aspect of the game is great. The only people who might not like this game are people who hate Rick & Morty; because the influence is ALL OVER this game. But like I said, I loved it.\n\nHelpful | 1", "darwins.lastJun 25 at 5:40 PM\nWasn't Expecting a Serious Platformer...\n\nBut here it is! Very well done at that. Adult language although you can censure it. Very satisfying gameplay. Like a TV show. Funny situations do their best to make you feel bad about your choices. Don't want to ruin it, but it's well worth the money. Definitely a top game on the Quest.\n\nHelpful | 9", "GamerGirl6611714 days ago\nLove this\n\nIf u have a sick sense of humor this is for u though it has a lot of cussing but that isnt a problem for me I definitely would recommend to play because its by far one of the best oculus games ever but yeah love the game definitely recommend this\n\nHelpful | 1", "Deets39x23 days ago\nFun - wished it was longer\n\nFun game, hilarious moments. Was unsure of how a 3rd person vr game would play out. But I can see the future of 3rd person VR games being good if its like this game. I definitely recommend this game to those who like Rick and Morty; same sort of twisted humour. I just wish there was more to play !!!\n\nHelpful | 0", "Ladiexeric13 days ago\nNewbie\n\nIm new to Vr, I noticed this game and watched the preview. Absolutely mind blown about the mechanics and physics of the game. Very cool way to introduce how to use controls in game play. I really enjoy playing this game and look forward to more.\n\nHelpful | 0", "PropagandistPicturesJul 17 at 12:32 PM\nNever thought I needed a VR platformer\n\nThe most fun I have had playing a platformer in years. The mechanics are kind of basic but its still so satisfying - after all as Trover says its elderly abuse time.\n\nI like the absurd moral decisions you have to make, very reminiscent of Rick and Morty.\n\nThe graphics are some of the best on Quest currently.\n\nHelpful | 2", "MykallCasias22 days ago\nFood For Boredom\n\nIve never seen Rick and Morty outside of the PSVR game, so imagine that Im barely a fan. This game surprised me, and it was for a lot of creative efforts, and not just the curse word filled stream of consciousness. I think the shock humor thats here is just a notch above South Park, but is mostly for pseudo intellectual nerds. The kind that enjoy the Big Bang Theory, but still call chimps monkeys. Theyre GREAT APES! Monkeys usually have tales you f*ck. Apes NEVER do, tail bones okay fine yes. Curious George never had a tail because hes a chimp. Those of you that suffer from that Mandela effect are also suffering from a lower than average IQ for a great ape of any kind.\n\nWell, the creator of this is kinda doing the shockiest crap like other opportunistic entertainment media creators of yesteryear, but with a lot of clever rants throughout. I hope the stint of fame is worth losing any chance at ending up anywhere like the last level. Ill poison your mind for a lot of buying power and a group of yes men for friends. When you throw caution to the wind and sell your soul for $ you are seen as brave, bold, and probably right to the people whose only real purpose is figuring out what will make them orgasm the most intensely. Hollow, but still fun if you shut off your higher brain functions and embrace a self indulgent lack of morality. A+, but youve been warned. Just enjoy it for now until you find out the creative mind behind this garbage once slapped a womans rear when he was drunk and you die from a different kind of shock than what this game offers in abundance.\n\nHelpful | 0", "gabe.blasingame24 days ago\nGreat fun!\n\nWanna sit and play for hours? This is for you. Funny, entertaining, plenty of content compared to many games on this platform, though id pay for more in a heartbeat. Please make a sequal or 2 developers. Glad to find a vr game where the reviews arent inflated.\nP.S. Dont let your kids play.\n\nHelpful | 1", "Cozzy_Jun 20 at 7:07 PM\nAaaw Geez\n\nAmazing. My face hurts from smiling and laughing like and idiot throughout the 5+ hours. What took so long to release Trover on the quest without even giving the Chairopian quest remotes? A must for any Rick and Morty fan.\n\nExtremely playable, easy progression, insanely funny and a joy forever. If you collect all of the green power babies you are in for a real treat. Not waiting to get the free DLC is also a bonus.\n\nThe graphical hit this version has taken is a bit of a bitter pill to swallow in the resolution stakes given that most of the action happens at range. The texture quality reduction and lower draw distance are acceptable losses- although at the moment the texture is drawn at higher LOD at the extremities and the center is lower...aww geez guys. The resolution needs to get dragged up if only in the centre FOV, not the outside ;)\n\nHelpful | 6", "JenspadJun 26 at 10:10 PM\nI love this game!\n\nFinally Trover has come to the quest! A multi-dimensional multi-level platforming game with 1st to 3rd person mechanic and view. I have followed this game on PSVR as well as pcvr and once again we experience the hilarious crude humor we got from the accounting series so if you loved accounting plus on quest you will love this. I'm writing this review on the day 1 of release and hopefully some glitches will indeed be fixed on the next update but my one and only complaint is that I was expecting the exact same game play that is on PlayStation and PC VR. This game has plenty of content, to play in full will take you about 8 to 9 hours and it even has an entirely different side campaign that you can play after you've done the main one which is completely unrelated. If you are not easily offended and want a great platformer that's hilarious with re-playability get this game!\n\nTo the Devs:\nPlease please add anything you may have taken out for the port to the quest if possible.. constant banter, the things you can destroy in PC version, the wild crude convo when you hang around etc. the graphics have taken a slight downgrade and the audio is so low I can barely hear please fix both and thank you for making this!\n\nHelpful | 41", "austin.zwickelJul 13 at 6:26 PM\nFunniest game I've ever played\n\nWriting reviews isn't something I ever do but must speak my mind. If you're a Quest owner you NEED TO BUY THIS GAME and support Squanch Games. I don't have the words to describe how brilliantly funny and entertaining it is to have fully-animated characters break the 4th wall at you in real time - it's genius and it makes the world feel alive and almost sentient. I can't wait for them to make more games like this in the future!\n\nHelpful | 2", "incompetent.ninjaJul 26 at 4:08 AM\nHilarious & fun\n\nMan. This game transported me to another realm. It was one of the most inappropriately funny and ridiculous games Ive played in a long time. I wish I didnt end. I even finished the DLC which comes with it and I wanted more.\n\nWear headphones. Its spectacularly offensive and if you have a decent sense of humor, its difficult to not laugh out loud.\n\nIts probably not going to win many awards, but I spent a solid two days in another world. I can not recommend it more. Fantastic. Im sad that Im done. I played while my headset was charging.\n\nHelpful | 0", "lORDOFTHEfLOODJul 10 at 7:03 AM\nBrilliant game psychology\n\nThis game functions on an incredibly intuitive psychological level - the characters you grow to love (or hate) manipulate you in just the right ways to move forward with this joyously hilarious experience. First they destroy you with laughter, then they encourage you to delve into this amazing platforming design (which has in initially high learning curve, but is very rewarding once it becomes natural - make sure you learn the telekinesis chair upgrade well). Your new VR friends are encouraging to let go and actually enjoy something. If you miss this psychological element and just pound your way through like you do through more crudely designed games, you miss the entire point of the experience. Those that get it will thoroughly enjoy the end level of the main campaign . Seriously euphoric.\n\nHelpful | 2", "DrFeelGood007Jul 9 at 11:46 AM\nWow - So many funny parts\n\nThis game will have you laughing for hours on end. It will take you days to beat if you play obsessively like I did, but the first thing I wanted to do once finishing was play it again because the game gives you many choices and I wanted to see what the alternative storylines were. Also, collect all the green power babies for the best unlockable in any game ever!\n\nIf thats not enough enjoy the free DLC!\n\nHelpful | 2", "kachtanJul 22 at 7:20 PM\nAwesome.\n\nI got this game this morning and I already love it. I can't put it down! I do have a question about the controller. On quest you use like an 80's Nintendo controller but on rift, rift s, and PS4 you have like this si fi PS4 controller. Can you maybe make an option for that in the main menu so you can switch controllers maybe? I also think that they should update the game to have better graphics because when I played it, some of the characters and the levels looked less like the rift version of this game. One more thing. I also wish that in a later update they could add a feature where you and trover can swap bodies instead of you staying in the chairorpian body. That would be awesome. Hopefully they actually put it in. Probably not. :(\n\nHelpful | 1", "velvet.jackJul 24 at 3:22 PM\nCan't Move; Updated on 7/24/2020:\n\nThis is probably a premature review if anyone knows how to help me out. But the start of this app was great. I understood all the directions except how to move myself. I did move myself at the beginning once, but didn't register how I did it. From then on, all I could move was Trover. I could turn my chair around with the right hand button. I could move Trover any way I wanted with the left hand button and make him jump. But I spent an hour trying to make myself move after Trover, to no avail. I tried every finger combination, and I still couldn't move. I was really bummed out because the app looked so good. But I finally gave up when I exhausted myself. This is an update after talking to support. I was told that I could move myself with my right index finger once I put Trover on the round green node pad. The problem with this is that none of the buttons on my Oculus Quest controller will create this green node. The joy stick button on the left hand just move Trover; it doesn't put him on a green ring.\nOkay; Dumb user problem. I found the rings. They are just there in the app. I don't have to create them. Now that I know what I'm doing, the app is a lot of fun.\n\nHelpful | 1", "genasianeJul 19 at 10:16 PM\nHilarious and inventive\n\nReally hilarious game with fun and inventive mechanics and worlds. I still cant believe they recorded so much dialogue for this, theres a ton to discover while playing. I will say it helps if youre a fan of Rick and Morty and some of Roilands other work as his brand of humor may not be everyones cup of tea.\n\nHelpful | 1", "jonas.sandstedtJun 25 at 3:44 PM\nIs this a PS VR port?\n\nSure, it's a fun game (the 30 min I've played this far). But the interaction and rendering in the game feels a bit off. And keeps me from getting immersed.\n\n- It's wierd that you chair doesn't not rotate when you turn around (I tried sitting on a rotating chair, and standing. But your really need to sit in a stationary soffa according to how the designer wants you to play. The Quest doesn't have a cord, please let me turn around how I like without needing to use the joystick.\n- It's wierd the way you need to move the green dot to interact with objects.\n- It very wierd to not allow your hands to move around.\n- The LOD in the texture is completely off. They get a lower resolution in the middle, and higher in the bottom part of the field of view. (Ex in the intro scene with the statues, the text underneath is only sharp when I tilt my headset upwards and look in the bottom part of the screen.\n\n+ Good VO and manuscript\n+ Nice mix of a 1st person and 3rd person view\n+ Nice humor\n\n(This is written the first day of the game release on Quest, I will change the review if new updates arrives)\n\nHelpful | 66", "TiboricJun 30 at 10:19 AM\nI eat burger\n\nYummy tummy goodness\n\nHelpful | 100", "morbidmortyJul 16 at 11:25 AM\nFriggin fantastic \n\nThis was exactly what I needed on my Quest. Great escape while not requiring a ton physically from me. I still enjoy the active and super physical games offered on the Quest, but some nights I need a break and this was just that.\nGreat for anyone who looooves Rick n Morty, or for those who simply enjoy being told how much they suck and like a dose of reality with their virtual reality.\nCheck it out, don't be lame ...JUST DO IT ALREADY\n\nHelpful | 1", "KnittelManJun 29 at 2:19 PM\nHilarious and entertaining\n\nIdk where to begin with this one. Beyond the fact everything in the game is hilarious (found myself stop playing just to listen to characters talk) the game actually has a unique approach.\n\nI love how it makes you a character actually in the game while also controlling another character. Makes you feel like a part of the game more than an observer playing one. The controls were very easy to understand and learn as well.\n\nIf I had any cons it would simply be the actual gameplay itself can be a bit repetitive and the game overall is very short. I wish some of these Vr games were much longer for how much they cost. But I highly recommend this one and I hope they make more!\n\nHelpful | 2", "VKGAMINGJul 16 at 2:44 PM\nAMAZING\n\nIf you're a fan of Rick and Morty, you'll definitely love this! They did an amazing job porting this to the quest, it's nearly identical to the PSVR and PCVR iterations. We finally have this game fully portable with VR, THANK YOU. Hopefully Virtual Rickality makes a surprise drop too!\n\nHelpful | 0", "Headsnipe101Jul 13 at 1:37 AM\nBest vr game ever\n\nI dont write reviews but, this game is the best thing in the world. Its like being in the world of Rick and Morty. The commentary, the characters, just all of it is absolutely amazing and worth every cent. Nextvr may be gone but until a new way to watch sports comes to vr, this game and this game alone is making this oculus quest even worth while. Get this game and buy all things Rick and Morty. They never disappoint\n\nHelpful | 0", "DudisPudisJul 13 at 8:38 PM\nOne of my favorites\n\nThis is an amazing game and one of my favorites in and out of vr. The main story mode took me about two in a half to three in half hours to beat and the free dlc took me about one in a half hours to beat. It is also really funny and if you liked accounting+ and or Rick and Morty you will Love this game. To wrap it up this is it this was a pretty long game it is also really funny and its good. Im writing a review. Yeet.\n\nHelpful | 0", "mopsigmorumJul 27 at 10:26 AM\nPlease make more!\n\nThis game is hilarious throughout and a lot of fun to play. I love the commentary and the way it often breaks the fourth wall. I really enjoyed the controls and dynamic. I wish it were longer, or better yet hoping for a part two!\n\nHelpful | 0", "ReReForLife15 days ago\nAmazing game\n\nJust bought a quest and was uncertain about the quality of games made specifically for quest but this game blew my expectations out of the water. Funny as hell\n\nHelpful | 0", "FlexGod27924 days ago\nAmazing\n\nThis Game is a MUST HAVE. Its soo funny and fun to play, its not a very long game but its not short either. Everything fits in perfectly where it should and the game is a perfect amount of time.\n\nHelpful | 0", "SeptuaScorpiusJul 11 at 3:50 PM\nOne of the best comedy games out there!\n\nLoved this game. It had great dialogue that I couldnt get enough of and very cleaver game mechanics with a great story behind it that led me to putting 10 plus hours into. Also, great drive for exploration due to the VR aspect of the game along with making me want to find every collectible to read its quirky descriptions. Highly recommend it!\n\nHelpful | 0", "JkazemekJul 15 at 9:04 PM\nI love these guys!\n\nI have literally never seen one episode of Rick and Morty. I was such a fan of accounting plus and was elated when this was released. I am playing through it slowly so I can enjoy all of the little nuances they put in the game. Keep them coming guys. I will always be a fan!!\n\nHelpful | 0", "daveydanger96Jul 13 at 10:27 PM\nHad me laughing for hours!\n\nI love Rick and Morty, so knew it would be pretty funny, but wow it really exceeded my expectations!! Highly recommend the game, the funny commentary and crazy quests will have you pausing the game with laughter. Plus, there's a bunch of DLC within the game. Well worth the price!!\n\nHelpful | 0", "FacekickerJul 14 at 2:37 PM\nHilarious. #UNCENCORED\n\nFirst off Im an idiot and I love Justin Roiland's sense of humor and quirkiness. This game is just that, stupid humor but really fun and believe it or not its actually a little bit hard. It makes you think your way thru the gameplay in some areas which is cool. This is a complete crapmix n mash of watching a Rick n Morty type show while also portraying one of its characters. Keep it uncensored and get all the foul mouth stupid comments from all the characters. Im having fun with this one for sure. Get ready to be called \"a real piece of s#!t.\" A lot\n\nHelpful | 1", "daniel.migotto23 days ago\nGreat entertainment\n\nI was almost certain I was going to like this game from the moment it was announced and I was not disappointed. The humor is great and the gameplay is a surprisingly large amount of fun.\n\nHelpful | 0", "TheChosenOnezJun 25 at 12:52 AM\nLegendary games have the best storys\n\nAMAZINGER! SUBLIME! STAGGERING! STUNNING! What other words are there.\n\nThis is THE absolute best game I have experienced on the quest and is the best platformer I have ever played. With the current 2020 lockdown and all the strange events that are happening Im sure people will find this game extremely relevant and refreshing, bringing a much needed smile to your face in these strange times The story is amazing. You only have to look beneath the surface and you will find the most clever, witty and insightful story ever. It brilliantly explains our culture and makes people aware of serious current events in society that are important talking points, but these are always raised in a comedic nature. Some peoples jaws are going to be literally on the floor when playing this game.\n\nQAnons eat your heart out you will love it.\n\nTrover saves the world is a lot better than some films You will watch at the cinema today, especially when experienced in VR.\n\nThe graphics and originality of the play mechanics are one of a kind with playful and interactive thought provoking virtual reality mini games that both amuse and get you thinking at the same time.\n\nI never stopped laughing throughout the whole game and that alone is worth the money I paid for it. The script is fantastically unique and hilarious with a modern twist or thinking point raised in every sentence. This is a must own title for the oculus quest and any console especially Vr.\n\nThe only bad thing there is... Well there isnt one really but Im afraid of heights and the first chairtopia upgrade made me queasy lol  I have played games all my life I know a good game when I play one this is that good title we get now and again, you have to experience this game \n\nHelpful | 2", "Lalelu15Jul 8 at 11:28 PM\nVery good game !\n\nThe graphics, the characters, the Humor and a unique gameplay. That game has it all.\nIts also the first VR game I played in wich you can interact with characters as in they ask questions and you can actually nod or shake your head to answer yes or no.\nI spent the last days playing trough that game and I can easily say it might be one of my favourites.\nIf you know and like Rick and Morty its a must have, otherwise perfect for people with a dark Humor.\n\nAlthough there is a way to censor all bad words etc for kids, Im not sure I would let a kid play it.\n\nHelpful | 0", "GarrettVanoer21 days ago\n10/10 Schleemies would play again\n\nThis game is literally just Justin Roiland playing different voices in a very irreverent manner. Incredibly fun and entertaining. Just wish it had been longer.\n\nHelpful | 0", "meganwalkerJun 26 at 9:14 AM\nVery fun and funny game\n\nI really like the game. Love the humor. I agree with some of the feedback around having the chair swivel with the headset. It obviously could since they use the head movement to respond to questions. I would also prefer that the control look like the Quest controllers. But the reason I am giving 4 stars is because there is no save for more than one game. This drives me crazy. If I want to let someone try out the game, They either have to play where I left off (effecting my game), or I have to start the entire game over. I have only had a couple Quest games like that, and it is becoming a deal breaker. I hope the developers will fix this.\n\nHelpful | 14", "KingBeviA day ago\n\nAbsolutely amazing laughed through the entire game 10/10\n\nHelpful | 0", "nikki.rood34 days ago\nSo much fun\n\nAll I have to say is.... just get it.... you won't be disappointed!\n\nHelpful | 0", "dylpickle132116 days ago\nAmazing game\n\nThis game is as much fun as acounting+(I wish rick and Morty vr was on the quest) for a comedy game this is a good game.\n\nHelpful | 0", "dantehohJun 25 at 8:40 PM\nA gem to the quest!!!\n\nIf the comedy styles of Rick and Morty are up your alley, you will INSTANTLY LOVE this game!!!\nThe controls are simple as hell so the gameplay is quick to learn to.\nPersonally for me, I got my money's worth out of this already and have only finished the first level as of writing this!!!!\n\nHelpful | 2", "zombie683Jul 2 at 4:43 AM\nAbsolutely brilliant\n\nFirst of all I dont write reviews often but this one deserves a review. Having just complicates the game I have to say its amazing the whole game play, script, graphics are great just what you want for a top title for a new bit of tech. I think all in all playing daily for an hour or so I think it lasted around the 5 hour game play mark but, theres an extra after the game which Im on now and so glad its there to carry on the game. As for replay ability I will definitely play the whole game again. Good value for money I recommend this game and I like many others really hope for another or extra dlc both which I will be buying. Thank you to everyone who played a part in making this game. Great job. Stay safe, well and happy gaming\n\nHelpful | 0", "Scary_Clown5831Jul 7 at 10:26 AM\nOne of the best games on here\n\nThis game has amazing graphics, amazing gameplay, and worth buying. Its not just a game thats comedic so but interactive and thats what I love about it. If your new to the oculus quest or just trying to find games this is one of them you should put on your wishlist.\n\nHelpful | 0", "ZoosafJul 2 at 3:27 AM\nI encountered a bug\n\n(SPOILER ALERT)\nThe game is amazing but when I was in Weird Earth and killed bathtub guy I left the game after I killed him, but then I went back in and Trover kept telling me to go to Tech World. There was supposed to be a call telling me about crystal babies and that they were in Tech World. Now for whatever reason everytime I enter the game, bathtub guy is alive but Trover talks like he is dead and calls him a corpse. Trover keeps telling me over and over to go to Tech World even though the telepod isn't showing anything on the teleportation screen and that means I am stuck in Weird Earth. Meaning I actually DO have to start over. Maybe I am entering the game and the wrong dialogue is being played because I looked it up and the dialouge is a bit long during the call. I have nothing negative to say about the game but this bug worries me for those that actually do get tricked into leaving even though you probably should not. Great game though 10/10\n\nEdit: Nevermind I forgot level select was a thing in this game. Great game 10/10\n\nHelpful | 0", "j70610Jun 25 at 8:41 PM\nNew favorite game\n\nThe platforming feels great and the collectibles are rewarding, the story and NPCs are funny and to top it off the combat is satisfying and fun.\n\nHelpful | 8", "ButtCheekClapperJul 1 at 5:27 PM\nAwesome game.... tad bit slow....\n\nThis game is amazingly funny! Any fan of R&M must have this! I loved every baby collecting second of this hilarious game! Though it is kinda slow... one thing I think is a little annoying is the power baby collecting... it takes way to long to have to take so much time and effort to collect all 30 of them from each level (Though I may just be a little impatient). Though with that aside, Im always cracking up at the funny remarks coming from chicken nug peeps and Trover himself. Not a thought in my mind has ever said that I regret buying it and will recommend it to people of ALL ages (if theyre 14+).\n\nHelpful | 0", "Boodgie19 days ago\nI know a game is good when I finish it\n\nI completed this one and enjoyed it immensely. It was freakin weird man but we did it! We freakin did it! Team is the dream.\n\nHelpful | 0", "Natured_ApolloJul 8 at 8:06 AM\nTruly a blast\n\nAll kinds of stuff to find, new dialogue you may have skipped plus a mode that replaces Trovers model with some weird yellow guy AND free DLC? I mean the DLC isnt much but its free so big props. If you laugh at Rick and Morty, youll laugh at this lots.\n\nHelpful | 0", "LukeP3607 hours ago\n\nVery good and fun so far\n\nHelpful | 0", "RedPanda63712 days ago\nSo much floompin fun\n\nGreat game. After we move these boxes,\nI recommend playing it! Doopie Dooper\n\nHelpful | 1", "DemneZJun 29 at 1:37 AM\nTrover\n\nOne of the Funniest games I've ever played but why I like it better than the funniest game ever played because it's virtual reality something I've dreamed about since I was a little kid back in the 90s this game is the bee's knees in other words the best you should get it it's for mature and there's a censored mode I haven't tried the censored mode no point at my age if you want to have a good laugh and a lot of fun playing a game if you have a good sense of humour buy this game it's great and please turn up the volume thats why its not the best but still awesome \n\nHelpful | 0", "CodeZionJul 17 at 2:35 PM\nAmazing.\n\nThere's no other way to put this other than amazing in VR, I actually started to become friends with trover, if you're into dark and dirty humor and can handle tons of swearing, this game is absolutely perfect\n\nHelpful | 0", "HexBlehJun 28 at 7:33 PM\nLETS GOOOOOOOOO\n\nTROVER SAVES THE UNIVERSE YOU ALREADY KNOW WHATS GOOOOOOOD\n\nHelpful | 22", "oofman_42012 days ago\nGreat game\n\nIf u like the show rick and north than u surely will like this game\n\nHelpful | 0", "Schiller10725 days ago\nHilarious and fun time!\n\nSuch a ridiculous campaign that totally works ! I felt really immersed in this world and I really enjoyed the quipy jokes and nonsense !\n\nHelpful | 0", "NigaliciousssJun 25 at 9:22 PM\n\nYou ready know this is gonna be fire.\n\nHelpful | 28", "captnatom2 days ago\nFun overall, but with one shortcoming\n\nI enjoyed the game for the most part. It was original and funny to begin with. I enjoyed solving the little puzzles. However the dialogue becomes very repetitive and by the final scene it seems that the script for the game was written by a crude teenage boy. The main antagonist just keeps repeating gross and disgusting things over and over and over. I almost didnt finish the game the dialog was so bad, and Im no prude. Just imagine Donald Trump as a 14 year old hanging out with other boys that were raised with no manners and thats what this game becomes by the time it ends.\n\nHelpful | 0", "Lake418 days ago\nThis game is Hysterical And fun to play\n\nThe story is hysterical, the script is funny as hell in the game plays really easy.\n\nHelpful | 0", "mainmillerman56Jul 30 at 6:12 AM\nThis chairorpian approves!\n\nI mean, come on. If you like phlemgar then you'll love this. The way they squanchin did the thing was like SHLEMBOL! Flaryint!\n\nHelpful | 0", "DirtySkundy11 days ago\nLove this!\n\nIf you like Rick and Morty at all, buy this game!\n\nHelpful | 0", "piping-cultistJul 8 at 4:01 PM\nOne of the best Oculus games out now\n\nIf youre a Rick and Morty fan, this is your game! I have never laughed so hard playing a video game. This game really is a great showcase of how fun VR games can be. Hands down my favorite game so far in the Oculus Quest.\n\nHelpful | 0", "Scarletwolf-77Jun 22 at 10:53 AM\n\nI love the game. I love the quest. I love the characters. Great to look at. Fun to play.\n\nI would like to be able to just turn in my chair and it happen in the game. I don't like having to do that with my thumb and sit still. It feels counter to what I would consider is the entire purpose of VR.\n\nHelpful | 6", "Killerkai624 days ago\nIt good game\n\nIt good map. It good app. It good characters. It good story. It good controls\n\nHelpful | 1", "Drokz6Jul 20 at 3:08 PM\nFun and worth the money\n\nIf you enjoy the sort of adult humor found in Rick and Morty, you should enjoy this game. It's a great VR experience and I hope this is the start of a series of Trover games on the Quest.\n\nHelpful | 0", "FloridaManComethJul 25 at 12:52 PM\nA truly unique experience\n\nThis game has some great laughs but also a dark, twisted sense of humor. Not for people who arent morally flexible.\n\nHelpful | 0", "NamaslayJun 27 at 7:45 PM\nOmg Amazing!!!!\n\nLove this game! Im not the biggest rock and Marty fan but enough to know this title would be great. Not understanding anyone that didnt give 5 stars. They werent good enough to play the game!!! NOT FOR KIDS! But I know so,e idiot just bought it for them.\n\nHelpful | 1", "BrayZboyJun 19 at 7:37 AM\nAmazing 5 star game\n\nEasily this is one of my favorite story line games with all the same funny and stupid jokes from Rick and morty. I am a big Rick and morty fan and this just brought a whole new level of interaction with the same concept it has an amazing campaign and is long enough to last. Trover is amazing he is basically your friend morty throughout your adventure and you talk about stupid things and have fun. The one thing that spoke out to me was that you can shake your head yes or no which would give you a different answer upon what the character had said I thought that was really cool.\n\nThe one problem I have is that the babies are sometimes hard to find and I dont have the time to do it and I wanted to see what would happen at the end and still need to figure out. But to sum it all up if you are a Rick and morty fan definitely check out this game your will really enjoy it.\n\nHelpful | 1", "Helmy366Jun 25 at 5:18 PM\nEpic\n\nThis game is very fun, funny and cool. A lot of work has gone into it. If you dont buy this game, what are you doing lol? 5 stars 5 stars 5 stars!\n\nHelpful | 5", "RedBro123Jun 18 at 4:47 PM\nLost Track Of Time!\n\nThis game was immersive and really funny Justin you done it again you made a funny experience that I will enjoy playing over and over again just not in one sitting like I did the first time my head still hurts from that much VR.\n\nHelpful | 2", "dstigueJul 28 at 9:15 AM\nWas fun\n\nIt was definitely fun. I feel like maybe I didn't take enough time to really enjoy it. So to me it felt a little overpriced. The free dlc was cool. But honestly felt like a job. Which is funny because it was. Overall worth it if you're looking for a fun diversion. I would wait on the price and then it'll be a solid buy.\n\nHelpful | 0", "Shatterking420Jul 6 at 10:33 PM\n\nIf you are true rick and Morty fans this is the game for you plus for the oculus quest its a good long game so much humor in it  ........ But note that it is definitely not for kids \n\nHelpful | 1", "LethalDucklingJun 25 at 3:05 PM\nI SQUANCH THIS GAME!!\n\nI Squanched so hard playing this game. 10/10 would squanch again \n\nHelpful | 8", "RodOculusGameJul 16 at 11:04 AM\nExelent\n\nGame is fun, the dialogues are great, dynamic and crazy game. I wish the chair would rotate when you rotated your head. Otherwise I had a lot of fun with the\n\nHelpful | 0", "Bolsen.nzJul 27 at 1:47 AM\nGood enough\n\nIts reasonably funny and interesting the first time through. Second time was like a dialogue simulator. The dlc completed the experience. I liked that it challenged my ethics and the characters ask for my input. The designers arent afraid to troll the player in all their games. I gave it 1 star less because Im probably going to forget the experience in time.\n\nHelpful | 0", "Hinate2423 days ago\nWeird fun\n\nIf youre a fan of Rick and Morty, youll really enjoy this game.\n\nHelpful | 0", "guy.talmorJul 5 at 8:34 AM\nGood, not amazing\n\nI love Rick and Morty, i think it's a brilliant show, however this game is just ok.\n\nPros:\n\n- Cool combination of first and third person\n- Amusing at times\n\nCons:\n\n- The controls can be frustrating to use\n- The characters keep rambling on and on while you are trying to focus, gets annoying.\n- Too expensive imo\n\nHelpful | 4", "simdizzleJul 13 at 8:13 AM\nFunny shizzle\n\nReally funny game with a dark sense of humour that will have you laughing all the way through it definitely reccomend this game to any fan of rick and Morty must buy\n\nHelpful | 0", "SteveStone7625 days ago\nReally fun!\n\nThis is the first game I have completed since getting the Quest. Super fun!\n\nHelpful | 0", "pies348412 days ago\ngrait game\n\ngrait game\n\nHelpful | 0", "lettucegyyJul 25 at 8:53 AM\ngood\n\nrick and morty fan you should get this game man its one of the funniest games Ive ever played\n\nHelpful | 0", "ArtFaceJul 12 at 1:04 PM\nSuper funny and fun!\n\nWe honestly need more games like this on the quest. I enjoy the fun play style and all the over the top silly jokes. You will for sure have a blast with this game!\n\nHelpful | 0", "IamPotat0oJul 16 at 1:57 PM\nWow\n\nI dont know what I just played but its amazing. If you like Rick and Morty this game is for you. I couldnt stop laughing. Good job!\n\nHelpful | 0", "tjcool2004Jun 27 at 5:00 AM\nAmazing\n\nThis is an absolute amazing game it is creative funny and breaks the fourth wall plenty of times. I hope now that this game has come to quest I hope rick and morty virtual rickality will come to quest. This is a must have if you want a good laugh, it is also a long game for 20\n\nHelpful | 0", "MOSUL_MEDICJul 5 at 3:27 PM\nA real work of art\n\nThis isn't some cash grab of a game. This game plays very well, has a hilarious storyline and legitimately feels like you are trapped inside a long episode of Rick & Morty.\n\nWorth every penny\n\nHelpful | 1", "sinelindenJul 1 at 8:45 AM\nGreat fun\n\nIve never watched Rick & Morty but the trailer to this really interested me so I took a chance on it. Enjoyed it very much indeed, not one for the kids and Ive now bought Accounting + off the back of it.\n\nHelpful | 0", "elaineloueezyJul 27 at 3:30 PM\nTrover saves the Universe\n\nBad a... funny as all get out game. Loved it and the many layers within.\n\nHelpful | 0", "DankskullJun 25 at 7:28 PM\nPlease update the sound its TOO LOW\n\nAs a person who bought this on psvr I can accept the slight downgrade and the fact that the controllers don't match what you see but the fact that the sound is so low you miss vital dialogue that is genuinely why you play ..i found my self laughing at the jokes on my live stream because it was far louder and I had missed the jokes the first time in person and I knkw u should've caught these jokes because of my previous playthough ..so to me I say it would be 10/10 if you can fix the sound\n\nHelpful | 3", "gottixoogJul 28 at 11:09 PM\nGame is effin funny and i like it\n\nI like how the game plays and its funny keeps you in it I just want one thing. Can the developers please make smooth turning I hate the little flicking turning I dont like that hurts my eyes I like the smooth turning makes it feel more realistic\n\nHelpful | 1", "tsl316199116 days ago\nOnly fun until you beat the game.\n\nThe game itself is good, but as soon as the game is over, so is the fun. Once you complete the game and the dlc and collect all of the green power babies, there's nothing to do except either restart the game or roam around the last level listening to what the other characters have to say.\n\nHelpful | 0\nDeveloper Response7 days ago\n\nwere sorry the game isnt longer!", "Mrsalt4503Jun 26 at 12:28 PM\nSo funny\n\nA must buy for all rick and Monty fans. The gameplay is good but this game focuses on being funny, but that is not a bad thing\n\nHelpful | 3", "yurgsmershJul 26 at 2:06 PM\nSo good it hurts...\n\nThis is absolutely hilarious....if you like laughing...buy it now\n\nHelpful | 0", "stuarttilJun 29 at 12:58 PM\nWorth every penny\n\nGreat game with great controls and is ideal for the quest. The characters are funny and the storyline and game play is brilliant. Been playing a few hours and havent finished it yet which is good.\n\nHelpful | 1", "MattyProfJul 6 at 3:34 PM\nOutrageous and funny!\n\nIf you like R&M you need to download this game. Choose the uncensored version and play it when the kids are in bed. I love the endless and non redundant dialogue.\n\nHelpful | 0", "Antbot123Jul 28 at 4:59 PM\nWish it didnt end\n\nGreat story, even greater dialogue. Extremely funny!\n\nHelpful | 0", "PieVlaJun 25 at 11:53 PM\nIts time to get schwifty\n\nIt's schwifty time today!\n\nHelpful | 8", "Tompkinsc24Jul 22 at 9:35 PM\nAbsolutely amazing\n\nHands down one of the best and funniest game I've ever played in my life\n\nHelpful | 0", "Art_Z_JonesJun 28 at 5:16 AM\nAmazing VR experience!\n\nThis is such a unique meta-VR experience. So smart, hilarious & inventive. Youll especially love this is youre a fan of Rick & Morty, or any of Dan Harmon or Justin Roilands work too.\n\nHelpful | 0", "BayareadagoJul 12 at 8:44 PM\nNSFW \n\nSick & tremendously entertaining.\nDelightfully Rick & Morty flavored.\nWorth every penny, so far.\n\n*ucking sweet!\n\nHelpful | 0", "WettuzikJul 14 at 1:18 PM\nCool\n\nThis game will become your bro. Interesting enough. For around 4h playing in total.\nThe dialogs are amazing.\n\nHelpful | 0", "Michigan_WolverineJun 27 at 11:13 AM\nFinally an adult-catered adventure game!\n\nLove the humor and voice actors from Rick and Morty... adventure seems fun so far and gameplay seems to give you a good amount of time to complete campaign and additional tasks!\n\nHelpful | 2", "sieraashleyalvarezJul 18 at 10:53 AM\nLove it!\n\nFinished the game after playing all day. But definitely worth playing over again!\n\nHelpful | 0", "NickyQuestJun 30 at 1:56 PM\nMy favorite game in the Quest so far!\n\nThis is by far my favorite game in the Quest so far! Its crazy, wacky fun with hysterical characters, dialogue and action. Very much in the same vein as Rick and Morty.\n\nHelpful | 0", "nico_sartJul 14 at 9:08 PM\nAmazing, funny, and fun!\n\nA extremely Fun, hilarious, and fked up time!\nEspecially if your a fan of Rick and Morty.\n\nHelpful | 0", "TimmyVR007Jun 26 at 11:47 PM\nGreat game but could be better\n\nThe game itself is excellent and has all the Justin Roiland humor you could ask for. It's a shame however that the in-game controller held by your character looks nothing like the actual Oculus controllers and thus doesn't track the real controllers. Was also hoping that they'd bundle this game with that Rick and Morty VR game but that was apparently also too much asked from the development team. Such a shame.\n\nHelpful | 7", "God_DoomJul 15 at 2:33 PM\nGreat stuff hope theres more like this\n\nLoved the entire experience. I hope these guys start cranking out more games. Lmao.\n\nHelpful | 0", "deadpooldaddy251084Jul 23 at 3:51 PM\nLove it\n\nFunny and u can just sit and relax and play\n\nHelpful | 0", "Smash10101Jun 26 at 10:16 AM\nTrover\n\nThis is a great game, the comedy is outstanding and I was laughing the whole way through the game. The gameplay is also very engaging and at sometimes challenging and I never felt bored while playing this game. But then I beat the game and I was very disappointed. Im not going to spoil anything but the ending in my opinion was not very satisfying and kinda ruined the whole experience for me. Overall a great game but the ending was bad, but I still do recommend that you play it if you dont care about the ending.\n\nHelpful | 2", "bigfootfinder555Jun 22 at 4:08 PM\nGet rid of that wall puzzle\n\nI paid 30bucks basically to play this game and I can't get past that puzzle where have to climb the wall to get to the castle. For goods sake please make that easier for me so other people can actually play the game I know how to do it but it's incredibly hard\n\nHelpful | 5", "rmoulder05Jul 1 at 2:36 PM\nFinally\n\nThis game let me murder aliens from other planets. Thats a win in my book.\n\nHelpful | 2", "szymon.niemczyk.925Jul 6 at 4:24 AM\nTrover\n\nLoved this game it was a bit slow to begin with but when it got going it was one of the best games I've played on the quest.\n\nHelpful | 0", "zefferyJun 25 at 6:18 PM\nfun for the family\n\nlove playing this with my little siblings and cousins, very family friendly especially with the different colored cute babies! :)\n\nHelpful | 3", "MinecraftGod521Jul 15 at 11:25 AM\nAMAZING\n\nI completely loved this game definitely reccomend it if you love sick comedy.\n\nHelpful | 0", "Skid314Jul 17 at 1:35 AM\nAmazing\n\nOne of the beat games out there right now !! Worth every Penny!\n\nHelpful | 0", "jelwellJun 23 at 1:11 AM\nMediocre Platformer, Stellar Humor\n\nThe Rick & Morty style humor is spot on. Occasionally the dialogue gets drawn out but theres always some mini activity you can do (like shooting trash balls into the basketball hoop) or you can often just cut the scene short if you really want.\n\n\nThe game itself is just ok. The Chairorpian mechanic seems clever at first but its really a way to lock you into essentially a 3DOF experience. The camera angles remind me of Super Mario 64 - limited control and not always where you want the camera to be.\n\nThe chair upgrades made for a good learning curve for controls. But the grab and move/rotate controls I struggle with every time. The on screen hints for which buttons to press for that make no sense. They should show the oculus controller and highlight the button to press. Instead Im presented with two gray shapes with L written on each shape and one of the shapes is moving. Thats not exactly clear. And even when you figure out which combination of buttons to press I find things rotating while moving and generally difficult to move things in some angles.\n\nWas it worth the 27$ I paid. I guess so. But Im not sure Id buy a sequel.\n\nHelpful | 5", "kaibarmJul 17 at 10:15 AM\nLovely!\n\nIf you are a sick f**k like me you'll love this game!\n\nHelpful | 0", "janwillemheemskerkJul 22 at 2:08 PM\nGreat game\n\nThis is really a great game!\n\nHelpful | 0", "Irish-roverJul 3 at 8:51 AM\nWhat a funny game.\n\nReally enjoyed this game. One of the better games I have played. Game play is quite fun and I they come out with another.\n\nHelpful | 0", "tugavirtualJul 17 at 11:33 AM\nhilarious and addictive\n\nsuper immersive and as funny as Rick and Morty!\n\nHelpful | 0", "Doomzoom07Jul 25 at 2:23 AM\nDark humour\n\nIt gud\n\nHelpful | 0", "VRvinbeanselJul 13 at 3:01 PM\nFunny as hell\n\nGreat port, a welcome change funny real adult funny. Great game!\n\nHelpful | 0", "FriscoFanaticJun 30 at 11:43 AM\nFunny as hell\n\nLoved it! Had me literally laughing out loud lol! Never watched Rick and Morty but I might give it a try after playing Trover!\n\nHelpful | 1", "parzival1989Jul 17 at 2:41 PM\n\nBest purchase i've ever made in my life\n\nHelpful | 0", "TigercaronJun 29 at 5:46 AM\nEdge of the seat\n\nWell worth the money and buckets of fun. Fight in a universe where the rules can change moment by moment. Your traveling companion is blue and 'spacist'. Don't trust his counsel all the time. Every time you are asked you opinion, don't do the obvious.\n\nHelpful | 2", "vSOMEBODYvJul 14 at 8:37 AM\nBest VR game\n\nOne of the best games Ive played on vr \n\nHelpful | 0", "LTLDamageJun 23 at 1:49 PM\nFunny as hell\n\nA must get game for staying home.\n\nHelpful | 3", "shawn.foisyJun 27 at 8:12 PM\nEntertaining. Hilarious.\n\nwell done. First platformer in VR i tried and it is fun.\n\nHelpful | 3", "BlkWildFLOWERJun 20 at 6:25 PM\n5 stars\n\nFINALLY, Now this is my type of game.. Its fantastic , love the humor, love the profanity lol, all the way around 5 stars. GET THIS GAME totally worth the money....\n\nHelpful | 1", "xjay111Jul 2 at 6:46 PM\nVery fun game\n\nVery funny to play and a lot of hidden voice lines I loved the game and I love how you can make desisions\n\nHelpful | 0", "james.doyle.7892Jul 12 at 4:31 PM\nBest Game Ive played on the Quest\n\nIf youre a fan of Rick and Morty or Solar Opposites this is a must grab game! 5 minutes in and youre already laughing out loud in this easy to maneuver trippy experience. Five stars all the way.\n\nHelpful | 0", "PoloKnight1Jul 8 at 11:25 AM\nF****n HILARIOUS!\n\nFunny concept; cool gameplay; hysterical writing and execution. Loved it.\n\nHelpful | 0", "sipie27Jun 28 at 8:15 PM\nJust buy it already!\n\nIf you like rick and morty you will love this. It is insanely hilarious and will have you laughing the entire way through.\n\nHelpful | 0", "joeyandchaseJul 5 at 7:36 AM\nTrover saves the universe\n\nLoved it. A must for any Rick and Morty fan. Hope they make something similar soon \n\nHelpful | 1", "EpicLucas07Jul 15 at 2:18 AM\nMORE DLC!\n\nI am a huge rick and Morty fan and this was a really funny and crazy game and the ending was grate and the dlc please make more.\n\n\nHelpful | 0", "kly3Jun 26 at 12:02 AM\nA good gamble\n\nThis game was purchased impulsively, and Im glad it was. Gameplay is mostly smooth. Fun to jump into. Justin Roiland, thank you.\n\nHelpful | 1", "alecsyntaxJul 2 at 4:46 PM\nI've Hit a Wall with this Game\n\nVirtually, anyway. I love everything about this game: the visuals, the humor, except for one thing: the wall puzzle. I understand what you're supposed to do to make it to the top, but I just can't seem to physically manipulate the controls in a way that works. A certain amount of challenge is great, but It's disappointing to be shut out of the rest of the story/game... give us a way to say, \"Uncle!\" and move on!\n\nHelpful | 0", "lord_luciferJul 1 at 9:58 PM\nGood story, just not a game\n\nThey managed to turn a VR game into a console game while testing out abunch features that becomes confusing real quick.\n\nLol if you can get pass the first 5 mins of the story that sounded like a bad improv you'd get a great laugh out of this \"game\"\n\nI say \"game\" because this more felt like a cocktail of VR features that is bundled together with a funny script.\n\nThis would have honestly been a great anime to watch but play wise you get lots of cut scenes where you'll just be standing and looking at a basically still environment while the motionless characters talk and talk and talk. Some of it is hilarious while others are really just there to drive the storyline so i just wanted to skip it...\n\nOng maybe im supposed to play this while sitting down?!  if so then that would make more sense but still... had it not been the voice actors i'd have returned this game.\n\nHelpful | 1", "poayoJun 27 at 11:05 PM\nAmazing\n\nThis game is hilarious, I've already replayed it and am planning to again to finish getting all of the achievements.\n\nHelpful | 0", "Apophis5006Jul 10 at 9:09 AM\nGreat game\n\nIts a great game funny too. Thats all I have.\n\nHelpful | 0", "YeetusjackJul 5 at 4:56 PM\nNot what I expected\n\nWhen I first got the game I was expecting more interacting like most other vr experiences but this one is different. In this game you control Trover by using a controller. You make him walk around and do various activities with the controller (Fighting, solving puzzles, etc)\n\nHelpful | 0", "TheSharpToothJul 5 at 12:10 AM\nAmazing\n\nGreat humor, and the way it platforms is genius. More like this please!\n\nHelpful | 0", "AwesomeOne5000Jul 1 at 8:17 PM\nDEVS PLAESE FIX THIS\n\nI want to use my Xbox One controller and everything works fine with it but I cant turn the chair with it.\n\nAlso you are forced to look the same way the entire time because the chair doesnt turn with you if you turn in real life.\n\nHelpful | 7", "RyTheFlyyJul 23 at 12:56 AM\nNice game, but super easy.\n\nIt was okay, but the puzzles and battles were way too easy. Even the boss at the end can be beaten easily on the first try. The only aspect of the game that was remotely difficult was finding all of the green power babies. And that is the most tedious part of the game.\n\nHelpful | 0", "mike.orr.14289Jul 1 at 6:52 PM\nTrivet saves the universe\n\nWhat a great game\nLove platform games for VR\nThis one is my favourite so far\n\n\nHelpful | 0", "Takuda77Jun 28 at 5:05 AM\nGreat game but..\n\nSeems to be a great game (from the laughter Ive heard from my teens!!) I havent played yet as the only problem Im being told is the lack of save files, Ive 3 teens and they always switching between their devices and only 1 can play this until its cleared, please developers can a update be added with this included? \n\nHelpful | 1", "fungj0222Jul 1 at 7:32 AM\nBeware of Bugs and Glitches\n\nIm not sure if anyone else has experienced this but as fantastic as the game is, for some reason Ive been stuck on shroomia world and the d-pad doesnt allow me too rotate the TV. And after watching the online tutorials, your supposed to move boxes but for some reason it doesnt move on to that part and the secret staircase does not appear. Any else having these issues?\n\nHelpful | 2", "landenpompeiiJul 6 at 10:03 AM\nMad nice\n\nTons of fun and one of the only swearing games out there for the quest. I do wish that we werent sitting the whole time but it is what it is. Nothing can be perfect. I do wish the green power babies were a little less important. I did love this game tho.\n\nHelpful | 0", "VinnyJ92Jun 29 at 4:27 AM\nHilarious\n\nSo so funny, I've just spend all afternoon laughing untill my quest ran out of battery. Looking forward to going again when it's charged!\n\nHelpful | 0", "0Shade0Jun 20 at 9:12 AM\nA great port bravo\n\nThis has to be one,of the\" few games for quest that keeps you enjoying game play for hour's not minutes.\"\n\n:> A full length game with steller game play, other dev teams take notes, of how a game's story is needed in vr.\n\nAs for the game it self it is for adults only.\n\nFor there is almost the entirety of the game, is mature content such as the jokes and comment's made by npc witch is veary funny yet not child content.\n\nIF you liked rick and morty on tv ,you will love to have this to your collection .\n\nMy copy included the dlc witch is amazing much love keep up the great work look for word to more games like this in the future :)\n\nGame gives you more then 5 hours of continuous game play,\ndlc keep's you playing to see what els you can experience ,\nas it feel's like your in charge of the animation your self ,\nnot once did I feel discouraged with game play mechanics, while feeling like i was a important player,\nin the game you even have head shaking support for saying yes or no ,\nyour yes or no does change the out come of what is said as for the choices in game do matter when you do ,\nsomething differently the game changes its story slightly but stays on track hope every one that want's a good experience with a vr game try's this out .\n\n*Platformer done right 10/10\n*Comedy done right 10/10\n*Game mechanics done right 10/10\n*Graphics well rounded 9/10\n*Story well designed 10/10\n*Replayability gives you options to complete collection 10/10\n*Online play 0/0\n*Rewarding game play 10/10\n*Achievements 10/10\n*Optimized 9/10 early port release due expect some minor issues if at all\n\nWould I refer 10/10 yes if you have a good sense of humor must have\n\nGame has a head tracking mouce point click also you will be having and slashing with your buttons on the remote :) feels so satisfying most iv used my press buttons on the quest controllers by far love it\n\nHelpful | 21", "sethandrewnotoJul 10 at 8:29 PM\nFirst game I played for a full hour\n\nThis game is good probably the only successful vr game\n\nHelpful | 0", "me0w.jpegJun 25 at 6:25 PM\nGame good\n\nI havent played it yet but it looks good lol\n\nHelpful | 32", "OneAuraJul 6 at 5:01 PM\nGreat Game!\n\nIf you havent given this game a chance you should!\n\nHelpful | 0", "i.lowlifeJul 10 at 8:10 PM\nHilarious game\n\n10/10 whats there more to say?\n\nHelpful | 0", "Mitch2RichJul 9 at 12:37 AM\nHilarious\n\nFunniest game i have ever played\n\nHelpful | 0", "KorbinoJul 13 at 5:36 PM\nMm yes\n\nUh huh yes\n\nHelpful | 1", "killswitch333Jun 21 at 5:31 AM\nNot bad\n\nIt was funny, but not as funny as Rick and Morty. Game play was fun, but never great. I'm glad I got it but probably not gonna replace any of it.\n\nHelpful | 4", "tzvika770Jul 12 at 11:07 PM\nFunny funny funny\n\nAnd funny\n\nHelpful | 0", "RickSanchezC-137Jun 27 at 10:42 AM\nVery fun and intuitive\n\nHilarious banter throughout the game with some familiar voices from rick and morty. Best $30 Ive spent all quarantine!\n\nHelpful | 1", "WaterEaterJul 8 at 8:59 AM\nSuper funny\n\nOne of the longer games\n\nHelpful | 0", "r0zbudJun 29 at 8:59 PM\nMust Buy for Oculus\n\ncant recommend this game enough if youre a rick and morty fan\n\nHelpful | 0", "MarchingBrawlerJul 6 at 2:02 PM\nFantastic totally awesome\n\nHilarious but a little pricy\n\nHelpful | 0", "TJDawg07Jun 28 at 1:11 PM\nYay :)\n\nGood game dont know what to say but get it\n\nHelpful | 2", "0fficerMikeJun 29 at 2:05 AM\nRoom for improvement\n\nThis is a must have for people that love humor from Rick and Morty. It's a huge game with a very cool concept. Only one problem, after a certain moment when you throw the bomb out of the capsule the game started lagging and froze.\nBut apart from that, I love it!\n\nHelpful | 1", "Gold_n_BrownJul 9 at 7:49 PM\n\nHilarious !\n\nHelpful | 0", "ultra_bobJun 28 at 1:06 PM\nModerate fun was expecting more\n\nThis was an alright game but tbh was expecting more. The premise was interesting but didn't really lead to much. No real puzzle solving, combat or story. It was fun for a quick game but not mega challenging.\n\nHelpful | 4", "joyconkyaniteJul 2 at 9:50 AM\nGreat game\n\nYou really cant go wrong with this game\n\nHelpful | 0", "StoryBoardMattJun 21 at 8:43 AM\n\n\nHilarious game! But I expected that. Really fun to play and some really funny decisions to make.\n\nHelpful | 1", "deadryJun 18 at 12:27 PM\nYup\n\nHave it on switch cant wait to play in vr ......just waiting for it to download ...but all around good game..\n\nHelpful | 1", "Macchiato_ry6 days ago\nImmediately knew I made the right choice\n\nIm about an hour in.\n\nIf youre a fan of Rick and Morty than you will like this a lot. If you are not a fan than you will like this a lot.\n\nGreat handles and concept.\n\nVisuals are not bad.\n\nStoryline so far is great.\n\nYou can choose to censor the Language.\n\nDifficultly feels just right.\n\nHelpful | 0", "jb373usJun 26 at 6:29 PM\nAwesome\n\nI love this game, its Hilarious! Please turn up the volume! The dialogue is too low! Thank you!\n\nHelpful | 0", "TexasTerminaterJun 24 at 7:24 PM\nEnjoyed it\n\nIts a fun game and good humor if you enjoy Rick and Morty style comedy. A little choppy here and there and sometimes the dialogue cut out during load screens. Overall enjoyed it and glad I played it.\n\nHelpful | 2", "sandypants23Jun 29 at 10:29 AM\nTrover\n\nGreat game with good graphics and its very funny.\n\nHelpful | 0", "mattias.selinJun 30 at 3:22 AM\nVery satisfied\n\nVery funny and good gameplay tailored for VR\n\nHelpful | 0", "Andrzej_GouldingJun 25 at 5:10 PM\nAwesome fun\n\nA game changer for incidental writing. So much fun just listening to characters talking.\nWell worth it.\n\nHelpful | 1", "WeedmonJun 20 at 4:20 AM\nAnother great game.\n\nAnother great game by the producers of Rick and Morty. Download it you won't be disappointed\n\nHelpful | 0", "Willi_HeidenbergJun 27 at 7:53 AM\nAwesome Experience!\n\nI love the humor the graphics and the gameplay. Awesome!\n\nHelpful | 0", "ItsJustCianJun 25 at 5:04 PM\nFantastic game\n\nGreat sitting experience. Fun and immersive gameplay with funny and interesting dialogue.\n\nHelpful | 1", "burnbunsJun 27 at 2:51 AM\nTrover, you son of a B\n\nThis game is great! Hilarious and chock full of fantastic profanity.\n\nHelpful | 0", "MrdjhJun 23 at 12:39 AM\nFunny Funny Game\n\nGreat game. Laughed all the way through it. Not for the innocent lol\n\nHelpful | 1", "luis.payan719Jun 25 at 7:21 PM\nOh no rick! Shut up morty!\n\nIts like im.controlling an episode of Rick and morty. Sh!t is funny.. keep your kids away!\n\nHelpful | 1", "MILWAUKEESFINESTJul 12 at 3:22 PM\nFear of dying from laughter\n\nThis game is incredibly funny!!! It's fun to explore and the layout of the game is pretty cool. That dialogue tho has me dying soooo fn funny and witty well done!!!\n\nHelpful | 0", "everyday_balloonsJun 23 at 6:04 PM\nTrover Saves The Universe\n\nThis game is awesome it was really fun to play. The ending wasnt my favorite but I get they have to keep it open ended for the sequel which if it come to the quest I will buy as well.\n\nHelpful | 2", "SunshineNurseJul 30 at 6:39 AM\nDark and fun\n\nGreat game. Humorous very dark not for kids or anyone with a conscious lol.\n\nHelpful | 0", "brett.rutecky24 days ago\nFun game\n\nFun game with good graphics, and interesting story and TONS of humor.\n\nHelpful | 0", "eeeeeeeeeeeeezeJun 26 at 8:53 PM\nHilarious and fun game!!!\n\nI loved this game!! Made me laugh out loud.\n\nHelpful | 1", "Skaffen-AmtiskawJun 28 at 4:30 PM\nAwesome\n\nIts a great game. Make more.\n\nHelpful | 0", "justyn44Jun 26 at 1:07 PM\nValid timing !\n\nI got a quest hoping to play this game it wasnt out till yesterday, fire\n\nHelpful | 0", "levi.eslinger.7Jun 26 at 9:59 PM\nGreat\n\nReally fun and hilarious game\n\nHelpful | 0", "RelycSwerdnJun 26 at 9:57 PM\nLoved it.\n\nFavorite quest game by far.\n\nHelpful | 1", "mplattJun 25 at 3:28 PM\nTrover\n\nGreat game play only thing missing is Samuel A dropping the mf Bomb\n\nHelpful | 1", "Gamertag_VRJun 25 at 3:47 PM\nFans of Rick & Morty humour need this\n\nThis is game is fantastically funny in places with great animation and full of character. Cool platformer with standard puzzle moments but the action is very cool and you will unlock upgrades on the way. As for the port to quest from PCVR and PSVR I think its hold up very well. There are some lower textures in places but I this doesnt take anything away at all from the gameplay. I felt right at home using the touch controllers. My first Impression livestream for the oculus quest version is available NOW by searching Gamertag VR\n\nHelpful | 14", "Capital_IJun 25 at 3:07 PM\nThis is fun\n\nAh. Games for adults. Thank you. So funny. Great controls. Thanks!\n\nHelpful | 1", "aj.peters.9883Jun 21 at 10:14 AM\nThe best game on the quest\n\nNow all they need is Rick and Morty virtual Rick allity\n\nHelpful | 1", "PabloSchettinoJun 29 at 12:16 PM\nHilarious.\n\nHilarious.\n\nHelpful | 1", "nbarin13Jun 20 at 11:58 PM\nFun puzzle type game\n\nI love Justin Rolands work, funny and depraved.\n\nHelpful | 1", "benjones03Jun 20 at 9:02 PM\nAmazing\n\nReminds me of intergalactic cable in rick and morty\n\nHelpful | 1", "NeorealismJun 27 at 1:30 PM\nI love this game more than my child\n\nMuch cheaper too\n\nHelpful | 1", "JJpantherJun 27 at 7:21 PM\nTacos are good to eat\n\nPretty fun!\n!\n\nHelpful | 1", "ColdiiJun 20 at 10:06 AM\nSUper DUper\n\nThis game is epic, the comedy is epic, the controls are epic, some visual glitches but like still epic. now Im just waiting for fnaf and gorn then my library would be Gucci.\n\nHelpful | 2", "beauregardenerJun 21 at 2:18 PM\nAlmost all amazing...\n\nGround breaking game with a mix of platform, puzzle, combat, comedy.\n\nI guess the vulgar humor has good moments... but they are somewhat overshadowed by the flippant labeling of random things in the game as racist ...it a clear devaluation of the word by the creators of this game.\n\nBad time for insensitivity like this.\n\nHelpful | 4", "glowmossJun 26 at 12:28 AM\nGreat game\n\nA great game I would recommend to anyone\n\nHelpful | 0", "THEPREDET3RJun 25 at 1:41 PM\nAbsolutely great\n\nFantastic game\n\nHelpful | 0", "louwitcombJun 26 at 2:00 AM\n\nReally good game verry funny would recommend\n\nHelpful | 1", "chaotic_gudJun 20 at 6:19 PM\nHilarious and fun!\n\nGreat gameplay, music, and dialogue!\n\nHelpful | 1", "JasonParmarJun 21 at 10:15 AM\nOMG this is amazing!\n\nThe trailer actually put me off initially. Thought Id be like Accounting, which was decent but not amazing.\n\nThis game though, this is amazing.\nThey regularly break the 4th wall, it feels like theres consequences to actions and the interactivity between you and the Trover is amazing.\n\nThis is how VR was/is supposed to be done.\n\nOne of the very best & absolutely hilarious!\n\nHelpful | 8", "Solarflare360Jun 24 at 4:17 PM\nLove it\n\nVery fun game\n\nHelpful | 1", "Jaelous4720 days ago\nThis is the game you are looking for.\n\nThe game play is brilliant! Just get it! If you are a fan of Rick and Morty, hold on to your pants cause this is going to be one of those rides! Perfect for playing while seated on the couch, it completed the immersion. This is a hack and slash 3rd person action adventure from the perspective of you. Strap in, its time to save the universe! It should also be stated that this game features an entire cast of humorously foul mouth individuals. Not for kids.\n\nHelpful | 0", "luisantninJun 25 at 3:56 PM\nQuest needed this\n\nYou like rick and morty? Try this.\n\nHelpful | 1", "LilBerkyJun 22 at 6:07 PM\nGreat game\n\nIts a great game\n\nHelpful | 1", "LowGun33Jun 25 at 6:18 PM\nHilarious\n\nThis game is so funny and entertaining!\n\nHelpful | 1", "EmtRN77Jun 20 at 1:15 PM\nFunny\n\nI like it 10mins play so far.\n\nHelpful | 1", "JoeRixTheMidgetJun 23 at 1:12 PM\nVery good\n\nI recommend\n\nHelpful | 1", "cdarring5Jun 25 at 1:48 PM\n\nGood and funny\n\nHelpful | 1", "DarkPenny87Jun 27 at 9:46 AM\nGreat game\n\nIt was so funny I loved it\n\nHelpful | 0", "NonojoubertJun 21 at 9:46 AM\nExcellent\n\nExcelkent\n\nHelpful | 1", "Hicksy01Jun 20 at 11:13 AM\nAmazing\n\nAmazing!!!\n\nHelpful | 1", "Criss1Jun 25 at 6:18 PM\nBug - shroomia world\n\nI positioned the tv in front of character but does not allow to continue.\nI tried to leave the tv in different positions but still :[\n\nHelpful | 8", "Aaronb3434Jun 29 at 4:07 PM\nCool\n\nGreat game!\n\nHelpful | 0", "ParadiseDecayJun 25 at 2:25 PM\nI played with a REAL Swear Box!\n\nImpressions Video with Commentary + Swear Box:\nhttps://www.youtube.com/watch?v=AOwf19tLO1Y\n\nMy Initial Impressions:\nA superb addition to the Quest and I cannot see any differences with this port and the PC version.\nI am constantly amazed at the quality titles appearing on the Quest, which is turning out to be one of the most versatile and accessible VR headsets.\n\nHelpful | 8", "CH33CKCL4993R_2Jun 20 at 8:08 PM\nFun game didnt get to in joy\n\nI have really bad drift on my controller so I didnt get to have a whole lot of fun. When I ask oculus support there best answer is to buy another 70$ controller. LMAO\n\nHelpful | 2", "stoffel.bollu.9Jul 24 at 11:26 PM\nHilarious\n\nIf you werent a fan of Justin you will be after playing Trover. The never ending f*****g dialogues are hilarious!\n\nHelpful | 0", "imxppJun 25 at 3:25 PM\nSimply amazing\n\nIf your a Rick and Morty fan don't even keep reading this and just download it it's just amazing and hilarious well atleast for me but if u don't like dark humor or stuff like that don't play cause this is all the game is but other wise this game is completely amazing I mean like 9. 5/10 in my opinion there is a ton of stuff to do funny characters and a good storyline so I highly recommend you buy this rn\n\nHelpful | 6", "LegacyCliffy4 days ago\nHilarious and Challenging\n\nI didnt know I could be laughing in the middle of an awkward puzzle, rly great humor and quality graphics with incorporating the role in rpg very well. I want another one!\n\nHelpful | 0", "01kingjJun 30 at 3:01 PM\nNot cross buy.\n\nBest fun and most addictive game I've played... not for little ears.. but hilarious if you like Rick and Morty. :-)\n\nGet it.\n\nHelpful | 1", "Ommmm_2486Jun 27 at 11:15 AM\nClunky navigation and meh gameplay\n\nI didnt enjoy the navigation of this game. To me, using a game controller to move around a VR world defeats the purpose. Also, to me the tasks were a little boring.\n\nHelpful | 3", "sj_7722 days ago\n\nStupid thing scammed me I paid for it and then downloaded it but it wouldnt go through\n\nHelpful | 0", "ChadbaccaVRJun 25 at 5:52 PM\nLove this style and humor!\n\nI have played this on the Rift S and now will be playing again on the Quest! I love this gameplay and everything about it! Can't wait for more just like this! Thank you for bringing this to the Quest.\n\nHelpful | 10", "BrianBeahmJul 18 at 12:15 PM\nSuper good game!\n\nEver wanted to be immersed in the rick and morty universe? Well here's your chance!!! It's really easy to see why this game has almost a solid 5 star review. It's hilarious and tons of fun! You can play it seated really easily which is pretty nice and id actually recommend playing it that way! Kick back relax and laugh, solve some weird puzzles and fight some weird creatures!\n\nHave fun!\n\nHelpful | 0", "charles.james.507Jul 5 at 3:44 PM\nGreat game.\n\nThe game play and concept are cool. The resolution is a bit glitchy.\n\nHelpful | 0", "Nusbaum82Jul 14 at 11:29 PM\nWonderfully done\n\nAnother great game by brilliant artists of comedic genius. Truly a game your grandmother will love, and your children will model their entire lives around. I hope these guys keep putting out instant classics like this one the enrich the lives of all that are blessed with its glory. Thank you for giving life meaning in a time when we all sit in the vacuum between seasons of Rick & Morty, waiting for something to make us smile again.\n\nHelpful | 0", "Dr3w5k1_316Jun 21 at 6:13 AM\nTROVER SAVES THE QUEST!\n\nIf youre a fan of Rick & Morty...or just have a sick and warped sense of humor, you will truly enjoy this game! One of the best that I have played in Oculus Quest and one that I was hoping would port over! Lots of fun and well worth the investment!\n\nHoping to see more excellent games like this ported over your the Quest!\n\nHelpful | 3", "WalkNStab18 days ago\nHilarious\n\nThis games fun and it's hilarious. I spent way to much time trying to score paper baskets in the spaceships trash. Weirdly addicting! I love Rick and Morty and this was a good find!\n\nHelpful | 0", "markieburtonJul 14 at 1:16 PM\nLaughter & Joy unlike any other game out\n\nI've been wanting a game that takes me out my reality and puts me into a much more funnier one. I'm a sufferer of depression and the laughter I get from this game is unlike any other in my quest library. I love everything about this game. I wanted to buy this on sale, but my anticipation got the better of me and I bought it at full price. Not disappointed in the slightest. I would say if this game ever does go on sale, it would be a steal, cause it's worth every pound I paid. I've heard of the longevity this game offers compared to accounting+ so I knew where my money was going straight away. The only thing missing is probably a new game+ or some other kind of replayability add-on to extend its life because once I beat it there might not be an excuse to return at least not while my mind's fresh with the game.\n\nHelpful | 0", "SheenOMackJun 20 at 12:45 PM\nBest game on the quest\n\nAlways been a huge Rick and Morty fan. Love the show and even have collectibles from it. Been waiting for this game to come out on quest and was excited when i saw it. Bought it immediately. As of right now, it is easily the best game on quest. Its by far the longest story game on the quest. Giving you hours of gameplay and even comes with free DLC for even more hours of fun. Definitely a must by, especially for a Rick and Morty fan!\n\nHelpful | 3", "Spongeycraft19 days ago\nOne of the funniest games Ive ever play\n\nI havent played much of it but already its one of my favorite quest games. Great graphics, great voice acting, fun gameplay, GREAT HUMOR. Get this game. Its a must buy\n\nHelpful | 0", "bluepiggy186 days ago\n10/10 game, would recommend\n\nThis is one of the best games Ive ever played and I would recommend it to anyone with a mature sense of humor\n\nHelpful | 0", "michael.b.baumanJul 2 at 11:45 AM\nLoved it\n\nA must have for any Rick and Morty fan!\n\nHelpful | 1", "ZMachine21Jul 5 at 12:36 AM\nOne of the best casual games out there\n\nPokerstars was down and I wanted to just sit and play a game...I literally became the chair sitting main character. It is not a slash and dash fighting game but it gives a 2d video game feel in 3d and it was sweet.\n\nHelpful | 0", "BruhWatrrJun 21 at 9:58 PM\nCan't help but laugh constantly\n\nA combination of humor and clever game mechanics mesh well in Trobler Saves The Uniburse. In Trogler Saves The TruneTrurse, the small things go a long way. Simple little details always make me laugh, wether it's the purposefully unprofessional aspects of the game, or just how troler acts. This game is a must-have for any Quest owner.\n\nHelpful | 1", "ifishalot2Jul 5 at 8:50 PM\nNot bad\n\nFunny game\n\nHelpful | 0", "Darkfury1Jul 5 at 10:38 PM\nFunny as he11\n\nSeriously is is the kind of stuff Id expect from the makers of rick and morty its all funny stuff to laugh at even when theyre trying to guilt trip me about killing a guy who threw poop at me me killing all those women was doing them a favor its mercy killing but I love this game its fun and entertaining sad I have to kill the rick voice actor whos playing as the clones wish he was the va for trover but hey games still fun either way\n\nHelpful | 0", "TrlpPJun 20 at 5:50 PM\nFunniest game for VR Period!\n\nI never thought that this would come to the Quest and when I went looking for whats new and saw it, I couldn't have hit purchase any faster. This is the funniest, high quality adult game there is. The dialog is exactly like the Rick and Morty you know and love, but the best part is that its not on repeat. Just sit there listen to the NPCs talk and they just keep on going with hilarious dialog. The game itself isn't very difficult, but you dont play it for the challenge, you play it for the funny naritive. The game is surprisingly long if you try to get all the green power babies as well.\n\nHelpful | 2", "TheBungersJun 20 at 2:08 PM\nFunniest VR Game on the Quest\n\nAfter watching the trailer I knew that this game was a must, and I boy was that an understatement. There arent that many Funny Quest games so there wasnt a bunch of tough competition but by far this is the best puzzle game in my opinion and obviously the funniest VR game I have played ever. You will not regret buying this, and if you want a more appropriate approach so Younger audiences can play, there is a censored mode in game. Pls take my word for it, this game is interactive, fun, hilarious, and a must have!!!\n\nHelpful | 2", "BlazingAsteroidJul 16 at 9:49 PM\nGreat, creative, and hilarious\n\nFunniest game on quest and its comedy is really simple but very funny. Levels are super fun, its a cool way to control Trover and I love how it has a mature and censored version. If you love Rick and Morty youll love this.\n\nHelpful | 0", "oscar111222Jul 5 at 2:42 AM\nGreat game but the sound...\n\nThe game is great but the sound is ridiculous low, I will change to 5 stars when fix...\n\nHelpful | 0", "brooksyboyJun 26 at 4:25 AM\n\nGood and different\n\nHelpful | 1", "BananaPoet14Jun 27 at 10:05 PM\nRed Rover,Red Rover,Send Trover on Over!\n\nThis game is FANTASTIC! This had me laughing the entire time. If you are a Rick and Morty fan, you will love this game! If you are familiar with the way Moss plays, it has a similar platform. The length of this game is also fairly decent and I loved the relationship you develop with Trover. This is by far one of the most interactive games I have played on OQ. I hope the creators of Rick and Morty make more games! What are you waiting for?!? This game has a ton of good reviews- buy the game and get playing!\n\nHelpful | 0", "dylan.m.993 days ago\nGreat game\n\nGreat game very addicting\n\nHelpful | 0", "iseeufosJun 27 at 10:33 AM\nLoved it!!!\n\nFinished it! Loved it! Still have to go back and get the rest of the power babies though.\nThis game is the standard of what Oculus game play should be! Smooth game play, no glitches and well thought-out. Good job on this one guys! Love how the Trover voice over starts laughing at one point in his rant haha classic!\n\nHelpful | 0", "jd.biancottiJun 26 at 9:50 AM\nWOW WOW WOW\n\nI always always hated platform games, but this!?!? THIS!?! This is a masterpiece! This is so much fun, and doesnt feel like you will burn out on it after a few days of play! So much gross out humor, so much action, and a great experience being able to watch trover get angry when you dont go where he wants you to. This is my first review, and its 5/5. My new favorite VR game.\n\nHelpful | 0", "Alyssa.K14Jun 26 at 4:01 PM\nIncredible\n\nThis was the first game I purchased and played after receiving my quest and it was amazing. Im genuinely worried no other game out right now will compare to this. The humor was perfect and the game itself was really fun to play and it was easy to understand as a new VR player. I really hope they make a second part! It took me a full day to complete even though online it says 3-5 hours but thats probably because Im not experienced in any sort of video gaming.\n\nHelpful | 0", "JustinsullivanJun 21 at 10:51 AM\nFirst Full feature VR game!\n\nEvery Quest experience is disappointingly short. This game is actually complete! Character power ups full story line. The game gets increasingly complex. Love it and hope more studios follow suit in putting the time in to make the game complete.\n\nHelpful | 1", "WelchFruitSnacksJun 25 at 6:10 PM\nWhy Are You Reading The Reviews?!?!\n\nDont have second thoughts about buying this game definitely not for younger kids but Im at 12 year old and I think people my age can handle this its just such a fun and funny game if you understand the stuff they are talking about so thats kinda why younger kids wont understand it that much anyway what Im trying to say its just a amazing game buy and try it yourself and youll love it! No Cap\n\nHelpful | 0", "eborquezJun 24 at 11:46 PM\nHilarious\n\nFound myself laughing out loud. Its longer than accounting + and requires a bit more concentration - youll need to be moderately sober. I very much appreciate having the option to play a censored version for the kiddies to try. I am about 2/3 of the way through and dont want it to end. Hopefully they can shoehorn rick and morty onto the oculus platform too.\n\nHelpful | 0", "VectorCollectorJul 8 at 4:16 PM\nGotta catchem all\n\nOne of the coolest games I played, specially if u like Rick n Morty, but if u don't, ull probably love it too.\nI just don't think I can catch all the green power babies to see the stuff trover is always saying he'll show me at the end\n\nHelpful | 0", "MirandalabeautJun 24 at 5:09 PM\nWooow wasnt expecting this at all\n\nOk the game is sooo much better then you think it is. Theres a lot of adult humour which i havent seen this much of in any game. Its so cool how you control the little purple dude and upgrade. The voice actors are really funny and the story line is really good. I enjoy this game so much. 100% would recommend this (to adults only)\n\nHelpful | 0", "SyplusJun 21 at 11:24 PM\nFantastic game - great developers\n\nThis game screams creators of Rick and Morty the art design is stunning even on quest. The narrative is intriguing and has very few hard to follow parts. One of the longest VR games Ive played on quest which is great to see and to have everything amazingly rendered is fantastic. For the price of this game it is definitely worth it no doubt about it. So what are you waiting for go buy it!\n\nHelpful | 1", "LittleSloppJun 22 at 2:24 PM\nTrover Saves My Boredom\n\nWhilst in a 4 month long quarantine, Trovers dialogue with the player and life like reactions are exactly what I needed to cure my boredom and fill a little social aspect that was since burned off due to the god forsaken virus. Great gameplay, funny storyline, and interesting environments that keep me staring for green power babies!\n\nHelpful | 1", "bubs.micoleJul 24 at 11:05 AM\nAwesome!\n\nThis game is hysterical! I started playing it and next thing you know its almost 2 hours later! I would definitely recommend this game\n\nHelpful | 0", "BlueEyes300Jun 25 at 12:49 AM\nIts subtitled!\n\nThis is one of the best game ever I was cracking up as I was playing the game... they have censored and non censored and I tell you what it is so good and its funny. Mainly for mature audiences. If you like twisted mind game with full of curse word lol this is for you! GET IT!\n\nHelpful | 0", "nishruu2Jul 10 at 9:26 PM\nHahhahahahahhhaaaa\n\nfun\nbut yes nicely demented; adult language, if selected; you can censor if you need.\nanother good experience for sitting, and Trover does help, and never shuts up but its part of the experience.\n\nHelpful | 0", "SourSirwinJul 22 at 4:42 PM\nGreat game\n\nIts like a Rick and Morty Fever dream... or an acid trip. Yeah, yeah definitely the 2nd one. Also squanch games BRING BACK RADICAL HEIGHTS!\n\nHelpful | 0", "joyjones1Jul 20 at 2:05 PM\nInsane\n\nPerfect for Rick and Morty fans...plus it has two versions, one for adults and one for kids..idk why it only was a 4.8 star rating...I give it a 5\n\nHelpful | 0", "BlazeScream711Jun 23 at 5:39 PM\nTrover is simply fun\n\nThis game is mix of irreverent humor, engaging story telling, and fun game mechanics. The puzzles are challenging to solve without being frustrating. The fight action is hack and slash goodness with a nice mix of combos and just enough difficulty to keep you on your toes. Oh and if you are a Rick and Morty fan the tone of this game is fun and familiar. Do yourself a favor and get this game, play, and enjoy. It takes full advantage of the uniqueness of VR gaming without feeling gimmicky. One last thing...parents, this is NOT a games for kids. There is cussing, swearing, and very adult humor. Sure there is a censored mode you can turn on, but lets be honest, the context still makes it clear what is going on and would not fool anyone over 10. Other than that little PSA, this game is ridiculous fun, get it.\n\nHelpful | 0", "FulgurataJun 25 at 2:41 PM\nExactly what it promises\n\nKinda feels like Morty without Rick wrote this thing. It's funny, but not Rick level. It does have multiple layers and lots of easter eggs. Definitely good for consistent laughs. Decent VR gameplay designed to be played from a chair. Gets 5 stars from me because of it's excellent quality. 0 bugs and makes me laugh as promised.\n\nHelpful | 1", "JoeMuniiJun 22 at 2:16 PM\nTrover Rules!!!\n\nThis game is totally top teir! The game plays smooth, with really good concepts and graphic artwork. It look a bit kiddie, but don't be fooled, this is definitely a PG13 game due to the language and content. This will definitely be a game that keeps you hooked and so worth the price.\n\nHelpful | 1", "TravobanavoJul 29 at 2:57 PM\nAwesome game\n\nAwesome game, definitely hilarious. Only thing is the view from the chairorpian is sometimes not in the right place. The view usually puts me a little low in the characters belly. Its not a big deal, just kind of annoying. Other than that, its really fun to play. Hard to put down.\n\nHelpful | 0", "siferxJun 25 at 2:28 PM\nTrover\n\nSuper fun game love the voice acting you really can't go wrong with this game 17+ it's worth every penny give it a shot you won't regret it.\n\nHelpful | 4", "DimotroscovtichJun 23 at 10:16 AM\nAmazing game\n\nLike everyone else here I highly recommend this game. The humor isn't that clever like Rick and Morty but it's still enjoyable.\n\nThe levels are fun and well made and the game play is very fluiend.\n\nThis is one of the better titles you'll find on the quest.\n\nHelpful | 0", "Howlingwolf443Jun 25 at 4:41 AM\nSimply beautiful\n\nI cant get enough of this game, I just finished it and I just want to keep playing it over and over and laugh just as much as my first playthrough this game is a masterpiece and is easily a favorite of mine I really recommend it to anyone\n\nHelpful | 0", "Frenchmoco21 days ago\nFunny game\n\nFun game full of Rick and Morty style humour\n\nHelpful | 0", "BitingBunnyJun 26 at 2:07 AM\nAn amazing and hilarious game\n\nIve been a huge fan of rick and morty for a while now, and this game is absolutely great. Its funny, charming, and challenging enough to be fun. Also, it has Justin Roilands voice acting, and thats always a plus.\n\nHelpful | 0", "L1TTYJul 11 at 2:02 PM\nIt's just fun\n\nI love the show Rick and Morty and I've wanted to try this game for a while. It's surpasses my expectations and is just straight up a blast to play.\n\nHelpful | 0", "SlurmHD25 days ago\nHilarious\n\nCant stop laughing whenever I play this game\n\nHelpful | 0", "BongmitzvahJun 21 at 11:27 PM\nBest game on the quest!\n\nMy husband and I's favorite game! There's so much to do, and the adult humor makes it really entertaining. The developers knocked this out of the park! If you're wondering whether you should get it or not, just freaking get it!!\n\nHelpful | 0", "CatKing5Jul 17 at 9:22 AM\nHilarious\n\nSo so so so so so funny. Great gameplay and the graphics are great too! Did I mention how funny it is?\n\nHelpful | 0", "brundIefIyJul 20 at 11:15 PM\nOne of the best games Ive played\n\nNot just in VR but period. The writing is hilarious and the visuals were perfect\n\nHelpful | 0", "frida.berlinJul 26 at 2:54 PM\nbest game ever\n\nso sad the studio had to close!! want more of this!!\n\nHelpful | 0", "mkrajeski09Jun 20 at 1:11 PM\nAnother Hilarious Adventure\n\nThis is definitely a top pick for me. Justin Roiland does an amazing job. Of course with his sense of humor and improv nature, is Rick and Morty Esq nonsense. A must if you are gathering a greatest hits library!\n\nHelpful | 0", "Beastslayer14-Jul 16 at 12:50 PM\nYou need to get this\n\nThis game is hilarious and the amount of choice you have is in real!\n\nHelpful | 0", "shloobyJun 25 at 3:25 PM\nHilarious\n\nA lot of very dirty humor. Not for kids, but hilarious for adults. The actual gameplay wouldnt be that great on its own, but paired with the irreverent Rick and Morty style humor, this is a winner!\n\nHelpful | 1", "Adopted_ChihuahuaJul 7 at 2:13 PM\nLove it\n\nLove the game it made me laugh so many times probably one of my favourite VR games of all time would recommend\n\nHelpful | 1", "wgdJun 20 at 10:44 AM\nFun and Funny\n\nOther game developers need to learn from what these guys are doing. They are delivering quality entertainment in the form of a well crafted game. I have never enjoyed being insulted so much.\n\nHelpful | 0", "damianmoreno2009Jun 25 at 4:45 PM\nCool\n\nMy favorite things about this game is that you could nod you head and say yes or no and the maps are so cool its the best\n\nHelpful | 2", "Matrix304Jun 24 at 8:33 PM\nAmazing\n\nI cant believe how shocked I am with this game its incredible.\nIf youre that person who has that sense of humor.\nI definitely recommend this.\nIts awesome!!!!\n\nHelpful | 0", "xevious22Jul 20 at 7:49 PM\nFun game\n\nFull of humour and surprising elements\n\nHelpful | 0", "LanzaroteDazzlerJun 23 at 10:14 AM\nHad to finish the game\n\nGreat game very entertaining start to end would like to see more.\n\nLove Rick and Morty so had to get it maybe we could have a update to see Rick and Morty within the game.\n\nHelpful | 0", "Bless1103Jul 15 at 6:50 AM\n\nI love this game to the fullest absolute favorite of all time\n\nHelpful | 0", "poetic_is_hereJun 24 at 4:30 AM\nSimply amazing\n\nCan't put this game down. As soon as I tell myself I'm going to stop, I play for longer. Dialogue is hilarious, gameplay is great, and game is an overall delight.\n\nHelpful | 0", "DaKrausJul 20 at 1:44 PM\nMasterpiece\n\nOnly one word: Masterpiece!\n\nHelpful | 0", "GogebatJun 23 at 8:49 PM\nTrover, Trover come on over!\n\nI never thought a VR Platform could be so bad@$$! Not to mention its hilarious! This is the apex of VR gaming and I hope we get more! Wubba Lubba Dub Dub!!!!!!!!!!\n\nHelpful | 0", "jose.ballesteros.884Jun 22 at 7:24 PM\nHilarious!\n\nI cant say enough about this game. This is a must have! Sometimes I take too long solving puzzles because I cant stop laughing! The dialogue is simply brilliant!\n\nHelpful | 0", "KingCooperchuJun 23 at 8:46 AM\nSo FUNNY!!!!!!\n\nGreat game with great mechanics. Would like to be able to have different saves so my Bros can play without ruining my progress, but other than that it's amazing!\n\nHelpful | 0", "bmkippJun 26 at 8:05 PM\nGreat game!!!\n\nThe game is beautiful!! Graphics are outstanding, gameplay is unique but on point amazingly, and the dialogue is hilarious!, 5 stars for sure!!\n\nHelpful | 0", "Crusader16Jun 21 at 2:09 PM\nFunny as hell\n\nHoly f$&@ whoo weee Ahaha this game is crazy Mann this game is awesome for Justin roiland fans and Rick and Morty fans this he got me laughing through the whole game.\n\nHelpful | 1", "agitokazuJun 24 at 11:47 AM\nEntertaining!!!\n\nSo Far I've enjoyed all of Justin Roilands VR titles\nThis one hits the mark as well :) it's super hilarious & lovin the Mechanics\n\nWorth the purchase\n\nHelpful | 0", "Majestic76Jun 25 at 2:55 PM\nAMAZING!!!\n\nI love Trover just an all around great twisted hilarious game!!! I would give it 10 stars if I could.\n\nHelpful | 2", "TheSuitedCombineJun 25 at 2:42 PM\nGreat Game\n\nSo glad to see a quest port\n\nHelpful | 4", "PoisonMonkeysJun 24 at 7:52 PM\nGreat game\n\nIf you like Rick and Morty youll probably enjoy the game. Its definitely not for kids. Its extremely vulgar, but in the best of ways.\n\nHelpful | 0", "TanixKingtonJun 21 at 8:13 AM\nUpdate\n\n...after playing some more I must switch from 4 to 5. the Jones are top notch ^^\n\nHelpful | 2", "IhrieJul 2 at 10:30 PM\nQuite enjoyed\n\nA fairly bog standard third person Platformer, but well done just the same. The primary draw is if youre into the humor. Much like Accounting + for example, But unlike Accounting + there is an actual game not just an experience.\n\nI enjoyed the game and experience overall and this quest version is an excellent port.\n\nLooking forward to finishing up the ICJ section.\n\nHelpful | 0", "EDDYTIMEJun 21 at 5:48 PM\nHilarious\n\nLove the game and the mechanism great for when you feeling to tired or lazy to stand haha. Graphics are nice and there's a decent amount of replayability.\n\nHelpful | 0", "KronosGaming123Jun 25 at 2:33 PM\nHave problem\n\nI keep try to install but gets stuck at 3.26 Gb\n\nHelpful | 3", "bengood268Jun 25 at 2:52 PM\nsweeeeet\n\nAMAZING!!!!!!....finally a game that feels like a complete game. add Rick & Monty humor and youve got pure excellence!!!\n\nHelpful | 0", "Lightning_LiiJun 22 at 7:23 AM\n11/10\n\nIf you love single player games like Zelda or GTA and happen to watch Rick and Morty then you will 110% love this game, worth the money.\n\nHelpful | 0", "TorsionaljarlJul 16 at 11:57 AM\nI like chi\n\nI like chicken\n\nHelpful | 0", "ElebekJun 28 at 8:53 AM\nPolitical opinions\n\nThe game is well made, didnt glitch at all. It's too short, like most things justin roiland makes (i.e their 8ep long seasons) but I consider that more because of the memory limits of the oculus. There is a setting to turn off profanity but clearly for the comedic effect you want that on. Not for kids, very crude and lude. Very funny if you like spontaneous wit-a-cism and purposely obnoxious characters that incoherently curse. Like always they have nailed their art theme. By the end you probably will be burned out by the repeating jokes like \"get a job\" very well made though a little obnoxious to play because of the repetitiveness. The fourth wall gets played with alot making hilarious interactions.\n\nHelpful | 1", "Cap3taJun 23 at 4:20 PM\nGreat Funny Game\n\nThis game is way better than I expected. Dialogs are incredibly funny.\nIt is one of the best games I have played on Quest.\n\nHelpful | 0", "IchibanJohnJonJun 26 at 1:37 PM\nGreat Title\n\nThis is a great use of VR platforming. The comedy is great. The Rick and Morty team can make a ton of these.\n\nHelpful | 0", "DaveSmithinJun 25 at 4:08 PM\nExtremely well executed.\n\nThis game is phenomenal the comedic value is great! In the third person through first person view play out very effortlessly. 5 Stars easy.\n\nHelpful | 1", "MR_POPSICLESJun 27 at 8:57 PM\nThe best paid for app ive bought so far\n\nThis game is hilarious, super fun and enjoyable if youre a rick and morty fan youll enjoy this game\n\nHelpful | 0", "bondotronJun 27 at 5:03 AM\nAmazing Game\n\nThis game is worth every Penny. it so funny and I need more of Justin Roland content in my Life !\n\nHelpful | 0", "private.fatbody1976Jun 20 at 3:26 PM\nAmazing\n\nVery fun game. Its almost like a crudely humorous Moss. Very minimal glitching if any, very interactive and just downright fun!\n\nHelpful | 0", "liquidmindJun 24 at 3:38 AM\nSick game!!! Love it!\n\nI am not that much into platformers but this is gold. Super funny if you like Rick and Morty style humor.\n\nHelpful | 0", "FIXITMAXJun 28 at 10:36 AM\nAmazing platform game\n\nTrover saves the universe is an awesome game that I do not regret purchasing at all.\n\nHelpful | 0", "BeachLifeJun 20 at 11:37 AM\nFun as Heck \n\nLove the quest! This game is unique and just great from the first time you hit play!! Its funny and just fun to play!!!\n\nHelpful | 0", "dreemrJun 22 at 12:27 PM\nAbsolutely amazing!!!\n\nThis is the most creative, fun, funny, and enjoyable VR game experience! Nothing like it, you have to get it!!!\n\nHelpful | 0", "hisirlaterJun 26 at 8:53 AM\nGreat game\n\nIts a great and funny game but I hade trouble doing the level but thats why its fun\n\nHelpful | 0", "AwesomeIan24Jun 21 at 9:10 AM\nMy favorite game\n\nIve played like 39 minutes of this game and I can already tell its going to be my favorite game on the quest.\n\nHelpful | 1", "D-2007Jun 25 at 4:52 PM\nHilarious\n\nThe quest needs more funny games like this! Hopefully more from these developers in the future and Im not even done yet!\n\nHelpful | 1", "Aqua-VRJun 21 at 3:21 PM\nFunniest game on Quest\n\nGreat platformer game. I've never watched Rick & Morty, but if it's this funny then I've been missing out.\n\nHelpful | 1", "rob1_Jul 4 at 4:50 AM\nthis is the reason why i got a vr\n\nyou cannnot go wrong with justin roiland\n\nHelpful | 0", "EpicZebra68Jun 21 at 2:06 AM\nTrover\n\nBrilliant game so fun with up close fights\nIt is the funniest game I have ever played \n\nHelpful | 0", "Bear_MilkJun 23 at 5:38 PM\nSUPER FUN\n\nAwesome game, and hilarious. You should totally get this game, it is worth every penny.\n\nHelpful | 0", "Jovr21eJul 1 at 3:52 PM\nIf you like Rick and Morty\n\nYoull love this game its weird and funny.\n\nHelpful | 0", "Satanic_EntityJun 25 at 2:31 PM\nBest game out for quest\n\nYou read the title. GET A JOB!!!\n\nHelpful | 2", "bloxnet56Jun 24 at 2:40 PM\nThe story line is great\n\nIts so find out and funny I would bye it for any rick and morty fans\n\nHelpful | 0", "matthewbialecki11111Jun 25 at 4:36 PM\nAwesome\n\nThis is an incredible and hilarious game that I recommend 100%. I also prefer playing it uncencord.\n\nHelpful | 0", "BIackfaceJun 22 at 6:25 PM\nGreat\n\nExcellent game. Well worth it. Tried it for pc, its definitely worth the vr.\n\nHelpful | 0", "jayisspillz94Jun 27 at 12:19 AM\nnear a perfect port.........pump up\n\nTHE VOLUME!!!!!!!!. other than than magnificent.\n\nHelpful | 0", "bigjerm199778Jul 3 at 10:08 PM\nCrap\n\nThis game truely sux. Nuff said\n\nHelpful | 3"]