{"App Title": "Ultrawings", "App description": "In Ultrawings, you'll pilot multiple aircraft using your virtual hands to interact with the flight stick and instruments to complete tons of missions while soaring around beautiful islands.\n\nKey Features:\n\n- Pilot 4 distinct aircraft each with their own handling characteristics!\n\n- Soar around 4 unique, beautifully-stylized islands!\n\n- Earn money to buy new airports and new vehicles! Ultrawings is a VR game with REAL progression!\n\n- Tons of gameplay variety! Pop balloons, participate in thrilling air races, fly through score rings, and even perform emergency landings! Ultrawings is the ultimate hobbyist flight game!\n\n- Full VO support guides you through the game!", "Purchase section": "$14.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Flying, Simulation", "Languages": "English, English (US), Chinese (China), French (Canada), French (France), German, Japanese, Spanish (Mexico), Spanish (Spain)", "Version + Release Notes": "2.02", "Developer": "Bit Planet Games, LLC", "Publisher": "Bit Planet Games, LLC", "Website": "https://bitplanetgames.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Space Required": "1.12 GB"}



["5 stars\n52%\n4 stars\n27%\n3 stars\n8%\n2 stars\n5%\n1 star\n9%", "Captain-DiabetesJun 26 at 8:21 PM\nFinally, a flying game\n\nWaited a long time for a flying game to come to oculus quest store (I know about other games with link), makes everything so much easier. This game is just good, has the progression, the free flight, 4 planes and 4 maps at 15$, OH YEAH, we flyin for hours. The blocky surrounding feel comforting even if its not semi-realistic graphics, pushing buttons and twisting knobs is easy and can always do it first try (just go slow and dont rush). Flying is easy even if youve never flown.\n\nOne thing to help new players, CHANGE THE CONFORT MODE, the awful default mode needs to be changed, I personally use no, but medium works well too.\n\nGreat game, replayable just to fly around for fun.\n\nHelpful | 29", "Pheckless14 hours ago\nUltrawings\n\nThis game is worth the money. When you get started and you see the helmet you should have a pointer i one hand. Point to highlight the helmet and pull trigger. You are in the game and it will tell you the rest. You have to start out with ultralight and do missions to get cash to get the other planes.\n\nFor those that have a hard time with controls I recommend when you are setting up your stationary play area, scoot forward a couple inches. Then the controls will be a little easier To operate as you sit back to normal position\n\nThe reason I only give 4 stars is that the developer contact in FB thinks there is a glitch that is preventing me from getting 100%. The issue is with the ALERT missions. After completing all golds I noticed one of the Alerts showed Silver. No matter how many times it congratulated me for getting gold, when i went back to see, it would only show silver. I reset the whole game and same thing happened with a different Alert mission. THIRD RESET I left one regular mission undone and verified all the others, including Alerts, were showing gold. Finished last mission with gold, went back and it registered gold, no 100%. Looked through other missions and ONE OF THE ALERTS CHANGED TO SILVER. Trying one more time and be satisfied with the glitch.\n\nHelpful | 0", "dueddelJul 11 at 11:36 AM\nAlltime favorite !!1!111!one!1eleven!111\n\nI own the Quest since June 2019 and Ultrawings was one of the very first games I purchased.\n\nThe game MAY look simple in terms of graphics and it MAY seem to be kinda limited in terms of content (four planes and four islands, up to now no content updates).\nBUT the FEELS are AWESOME. And they're totally worth the buy.\n\nWhenever I pause playing games on the Quest due to my work load and/or because of my responsibilities for my family my Quest \"gets dusty\" for several weeks.\n\nAs soon as I start using the Quest again (after weeks) to play games I already own or even to play new games, I almost always come back to Ultrawings. Flying over the islands and earning some in-game money on the missions is just too addicting for me.\n\nI can't leave any other words than those that the feel of flying and the sense of height are incredibly \"real\". The controls and the handling of the aircraft are also totally fine to me and they feel \"realistic\".\nSome minor difficulties on starting the engine or some minor bugs (sometimes in the cockpit there is still the laser-pointer in the pilot's hands) and the low-poly environment models without that much detailed materials/textures are no actual deal for me. The fun prevails everything by far.\n\nTo sum things up:\nUltrawings is still my absolute alltime favorite despite the non-realistic look (sounds much better than saying \"bad graphics\"). It's no simulation, it's a fun VR experience with partially challenging missions.\nI love it and I do so for more than one year now (as of writing this it's 13 months already I am sure my love will go on a bit).\n\nNo doubt, there is room for some improvements and bugfixes and some more content. But I can't help, it's too good for me personally to give less than 5 stars. Flying in these planes just feels too great. It's exciting, thrilling and in the end it's some sort of freedom in a box.\n\n\nThumbs up! \n\nSidenote:\nThe game is definately nothing for people getting motion-sick easily in VR.\n\nHelpful | 12", "frankie.rjo4 days ago\nReally good\n\nThey are not that many flying games on oculus quest that is why I bought it but I got caught on a train of entertainment I started playing at 11 am the time when so fast its was 1 all of the sudden\n\nHelpful | 0", "Taikung940Jul 16 at 4:54 PM\nEpic\n\nEpic\n\n\n\n\n\nWell, not really, for me itd be a great feature if theres height settings, since my brother who is about 130cm (42) couldnt get up high enough without standing but the rest is good.\nJust one lil feature.\n\nHelpful | 4", "DrNeevil9 days ago\nI love this game!\n\nI keep coming back to this game. I've put many hours into it and I can't see myself getting bored of it.\n\nThere's great progression with 4 aircraft that handle quite differently that you unlock by doing challenges of increasing difficulty.\n\nIt took me a little while to realize that I could go back to previous islands with new planes to get easier missions.\n\nAt first it may cause motion sickness if you don't have good vr legs. Once your comfortable, it's much better with the comfort view turned off and controls on simulation.\n\nIf you like flying games, definitely get this!\n\nAlso: I have no trouble turning on the fuel and I like the art style\n\nHelpful | 0", "MinisterofDOOMJul 23 at 6:26 PM\nLots of fun--lots of comfort options\n\nI use my Quest with Oculus Link for PC Flight Sims frequently, but I still find myself booting up UltraWings very often.\n\nI like that the comfort and control options are both independently configurable across a good range of preferences. I play in least comfortable mode with Sim-style controls, and it feels entirely natural. Interaction and flight controls make a lot of sense, and there's really no \"wait, what was this control bound to\" even with the more advanced controls. The visuals are not exactly gorgeous, but they are absolutely fine and the art style means the Quest can run this fine without detracting from the experience. I don't find myself missing high-res detailed cockpits in UltraWings, because I'm having too much fun soaring--untethered whereever I happen to be.\n\nAlso, bonus points for supporting cross-buy. I rarely feel a need to use Oculus Link for the Rift version simply because the Quest version is already great, but it sure makes it more flexible to more play styles and setups.\n\nMy single complaint: For some reason, I can't get the grab-and-twist motion for the fuel valve on the earlier planes to work most of the time. It always takes me several tries. I don't know why; everything else works flawlessly.\n\nHelpful | 0", "Jadranko.K-KMay 4 at 12:28 AM\nAn alternative to shooting/music/puzzles\n\nI was looking for a casual (=relaxing) flight simulator when I get bored of my other games which all seem to be about shooting / escape room / getting tired dodging stuff. The graphics are cartoonish but it is a fair price to pay in exchange for smooth gameplay and fairly big scenarios. The 4 planes provide quite different flying experiences. Some people may be disappointed to learn that the planes have to be unlocked little by little but it only takes a few hours of gameplay and the process helps getting used to the controls and not getting sick. I thought I had good VR legs when I bought this and the second day I played I tried to go fast by cutting corners doing some wild sharp turns and in 10 minutes I got sick for the entire day. It hasn't happened even since and I play in simulation mode with comfort viewing angle constraints removed. One note: the flicker of the propellers of the fastest planes is pretty bad and potentially dangerous to anyone with epilepsy, it would be good to have the option to disable it somehow in the settings.\n\nHelpful | 47", "AshmanRoonz21 hours ago\nPretty decent\n\nGood game. I wish there was a code to unlock all the planes, it's too much of a grind to get them all unlocked.\n\nHelpful | 0", "Boxfan4910 hours ago\nIt has planes\n\nIts a good game and it has planes I like planes souped much and but it makes you very motions sike\n\nHelpful | 0", "GeribaldBeardsley16 days ago\nGreat fun\n\nAs a pilot, I have to say that this game is great. On the arcadey side, but that's a compliment for a game. Aircraft still respond in predictable, and realistic ways without forcing the complications of a deep simulator. Love to just fly around!\n\nHelpful | 1", "DogeMan153713 days ago\nPretty Cool\n\nThis is a pretty cool flight sim, i just wish for more complicated procedure and more planes, (maybe in the military catergory)\n\nHelpful | 0", "DarkilllerJul 27 at 12:18 AM\nDidnt expect this much fun...\n\nIts pretty wild, definitely feels like flying and its shockingly good!\nThe best part is it could be improved and be even better if developers want to make some add-ons and/or fine tune the graphics which would use a little bit more details and sharpness.\nThat being said, it is one of my top 5 games on the Quest and one ill likely never delete.\nIts so good.\n\nHelpful | 1", "Yellowbeard69Jul 18 at 9:25 PM\nWow!\n\nGreat game with a few irritants like the finicky throttle controls or accidentally turning off your engine or moving the flaps unintentionally. Overall, it gives you a true sense of flight and I love it!\n\nPlease make a WWII dogfighting game!\n\nHelpful | 1", "LarrymclarryJun 17 at 8:00 PM\nIts cool\n\nIm not gonna say that this game is top tier, or perfect for that matter. I will say that it is a game for when you are tired from shooters/sports. To wrap this all up, this is an average game that if you learn how to play, will be pretty fun.\n\nHelpful | 4", "alon.sabiJul 3 at 12:49 AM\nFive stars - please read\n\nI write this as a one star for all the people (like me), who read the one star reviews before making a decision to buy or not. I usually don't write reviews, but I felt that there is some injustice done to this game. I almost did not buy it, but I'm glad I did. I wish the developer responded to more of the one star comments.\n\nPeople complain about certain things :\n---------------------------------------\n\n- Turning knobs before flying. I have no issues with turning the fuel, flipping the switch, turn the engine on and increase the throttle. It's actually fun and makes it feel real.\n- Not being able to see through the windows. That's a comfort setting (on the board when looking to your left in the first office). The default is \"closed blinds\" on the windows until you look at them, and it is REALLY weird). I have mine turned to the middle setting. Allow you to freely look outside and it feels very natural. I'd recommend the developers to make that the default (hopefully you read this). When I first found myself in the cockpit I had a moment of \"oh shxxt it is true, this is a really crappy experience). It took me a minute to find the comfort settings. Maybe make this part more obvious?)\n- Nausea when flying. I felt it a bit on the lowest comfort setting, but the middle one is perfect. I just spent close to two hours \"flying\" with no issues.\n- Not having all of the islands / planes available from the moment you start playing. For me it makes sense. It gives you a goal to work towards, otherwise there is no incentive to get better, earn money, and do the activities.\n- The flight mechanics. Personally I did not find anything wrong with it. Someone suggested that it is \"wrong\". The person actually makes a convincing explanation, so I was dreading that part, but nothing. It works and feels great.\n\nMy general feelings after playing for a couple of hours (until my oculus battery died ):\n-----------------------------------------------------------------------------------------\n\nI find the graphics just right. It's a bit cartoonish, but it works really well for the game. When I fly the glider it feels real. It took me about 15 - 20 minutes to get used to the controls in simulation mode, and the tutorial was great (and not too long). Once I got used to it, I was able to fly through the middle of the rings and land very accurately on the landing platforms. It's a great feeling.\n\nAll in all a great game. When I buy games I look at what people complain about, and try to figure out if I'm ok with those complaints. I also look at the % of the 4 and 5 stars reviews, if it's less than 90% combined, I don't buy it. This one was 79% at the time I bought it (sorry for making it a bit lower). I'm glad that I decided to take my chances based on some youtube videos.\n\nOne suggestion is to allow different music. Don't get me wrong, it's fine, but a bit more diversity will be nice \n\nI hope you find this useful.\n\nHappy flying!\n\nHelpful | 71", "Carl_Wheazer420Jul 30 at 4:26 PM\nThe best flight sim on the quest\n\nThis hands down is the best of the best when it comes to a flight sim game its polygonal style is great and I just wish their was more content. Dont get me wrong their is a lot of content but it gets old quick, for me at least.\nEither way would totally recommend 10/10\n\nHelpful | 0", "ToucherCrown5013 hours ago\n100% worth it\n\nThis game is 100% worth the $15 it is. At first it might seem a bit frustrating but once u get passed that it is sooooo much fun.\n\nHelpful | 0", "hakpilotJul 6 at 6:02 PM\nExcellent Sim - Even For Licensed Pilots\n\nAs a licensed single engine pilot, I can vouch for the fact that the aerodynamics and responsiveness of the aircraft controls are fairly realistic for an ultralight aircraft, flying in smooth air under VFR (Visual Flight Rules).\n\nI was able to successfully land the plane during my first session of training (because I was able to translate my real-world skills to this simulation).\n\nSo those who aren't able to fly due to COVID19 (or due to financial or other constraints), this is a lightweight simulator that can recreate the experience of actual flight...\n\nIt's definitely no XPlane or Microsoft Simulator in terms of complexity, but this is a great simulator to have fun with.\n\nI will tell you that motion sickness can set in after prolonged playing (which I guess is common in certain VR Games), so I would recommend limiting your sessions to a few minutes at a time.\n\nWould love it if the developers can expand on this game, with different types of aircraft, different geographies, different types of weather, and more challenges and missions.\n\nDefinitely worth it to add this game to your VR collection!\n\nHelpful | 2", "vinegarshots11 days ago\nBroken on Quest\n\nI used to play this frequently on the Rift. The controls in the Quest version are extremely buggy, which makes it very difficult to play. For example, it is very difficult to reduce the throttle all the way down, as the hand often seems to let go before you pull it all the way to the bottom. Sometimes when you move the throttle, it also moves the flaps at the same time. Sometimes the laser pointer comes out when you try to move the throttle. The landing missions are extra difficult to finish without having a properly responsive throttle control. For people who haven't played on Rift, maybe they think this is how it's supposed to be, but I assure you it is NOT.\n\nHelpful | 0", "RollermansJul 26 at 11:50 AM\nReally challenging\n\nThis is fast becoming my favorite game. The gameplay is awsome and extremely challenging without being impossible. It is nerve wracking at times but easy at others. The levels go pretty quick. My only wish is to be able to fly to the other islands in free flight mode.\n\nHelpful | 0", "tonyryanJun 24 at 1:18 PM\nBasic visuals, but immersive experience\n\nI was interested in this because I used to love the Nintendo Pilotwings and just wanted to fly around the islands in peace.\n\nOnce youve completed the tutorial (getting your licence) youre free to earn money through tasks or fly freely at your leisure. For me, this is the most enjoyable thing: fly around, land refuel, fly some more. Its not a beautiful game, but it does what you expect it to. Theres plenty of longevity with multiple different islands and tasks to challenge you. Well worth 10\n\nHelpful | 2", "feelgoodfactory2 days ago\nWell Done!\n\nMakes a lot of fun once you have more (and faster planes). Would be great to have a helicopter! @dev team ;)\n\nHelpful | 0", "idoL_KOKOYJul 22 at 2:57 AM\nHalf & Half ...\n\nThis rating is based only on my own personal experience and not majority... its a great game for those who love flying specially myself, but every time when im inside the game..Im keep on feeling dizziness and throwing up... thats why its titled Half & Half.. Half/fun and Half/ Dizzy.....or maybe its just me but other than that.. its highly recommended to all flying enthusiast!!!!\n\nHelpful | 0", "SubZero007Jul 24 at 9:02 AM\nGood\n\nIt is very good and a flying game the first one but some of the challenges are hard and I wish there where a lots of different planes\n\nHelpful | 0", "Andrzej_GouldingJun 25 at 5:10 PM\nPretty good but needs a few tweaks\n\nReally fun so far. The only thing I find weird is what others have said in that the VR camera seems to move around in reaction to the plane turning which is odd. Its like the plane is moving around the VR camera which isnt right.\nOnly other problem is sometimes the stick hand gets gimble lock and gets stuck. Can easily take over with the other hand till it rights itself, but would be great if it didnt break.\nThe other issues mentioned in the 1 star reviews have been fixed now as far as I can tell.\n\nHelpful | 1", "nesta.gerberding.92 days ago\nThey should add some more aircraft\n\nDont get me wrong the game is great but the content in the game is a bit lackluster for 15 dollars\n\nHelpful | 0", "TheConjured21 days ago\nTerrible control\n\nThe switch to ignite engine being so close to the flaps and how innacurate controls are cause me to disengage motor unable to boost during flight awful game. also can't stand being given silver medal when I complete mission perfectly.\n\nHelpful | 1", "QuadArcJun 29 at 5:33 AM\nA great game\n\nWhen I first got the app I played it for a while and got attached to it. This game is very immersive and fun game to experience and to explore. It is hard at point and you can get stuck on levels but u have to switch it up a little. I would definitely suggest getting this game. It is a very good break from all the other games.\n\nHelpful | 1", "rohitkumbhar11 days ago\nHarder than it looks!\n\nIt's quite fun to play. Flying is a lot harder than it looks.\n\nHelpful | 1", "SpinDrifter176Mar 14 at 9:02 AM\nJust plain and simple fun.\n\nIm still working on the Jet Glider, but this is true fun. It gives a true feel of flight. The fuel switch is a little difficult to manipulate, but otherwise, this is great.\n\nMy favorite part is the balloons and target rings. It would be nice to make this a multiplayer game with competitive balloons and rings, include a flag capture at the opponents airfield, or evasive balloon pop where the balloon is affixed to the craft, add the risk of crashing into the opponent,\n\nWhen Im bored, I plop down for about 20 minutes of flight. Nice and relaxing. The experience is enhanced in a swivel office chair. Just enough give in the chair in all directions to add a little more realism to the flight.\n\nHelpful | 44", "SinusSupremusMay 9 at 7:23 AM\nGo fly a Quest!\n\nI really like this game. Its fun to fly and do all the activities, but can also be serene.\nBut I spoiled myself by playing the PCVR version first. The Quest version is understandably downgraded; graphics a little less intense, cant see all the islands at once. The biggest thing I dont like about it is the pointer. That makes it obvious that this is just a port from the Go rather than a lesser version of PCVR. I wish they would at least make an update to get rid of the pointer. And maybe tighten up the tolerances on the hand controls. But even the PCVR version was a little loose on the controls.\nBut I still love it, and have no regrets about paying for this!\n\nHelpful | 3", "Pet3r_38Jun 22 at 1:54 PM\nFor what it does, i cannot ask more\n\nIts probably one of the best immersive experiences out there. Now i dont have motion sickness so it is very good for me but if you suffer from it then turn on the blinders. Personally this is a great dumbed down version of flying to me as i always wanted to at least try to fly a plane\n\nHelpful | 1", "PixelLinkOC8 days ago\nEpic\n\nEpic\n\nHelpful | 0", "gonzomech17 days ago\nBest VR So far.\n\nChallenge accepted!\n\nHelpful | 0", "360VRcreatorJul 6 at 12:36 PM\nPretty good low-level Flight Sim.\n\nOk so the flying is fairly ok. as a pilot I can say flying have a distinct \"feel\" of flying, landing is a bit odd, the airplane don't feel floaty in ground effects like regularly, and the lack of ground details make managing the flare... well impossible :-) - landing is more a matter of keeping airspeed with flaps down and come down until you hear wheel impact.\n\nMain activity is racing the clock while flying hoops in the air. points given for centering on the hoops.\n\nWhy is the side windows blacked out until I look towards them?\nOK solve the side windows by selecting the open model, still don't understand why it renders only the front if I click back to the closed airframe.\n\nYou can fly the rudder with the left hand thumb stick.\n\nBiggest gribe - how many times must one fly the free flight before going on to another airframe :-)\n\nOh and lets incorporate ridge-soaring. :-)\n\nDesperately need a smartphone app of sorts, with support for a bluetooth rudder-pedal, kinda like how supernatural use bluetooth heart-rate tracker in their exercise program. bet a BT rudder pedal could be a fine side business for Ultrawings :-) I would preorder for sure.\n\nHelpful | 1", "DavidShapMay 7 at 1:23 PM\nNew Flyboy\n\nI play this game on an Oculus Quest. I find that the controls are difficult to manipulate - its hard to turn on the fuel, turn on the magneto and press the start button. Once I get past the preflight procedure, the flying is fun! Anxious to see how the game unfolds from here...\n\nHelpful | 2", "gunpilotApr 13 at 7:53 AM\nA bit of fun to fly!\n\nThis App is good fun and has a reasonable flight model. As someone who spends a lot of time in real flight simulators and flying real aircraft I still get a little motion sickness in this App. By changing visual settings you can mitigate this slightly. The sky is well modelled and looks good, the ground and sea a little cartoon like, but to be fair it is a game and does not claim to be a flight simulator. It is worth the money and I would buy it again. I would love for the developers to take the knowledge gained from developing this App and put together an accurate VFR and IFR flight simulator.\n\nHelpful | 5", "Turboboy997Jun 20 at 7:00 AM\nFun Flying\n\nReally fun but for some, it might get little boring, especially needing to go through start up sequence after ever failed mission.\n\nHelpful | 0", "christophercarbJul 4 at 10:22 AM\nIts too awesome!!!!!!!!\n\nThis game is super awesome it actually feels like you are flying a plane. I give this game five stars:D. Too awesome!!. I recommend this game!\n\nHelpful | 0", "Bl4nkuJul 16 at 5:02 PM\nVery cool\n\nThis game is super cool, it feels like a sandbox game and also like your really there\n\nHelpful | 1", "Zack_vrJun 26 at 2:43 PM\nAmazing\n\nIve always looked for a flying game and this is the one. I love everything about this game there is so much to do, missions, doing barrel roles just flying is the best the part.\n\nHelpful | 1", "The-Mad-RobotJun 19 at 6:52 AM\nExcellant game\n\nOnly had my quest for a few days and really wanted a flight sim. This reminds me of pilot wing on wii. Only thing i would really like to see on this a game is a multiplayer mode. Definitely recomend this\n\nHelpful | 0", "TheOldRascalJun 16 at 4:26 PM\nFuel switch is a pain!\n\nI love this game but recently the fuel switch takes lots of attempts before it turns, it ruins the experience and I end up playing something else. A quick search online shows this is a common issue and has been for some time. Couldn't an update address this?\n\nHelpful | 0", "Twister-42Mar 26 at 11:00 AM\nNot bad overall\n\nIts pretty comforable overall and style is fun. The only problem i have so far on the first plane is sluggish controls but i think its pretty good for what it is.\nIf you like flight sims its worth the experience just dont expect realistic flight sim and you will get value from it even with its limitations.\n\nHelpful | 8", "neil.millardJun 20 at 9:50 AM\nFlight simulation with fun\n\nI love flying, and this game immersed me in the islands and aircraft. The absurdity of shooting balloons whilst piloting a plane is such fun, I would recommend to everyone.\n\nHelpful | 0", "King-Ry-RyMay 9 at 7:47 AM\nOne of the best games on quest!\n\nAn amazing game that doesnt take itself too seriously! The mechanics are spot on and give some real depth into how planes actually work in the air without being too sim like. Theres a perfect balance of arcade feel with real sim feel. One of the main positives of this game is its a full length game!!!! Horaaahh!! Im so fed up with picking up quest games that end up lasting barely 4-6 hours! This platform desperately needs fully fleshed out games with play times that match traditional video games. Especially since there is no second hand market to sell them on to buy more. Ultra wings is as good as it gets so far. Im about 65% through this game and Ive spent so much time in it already. I fly RC planes and so probably biased towards this kind of game but its great fun and has a great learning curve to it. The only thing its obviously missing is multiplayer. Lets hope it will come in an update.\n\nDevs!\nMULTIPLAYER!!!!!! This game is crying out for multiplayer! Team and death match dog fights with radio communication! Team and normal racing! This game could be an evergreen with a good multiplayer mode! Ive just been playing echo vr recently and you could do some sort of aerial team ball type game with goals at each end. Also a simple level editor for racing would be good so you could layout the track rings on an island. Or even balloons as well. Also dont know if its a secret island already but if not would be good to have there be dragons island located on that spot on the map with some huge dragons flapping around.\n\nHelpful | 2", "RJC14Jul 5 at 1:39 PM\nEnabling Fuel Flow is too complicated\n\nCould you please make it easier to enable the fuel flow? I have tried so many things and it is still so difficult to do properly.\n\nHelpful | 2", "NimbusCainJul 26 at 2:29 PM\nBest 'Real Feel' game\n\nI've played this game for several hours now. So far I'm having a blast. I have a fear of building heights, but not so much of aircraft heights. The vertigo experienced lends itself to the realism of the game. If you like flight sims and flight based challenges but think you'll have issues with height and motion, leave the safety blinders turned on.\n\nThis game is a ton of fun. It has definitely been the go to game of all the games that I've purchased so far.\n\nAdded: I've owned this game now for about two months. I've recently started over because I had such fun the first time through. The allure for me is that the game has a 'real feel'. I wish there were more islands and more planes (to include a war plane and helicopter).\n\nPeople have trouble with the controls, particularly the fuel switch. I've had success by positioning my left hand with my palm facing the switch as opposed to reaching straight out with fingertips.\n\nAlso, people have mentioned a less than optimal cockpit seating position. You can adjust this. Raise your body a couple of inches so that the headset is higher then press and hold the Oculus button. The cockpit will adjust itself to follow, then when you relax back to your normal seated position the controls will be a couple of inches higher. Fantastic game in my opinion.\n\nHelpful | 0", "pmc152dApr 24 at 6:50 AM\nGreat flight sim\n\nIf you are a fan of flying, especially solo, this ticks a lot of boxes, thoroughly enjoyable, if I could improve it I would have more real buildings etc. But for its price you wont get a better flight sim.\n\nHelpful | 3", "VanillainApr 14 at 9:31 AM\nBest seated game!\n\nAwesome game, I have deleted the .dat file on my quest twice and played it over. One of my favourite games on the quest. The only reason 8t doesn't get 5 stars is that one of the glider missions on the quest is broken, I've seen it mentioned on forms and I've emailed support but it still hasn't been patched. Great game but the lack of support is a bit lame.\n\nHelpful | 2", "TheVirtualNickJun 4 at 3:43 PM\nRelaxing\n\nA good game if you just want to chill and look at the islands below you or if you want to try to complete missions.\n\nHelpful | 0", "noodleninjaApr 25 at 9:09 AM\nFabulous\n\nReally enjoyed this, and so did my 13 year old daughter.\nOption to go into simulator vs arcade mode bring extra levels of control (loop the loop) but more risk.\nLoved the shooting levels. The racing was the only disappointment, mainly due to when you land, the other AI controlled planes crash into you after finishing a race and you fail?!\nOn the whole very good however\n\nHelpful | 1", "Nightslash1984Jun 22 at 1:15 PM\nAmazing flight sim for beginners\n\nIf you want a flight sim that you dont have to use oculus link for then this is exactly what you need.\n\nHelpful | 0", "ryster2009Jul 10 at 4:26 AM\nOne of the best quest games out\n\nFun\n\nHelpful | 0", "sjbackhoMay 17 at 9:03 PM\nAwesome game - Please add on\n\nGreat game A++ ... Devs please add on more aircraft & maps. This would be a blast to get some jets & maybe some other fun aircraft like gyros & a helicopter too. I would gladly pay for access to additional aircraft... multiplayer dogfighting would be amazing also \n\nHelpful | 1", "lutherfedoraApr 29 at 9:44 PM\nIts a fun game but...\n\nThis is a great game but it has some bugs and it is known for causing mild motion sickness also the levels get really hard but if you are not overly concerned about motion sickness and you like planes I highly recommend this realistic flight simulator.\n\nHelpful | 0", "Knarf76May 5 at 3:39 AM\nReally nice flightsim\n\nThis game is really nice.\nSimple cartoon graphics, but they work great.\nFlying itself is really nice.\n\nShort missions. This is not bad of you get carsick.\n\nDon't expect fighter jets. Just simple flying.\n\nHelpful | 0", "KenondpMay 9 at 3:11 AM\nAny chance of lol\n\nSensibly priced & a Good clean game for all ages whether your into flying in vr or not , highly recommend . Devs please add a small moving aircraft carrier to take off & land from for kicks in free flight mode, would be awesome when I have a spare moment to play the Quest.\n\nHelpful | 0", "Anthony_reyes1998May 17 at 11:49 PM\nA few bugs\n\nLike the game a lot but some levels load with no fuel and the option to refuel isnt available plz fix this I love the game tho\n\nHelpful | 0", "TheLiquor115 days ago\nI LOVE IT!!\n\nIve only played the game for a few minutes and I was amazed!\nI havent gotten far before writing this review but Im really intrigued by the movement in the game! The graphics and detail arent that great but its awesome just to fly around get lost and do various Jobs & Challenges.\nWould really love to see this game go further and add maybe online community or large and more obstacles to fly around!\n5/5 stars!\n\nHelpful | 0", "dishwasher5234May 3 at 10:37 AM\nReally fun and relaxing\n\nAll the time when Im playing this game I feel like Im actually flying a plane(which is a nice brake from quarantine)whenever I think its starting to get boring there is a new thing to do which keeps me always coming back to fly\n\nHope full for new things in the future,new planes and island say\nAnyway its a grate game and I will definitely recommend to my friends\n\nHelpful | 0", "belambaMay 9 at 3:29 AM\nFrustrating...\n\nI bought this game and had real issues with the red switch (cant remember what it does) so got a refund. My Quest was faulty so when I got the replacement I thought Id buy this game again. First time I was ready to fly red switch was easy to move. I crashed (which is all Ive managed to do cos Im stupid) and after next two times red switch wont move again! No matter what I do it is stationary and refuses to move which makes the experience useless. I have to factory reset Quest just to try again which means I lose the progress in all my games, and then the red switch fails again :(\nWhat Ive seen so far is really good, just dont know how to overcome the issues Im having?\n\nHelpful | 0", "JossTroMar 17 at 6:58 PM\nGreat fun flight trainer\n\nThis game is immensely fun. Even with fairly basic cartooney graphics it still gives a surprisingly accurate flight model and a sense of actually flying over beautiful tropical islands. My only major gripe is that it really needs multiple profiles or a guest mode so you can show it to friends and family from the beginning.\n\nHelpful | 3", "Shadow444Jun 7 at 9:19 AM\nLove it\n\nI love this game... if you like planes and want to fly one then get this game!!! In my eyes it's worth $30\n\nHelpful | 0", "MarkStirtonAberdeenApr 5 at 4:18 AM\nDull\n\nThe flying mechanism is OK, but the game is very badly designed, seemingly impossible to unlock good things to fly, seeming impossible to figure out the mission structure. I'm been flying through loops for months now with no reward whatsoever. No plane unlocks, no mission unlocks, no side missions, just the same stupid glider thing and the same islands over and over. Good, if dull, flight sim with hardly anything to unlock and no good craft. Someone please create a Quest flight simulator worth buying. But, if you like flying through hoops like some demented airborne dolphin, this one's for you.\n\nHelpful | 11", "HemiMGMay 19 at 2:16 AM\nControls are annoying\n\nI'm rather frustrated at how difficult they made it just to get started. Flying is fun, although my hand seems to occasionally lose track of the stick. The real problem though is that turning on the fuel is next to impossible. It takes forever to find that seemingly 1mm area where they'll actually let you move the thing. I can't believe any of the developers even tested the switch. I swear they have some cheat to bypass it that they forgot to turn off. It's inexcusably bad.\n\nHelpful | 1", "LeoArranApr 28 at 10:54 AM\nChallenging\n\nI try to get gold in every challenge, its difficult. The graphics may seem limited but this does not affect the game play. I used to fly helicopters, this is very realistic. I love it. Well worth twice the price\n\nHelpful | 2", "djmillernetMay 15 at 2:30 PM\nJet Glider Issues\n\nOn the Quest. The second aircraft the jet Glider keeps crashing on the first assignment to fly through rings. Tried over and over as nd cant get any further. Does not do it exactally the same place but cant complete the the first flight before it either dumps completely out of the game and back to the Oculas menu or just hangs until you press and hold the power button down until the quest restarts. Can you help?\n\nHelpful | 0", "JSAviatorMar 12 at 3:46 PM\nGreat app, with some problems\n\nThe overall game is great, but its a little frustrating that free flight mode only lets you fly aircraft that youve unlocked in the missions. I had to factory reset my quest due to a bug and its been really annoying redoing all the missions just to be able to fly planes that should be free to fly in free fly mode. Its a great game overall, but it would be much better if free fly actually meant free fly.\n\nHelpful | 3", "nathan.cheetah.24 days ago\nAmazing, has ways to solve motion problm\n\nSo because your flying a plane it will get you quite motion sick, but if yoy select the mode where you can only see forwards, then it solves that and you can play for hours without problem. The game modes are fantastic with my favourite being pop the balloon where you shoot a gun whilst flying. For realistic simulation it is very good, but I hope to see more planes in future. Also, it is very progressive so it is a game to last very long and even more so can be played in bed or in a seat so it isn't too tiring.\n\nHelpful | 0", "Witcher.IIIJan 6 at 1:00 PM\nGreat fun- with an air bag.\n\nI bought this game- eagerly- when I first got my Quest. It was one of my 'must have' games. My first issue with it was it was almost impossible to turn the fuel pump on so I couldn't even take off. When I finally finished that fight, each and every time, the actual flying made me sick. Like- fall over and puke sick. I returned the game and was very bummed.\nThen I saw a video that talked about how to overcome air sickness in VR and it offered up one suggestion of \"just play for very short periods- quit and come back later and keep doing this until you're okay. So I bought this game again and tried again.\nIt actually worked. First- let me say I've had zero problems with the fuel pump this go around AND I've built up enough tolerance to use the mid range comfort setting. Using the rutter still makes me feel sick, but I can cope at this point.\nThe game is very relaxing and a lot of fun. I'm really happy I'm able to play it now and I truly hope there's another one coming.\n\nHelpful | 59", "BrozitchApr 16 at 1:02 PM\nFavourite Game\n\nUltrawings is definitely my favourite game on the quest. The graphics are simple, but the gameplay is fun! The physics work quite well, I just wish that there were more game mechanics like plane customization and upgrades, and the ability to fly between all the islands without having to switch. 10/10\n\nHelpful | 0", "DatBoiDavidMar 31 at 5:11 AM\nAmazing but.....\n\nIt's just an amazing game. I realy enjoy playing it. Flying is awsome and landing also feels great! The graphics for the Quest are amazing to. Almost Nothing to complain about. I wish i could just give it 5 stars tho. Why i didn't:\n\nat first, learning to fly is cool, but you want a new plane fairly quick. You get a new plane quick, but to get even more planes, you first need to unlock islands. You lose your money by buying these islands. To earn money again (to buy that new plane), you have to finish missions, in the plane you aready flew with for super long. The point is that it just gets boring quick by flying the same plane over and over again, with the same missions to earn money to finaly buy a new plane.\n\nAlso the narrator is super anoying . This is more of a personal thing, but when you lose over and over again, and finaly finish it, but with a silver medal instead of a gold one, he/she says its not good enough and you should do the mission again...... AGAIN. I'm already angry, and he/she comes in and tells me im stupid i just got a silver one. There is a good solution tho: just get good \n\nPS: maybe add a sandbox mode with a few stunt courses where you can fly all the planes.\n\nHelpful | 3", "guybrush_treepwoodMay 6 at 7:09 AM\nNice\n\nThe game is different form most oculus games as thuis is a flight sim. The graphics cloud improve but the look and feel is realistisch, i hope in the future also other planes will be available\n\nHelpful | 0", "ProGameboxerApr 4 at 10:19 AM\nTerrible Quest Port\n\nThe motion controllers do not work reliably while playing this game on the Quest. I have had multiple instances of not being able to let go of the flap lever and had the flaps move up and down as I adjust the throttle.\n\nThis game would be much easier to play with a gamepad instead of motion controllers (as it is on PSVR). Unfortunately, many of the Xbox controller bindings do not work (i.e. X+Y not recentering VR), and many controls such as flaps and fuel shutoff are not bound to a button and most be actuated by looking at them. Even when the controls work, they do not feel natural.\n\nThis game is a blast on other platforms and was one of the titles that encouraged me to buy a headset. On the Quest, it is almost unplayable and is at best a casual VR demonstrator, but has lost attributed that make it feel like an actual flight sim.\n\nHelpful | 4", "mattjohnholmesJun 20 at 2:45 AM\nIt's fine\n\nYeah.\n\nHelpful | 0", "eebeejayDec 21 at 1:43 PM\nFree flight needs to be improved.\n\nNeeds the ability to be able to fly from one island to another as in the other versions.In the Quest version you choose the island from the airport office. Then you are warped to the outskirts of the island to land your plane. In the PlayStation version you choose free flight, get in the plane, and fly to another island, the way it should be.\n\nHelpful | 155", "phillyg2020Mar 18 at 12:37 PM\nGet your VR legs here!!!\n\nBecause of this game I can play other games that have smooth locomotion. This game held my hand and trained me to get over VR motion sickness. It starts of slow and eases you into flying different types of planes so when u finally unlock faster ones you're ready for it. I've put more hours and had more fun in this game than any other on the quest!!!\n\nHelpful | 3", "SkylineGrandMay 23 at 5:59 PM\nUltra great\n\nThis game is truly amazing you guys should really put more planes in but i love the game\n\nHelpful | 0", "magicmurphieApr 26 at 2:34 PM\nFun but motion sick\n\nIts a great game but after a few minutes it really gets bad but there is a way to fix it so its good\n\nHelpful | 0", "JavierAlCaMay 12 at 10:22 AM\nLoads of time spent in.\n\nEntertaining and accessible. It brings great fun with few aircrafts, different locations and a load of missions.\n\nHelpful | 1", "messidogJun 22 at 11:16 AM\nGreat game.......For kids\n\nUltra Wing is amazing and really well done.The graphics arent the greatest but good enough. One thing is this game is not really for older kids who want the real deal on flying simulators. This game is more for beginners on VR like me. Great game not for people who want a exact replica of flying.\n\nHelpful | 0", "georgeclarke0Jul 6 at 2:38 AM\nLove it\n\nIt is not a serious flight game so if your trying to learn flying then find another game but apart from that its fun and Im surprised at what quality gameplay I have gotten from a cheap game. It is intense and you can get really motion sick so if your looking at this review then make sure when you play to take breaks (only if you are effected by motion sickness) I managed to play for an hour and it felt like five minutes and it seems more complete than even some of the expensive games. What I have learned it the games in the 10-14 pound price tag are the most fun and long and this is a perfect example. I do think though if the creators look at this then they should add a multiplayer free flight where they can crash into each other and stuff and even races that would be amazing. Make sure if you are wondering wether to get this game or not, you should.\n\nHelpful | 0", "Tony.DiIuorioApr 14 at 6:11 PM\nA decent flight simulator - WAY fun!\n\nIn future I would love to see a more realistic simulator with jets, civilian and military! And Ironman-influenced jetpacks!\n\nULTRAWINGS, however, is light aircraft. And you certainly feel like you're flying! The cockpit controls are simple accordingly to the small aircraft (fuel, power, throttle and stick/rudders).\n\nThere's difficult landings, flying through rings, making flights with limited fuel, and the balloon pop levels are my favorite with mounted guns or a six shooter in your hand.\n\nThe very basic rendering of the landscape is what gives the feeling of flight, so I am grateful for the gorgeous blue sky and polygonal landscapes. It's pretty, and it's not meant to be photoreal.\n\nMy only complaint is leveling up to better aircraft isn't obvious. Flying to other airports opens new levels but the game doesn't explain how money is only awarded for NEW achievements. I kept flying the same levels, because the game kept saying I was earning money each time...\n\nAlso would like a more intuitive menu system, rather than the \"next/back\" mess. But mostly jets and jetpacks is what I am missing now lol.\n\nHelpful | 2", "lonaldMay 11 at 6:02 PM\n\nIt's very fun to play and actually feel like you are flying a plane\n\nHelpful | 0", "WBAvlMar 15 at 4:24 AM\nTerrible flight model on the quest\n\nWhen you apply forward or aft stick to change the pitch of the aircraft the aircraft moves relative to the user viewpoint then the environment moves.\n\nIts like youre not really attached to the aircraft and there is a lag. Its not at all realistic and it tends to induce nausea.\n\nIn the real world if you are strapped into the aircraft then you and the aircraft move as one unit. This is not what is happening.\n\nVery disappointing.\n\nI had played this on the oculus go and didnt notice this problem.\n\nHelpful | 6", "Bman32HoopsVrMay 11 at 4:12 PM\nSuper Chill\n\nSuper chill and relaxing game to escape life\n\nHelpful | 1", "earthkingApr 23 at 3:40 PM\nFun game\n\nMy only complaint is that the planes should cost less.\n\nHelpful | 2", "MrThistabutJul 25 at 4:27 AM\nFun flying gane\n\nA fun flying game, I would recommend if you have a spare 10\n\nHelpful | 0", "jakn0Feb 22 at 10:44 PM\nFlying around and having fun\n\nThis game has been fun so far. It is a small game but still presents enough fun. I was a huge fan of PilotWings on snes. This has been giving me similar satisfaction with the challenges. Using the virtual joysick of the plane opposed to the thumbstick on the controller adds fun to the experience. I have found some of it challenging, but you can fly in free flight mode to just have fun and explore. There are a few bugs causing the game to crash but it looks pretty cool with the cartoon world. Turning the fuel pump on feels a little clunky. Other than that, its enjoyable if you like flying.\n\nHelpful | 1", "AudreyHighMar 10 at 3:43 PM\nFrustrating !!!\n\nEnjoyable real feeling of flight, ..... IF you can switch the fuel gauge on! It seems to work by chance off and on, and after a while did not move at all no matter what I try. So I am unable to play this game.\nAnother frustrating thing is that my virtual hand slips away from the steering stick too easily.\nRight now its a waste of money for me. I want to fly but my fuel cannot be accessed! PLEASE FIX THIS !\n\nHelpful | 3", "DiamondTechFireFeb 27 at 5:35 PM\nGreat Flying Game\n\nFirst off, I really enjoy this game. I feel as if the free flight gives me a lot of freedom for just enjoying the scenery. The different jobs can be challenging and fun. You can really spend a good amount of time perfecting your piloting skills. However, I feel there could be a lot added and/or changed to make this game even better. First off, the addition of more aircraft, like gliders, paramotors or parachutes can really add more to the feel. These would give even more options to how you can experience this game. Second, the addition of more airports. These would really sell the feel of flying. Overall, this game is really fun and I reccomend it to anyone wanting to do acrobatics, get a feel for flying or just relax, however, the game would be more fun with the addition of new craft and airports.\n\nHelpful | 3", "bigdealingsMar 13 at 11:15 AM\nFull access ???\n\nI paid for this game\nI should have full access to all airplanes / flying etc immediately\nI dont want to fly slow ultralights. Do I get to fly regular planes as shown in initial pix ???\nNot happy !!!\n\nHelpful | 11", "AltaAlexMay 1 at 10:18 AM\nIt bugs and crashes\n\nIt is really frustrating that the game closes and crashes so often. Crashes on vr should be aloud\n\nHelpful | 0", "OverzeetopJun 23 at 12:08 PM\nFirst impressions are poor.\n\nThe game is not very visually interesting, and the menu system - while interesting (bulletin board style) is not very functional, with no description of what the various option are or do.\n\nControls in the first plane are poor, with many gestures requiring multiple attempts to activate due to lack of feedback (and difficult placement of) grasping motions.\n\nOne of my primary disappointments is there seems to be only one pilot spot. Once one user has played the game, none of the progression is available to a second (3rd/4th) player without uninstalling the game. Might be okay if you only have one person in your family, but if you have multiple users, or just want to loan your quest to a friend, you lose all your progress or they have to fly with zero tutorial levels (they exist, but don't work properly once completed).\n\nHelpful | 0", "RichAtGoolwaJan 29 at 8:38 PM\nGood flight simulator with some issues\n\nThe flight sim part is good, mostly accurate and the game structure is fine if you like doing the challenges. Every now and then though, you find you cant grab the throttle or the stick doesnt respond, or its hard to turn on the fuel and you grab the flaps by mistake. These maybe limitations with Oculus Quest or the game itself. Having overrides by using the joysticks on the Oculus controllers may help. Otherwise a fun distraction!\n\nHelpful | 7", "Spg159Apr 1 at 3:50 PM\nNot enough content\n\nWhile there is good levels and variety, there arent enough planes.\n\nHelpful | 0", "VeganBoatApr 18 at 4:33 PM\nEpic\n\nThis game is amazing, even if it is a bit slow at times\n\nHelpful | 0", "Josh1015Feb 9 at 3:34 AM\nVery addictive & fun\n\nIve only played for about 30-45 minutes and its a lot of fun, I find a lot of games on quest are fun but fail to bring me back, but this has me wanting to play more and more. The only reason its not 5 stars is I wish the graphics were a little more realistic, but its the quest.. so not an easy fix... but loads of fun and worth the money.\n\nHelpful | 1", "JAM3XFeb 28 at 6:03 PM\nExtremely SatisFLying!!!\n\nI'm gonna give this game 5 stars instead of 4, because it's just so enjoyable (one of my top 3 Quest Store games), I can forgive some of the things that I would normally take issue with. The controls work much better than I expected them to, but still can be a bit wonky (I'll talk more on this later). The flight mechanics are a blast. I've only played with \"Sim\" settings turned on, and no comfort options- (they block off a portion of the view to reduce motion sickness, but they also get in the way). I can only comment on the above settings that I personally use, so keep that in mind. The game is on the \"arcade\" side, but still has some simulation aspects; you can land very hard and when you stall out it's very easy to recover. I've had this game ever since I got the Quest (close to release) but held off on the review until I unlocked all the planes (I get distracted just flying around). I can say it feels incredible doing rolls/ loops and flying knife edge in the \"Sport plane\" while twisting your neck to find the horizon! VR flying is awesome...\n\nThere are a few problems, mostly with the controls, like losing grip on the stick when looking over your shoulder (I was expecting this due to the front facing cams on the Quest, but it's nowhere near as bad as I thought it would be). Other controls can be hard to manipulate while flying but it's all doable and rarely takes away from the experience after you're gotten used to it. The fuel shut-off is a bit finicky and can be too close to the flaps depending on the plane. Other than those little things, I've had no problems with this game.\nIf I could find a Bluetooth HOTAS stick that would work with this game, it would be nearly perfect \n\nI highly recommend this game for any flight enthusiast! Maybe watch out if very prone to motion sickness.\n\nHelpful | 1", "DutchTrekMay 5 at 2:41 PM\nNot really like a real flight sim\n\nLooks like it, but needs work.\nPls bring a good working 747 sim\nXplanes to quest or flight unlimited\n\nHelpful | 0", "KyleDoesAQuestFeb 21 at 5:04 PM\nFeels Great to Play!\n\nWith this game, you get what you see. A simple game about flying airplanes. It feels pretty great to fly around and there's challenges to complete which is nice. Not the most interesting VR title but absolutely worth a try.\n\nHelpful | 0", "DarkAlkaiserFeb 24 at 1:29 AM\nAdore it\n\nIt's flawed for sure. Takes WAY too long to get to the second plane, but I just love the feeling of flying, even over a rather lack luster landscape.\n\nIf you love flying, it's a blast, if you expect pretty much anything else, you'll likely be disappointed.\n\nFlying and shooting balloons with a handgun is likely gun3 for an though\n\nHelpful | 0", "0xfsNov 2 at 4:00 PM\nFantastic fun, not enough fuel.\n\nI have a lot of fun flying the different missions and planes. I have made it to the third island, and third plane. Looking forward to finding out what the forth plane flys like.\n\nPositives:\n- A lot of different types of jobs to fly\n- Each plane teaches you something new about flying\n- Each island gives you very different flying experiences\n- free flight is loads of fun\n\nMinor things to fix: * need unlimited fuel (free flight) *\n- dials are unreadable (dark black) when in shadows\n* need illuminated dials *\n- fuel runs out to fast in free flight (about 10min of flight)\n* need unlimited fuel (free flight) *\n- Some graphical glitches when flying above 10,000\n\nWell worth the purchase, and with the above fixes, would be an amazing game for the Quest.\n\nHelpful | 75", "MightyQuinnJFeb 23 at 12:15 AM\nSuper fun slight sim!!\n\nI love how the realistic flight controls and mechanics makes you feel like your really flying! That being said bc you get that realistic flight feeling be cautious with the settings! Ive got pretty sturdy vr legs but could see a newb having motion sickness issues with having the full visual mode. But this is a very fun game and I would say its a must have for any aeronautic fan!\n\nHelpful | 0", "Judep114Apr 12 at 9:37 AM\nFlight Sim\n\nWould like a combat jet or helicopter flight simulator\n\nHelpful | 0", "Seaborn111Feb 29 at 8:41 PM\nGood fun, little quirky\n\nOf course I searched flight sim early on. This one is good fun but sometimes the controls/mechanics can be a bit frustrating. Absolutely must play though.\n\nHelpful | 0", "epicalex27Feb 26 at 4:30 PM\nWonderful game\n\nThis game is awesome and I really recommend it but it does really gives you a headache when you start doing knife turns so I don't recommend this game if your sensitive\n\nHelpful | 0", "ISurvivor007Mar 23 at 8:04 AM\nAwesome\n\nFun, learning curved game that provides hours of gameplay (you'll get your buck for your dollar). They also fixed all my complaints\n\nHelpful | 0", "cyllas.rossJan 25 at 5:26 PM\nOne of a kind\n\nGreat game for Flight Simmers! Since there are no other game(s) to compare it to on the quest it is the best ever! Physics are spot on. Even though you may have played it in its entirety you will find your self strapping up to just fly around to keep yourself current. I wish this developer would either make add ons or a part 2. Either way Im still playing it till this day. Actually I just flew around just a second ago before I got the notification asking for a review.\n\nHelpful | 3", "embed_May 17 at 1:38 AM\nNeeds better controls, fun overall.\n\nPlayed for about 3 hours and it's good fun. Controls sometimes don't work and I tend to put my flaps to max when bringing throttle up. Other than that it's everything I could've asked for. Wish there was a sandbox to try all the planes out though.\n\nHelpful | 0", "m.cody.simsJan 18 at 1:58 PM\nVery fun game!\n\nI have found Ultrawings to be a very fun flying simulator. It doesnt have the most realistic graphics in the world but it does have charm and it provides a decent flying recreation. My one small quibble with the game so far is that some of the toggle/instrument utilization is a little finicky. I have to sometimes try a few attempts to get the desired result. Overall this is a good game and you could do much worse than buying Ultrawings.\n\nHelpful | 5", "spudwrenchFeb 25 at 11:03 AM\nGreat but could be amazing\n\nDont get me wrong I'm only a couple of days in and i have very much enjoyed the game so far. From a sim standpoint it's great, but not so much for a game. It has a few negatives holding it back from being simply amazing. For starters when I play sitting vr games I am usually on my couch for comfort. The only drawback is that in this game I cannot reach the throttle control because I end up hitting the couch before I can get to the throttle lever. There needs to be a way to adjust the height of things in the cockpit. The other issue I have is this game needs more scenery. It gets very repetitive looking at the same things and doesn't take long before you have explored all of it.\n\nThe challenges are very repetitive and start to feel the same as well.\n\nNeed a free fly mode that doesnt require fuel for when you just want to goof off and are not trying to be confined to realistic concepts.\n\nAlso need more aircraft\n\nHelpful | 1", "Lucario_boiJan 25 at 7:16 PM\nPretty good game \n\nIve been playing this flight sim for a couple days and for a cartoon flying game its well worth the price of $15 theres a few bugs that could be fixed with a update like the fuel lever doesnt always go up when you try to start the plane thats my biggest complaint about this game besides that its pretty fun\n\nHelpful | 1", "SuperNinja9000Apr 3 at 4:49 AM\nSo Much Fun!\n\nIve been playing for awhile now and its really fun!\n\nHelpful | 0", "MayorNessaFeb 21 at 7:34 PM\nAlmost trow up. (But in a nice way)\n\nGreat experience, very inmersive. Some controls could use a little improvement, because you pass your hand trough it, but everything else is really great. You get really dizzy, if you try to do crazy stunts, which is a great thing if you are looking for the real deal.\n\nHelpful | 1", "Darius_1Jul 8 at 4:30 PM\nLove it\n\nThis game is great for anyone who knows the controls. 10/10\n\nHelpful | 0", "ferbgamer223Mar 21 at 8:41 PM\ngood\n\nnice game\n\nHelpful | 0", "JellyfishManiacMar 13 at 8:02 PM\nRealistic yet not too realistic\n\nRead the title. Good game! Lots of campaign!\n\nHelpful | 0", "GiarlyFeb 10 at 10:43 AM\nGreat game but could need more content.\n\nThis is game has a lot of potensial.\nIt runs well and its a lot of fun, but i wish there was more places to go and more planes to fly.\nI also wish that the runways would be longer.\nIt could have a fighter jet and an aircraft carrier at one of the maps.\nAnd maybe even have helicopters in it aswell.\nI do wish that you could travel from island to island via the plane and not fast travel.\nOverall this is a great game with a lot of potensial.\nI would recommend this game as one of the first you play as it is easy to learn but hard to master.\nI give it 5 stars\n\nHelpful | 0", "dcallearyFeb 21 at 4:42 AM\nBest flight simulator on quest\n\nCartoon themed flight simulator with some issues but you learn how to get around then. Very relaxing and gives you different comfort options. I had this on the oculus go and got it for free as I had previously bought it.\n\nHelpful | 0", "MilkManVRJan 16 at 6:39 AM\nGreat concept with a few small hitches\n\nText is often very aliased and hard to read.\nThe controls are sometimes painful to interact with.\nAll in all I am having a bit of fun with this. But would love to see improvements in the controls department. Specifically the red knob you turn to allow fuel flow is a pain. The gas throttle can be finicky.\n\nHelpful | 0", "Ace_007Jan 13 at 5:59 PM\nDefinitely worth it.\n\nThe game is fantastic. The arcade-y flight is a blast (Assuming you aren't a WEAKLING prone to motion sickness)\n\nAvoid \"Land!\" missions at all costs. They are one of the most infuriating experiences I have had in VR so far.\n\nIntentionally crash the glidester at full speed at least once, if you enjoy an adrenaline rush.\n\nHelpful | 1", "donwrob317Jan 14 at 12:27 PM\nEnjoyable flight simulator\n\nI really had a good time with this game. I did get nauseous a few times in the beginning. The reason for only 4 stars? I found myself wanting more, money in the bank and nothing more to buy! I kept thinking there may be a hidden area to explore and buy a fighter jet or something! Lol. Oh well, it was still very enjoyable and worth purchasing in my opinion.\n\nHelpful | 0", "PudgybubbaFeb 24 at 12:22 AM\nSo good\n\ntotally immersive and fun! Me and my friends played for hours, you actually feel the g-force and get a little dizzy with comfort turned all the way off. Totally worth the money spent!\n\nHelpful | 0", "JankultYTFeb 25 at 3:26 PM\nSome new updates would have been good\n\nThe design of the hands are a little thin.\nIf the developers could make pvp dogfights and jets or something, it would have been a improved and\npopular oculus quest game. Everything else is just perfect\n\nHelpful | 0", "sputukJan 10 at 8:05 PM\nGreat fun, but not for novices to VR\n\nFirst, Ive seen a lot of the negative comments and I can see where people have struggled and judged the game harshly, but many of them are just plane (sic - excuse the pun) wrong.\n\nYes, there is a knack to using the controls in the plane, but its not really that difficult to get used to. Yes, the DEFAULT view in the plane has the side windows covered, but there is an option to change that, and its clear that the default has been done to try to avoid new players suffering from too much motion sickness by limiting the field of view deliberately - but once you are comfortable with the motion, you can have the plane wide open and enjoy the views.\n\nThe mission select interface using the virtual PC is bearable but its a bit of a pain.\n\nOverall, good fun, and plays well. People who have issues must either be suffering with a faulty/badly behaving VR set up, or simply havent given the game the 5 mins it takes to get used to how it plays.\n\nHelpful | 1", "JcPeacemakerFeb 19 at 3:11 AM\nReal thrill in vr.\n\nI keep coming back to this one. Real sense of freedom. Amazing thrill when performing stunts and massive set of challenges for completionists. Great to show of to family and friends at a party.\n\nHelpful | 1", "FacebuddiMar 6 at 10:38 AM\nAmazing\n\nBrilliant game but just after you get your license you feel like theres nothing to do but after that it gets really fun\n\nHelpful | 0", "CephjediFeb 7 at 5:09 AM\nGreat start, but bad controls ruin it.\n\nI love to fly and Ultrawings has done an admirable job bringing the feeling of flight to the VR world. Sitting in a wide open ultralight cockpit while lazily circling over a dormant volcano is incredibly liberating.\n\nBut. Fighting with unresponsive controls is a surefire way to ruin any game, and this one is awful. Trying to accomplish some of the precision landings and other jobs are very difficult because the controller/grip tracking is terrible on this game. It routinely takes 3 or 4 tries just to turn the fuel valve, and forget juggling the stick and flaps while in the air. You just cant reliably adjust the flaps while flying. Your grabs dont track right so you accidentally turn off the fuel or the mag. Its so frustrating! You wind up having to try different hands, then you lose the stick, then your plane veers off and before you know it the job is failed and you have to start over.\n\nIf the developers can tighten up those controls, the Id say youve got a hit on your hands.\n\nHelpful | 1", "LastHope79Feb 21 at 3:29 AM\nNice App but airplane to lame \n\nI like this app but the airplane is to lame ... more power will be nice !\n\nHelpful | 0", "jeff.mannionFeb 29 at 7:02 AM\nFun, but not stellar\n\nGood fun for short times.\n\nHelpful | 0", "VarkRavenSep 26, 2019 at 8:23 PM\nExcellent simulator\n\nI'm a professional pilot currently flying for an airline and with 20 years of previous fighter and transport experience in the Air Force. That being said, I find this program to be excellent for what it is, a pretty spot-on flight sim. Controls are very understandable and they feel right on for the characteristics of the aircraft being offered. And just flying around the islands and doing things I'd never try in a real aircraft is a lot of fun.\n\nOf course I have all the comfort switched off and have the program in simulator mode so it is possible with different settings that you may have different experiences.\n\nI find that the concept of energy management is really well done in this game as well. The rocket glider is a favorite so far, initially flying very much like a fighter aircraft and then needing to be energy managed all the way to touchdown. It's definitely tricky, especially when they build a seawall at both ends of the runway!\n\nThings I'd like to see fixed include making the fuel easier to switch on, putting the flap lever on the left side in the rocket glider to help so I don't have to reach across to activate it, and getting rid of the complete blackout of the instruments when the sun isn't on them. That last bit is probably one of the most unrealistic parts of the game in my mind and slightly mars an otherwise excellent program.\n\nOverall, as you can tell I really like this and as someone who's been flying for about 25 years I think it can be both a fun introduction to flying as well as a simple but effective simulator that can teach a decent bit of airmanship.\n\nHelpful | 326", "Fireskydiver7Feb 19 at 9:40 AM\nBest Game\n\nO love flying and am looking forward to being a future pilot! Also please add more planes and bigger places in an update, other than that, your doing great!\n\nHelpful | 0", "gibritteApr 4 at 5:42 PM\n\nDoesnt work ! Command arent accurate at all!\n\nHelpful | 1", "Brad1954Feb 15 at 4:19 AM\nSlow at first\n\nAt the start it is very slow with only one plane that is my only complaint\n\nHelpful | 0", "StreetJusticeDec 31 at 9:44 PM\nWell made, but....\n\nVery immersive. There are a couple of problems, but overall worth the money if you like the feel of flight. Some of the controls in VR are way too difficult to activate. Also, progressing in the game is too difficult to understand. Its almost like a puzzle game, when it actually isnt.\n\nBut the feeling of flying is very real. My kids and mother nearly fell at several points during the game. Fun to play!!!\n\nHelpful | 0", "emperoroftheuniverseDec 10 at 11:27 AM\nBoring and glitchy\n\nOne of my first Quest purchases. Very realistic flight sensation. ( I am a pilot). Frustrating to hold sick- no position feedback. Switching the fuel on is problematic unless you get just the right grip. Same for the throttle which makes it hard to adjust landings with power. Also, need an altimeter. Biggest frustration is that I haven't been able to move on to another plane than the ultralight because I have to earn money with mundane races and slaloms to buy another airport / plane. Should be able to select plane you want to fly.\n\nHelpful | 9", "ItsMeGustaJan 27 at 10:43 AM\nAmazing but...\n\n...take care not to throw up... ;-)\nThe comfort setting is there and do not underestimate it.\nOverall the game is great and worth my money!\n\nHelpful | 0", "OldSpyGuy1Mar 14 at 10:43 AM\nFreeflight has me confounded\n\nI had this game for awhile now but can't get by freeflight. Tried many different things to no avail.\n\nHelpful | 1", "420Brent420Feb 2 at 5:36 AM\nGood but\n\nI like it but multiplayer would b nice n bigger map for those 2 reasons yu lose 1 star but i do like it\n\nHelpful | 0", "arthur67037Jan 13 at 2:20 AM\nBugs, Bugs\n\nEvery session, I spend 5 minutes trying to flip the switch for the fuel flow. That is step one for take-off. Then the stick won't move the ultralight forward. Can someone fix these problems on the ultrawings for the oculus quest? So frustrating every time I play this game that I have given up.\nUPDATE: By reading the reviews here and comments, it was mentioned that I have to press and hold the left hand trigger and the x-button simultaneously and then turn like a key, which worked. Idk about the stick at take-off, but i can live with it, I like this game now. You have to like flying like me, I have been an RC pilot for over 20 years.\n\nHelpful | 0", "BeneuphoMay 16 at 9:08 PM\nReally fun\n\nIts cool to be inside a plane. I put a fan in fan in my room so it feels like I was actually flying. I was way to in to it. One suggestion you should add multiplayer\n\nHelpful | 0", "K9SHAWN16Mar 15 at 4:08 PM\nUltrawings\n\nJust love it, great feel to actual flying, just 10+ onthe wow factor\n\nHelpful | 0", "virgil.gipsonJan 11 at 4:45 AM\nAmazing flight experience\n\nIm just starting to learn to fly in real life (had one lesson as of writing this review). This game is an outstanding flight experience! The physics of the aircrafts flight feel very close to real life. I switched to simulation style as soon as the game offered it, and set the visibility to clear. I havent gotten motion sickness at all, but I have felt the slight disorientation when engaging the rudder (and I am of the opinion that it should feel that way until I have learned what engaging the rudder will do). I wish I had bought this game sooner, great work all.\n\nHelpful | 0", "PortlyPigletDec 16 at 5:58 PM\nGood, but could be better\n\nThe controls and gameplay are fun and intuitive, but after completing the first few islands, the missions just feel very repetitive. I would like to see some challenges, like \"fly this course at a certain speed\" or something like that. I would also like fly all missions on all planes, so that way you can use your own judgement and pick the right plane for the job. Also, the four planes provided are good, but I want to be able to unlock more like 10-20 planes. All in all a great buy\n\nHelpful | 5", "anonymouswolfFeb 16 at 4:31 PM\nPopsicles\n\nHot dog potato holding cow ninja star chicken nugget man so we are potato United States of potato poop nugget oh Millbrae her just so you know Im using dictation dish dish banana nugget turd cow curd turd turd curd yeet yogurt how tall are you ,yogurt\n\nHelpful | 0", "ramrod_budmanFeb 12 at 4:43 PM\nReally enjoyed this game!\n\nIt's a great sitting game with a lot of play time if you are using it like a simulator! If you like planes/flying at all it's a must own\n\nHelpful | 0", "w6graceDec 29 at 8:56 AM\nExcellent Game, slow progression.\n\nGame is well made, and sufficiently realistic to entertain me (a pilot) as well as my kids. My one complaint is the missions are quite repetitive at times, and unlocking new missions and planes takes a while. I hope they continue to add new content.\n\nHelpful | 1", "RadioCougJan 8 at 5:29 PM\nFun, but makes me nauseous!\n\nThe game itself is fun, at least what I have been able to play of it. Admittedly I get VR Sickness from certain titles (fast moving ones particularly), but both of my sons also get very nauseous and they almost never do. If youre inclined to get sick from VR, be warned.\n\nHelpful | 2", "TheSwirlingBrainJan 17 at 1:15 PM\nAn OK flight Sim\n\nI'm sort of on the fence on this one. It's a good flight Sim if a bit cartoon looking. You start out with an ultra light then upgrade to a jet propelled glider. So far there is no indication to me if there will be other planes unlocked it not as there is not a lot of planes to choose from. There are various missions that get progressively harder but nothing super hard that can't be done so far. I want to like this game but it's just so-so for me and with a lack of normal planes to fly I've grown bored with it. I still play it now and then and enjoy it so I keep going back to it but not really excited about it. I just wish it were a little more textures that looked better and more than two planes to play with. I can't really complain much since there's not really any better flying Sim on quest yet so it will have to do for now.\n\nHelpful | 0", "thegabeJan 6 at 8:22 AM\nNice flight sim game\n\nI only achieved buying 2 airports and still have only one plane, its really fun to fly around in the beautiful island environment.\n\nI had 2 crashes, but They're weren't during missions, so they don't matter. Missions at the start are not too hard, but they have a nice difficulty steep. Controls feel good.\n\nStarting up a plane isn't that hard, I've read comments about the fuel valve before, but it's not that bad. There are a lot of comfort options, I prefer the one where I see the most.\n\nA good stable seat or beanbag is recommended to play, if you take too sharp turns you can get dizzy easily.\n\nI am waiting for your next game, Dear Devs, keep up the good work!\n\nHelpful | 1", "CaptainKFCFeb 23 at 11:46 AM\nNeeds a jet\n\nI like it but it needs more planes and more different challenges\n\nHelpful | 0", "MidwayMonster512Jan 12 at 12:37 PM\nFun simulator\n\nI have always wanted my private pilots license. Although not the same, so far this has given me a lot of the feels and was just amazing feeling to fly a plane. Coming from the perspective of a grown adult who always wanted to be a pilot - I absolutely love this game.\n\nHelpful | 0", "fishdude2019Dec 31 at 11:51 PM\nAwesome game!\n\nI love this flight sim, I have been looking to get one for a while but havent had the money to buy a few additional monitors and a better pc. This is the first game I bought and I love it! The only problem I had on it was the hard fuel switch and the nausea that comes with the game when you first jump in. In no way is that a bad comment towards the game but it is something to keep in mind if you start to feel sick. Just play in short periods when you start to get dizzy or nautious. Overall great sim for only 20 bucks!\n\nHelpful | 2", "vampygrainJan 2 at 10:17 PM\nVery emersive\n\nI love flight simulators and ever since Ive gotten an oculus Ive wanted one for vr. I found this game and at first I didnt really like it but after learning to fly the game becomes so much fun. I would definitely recommend this game to anyone looking for a really fun and immersive flight simulator\n\nHelpful | 1", "jcquestDec 27 at 7:26 PM\nWay fun\n\nGame is pretty cool, gives you the feeling of real flying, just make sure you set the comfortable level for beginner, it will give you sick motion if it's your first time, or just get a bucket and play with clear option is way too fun\n\nHelpful | 1", "Jani1988Feb 21 at 11:57 AM\nA chill flight\n\nThis game I play when I want a no-brainer game. Very relaxing!\n\nHelpful | 0", "fehz1Jan 15 at 9:56 PM\n\nI really like this game becausee it gives the feeling of flying. It's a good simulation, the only problem is that while flying I often feel sick.\n\nHelpful | 0", "XoACABoXJan 31 at 2:03 PM\nHelp\n\nIt seems to be a great little game..... when i can eventually flick the switch for the fuel!!!! Literally sat there for 5 minutes trying everything!!! Its killing what could be a winner for me \n\nHelpful | 0", "AntebarteFeb 10 at 10:42 PM\nPretty good game.\n\nThe ggm\n\nHelpful | 0", "MalibinoJan 3 at 4:55 PM\nEasy and fun. I like motion sickness\n\nThis was the first game I bought. I am a bit psycho and enjoy flying around islands tipping the stick as far up and down as possible to give a feeling of excitement. I suggest doing the free flight after learning the tutorial (which is short but needed. If your prone to motion sickness this game accommodates well by adding blinders to the cockpit. You unlock different aircraft later (I have not yet). As well as different jobs and courses which earn you money to but landing strips/airports. Oh and youll love trying to maintain control of your aircraft while shooting balloons. If your an adult you can have a wine spritzer and test your pilot wings. Super fun. Wish it had an update with more aircraft (helicopter maybe).\n\nHelpful | 0", "CaminoDiabloJan 28 at 3:54 PM\nLove it\n\nIts really neat to fly around and just have fun. Feels like your really in the plane and I hope there are add ons or a sequel. Buy it, you will like it for just having fun\n\nHelpful | 0", "habakoskiApr 10 at 5:46 AM\nFun flight sim, shame no hand tracking\n\nUltrawings is a fun light flight sim and totally holds up in 2020.\n\nMotion controls work really well but the game would be perfect if we could have hand tracking support - so that we could push the dashboard buttons with our fingers!\n\nAlso the possibility to manually align real world HOTAS system with the VR view (adjust throttle and joystick position in the cockpit) would be mind-blowing. Maybe these features will find their way into Ultrawings develors next title, eh? One can dream at least.\n\nHelpful | 0", "alyinpacificaDec 22 at 4:44 PM\nIncredible simulation.\n\nAll those flight sims youve (like me) been playing for the last 38 years pale next to this. The mechanics, once turned to SIM mode are near-perfect. The flight characteristics of each vehicle are quite unique. Missions range from easy all the way up to throw-the-controller-at-the-wall. Which is a good thing. This is not a dry 767 simulator, but you WILL feel your heart in your mouth. And it is so replayable.\n\nHelpful | 4", "getwreckedson11Dec 28 at 8:50 AM\nIm surprised!\n\nI bought this game for twelve dollars, and think its worth double that. The planes handle nicely and the controls feel really good. There are only four planes, which need to be unlocked by completing missions, but the missions do not get old quickly and there is good variety in them. I think the devs should add some new planes and an upgrade system maybe.\n\nHelpful | 0", "mradammillsJan 23 at 9:30 PM\nAbsolutely fantastic\n\nIve been playing computer games for 30+ years and really enjoyed playing this  flight simulator its a breath of fresh air Big thanks to game developer\n\nHelpful | 1", "joBDCMTDec 24 at 12:55 PM\nThe ultimate flying simulation\n\nWere getting a VR headset the main thing that you would want is an interactive experience of a real thing that is either too complicated or too expensive to do in the real world\nUltra wings delivers flying experience perfectly and despite the fact that the graphics might be a little toned down the whole experience itself makes up for that and for the price of only $15(Price me grow or lower depending on demand) its perfect\nAnd dont worry about motion sickness my grandma was able to play for the game for over 20 minutes without any problems\n\nHelpful | 1", "muddywaterzzzJan 18 at 8:50 AM\nTrue feeling of fligh\n\nI've been playing this since the Go, and it is still great to play. The sense of flight is super realistic and flying/gliding around different islands never gets old!\n\nHelpful | 1", "Genji515Apr 4 at 11:00 PM\nA really fun game\n\nHello i just wanted to say i really like this game i have been hoping for a flight sim and it was on sale so I decided to get it definitely recommend every time i get a new plane i get all giddy i just wish they had more then 4 maybe like 10 or 12 would be cool! 10/10\n\nHelpful | 0", "Black_NapalmJan 17 at 11:24 PM\nA Dream come true\n\nAn amazing experience. As an amateur flight enthusiast this simulation would have literally been worth the cost of a Quest JUST to be able to play this every day. 6/6 Stars\n\nHelpful | 1", "TheBrodsterMay 6 at 2:50 PM\nFun game\n\nFun game\n\nHelpful | 0", "Trump4Life1706Jan 21 at 5:34 PM\n\nVery Good just hard to get new planes\n\nHelpful | 0", "Nizno_lwdMay 7 at 12:05 PM\nA lot of fun\n\nThis game is a lot of fun, easy to learn and fun to fly around in missions and freeflight!\n\nHelpful | 0", "dark_bow_Nov 30 at 8:13 PM\nGreat game lot of motion sickness\n\nAs the title says its a really good game although I fell like it needs to explain how to get more planes and islands also because of the nature of the game motion sickness is a big issue but if you get a chair youre set but DO NOT STAND WHILST PLAYING you will fall and hurt yourself\n\nHelpful | 2", "xxCaphxxDec 23 at 4:13 PM\nUnplayable\n\nI would love to be able to play this game. It looks and sounds awesome! Unfortunately it is impossible to press the Engage Starter button so it is impossible to take off. Even when I'm on the ground shutters appear over most of the windows blocking all view unless I turn and specifically look out of them. How has this beta version of a game been allowed to be released on the actual store?\n\nHelpful | 3", "genghisjahnJan 5 at 7:30 PM\nLots of fun\n\nI set all the settings to simulator. So much fun figuring out the flight mechanics. Free flight is my favorite but the missions are fun too. Any chance we could get an F4U Corsair?\n\nHelpful | 0", "DawnstarDBJan 16 at 2:15 PM\n\nVery enjoyable experience\n\nHelpful | 0", "RPNT_Dec 9 at 10:08 AM\nGood intro to flying\n\nFor the price this is a good intro into what VR flying can be. The only feedback I would have is to create better hand animations that interact with the panel instrumentation more accurately. Other then that the gameplay is great, the progress and story is well done, and I like the options available.\n\nHelpful | 0", "matt.pennington.986Feb 4 at 11:44 PM\nPoor\n\nPoor game, controls slopy, game loses any interest after about 5 mins.\n\nHelpful | 2", "TheSmilingCrocDec 18 at 6:04 AM\nIts good but,\n\nYou can tell it wasnt optimized for quest since its just the go version. Its fun to play around with and do missions just wish it was more optimized\n\nHelpful | 0", "deefalconFeb 8 at 8:58 PM\nCant even fly\n\nI cannot move my hand in such a way to turn the plane on. I did it once that was great, but I need help.\n\nHelpful | 0", "spaceXace74Dec 28 at 6:38 AM\nFun but...\n\nIf you are the littlest bit motion sick do not buy it will make you sick as hell\n\nHelpful | 1", "RakvalenFeb 20 at 10:27 PM\nwth\n\nwent on sale right after i bought it\n\nHelpful | 2", "ZgamerVRJan 1 at 2:43 PM\nGreat game\n\nGreat game, the game is very immersive so makes up for the graphics, graphics arent bad just not the best Ive seen but still gives hours on end of gameplay.\n\nHelpful | 0", "iceman517Jan 18 at 1:35 AM\nCannot go to next level\n\nHave been playing this game for a while now but no money is going into bank therefore cannot move up a level. Very frustrating\n\nHelpful | 1", "mannamitDec 10 at 9:20 AM\nAwesome feel. Minor control issues\n\nIn mid game but already I really love this game. Feels really nice but I wish we had more\nFeedback from the\nControllers and headset.\nIn flight controls (steering stick, flaps handle Etc) has some issues and does not always work properly. But overall great game.\n\nHelpful | 0", "bensmith_czNov 9 at 3:27 PM\nAwesome\n\nIts not as good as the full-fledged PC version on account of the limited processing power of the Quest, but equally as immersive. Theres a great deal of fun to be had here, and if youre in any way into flying, then its a must have. The shooting balloons game is really fun as well!\n\nThe only cons are the limited aircraft, and of course not being a real simulator. Even still, as an amateur pilot, I find it surprisingly realistic!\n\nAnyway, buy it, even at full price.\n\nHelpful | 1", "SamHamwichNov 30 at 6:03 AM\nA word on controls\n\nThe game is awesome as already mentioned here and well worth the money. Controls work by grabbing the virtual controls in game, or you can use the right analogue stick as the flight stick and left analogue for rudder, throttle is still managed by grabbing the in game throttle which is a bit fiddly to get hold of.\nThe game is pretty tough and can be frustrating in later levels where the cool unlocks are.\nI had it on the psvr and the differences are minimal, a bit less detail and looks like separately loaded maps for each island.\n\nHelpful | 0", "drsurnameDec 17 at 4:11 PM\nAmazing for the price\n\nProbably my favorite Oculus Quest title.\nAmazing for its price, its very fun!\nHowever it is the only game that has given me some motion sickness. It happens if I lean my head too much while in the air.\n\nHelpful | 1", "chontlerDec 25 at 7:20 PM\nGreat when you can get it to fly...\n\n...but I seem to be spending more time trying to turn the fuel switch than actually playing the game. Please sort this out, I know I'm not the only one.\n\nHelpful | 4", "AnglezarkeNov 23 at 4:15 PM\nFeels so real, its uncanny.\n\nIm really enjoying this. As a flight-simmer for decades Ive always wanted what VR can give. This game does not have the photo-real airports and real-world weather, no ATC chat and orders, but it has the magic of VR and realistic flight behaviour. Totally lovable. Thank you.\n\nHelpful | 4", "jedfryDec 22 at 10:31 AM\nIts ok\n\nI wish there were more planes and bigger areas to fly over\n\nHelpful | 0", "jessevanderkooijJan 14 at 6:54 AM\nCool game\n\nIts a cool If you like planes\n\nHelpful | 0", "star5kyJan 5 at 2:41 AM\n\nIt deserves to be called a simulator even tho graphics are cartoon styled.\n\nHelpful | 0", "richard.merry.66Dec 16 at 12:45 PM\nUltrawings\n\nGreat fun but felt nauseous after 20 mins...Still love it though\n\nHelpful | 1", "TomanoleOct 11 at 12:26 PM\nGreat Game.. Could be awesome\n\nThis is a great flight simulator for Quest. You really get the feel of flying. For some reason the Gear VR version made me a little motion sick, but this version does not and gives me use of both hands, which is great! Thanks for the free upgrade!\n\nThe one thing that would make it five stars, or even ten, for me would be a multi player PVP dogfight mode!\n\nHelpful | 10", "dipsodorsalOct 31 at 8:38 PM\nGets much better\n\nI wasn't playing this a lot to begin with. It seemed more like a novelty with the first plane. You get a feeling for the game but it's not until you get the second aircraft that you really see how fun this game can be. I'd like to find a flight stick mod for the controller. It feels really odd sometimes when the input isn't really attached to anything. I look at this game as training for future flight games.\n\nHelpful | 1", "jonathan.savoy.58Nov 27 at 11:13 AM\nCOULD BE SO MUCH MORE\n\nDont like reviews but I was really excited about flying with a good VR system. Game started out decent but then became monotonous. Same thing over and over again.\n\nHelpful | 1", "Hendo70Dec 28 at 1:40 AM\nI love it\n\nIt is really fun to just fly around and it is the most calming game I own, when Im not crashing\n\nHelpful | 0", "Tg9223Nov 16 at 8:35 PM\nUltra wings\n\nI like this program a lot but I must say that I am getting frustrated trying to get to the next plane from the Ultra Wing. I have played it many times but cant seem to get to the next level.\n\nTom\n\nHelpful | 1", "Small_Nugget123Oct 24 at 5:05 PM\nGood but\n\nIt is a great game however. The fact that I have to get gold every time, on each level to move on makes the game go more slowly. So why even put in silver if its practically pointless since I cant move on with out getting gold. Also I know most people would say get good but,flying a plane is hard.\n\nHelpful | 2", "CentauriiNov 8 at 4:36 AM\nFun and emersive\n\nIts a fun and emmesive game. But the Best Thing in the game is the shooting. It feels so good to Lean out and shoot while steering with the other hand. I would love if the developer made a game That focuses around shooting.\n\nHelpful | 2", "cbsand05Nov 16 at 7:55 PM\nAmazing and more to come\n\nI love this game, it has a seriously good feel in the pilots seat and with every action you perform. This game had so much to do and master. This game has multiple challenges planes and airports which makes the game feel open and never leaves you without tasks. The aircraft can be set to 3 levels of comfort for new players who dont quite have their vr legs. And two levels of control simulation and arcade. I often find myself switching between these just for a different feel in flight. Having these features helps you customize the already good feel of the game.\n\nThe only issue I have with this game is sometimes the gliders thruster pushing you down to the ground its not a big deal most of the time so I found no reason to dock stars.\n\nIn my conclusion this game is one of the better ones I have for my brain system and always leaves me with a good taste in my mouth: 5 stars!\n\nHelpful | 0", "HowDoVrJan 10 at 8:26 PM\nHa\n\n\n\nHelpful | 0", "HaazzaTTDec 16 at 3:56 AM\nAmazing game\n\nReally fun game with tons of content! I must of put around 12 hours into this game so far and i am only 44% the way through the challenges!\n\nHelpful | 0", "CapnBDub67Dec 29 at 10:08 AM\nWow\n\nSo real it was making me motion sick!!! I love it!\nDefinitely a must have\n\nHelpful | 0", "Zensix6Nov 22 at 4:01 PM\nNice for beginner flight sim enthusiast\n\nI had some experience in the past with HTC Vive HMD and I recently switched to a Oculus quest HMD. I have no PC anymore and something I really miss is VTOL VR.\n\nHelpful | 0", "ddraig_gochOct 31 at 2:04 PM\nGreat, just want more...\n\nIts a brilliant accessible flight sim that scaffolds the experience with progression to more realistic options, but the landscape is limited in opportunities to explore in free flight and it would be great to progress to some bigger aircraft. Maybe even multiplayer?\n\nHelpful | 0", "wcheswickNov 18 at 9:32 AM\nI'm worried about airsickness.\n\nI have passed the first ultralight trails and liked it a lot. I have great hopes for this app. But I walked away sweating and a little dizzy.\n\nIt needs to be played sitting down, on a chair with enough arm room. I am having trouble flipping the switches and stuff, but I guess that will improve.\n\nThe scenery is limited but fine, and it really is a 3D flying experience, unlike the flight simulators of old.\n\nI am going to check for instructions to minimize the dizziness and try some more levels, before deciding whether to keep it.\n\n(BTW, I have piloted real aircraft, and airsickness is totally not a problem for me.)\n\nHelpful | 2", "sean.boguniaJan 9 at 7:26 PM\nVery fun\n\nLove this game\n\nHelpful | 0", "CloudTurtle27Jan 23 at 6:10 AM\nAwful controls\n\nWanted to like this but just couldnt get past the poor controls.\n\nHelpful | 0", "Chaud_7Apr 11 at 1:58 AM\n\nSuper entertaining flying game, I love it !\n\nHelpful | 0", "GemarcusApr 9 at 2:43 PM\nVery immersive. Really relaxing\n\nExcellent app. Fantastic game to play. Very relaxing\n\nHelpful | 0", "joetheboss07Dec 8 at 3:12 PM\nNeeds more aircraft\n\nGreat game no motion sickness but needs a helicopter or a fighter jet\n\nHelpful | 0", "m4gnet81Dec 14 at 10:09 AM\nExcellent\n\nI at first thought itd be a boring empty game. But as I bought it, it has exciting gameplay which encourages you to play more highly addictive\n\nHelpful | 1", "DuncanPeckOct 30 at 9:05 AM\nFantastic!!\n\nThe perfect game in my humble opinion. It has that incredible sense of scale and being up their in the sky.\n\nI started off with the first plane, cheered as I managed to learn to pilot it into a successful landing.\n\nBy the time I unlocked the second plane, the rocket powered glider I learnt a great appreciation for having to glide into a landing without boosting my throttle when I had made a previous error of judgement.. all important life skills.\n\nNow I'm on the third island, I have unlocked the stunt plane!! It's insane after spending a couple of days trying to work out how to 1) fly it! 2) land it! I love the stuff you can do. I get a real rush from the campaign objectives and I'm always left wanting more!!\n\nI eagerly anticipate the final plane. I can't wait to see what that is like. I absolutely love this game!! Please make a sequel it's the best game on the Quest!!\n\nNothing comes close to the feeling of ruling the sky's in such a way; it's an incredible feeling.\n\nThanks to the developers for making this experience, you have made a perfect game with progression and above all the elements of fun and enjoyment.\n\nI feel like I'm finally learning the mechanics of flying!\n\nHelpful | 5", "wigginswadeOct 10 at 3:18 PM\nNot x-plane\n\nWith that said its good. Im still in the ultralight and I can do a slip to lose altitude straighten out at the last minute to a soft landing. The controls and response to control input seems to be good. I was a student pilot for 13hrs in the air. (Could not afford to continue to pursue a dream) but I do have some experience if minimal actually piloting an aircraft. (Piper Cherokee). And the ultralight, I suppose the rest, responds predictably and accurately\n\nI do miss the more complex graphics of sims like Microsoft and xplane. But virtual flight sim for $399 plus $15! Are you kidding?! Absolutely worth it!\n\nHelpful | 5", "captain_kerkDec 8 at 7:03 AM\nSuper Realistic\n\nGame is so real and fun but can only play for like 10 min because of the motion sickness but once its passed I start playing again cant get enough\n\nHelpful | 0", "ChanceTime0387Dec 23 at 10:29 AM\n\nMore planes please. Big ones! Trying to land is the most fun...\n\nHelpful | 1", "scott_elliottJan 15 at 8:48 PM\nBoring\n\nNo much going on with this game. I would like a refund.\n\nHelpful | 0", "theCount99Dec 11 at 5:25 AM\nNothing like an actual flight simulator.\n\nThis is a cartoonish game. The 'controls' are like a Fisher Price toy but the Dynamics of the stick are pretty good. Caution... This may give you motion sickness.\n\nHelpful | 0", "Mason623Nov 29 at 6:10 AM\n\nI have been playing this game for a few months and I have to say, IT IS AMAZING! The only two things that would be cool to add on is a fighter jet and a dogfight game mode\n\nHelpful | 0", "Mgonza19Dec 2 at 8:29 PM\nNot very user friedly.\n\nControls are very difficult to grab. I spent minutes trying to add fuel or turn on the magnets. Does not show altitude or directions. I have landed after many tries but can not go to the next level. I do not like it.\n\nHelpful | 1", "rjeccreastOct 21 at 9:19 AM\nWorld Class Sim\n\nI am a 25 year veteran of Ultralight flying and USUA certified Ultralight Flight Instructor. I was the Team Leader for the United States at the 1997 1st World Air Games hosted in Turkey. Seeking out an Ultralight flight simulator that was realistic and having aircraft with the inherent flight characteristics that are accurate has been difficult to find until now. The taildragger type ultralight aircraft flown in this app is above and beyond, I only look forward to more realistic capabilities for mechanical devices to help in the simulation of flight controls. This is the number one flight simulator, fun, exciting and realistic. Incredible job thank you. RJE\nPS. The tasks that you must complete to grow your inventory are rightly world class tests of skill. Free flying through the legs of the Trojan statue, under and through the bridge, Landing on streets and outlying areas brings back the joy of barnstorming seat of your pants, wind in your face, bug eating excitement the only ultralight aircraft can give you. I would love the opportunity to add water floats something that would be a fun addition keep up the great work.\n\nHelpful | 6", "925aonraNov 20 at 6:01 AM\nCommodore 64 meets VR\n\nThe graphics on this game are pretty poor. You might just chalk it up to the Quest's capabilities until you compare this against something like End Space. While the flight dynamics of this are better than End Space, they are still not realistic. I kept looking around, trying to feel immersed but this just isn't an immersive experience. Another big issue with this game is that the controls in the plane are frustrating to operate. One disclaimer: I only flew the ultra light b/c I didn't know how to unlock other airplanes (I still don't understand it fully) and wanted to be able to get my money back.\n\nHelpful | 1", "Dumuffinman200Dec 30 at 10:24 AM\nI could play this for hours\n\nSuper fun\n\nHelpful | 0", "TrexAndBlueJan 19 at 12:04 PM\nReally devs\n\nIt won't let me put the helmet on\n\nHelpful | 1", "fireball226Nov 7 at 7:44 PM\nLost progress\n\nI had to do a factory reset on my Oculus Quest and lost all my airplanes and Islands. I hope someone can help me unlock them? I don't know how else to contact the developer\n\nHelpful | 0", "liveinvrDec 26 at 4:36 AM\nUltrawings\n\nGreat simulator love it\n\nHelpful | 0", "viajando.floresDec 31 at 11:25 AM\nNice game\n\nIf you like to fly is a nice game for fun\n\nHelpful | 0", "verdemanOct 18 at 6:21 PM\nA fun game for $15\n\nFor the price its not bad. Sometimes the graphics arent as smooth as I would like. For those who get sick easily on things like this there is a mode which will generally prevent it. Have not gotten very far but so far so good for the most part.\n\nHelpful | 1", "CynroxDec 24 at 12:06 PM\nSimple concept but harder than you think\n\nI very much enjoy it!\n\nHelpful | 0", "kinglucceOct 23 at 12:37 PM\nI dont know\n\nI was going in to this scared that I would have to refund another game and I am not doing that today\nI love the over all game but the handle is not attached to the hand so its very easy to slip and grab something else\n\nThere also needs to be an easier menu system I could not find anything and still havent found it all but its one of my favorite games\n\nI recommend :)\n\nHelpful | 3", "Finn_MacaulayMar 28 at 2:34 PM\nSimple and fun\n\nVery fun, easy controls, easy to learn\n\nHelpful | 0", "Oculus_Prime_67Nov 14 at 4:55 PM\nGreat game, loads of fun\n\nI love this game, have made it to the 2nd island and looking forward to reaching the third.\nAvionics feel very real!\n\nHelpful | 0", "HollywoodDR0Nov 10 at 12:30 AM\nIm flying!!!!!!!!\n\nReally fun game, lots to do, even target shooting missions. The seated experience is a nice change of pace. Ive played for hours and Ive only completed about 50% definitely one you wont beat in a weekend.\n\nHelpful | 1", "colezilla74Oct 6 at 2:29 PM\nPoorly Ported\n\nClearly this title was rushed for the quest and you have some nerve charging 20 bucks for it. I only downloaded it because it's now free since I had it on the oculus go. The quest has some minor things like sail boats and planes flying around but the go with an xbox controller is the only way to play this game. Trying to grab switches and the throttle with the quest controllers is awful. Tried using the xbox controller with this version and the display is frozen when u enter first mission. Don't you developers test things out before release? This is fundamental interactions with vr.\n\nHelpful | 9", "BlaenauFfestiniogDec 25 at 4:00 PM\nCannot find any aircraft\n\nOnly comes up with a microlight . I thought there was supposed to be four aircraft???\n\nHelpful | 0", "Roxtar73Oct 23 at 12:26 AM\nMy favorite app for the Quest\n\nI love love love this game. The way it turns my stomach and the feeling of really flying an airplane is just awesome. Now the graphics arent photo realistic, theyre more late Xbox early to mid Xbox 360. If you want top notch photo realism this isnt your game if you want the exhilaration of feeling like you are really flying then buy now. I was uncertain about this game because it didnt have the best reviews. Its frequently been referred to as Pilot Wings VR which isnt to off base but this is strictly about light weight aircraft.\n\n\n\n\n\nWARNING: POSSIBLE SPOILERS BELOW!!!!!!!\nYou have been warned if you do continue reading there is no turning back.\n\n\n\n\n\n\nAre you sure you want to go on?\n\n\n\n\n\n\n\nOk then its your choice to make. Im not your parent.\n\n\n\n\n3 aircraft to be exact. A ultralight thats fun to fly in, a jet powered glider; its a glider not a jet plane the rocket fires for a few seconds and then you are left to soar unpowered. The rocket can be fired several times; and a small light weight stunt plane. While I find the stunt plane to be the most fun each aircraft has its own unique handling and feel. Each has their own fun things to do.\n\nHelpful | 1", "Will_wrwr55Oct 24 at 1:53 PM\nOkish\n\nIf you dont have a chair to sit in this game can be difficult. It is fun, but the quality is dialed back soo. I hope they add new planes and cool challenges, but I will have to wait.\n\nHelpful | 0", "Drzej3kOct 18 at 4:05 PM\nGreat little game\n\nHad fun playing this. I dont have an issue with motion sickness as some other people have had. I have rode motorcycles and played wipeout on PSVR so am quite used to leaning and looking into a corner. This game does give a good sense of height and speed. Great fun. Not had many issues with hand controls. Just takes a bit of practice.\n\nHelpful | 0", "Dragon376Oct 30 at 10:20 AM\nPilotWings Nostalgia\n\nAmazing game, but I might be a bit biased because I was a huge fan of pilot wings on N64 and this game reminds me of it.\nBeing objective: graphics are basic but the gameplay is solid, anyone that enjoys flying will enjoy this game.\n\nHelpful | 0", "VRVinterOct 21 at 10:37 AM\nFrustrating\n\nAt first this is a highly enjoyable flight sim, with basic graphics it still manages good feels as you sore through the clouds. The fuel tank then begins to run dry and plummets to a watery death.\nTo progress in the game you must complete a series of challenges going from bronze to gold , unfortunately these range from fun to infuriating at the speed of sound (notably) land is the most infuriating part of this otherwise reasonable game. Unfortunately, keeping in mind that progression feels like a long haul flight on a budget airplane, you will spend far to much time trying to land a huge airplane on a tiny bullseye on a cliff, which admittedly sounds fun (it isnt) that unfortunately means by the time you have unlocked the better aircraft you will be too frustrated to enjoy the game.\nFun, frustrating and ultimately a let down.\n\nHelpful | 7", "CaptainFadaDec 4 at 7:20 AM\nFeel Sick\n\nGreat game , played too much so need a break.\n\nHelpful | 0", "nightowl8Nov 4 at 12:30 AM\nNot like flying a real ultralight.\n\nIm not sure about all the five star reviews. You cant even see out of the airplane until you move your head to the right or left. You should be able to see out of the airplane because its an ultralight and it doesnt have any windows or anything. Wish I could get my money back.\n\nHelpful | 3", "cotiso.cetinoiuNov 16 at 4:18 AM\nI'm impressed!\n\nI love this simulator. The controls feel real, the sensation is you actsly fly. Well done devs and keep improving the game!\n\nHelpful | 0", "alex.payne.69Dec 8 at 10:03 PM\nInteresting for the first 5 minutes\n\nGetting into the game and flying is only good for about the first five minutes. After that it gets very repetitive and boring.\n\nHelpful | 1", "obi2kenobiOct 10 at 7:42 AM\nGreat gameplay, low graphics, value buy\n\nThe gameplay is flying a plane. I love flying in VR and it delivers a good experience there which makes this game worth getting.\n\nThere are lots of different modes/challenges which keep things interesting. For example, flying through rings, shooting balloons, or landing on a target.\n\nThis was one of the best games on GearVR and it is still one of the best for Quest.\n\nI wish the graphics could be a little better, but I am betting that isn't possible considering the rate you'd have to render while flying. But as you can see from the pics its like N64 environments. Still fun.\n\nUpdate - after playing a bit more, had to come update to 5 stars. I just have a blast playing it, and the variety of game modes really keeps it fresh. Plus there are just tons of levels.\n\nHelpful | 3", "FollowWingsOct 10 at 12:38 PM\nWoW\n\nI really dont know what to say...\nFirst of all, I wanted a flight simulator in my library, so I took this in to my favs list.\nOverall as I saw from the photos and video I thought its a cartoon style press the button to land/take off easiest fairytale for youngs.\nToday I bought it, turned on simulation mode instantly after the first tutorial mission. Second mission The whole aircraft interface appeared, all buttons and throttle paddle as it should be in a plane.\nHoops that will be hard..\nYeah, I had to restart second mission a couple times to rearrange control now exactly in simulation to my plane. WoW. In game you really feel everything, just like you would be there (heights, turns, manoeuvers, flips). My brain beleives these all are real. I got motion sickness too what I missed long time ago ( no other games can give it back and i like it).\nI made 2 hours of flight continuously, I made many missions, got two landfield and was so cool just to hang out after whaching the view, ships, hills and chill out. My Quest drained but I wanna go back in! This game is a must Buy!! :) Please more stuff devs!\n\nHelpful | 0", "Wardog25Dec 6 at 8:27 PM\nAwesome\n\nAwesome and fun\n\nHelpful | 0", "cjesqipOct 17 at 12:40 PM\nQuest controllers vs BT controller\n\nIt's hard to fly straight using the Quest controllers. The game was much easier for me on Gear VR using a Bluetooth controller. Decent entry for the genre.\n\nHelpful | 0", "Alwyne_VillasNov 25 at 1:39 PM\nGreat game\n\nHighly recommend this game. It feels like you are flying.\n\nHelpful | 0", "VanguardGaming2Oct 12 at 10:55 AM\nIts O.K.\n\nI had fun with the ultralight, and liked flying around. but when i bought the glidester, i completes all of the license mission, but the last one. the mission where you need to fly to the top of the mountain, then fly back down, i cannot get to the top. I cannot find a way to complete the mission. Is it impossible? have other people completed it? if so what am i doing wrong?\n\nHelpful | 2", "hardrisk27dnNov 20 at 7:42 PM\nCool..\n\nThis game so cool.. but I want new game look this with realistic environment..\n\nHelpful | 0", "hbdlOct 24 at 2:08 PM\nFUNNNNNN\n\nThis game is is great way to get exited about flying! Some of the controls can be sticky but that might be user error. I wish there were more planes but other than that its FUNNNN. But you can get motion sick.\n\nHelpful | 0", "SaintTaintNov 10 at 1:09 PM\nGreat\n\nTricky, intense, and fun!\n\nHelpful | 0", "ray.bradshaw1Oct 14 at 1:08 PM\n\nGot this on go and now quest6love it but struggling on second test on free flight, keep landing at airports but getting nothing can't seem to get reward or money\n\nHelpful | 0", "Spanky8237May 21, 2019 at 11:29 PM\nINTENSE!\n\nFor a cartoony, arcade type flight sim, this game is SO much fun! It really does give you a sence of flying and heights. I have played nearly ALL oculus quest launch titles, and this is the only one that gave me slight motion sickness.\nWith that said though, it is WELL worth the $15 price tag! One of my top 5 Quest launch titles! Don't pass it up!\n\nHelpful | 162", "SteffananOct 9 at 8:59 AM\nOne of the best experiences available\n\nI had this game for gear vr and now for quest. This game is huge and the replayability is borderline endless. As expected, it can make you a little motion sick but in short spurts, this is one of my most valuable Quest experiences.\n\nHelpful | 1", "RedenrikOct 17 at 3:40 PM\nCool but miss something\n\nI love this game but it could be way better with some multiplayer dogfight mode!\n\nHelpful | 2", "abra-obscuraAug 3, 2019 at 4:31 AM\nBroken on Quest\n\nThere was a lot to like for this app. A number of fun things to do in the sky, reasonably realistic (for a game) flight models and fun almost cartoonish scenery.\n\nBut I just cant get past how broken the touch controls are. Its difficult to turn on the fuel. Not a real problem as thats during preflight. But about 80% of the time its nearly impossible to grab the throttle. Ive taken to doing all missions at full power and landing by cutting the mags.\n\nHaving all the instruments go black when in shadow is a PITA as well but at least manageable. Forces you to land from a particular direction. You cant really fly seat of your pants w/o a full motion simulator.\n\nLooking at the other reviews, the only explain way to the high ratings is the game must work better on other platforms. Not the game I was playing.\n\nHelpful | 36", "justplanejimOct 19 at 7:01 AM\nAlmost fell out of my chair\n\nAs a private pilot I was Not expecting to be impressed, but this game is more fun than a barrel of drunk monkeys - and a perfect way to unwind just using free flight mode...\n\nHelpful | 1", "CrustyPocketsSep 18, 2019 at 3:04 PM\nImmersive!\n\nThis game is great for getting that feeling of actually flying. I never get bored of taking off!\nA good sit down experience to sometimes just relax with. It gets better once you unlock the 2nd plane too.\n\nHelpful | 2", "brycegarrett32Nov 17 at 5:31 AM\n\nBEST THING EVER\n\nHelpful | 0", "THRaSHER42Oct 4 at 9:24 PM\nGreat Game, A must for Oculus\n\nGreat fun, wish there was some kind of red Baron type game play, they could do a lot more with what theyve done but its a blast hours and hours of flight, little bit slow but once you get all four airplanes its a good time.\n\nHelpful | 1", "preston.luberAug 12, 2019 at 7:39 PM\nCould use some in-game info for users\n\nI like this game. I think it would be helpful to explain the buying of planes within the program. I researched on line and found some forums that explained about landing on the small island airports off the big island to acquire a new plane.\n\nIt took me a long time to earn enough to buy my first plane, the rocket assisted glider and I am having a tough time completing the licensing. The rings are difficult to fly through. (well, at least for me).\n\nI wonder if a compatible joystick would make it easier to control? I'm new to VR but flew a lot of flight sims on my PC so I am not a novice at flying games.\n\nAfter failing the ring mission with the glider multiple times it got to be more frustrating than fun. I am hoping to earn the other 2 planes as they look like more fun in the videos I have seen.\n\nIs there any way other planes can be unlocked without having to jump through hoops?\n\nHelpful | 10", "Prof.DeLusionNov 9 at 2:57 AM\nBrilliant!\n\nBeautiful! I return to fly again and again.\n\nHelpful | 0", "HukaStarfighterNov 17 at 9:19 AM\n\nTop\n\nHelpful | 0", "FickbowtNov 25 at 12:55 AM\nWorld too small\n\nIt's a children's gimmick game that can make you nauseous. It sucks.\n\nHelpful | 1", "simian678Aug 12, 2019 at 10:45 AM\nFun but could use a few tweaks\n\nEnjoying this simple flight sim. My main critique is the sensitivity for grabbing the throttle. It seems like you have to be really precise in terms of the angle of your hand. Can be a bit annoying trying to manipulate the throttle, especially flying the sport plane. Would like to see either a larger grab area for the throttle or maybe some way to lock the hand to the throttle to make it harder for the virtual hand to slip off.\n\nHelpful | 7", "frankasmith568Sep 29, 2019 at 6:04 AM\nFiring with ballon Pop not working.\n\nWarrant replacement of Quest will lose all progress in game, I assume all will do that.\n\nIssue with Glidester. Seems the trigger to fire only works for 1 or 2 shots then stops, changed batteries, but no luck. Can't progress in game. I would not suggest this game until and if bugs worked out. All other titles I have played work. I will ask for refund, but since I got this far, they may not let me. I will not buy any more apps from this company until they improve quality control. I sure hope they don't blame it on the headset, since have had no problems elsewhere.\n\nHelpful | 5", "AIapakiSep 2, 2019 at 2:15 AM\nAT LEAST 20 HOURS OF GAMEPLAY SO FAR\n\nAnd I still have two airports and the 4th plane to unlock. Like the other guy said in my top 5 launch games. I thought this deserved my first written review because of all the lower reviews I see. I dont think they have merit. The game may be cartoony but that is not an issue (thats like saying Mario Bros is cartoony, its a game, it actually adds character), it is a spot on simulator and like many have said it gives a real feel of height, scale and flying. I find it challenging and rewarding. In the beginning I used all the blockers which made it perfectly comfortable so do not let that turn you off, now I have built an immunity to any motion sickness and I use no blockers. The controls are touchy but definitely not game breaking 4 out of 5 on controls. I can see getting 30 hours out of this game and I will probably still play it after I get all golds. Some courses you pull out a pistol and shot targets while trying to fly through rings, satisfying. Worth at least $20usd. Great price! Great fun! GREAT JOB DEVS! Hope you keep adding to it.\n\nHelpful | 4", "jeffrey.jay.378Oct 6 at 5:42 AM\nVery fun game\n\nArcade style flying gave. Very fun lots of replay value\n\nHelpful | 1", "Aracnareaper007Oct 5 at 7:41 AM\nFun flight sim.\n\nI bought this game thinking it had multiplayer for some reason. It dose not from what I can see. I think multiplayer would be really fun for this game. Devs add it please! Other than no multiplayer the game is pretty fun still. You can select a realistic control mode or have it arcade style. I prefer the realistic mode my self. A must buy for flight enthusiasts.\n\nHelpful | 2", "nyra.raynAug 24, 2019 at 10:55 AM\nStuck In Free Flight\n\nSo I got all the way to free flight and bought the airport. I flew around all the other islands and refueled. There is no clear next objective to progress. I bought a flight simulator not a puzzle game. If you can't make the next objective clear to progress then don't make games. Seriously wtf?\n\nHelpful | 5\nDeveloper ResponseAug 27, 2019 at 11:10 AM\n\nemail us at support@bitplanetgames.com", "sifiascoAug 31, 2019 at 8:47 AM\nWhat I was hoping for\n\nA cute friendly interface with what feels to this pilot like real flying mechanics and the absolute joy of the VR experience. Little things like the boost in lift when engaging flaps, the wind noise when going over speed, even the ability to slip to a landing made this feel natural. While its certainly not a full featured sim, its engaging enough and well worth the price.\n\nHelpful | 0", "Lorenzo.BeefheartOct 9 at 5:04 PM\nSo Cool!\n\nA real sense of flying for sure! This is a great flying game with easy to learn controls!\n\nHelpful | 1", "jeffry.verbeckSep 6, 2019 at 2:17 PM\nSlight flaw\n\nFor some reason, I cant see out of my side windows without turning my head. Im currently reinstalling the game to see if it helps, but I really like this game.\n\nUpdate: It works fine now but I am sure I had the wrong settings in the first place\n\nHelpful | 1", "KnarlesGageOct 11 at 3:11 PM\nFun Sim\n\nWhat this game lacks in graphics or realism, it makes up for in fun!\n\nHelpful | 0", "psbAug 19, 2019 at 7:45 AM\nGreat simulator\n\nDespite its cartoonish visuals, this flight simulator is so much more immersive and fun than any 2D simulator. The career track will get you back again and again, with faster and harder planes waiting later in the game. I'd have loved to recoup the status I had earned on the Go already, though...\n\nHelpful | 2", "Bronson.H.M.PSep 6, 2019 at 3:00 AM\nControls\n\nI think this has previously been mentioned but trying to switch the fuel on is very frustrating. Needs a fix because I cant give this more than three stars at the moment. Devs do a fix update and I can up the rating.\n\nHelpful | 4", "David_SheepJul 26, 2019 at 10:12 AM\nGreat but with some little issues\n\nIts a great game, very good flying sensation. But I noticed some problem activating the fuel and I experienced a bug that breaks my game. I bought the first landing track but I dont have access to it so I has to restart the game.\n\nThe graphics are simple, I know the Quest is not very powerful but I think it can do more in visuals. by the way, would be great have Supersampling and MSAA options like Racket Fury.\n\nEven with those small negative points is a great experience, fun and with a lot of content. Woth the price.\n\nHelpful | 2", "bluwatersSep 15, 2019 at 8:00 AM\nAmazing\n\nOne of the most enjoyable and engaging games on the Quest. Definitely a recommendation for all the fly boys out there as it really does get ya feeling that sense.\n\nHelpful | 0", "NINJINCARROTOct 9 at 2:32 AM\nAwesome!!\n\nIt was very realistic and cool!\n\nHelpful | 0", "Emilian1978Aug 5, 2019 at 12:25 AM\nNice and fun, but high motion sickness\n\nHello,\n\nThe game has good graphics (yeah, you could add some more details and anti-aliasing, but I guess it's better not to drain the battery in one hour and to have more motion sickness because of the low FPS). Cut completely the music for a better immersive experience.\n\nThe airplane is balancing too much front and backwards, giving us the motion sickness described by many. Why the real pilots aren't experiencing the motion sickness while in the air? Because they have a fixed visual reference point and because the internal ear is receiving the correct movement signals.\nIn VR the internal ear must be trained.\nThe developer should completely remove the wave movement of the plane and keep the cabin fixed for those with motion sickness - this should be an option in the game (hiding the lateral windows isn't helping at all ... the wave motion (nose up and down) of the plane is giving the motion sickness).\n\nTHIS is the only real issue with this game, the fact that the nose of the plane is moving independently from the pilot. THIS IS NOT happening in reality and should be fixed. In reality your entire body is moving together with the plane, of course. Anyway, the programming of such games has come a long way since the titles I was playing in the 90's and I'm happy to be alive these days and witness the progress of the VR technology.\n\nFinal words about motion sickness:\nAfter many days of game play, your brain will get used with the VR motion and with the lack of signals from the internal ear, so you will not feel sick anymore. Try a mint or a real ginger gum/candy to reduce the motion sickness.\n\nPS: do not worry if your motion sickness isn't passing right away. Mine took about 2 hours to fade away after I stopped playing this game :) I'll play some more tomorrow. I would really like to get over this horrible motion sickness.\n\nHelpful | 5", "imringmanOct 1 at 2:13 AM\nFeels like flying\n\nI'm a pilot and this actually feels like flying!\n\nHelpful | 0", "phylum_sinterJul 10, 2019 at 7:09 PM\nPretty great! let's see more of it!\n\nThis game was my first, and then 12th purchase after refunding the game when the cockpit didn't sit right initially -- if you're having issues with this, the key seems to be to lean forward when you're designating your play area, and if the perspective is wrong, while in-game hold down the oculus button for 2 seconds to reset yourself back into the cockpit.\n\nThe game itself lends to pretty lighthearted challenges, but they do ramp up pretty quick and there are multiple islands to fly around. My reason for 4 stars instead of 5 is mostly down to a desire for more planes, something higher speed (yeah i know, ultralights aren't stunt planes but still), and a greater variety of landscapes would be nice - how about some long flowing rivers, fields waving in the breeze, some birds flying around, and i feel like the graphics could be improved quite a bit after playing other Quest games -- this feels like it was meant to fit on the Oculus Go -- a much more limited system than the quest.\n\nWould love to see more of this, turn it into a series, go full cartoon with it and fill the gap nintendo left in our hearts by abandoning Pilotwings completely... give us a jetpack and more ring challenges! Would love to see some DLC if a sequel isn't yet in the works.\n\nHelpful | 6", "Richie5730Sep 13, 2019 at 4:10 AM\n\nIssues with controls inside aircraft. Very annoying.\n\nHelpful | 4", "SpeculaterMay 28, 2019 at 11:25 AM\nReally really like it... But\n\nI made a review about the game being broken. It is not in fact broken. Make a complete fist (all three triggers) around the fuel switch and rotate your wrist. The tutorial shows a quick flick of the finger, which does not always work. This game is super fun!\n\n\n\nOriginal comment:\n\nThe game is broken. Once you have to buy your first airfield it's impossible to flip the fuel switch on the left. I've reset and tried both hands. No fuel, no flight. Very sad.\n\nHelpful | 34\nDeveloper ResponseMay 28, 2019 at 5:40 AM\n\nemail us at support@bitplanetgames.com", "Steelknuckles5Jul 28, 2019 at 1:23 PM\n\nGreat flying game that has more than meets the eye. For a more immersive experience I would recommend to turn the music off in the game settings as this way you can hear the wind and other sounds which are otherwise obscured by the soundtrack. If you suffer from VR motion sickness start with small movements until you are comfortable. Great fun and immersive.\n\nHelpful | 2", "ShouldYouPlayThisAug 12, 2019 at 12:10 PM\nNo\n\nWhile it can be fun, the controls make me wanna vomit\nNo proper tutorial, controls are wacky, no save slots and you need to figure out how to progress on your own.\nNo.\n\nHelpful | 5", "the_other_oneJul 8, 2019 at 6:59 AM\nMy favorite game on the Quest\n\nUltrawings is one of the games on the Quest that has great longevity. So many missions and you will not progress through the game in just a few days. It will take awhile, and this gives the game great value for the very decent price attached.\n\nThe starter plane, the ultralight, is very easy to fly. Also very enjoyable. The Rocket Glider kicks it up a bit because you have to strategically use your rocket boost so as not to run out of fuel. The sport plane is maneuverable and quick - and will take some practice until you are nailing the center of the rings and landing smoothly. I have not unlocked the 4th plane yet, but hopefully will this week.\n\nI hold a private pilots license (I am not current right now, bummer) - and this game will make you feel like a true pilot. The cockpit controls are very basic, but this approach serves the game well. The devs did a great job with this game, so if you are on the fence, go ahead and purchase this game and reward their hard work.\n\nHelpful | 10", "joebitts01Sep 27, 2019 at 4:12 PM\nOk\n\nIt was ok\n\nHelpful | 0", "ZeroWaitStateOct 9 at 1:42 AM\nThanks for cross buy !\n\nJust want to acknowledge the devs, and their choice to support cross buy. I got this on the GO and found it hard to deal with 3 DOF after using rift and vive, which offer 6 DOF . Many are un aware of the effort to support alternate hardware. In most cases I would be willing pay a portion of full price to access cross buy app . Buy some developers do not support this and want multiple contributions for the same software in the effective same platform. This leaves the a bad taste in the consumers experience\n\nHelpful | 0", "xXMedheadXxJul 26, 2019 at 9:26 AM\nNeeds dogfighting\n\nIt is a really fun game but I think it needs pvp game modes that you can play with friends , like dogfighting or races with online friends\n\nHelpful | 2", "ArvinJun 22, 2019 at 3:00 PM\nVR Pilotwings\n\nThis is a great game if you like flying games. If you've ever played Pilotwings, it's quite similar. The only gripe I have with it is that it doesn't feel as immersive as it could be since you can only see the environment from the cockpit you are directly looking at. You can't see the grass, mountains, and trees unless you completely turn your head towards the windows (possibly for performance reasons). Otherwise this game is great if you love flight simulators, and totally worth the price!\n\nHelpful | 0\nDeveloper ResponseJul 10, 2019 at 6:39 AM\n\nSet comfort settings to None and all windows will be transparent.", "john.michael.5895Aug 24, 2019 at 1:29 PM\nFeel light\n\nMess with your senses. But need more aircraft quicker. Needs a full city.\n\nHelpful | 0", "CarcPazuJun 14, 2019 at 8:41 PM\nVery entertaining\n\nI've played a lot with game. Its look is a little deceptive, it's way more fun and challenging than it looks. It provides a great sense of flying even a little stomach churning at time. Lots of content, I'm about halfway done with the challenges/missions and I already feel I've got my money's worth with this game. It's pretty much the only valid option for flying games at the moment for the Quest so if you want to fly, give this a go. It lost one star cuz it crashed on me a couple of time and yes that pesky fuel switch is a nightmare to rotate. I've wasted at least a total of an hour try to make it work. Please fix this with an update. Just make it that you can flick it with the tip of your finger.\n\nHelpful | 0", "steve13870Jul 5, 2019 at 3:02 AM\nGreat sense of flying\n\nLove this game . I first had it on the gear vr and I'm glad I bought it again .you get a real sense of flying if you are old enough to have played pilot wings then this is like that but your in the cockpit for a proper challenge put it on simulation mode trust me this is a must buy !!\n\nHelpful | 0", "dazzerartJun 3, 2019 at 10:18 PM\nReally good\n\nI made this even more immersive by sitting in my massage chair that vibrates the whole of my back and I stick a fan on in front of me..the vibrations from the chair make it feel like the engine is shaking you..and the buzzing adds to the hum of the engines... This is a brilliant game but doing this made it even better...5 stars even though the game has crashed a few times\n\nHelpful | 4", "useri7Jun 30, 2019 at 4:54 AM\nFantastic game!\n\nThis game is so much fun on the Quest, it gives you a real flight experience and the tasks give hours of good entertainment. I also like that instead of the virtual stick you can also use the thumb sticks on the Quest controllers to control the plane. The only thing missing for me is to bind the throttle to the left thumb stick's up and down movement; I hope they will add that.\n\nHelpful | 0", "ricardo.wallachJun 8, 2019 at 1:33 AM\nGreat game in GearVR, but awful in Quest\n\nI used to play it in a Gear VR. Simulator mode only, with a XBOX One S gamepad and it was great. Now in Quest the support for gamepad is broken. The game just freezes with a black screen. I have not option but playing it with the Oculus Touch controllers, but this is a crap. Especially throttle control is terrible. Precision flight control is impossible. I am very disappointed, and hope the devs fix the game soon.\n\nHelpful | 8", "Kevgly03Jul 31, 2019 at 5:39 PM\nGreat game\n\nIts a really fun game, the only downside is that I get motion sick whenever I do stupid maneuvers, otherwise its worth every cent\n\nHelpful | 0", "DrachenherzMay 27, 2019 at 11:01 PM\nDont overlook this gem!\n\nAfter some pondering about what seated experience I should buy, I finally got this game for the Quest and now I am so happy that I did! The low poly catoony graphics are super fluid and actually pretty immersive and presence inducing. They suit this game very much.\n\nThe flight model is fun (on Arcade) and challenging (on simulation). It really gives a pilotwings vibe for me, just way better.\n\nI have to admlt, its a bit of a surprise hit for me, Id never thought that it is so much fun to play. I gave a pass on this game for SteamVR and the Oculus Go. But I couldnt resist on the Quest version. So glad I got it now!\n\nThe feeling of flight is very good, and the campaign looks rather lengthy with plenty of stuff to do. I clocked about 1 hour and have unlocked about 6 % of the campaign!\n\nDont overlook this little game, it has a charming artstyle, is technically very well made and its tons of fun to play. VR-Newbies be aware though that it might induce motion sickness, but it has quite a bunch of comfort settings. Personally, with about 1000 hours logged in Elite: Dangerous on PC VR, I didnt feel any motion sickness at all.\n\nHelpful | 4", "Chadwyck12May 24, 2019 at 7:06 PM\nWonderful Yet Simple Sim\n\nUltrawings is a wonderful experience which seems spot on with the flying mechanics even if its design is cartoonish. Please dont let that bit detract you from just how exhilarating it is to take off that first time and nailing a landing. The controls are touchy as the should and it takes a bit of practice but you will be soaring around the islands in no time. The jobs are fun but nothing beats free flight for me. The feeling of motion that the Quest and this game give you are spectacular. I have no doubts in recommending Ultrawings.\n\nHelpful | 9", "Crazy_SaneJun 20, 2019 at 4:44 AM\nRealistic Flight Mechanics\n\nThe graphics may be simplified, but the realistic flight mechanics and variety of game modes keep me coming back for more. I spend a lot of time just in free flight mode, enjoying the scenery and the sensation of flying. This is definitely one of my favourite games. The controls work well and I like having the option of using the physical joysticks.\n\nThe game has crashed on me a few times, but 99.9% of the time it runs flawlessly. The game is well made and it's cool that you can turn around and see that the flaps, ailerons, rudder and elevator all move as they should. I would have liked more environmental realism, like thermals to aid with the glider or even just wind.\n\nIf you're an experienced pilot, want to learn how to fly fixed wing aircraft, or just want a unique, fun and challenging game, get this.\n\nHelpful | 3", "moregingerJun 30, 2019 at 6:48 AM\n\nI'm having some issues with this one. Flicking the fuel switch is a problem every time, it gets easier but this shouldn't be the hardest thing in the game! The game seems fine but the environments are a bit too sparse for my taste, so far. I wonder whether the Quest just doesnt have enough juice to do justice to a flight sim.\n\nHelpful | 2", "SoggySaussagesJul 10, 2019 at 9:22 PM\nWorth the price!\n\nThis game is really cool! Its pretty zen, and it REALLY tricks your mind into thinking youre actually flying! I find my body constantly listing to the side when I make sharp turns Overall, really awesome!\n\nHelpful | 1", "tim.cassidy.56Aug 29, 2019 at 6:38 PM\n\nThis game made me nauseous, a VR first for me. I had to put it down after a few flights.\n\nHelpful | 0", "ErlikChanJul 25, 2019 at 3:20 PM\nLove it\n\nMy personal No.1 Quest game. I played it for hours and it is still motivating. I wish there were a multiplayer mode and a mission editor.\n\nHelpful | 0", "troyrobertsJun 11, 2019 at 4:16 PM\nFuel control needs work\n\nThe switch to control the fuel flow is endlessly frustrating. What should be a very simple task to prep for the actual flight is infuriatingly difficult. Not sure why, but I cannot get it to turn most of the time. I am giving the game two stars because it was relatively fun flying the few times that I was able to get to that stage.\n\nHelpful | 4", "cahliel.osamaMay 30, 2019 at 12:57 PM\nThe Best So Far\n\nI enjoy the game a lot. Its fun to fly around and just to have the experience. A lot of people are saying theyrr getting motion sickness. Its weird because other games I play I do get it but not when I play this game. Just make sure your sitting down. I hope that they add more planes in the future as well. Like jets or bigger planes etc.\n\nHelpful | 1", "THE7Aug 11, 2019 at 6:42 AM\nFun\n\nPlease add some military planes\n\nHelpful | 0", "TieInterceptorJun 16, 2019 at 4:36 AM\nLike a dream of flying a small toy plane\n\ngreat sense of flying a plane, the height and speed is real, you will be doing loops and flying through hoops and shooting balloons and getting points to unlock new airfields and move into bigger islands and buy more types of planes. You have four islands to buy with two airfields each and four types of planes, quite a lot of content to unlock. You control the plane with your hands, flipping switches and pulling the virtual joystick, good use of the oculus quest hand controllers. Well worth the asking price.\n\nHelpful | 1", "LamestGamrJun 14, 2019 at 10:50 AM\nIRL Pilot Loves It!\n\nI've done lots with recreational aviation and I love this game! I play it on sim mode and I feel it captures the essence of flying well enough to be enjoyable for IRL and sim pilots. The cartoon world renders very smoothly and is a lovely fantasy place to lose yourself in. There is a smooth and long progression of unlocking additional planes and locations that makes the gameplay lengthy and provides good value.\n\nHelpful | 0", "Hexagon-SunJun 2, 2019 at 7:23 PM\nPilotwings in VR\n\nIf you're a fan of Nintendo's Pilotwings or flight simulators, chances are you'll really enjoy Ultra Wings. The game has you flying many different aircraft with distinctive handling through a variety of missions on several different islands. There's also a free fight mode for when you just want the feeling of flight and to take in the sights.\nThis was a favorite game of mine on Oculus Go, but the Quest version is much improved.\nThe graphics are noticably better, with other aircraft and vehicles sharing space with you. If makes the islands feel more alive.\nThe game was built with the Oculus Touch controllers in mind. While I applaud the developers for being able to cram the controls onto the Go's tiny remote, everything just works so much better with the Quest's Touch controllers. Especially missions that involve shooting balloons.\nFor players who have their VR legs, I recommend playing with the comfort settings turned off and setting the controls to simulator instead of arcade. It really feels like I'm flying playing this game, which is both exilerating and relaxing. This is a go to game when I'm feeling stressed. It never fails to take my mind off of whatever's bothering me.\nHighly recommended!\n\nHelpful | 6", "Emerald100Jul 14, 2019 at 6:55 PM\nSo buggy and bad\n\nThis game is honestly so bad, I got motion sickness within a minute of playing it and all the buttons are bugged out.\nDONT BUY THIS GAME.\n\nHelpful | 6", "TinmaniaaJun 10, 2019 at 7:41 AM\nNice sim, easy pace.\n\nI like this sim, fully understanding its not designed to be exactly like the real thing. My main gripe is the in-cockpit controls. Both on my Rift and perhaps more so on my Quest, I have trouble just turning on the fuel or magneto in the first aircraft. That should not be a challenge. I think for sure it is worse on the Quest since the danged laser pointer appears. Huh??\n\nIm giving four stars because purchasing this app is good for both Rift and Quest, and Id like to support that.\n\nHave to go to only three stars since it is really a pain on the Quest, with the first ultra light. It is just absurdly frustrating trying to turn the fuel switch knob, when it shouldn't be. The second aircraft, the rocket-assisted ultralight, doesn't have that issue.\n\nAlso, the app lets you use the analog stick on the right touch controller for aileron and elevator control, and the analog stick for rudder. This is nice, as keeping hold of the virtual stick is often a chore (e.g., my virtual hand easily slips off the stick, often leading to a crash). So I like to use the analog stick on the touch controller, as I of course never slip off of it. BUT, there is a flaw in shooting the gun to pop balloons: It only works properly if you hold the virtual stick. That is bad in my opinion, exasperated due to the sometimes intensive nature needed to pop all the balloons. Which makes it very easily to \"slip off\" the virtual stick.\n\nRESPONSE TO DEVELOPER: Yes, I know how it is \"supposed\" to work, because it does work on the jet glider. But it most definitely is much harder on the initial glider. Why make the very first aircraft such a pain to just turn on the fuel? I often see the flaps lever move when my fingers are clearly on the fuel knob. This is not correct behavior, in my opinion.\n\nHelpful | 8\nDeveloper ResponseJun 6, 2019 at 2:38 AM\n\nJust need to grip the switch with the grip trigger and twist like a key.", "hankestmusicJun 3, 2019 at 2:07 PM\nGives me headaches\n\nIm not sure what does it, maybe cause Im nauseous from the movement of the plane, but I get migraine headaches when I play. Im still happy with my purchase though. Fun to fly around and complete the small challenges. Give it spin!\n\nHelpful | 0", "UayuMay 26, 2019 at 3:25 PM\nFun but beware\n\nI bought this game knowing it was cartoony but I wanted a fun VR flight experience.\n\nI am a pilot and for a $15 game it does a good job at providing a simple flight experience.\nMy biggest complaint is that you must be careful because for some people this can give you motion sickness that can last for several hours, like it did for me.\n\nHelpful | 18", "maddogJun 4, 2019 at 4:32 AM\nQUEST VERSION NOT BETTER THAN GO\n\nI upgraded my oculus go to a quest to play graphically better games. However this looks identical to me GO version.\n\nIts really a GO game quickly ported to the quest with minimum effort. I feel a bit cheated paying a premium for this version on top of my initial purchase.\n\nThis is not the first game to fall foul of the price inflation and release identical products, but it is one that could have taken advantage of the quest.\n\nThe game was ok on the Go.. for its small price. But now it costs considerably more, I expect more.\n\nHelpful | 2", "shannajo03Jun 29, 2019 at 6:09 PM\n\nThis seems like it will be a great game, but Ive played about 45 minutes and the game has crashed 3 times. I believe this could be a 5 star game, but my current frustration with restarting it repeatedly is leaving it in 3 star territory.\n\nHelpful | 1", "colourpixelsJun 23, 2019 at 12:07 AM\nGreat flight SIM\n\nThis is a super fun game, graphics are ok and the various play modes are great. I would suggest they have demo with balloon pop to get few more sales as that is a lot of fun. Shooting balloons while flying is tricky but a tonne of fun.\n\nHelpful | 0", "steve.weave.56Jun 6, 2019 at 1:49 PM\nGood Flight Sim\n\nI have now bought this game on 3 different VR platforms. Despite the cartoon looks it is a pretty good flight sim, except there is no wind/weather. Loads to do in this game, several planes to fly and different airfields to visit, each with a variety of missions. On the Quest you can use the virtual joystick (for immersion) or the joypad (useful when concentrating outside the plane). In VR it really does make you feel like you are flying, so it wont be for everyone.\n\nHelpful | 0", "FredFredBurger27Jun 4, 2019 at 8:37 PM\nSo far I love it\n\nThis game is a fantastic flight simulator. So far Ive only had one bad game crash. But the handling of the planes works great. However the worst thing Ive encountered so far is that the controllers are almost constantly vibrating. In one 1 hour session their battery life went grime 60% to 40%. This will be an issue for me as time passes so I think it would be great if it was either tweaked or made possible to toggle in settings. (However I didnt thoroughly check for it, I will soon and update this if I find an option) Over all this game is fantastic and if youve ever wanted to fly a plane I highly recommend this.\n\nHelpful | 1", "FeralCouchMay 31, 2019 at 8:17 AM\nWonderfully intense\n\nDon't let the simplistic graphics fool you, this game will make you tense up and your butt clench in the best way possible. This is a truly unique experience of flight when compared to any other Quest store title. With a lot of content to offer and fun gameplay and reward structure, this game is well worth the money. Dont sleep on it.\n\nHelpful | 3", "Poedameron1548May 31, 2019 at 11:33 PM\nGreat flight sim!\n\nBoth me and my dad fly real ultralight aircraft and this game in simulator mode is so realistic we have both played it for hours on the psvr. The quest version is hands down the best version because of the ease of set up and superior tracking!\n\nHelpful | 2", "MLCGHOSTYJul 4, 2019 at 7:24 PM\nI find this game very calming\n\nWhen I fly around make me feel free.\n\nHelpful | 1", "MihaiDinulescuJun 16, 2019 at 2:50 PM\nFun and light\n\nKinda dumb and simple looking, then you get terrified of pixelated trees and hold onto a broom handle that aint there for dear life.\nThank you for supporting my rift purchase here. I wish you guys made more content for it.\n\nHelpful | 0", "ZenburnJun 11, 2019 at 2:06 PM\nGood Gameplay - REALLY Simple Graphics\n\nI am having fun with this title, it can be a soothing, relaxing experience just to fly around aimlessly (I turn on a fan to increase flighting effect). Its kind of a bummer that the graphics are so simplistic, I mean, its almost N64 simple and the environments lacks diversity. I think this kind of simplicity lends best to low poly neon style graphics, not on beach environments.\n\nI know the Quest is not a graphics powerhouse but obviously can do much better than this. It should be a cheaper title because of this, if it doesnt have much of production value, the environments at least should be more spaces to explore.\n\nHelpful | 1", "chase.96May 29, 2019 at 8:46 PM\nAbsolutely amazing\n\nThis game is absolutely amazing and is worth every penny, like others have said dont let the cartoonish graphics distract you from the fact that the controls and physics are spot on. (Can make give you motion sickness after extended play time) I am not one to get motion sickness easy at all but this one got to me after about 2 hours so just know your limits.\n\nHelpful | 3", "KDXJun 6, 2019 at 12:34 PM\nLots of character but lacks polish\n\nUltrawings is fairly fun for what it is, which I'd describe as an inoffensive, serviceable launch title from a small indie developer, but it's too rough around the edges for me and it doesn't help that it gives me gnarly motion sickness, which I never experience when I fly or ride boats or travel in real life. I'm not sure if that's just from this game in particular or VR flight games in general.\n\nAs for the lack of polish, the graphics are extremely basic, there is only one music track (at least for the first island that I played on) that sounds super boring and generic and loops every 3 minutes, and the sound effect for the ultralight engine loops every three seconds! As an audiophile it drives me nuts hearing that audio track loop over and over and over so often!\n\nWhen you launch the game you start in a loading screen where you have to put on a helmet to play. I guess it's supposed to be the VR equivalent of a \"Start screen\" from more traditional games, but I really don't understand the purpose of it, and in fact when I first downloaded the game there was a bug where I couldn't even put on the helmet. I had to restart my Quest to get the game working again.\n\nUltrawings is not a bad game, but it's not very good either.\n\nHelpful | 0", "Pixel3DMay 27, 2019 at 4:44 AM\nFeels a bit clunky.\n\n\"put on the helmet\" by just pressing on it? That's not VR. Make us put the headset on our head to continue.\n\nHelpful | 3", "trevwollerMay 29, 2019 at 11:08 PM\nFun but very buggy\n\nThe gameplay is fun and pretty realistic but its super hard just to turn the engine on and take off. I just tried for 30 mins to turn the engine fuel flow on and my virtual finger just keeps going through the button. Its super frustrating I cant even start flying. I dont know how to fix it\n\nHelpful | 3\nDeveloper ResponseMay 30, 2019 at 6:08 AM\n\nGrab the fuel flow with the grip button and rotate like a key.", "felix.faassenMay 28, 2019 at 4:07 AM\n\nThis is my favorite game so far. If you like flying, or flying sims this is it. It has a nice progression system. However flying is so much fun I'm addicted just free flying around and enjoying the feeling of flight. Highly recommended!!!\n\nHelpful | 5", "DaveSlMay 24, 2019 at 10:46 AM\n\nI fly ultralight aircraft as a hobby and Im very surprised at how well modelled the characteristics of the planes are. The graphics are cartoony but hardly noticeable as you concentrate on the flying. VR makes all the difference for flight sims./\n\nHelpful | 6", "thebiglebateskiJun 12, 2019 at 11:20 PM\nPretty crazy\n\nNeat game pretty crazy, have yet to feel any sickness at all but that's just me, and it turns out you can roll\n\nHelpful | 0", "punkgeekMay 20, 2019 at 9:07 PM\nSuper fun\n\nI'm s pilot and it seems fairly legit.\n\nHelpful | 29", "rawbotsJul 31, 2019 at 12:42 AM\nMotion sickness\n\nNot worth it\n\nHelpful | 3", "zAppledotMay 31, 2019 at 6:48 PM\nMy favorite game!\n\nThis game is super fun, I love the feeling of flying in VR. I hope to see more games like it on the quest. I would love more flight sims games in the store. Or maybe a sequel to this game that includes multiplayer, co-op, and helicopters. :wink: :wink\n\nHelpful | 1", "b-twiceMay 28, 2019 at 7:17 AM\nFlies really well!\n\nI have this on Quest and have had it for a while on my Rift. They both play and look pretty much the same. The planes fly fairly realistically (I have a pilot license :-) and its a blast flying around in this little island world. Lots of fun and challenging.\n\nHelpful | 1", "sunandsnow24Jun 6, 2019 at 6:57 PM\nAmazing flight simulator\n\nYou aren't in the cockpit of a 747, but that makes sense. The devs know the limitations of the medium and created a have that is fun, gives you a real feeling it flying an aircraft, and is completely immersive.\n\nHelpful | 0", "chessbearJul 1, 2019 at 1:00 PM\nAwesome!\n\nGreat game, I wish some pilots would review how accurate it is, but it feels great.\n\nHelpful | 0", "Indeed77Jun 3, 2019 at 5:08 PM\n\nHad this game on the PSVR, and grabbed it again for the Quest. Awesome flight simulator. Massive replayability, as I've been playing this game for almost 2 years. Take-offs and landings, never get old.\n\nHelpful | 1", "RedHoodiesJun 6, 2019 at 6:17 PM\nGreat game for relaxing time\n\nIt's really fun and immersive, it's one of those games that you can only experience right through VR\n\nHelpful | 0", "KerbalAbuseJun 2, 2019 at 6:20 PM\nDisappointed\n\nSeems Im in the minority, but this game just isnt much fun to me. The graphics are rudimentary, the gameplay is bland and repetitive, and the controls are awkward and glitchy. I often found my hand fell off the stick, and it always took multiple tries to interact with buttons and switches. I wanted badly to have a good flight sim on Quest, but this wasnt it.\n\nHelpful | 1", "MikeFJun 21, 2019 at 7:11 PM\n\nCant recomend this one enough, flawless port of the rift version. One of the best quest launch titles available\n\nHelpful | 1", "sage.bond.2000May 27, 2019 at 12:32 AM\nYOU GET SO MANY HOUR'S OUT OF THIS GAME.\n\nThis game is only 15$ and I'm only 10% of the way through it. I've spent a lot of hours playing this game so far and I can say there is a lot more to play. Loved the game.\n\nHelpful | 6", "davidro14Jul 2, 2019 at 7:14 AM\nNot bad but could be WAY better\n\nThe graphics are too childish... Its like Flight Sim for kids.\n\nHelpful | 2", "luke.pinner.90Jun 8, 2019 at 12:23 PM\nOne more go kinda game\n\nHad this on the psvr snd although the graphics arnt as crisp on the quest the tracking and controls are 100% better. Absolutly love it\n\nHelpful | 0", "SnowUseJun 11, 2019 at 9:31 PM\nCross buy\n\nThis game is cross buy. That's consumer friendly! Plus it's a great game, even in the Oculus Go\n\nHelpful | 1", "FakeBloodJun 2, 2019 at 11:58 AM\nYou can sit down for this one!\n\nI think others have explained how much fun this game is, just wanted to point out that this is one of the few games you can enjoy sitting down.\n\nHelpful | 1", "ParadiseDecayMay 28, 2019 at 10:35 AM\nA gem of an arcade flight sim.\n\nI did a 1st impressions video of this game in 2017. It's still as good today on the Quest.\n\nhttps://www.youtube.com/watch?v=BlRusKT_s-o\n\nHelpful | 3", "PEVO72Jun 16, 2019 at 1:49 PM\nFeels like flying!!\n\nSome very challenging jobs. Great fun if you enjoy flying.\n\nHelpful | 1", "rg727Jun 8, 2019 at 11:52 AM\n\nSounds weird, but this is the best VFR flight simming (when turned to more realistic controls/view) I've had.\n\nHelpful | 0", "DeltaFlightMay 25, 2019 at 7:13 AM\nFeels like flying\n\nGood realism. Thanks developers, please keep it going.\n\nHelpful | 3", "Bbrodin2690Jun 20, 2019 at 8:57 AM\n\nI had to return nt quest do to it crashing and freezing all the time and requested a refund for the game a d they denied it. This hane freezes be careful\n\nHelpful | 3\nDeveloper ResponseJun 21, 2019 at 7:27 AM\n\nPower cycle your Quest. The game was tested extensively before we launched and stability was never an issue.", "OversizeWizardJun 9, 2019 at 2:50 PM\nFantasic\n\nLove this game. First time played and it was awesome. Gives a real good feeling of flying.\n\nHelpful | 0", "Original_Fly_GuyJul 3, 2019 at 11:14 AM\nPls fix devs\n\nThe game is not installing if fixed it is a good game\n\nHelpful | 1", "r83oculusJun 9, 2019 at 8:12 PM\n\nGreat game!!! Must have!!!\n\nHelpful | 0", "bradynapierJun 11, 2019 at 8:18 PM\nBS DO NOT BUY!\n\nYou cant put on a helmet so you can do nothing in this game. A COMPLETE SCAM!!\n\nHelpful | 5\nDeveloper ResponseJun 21, 2019 at 7:28 AM\n\nWhat? Point the laser indicator at the helmet and press the trigger."]