{"App Title": "Vacation Simulator", "App description": "The latest VR sensation from the creators of platinum hit Job Simulator! Welcome to the Vacation Simulator: a rough approximation of VACATION inspired by real human NOT JOBBING. \n\nAmenities:\n   Experience Vacation Island, your destination for optimal relaxation and/or efficient memory-making!\n   Customize a virtual YOU for picture-perfect selfies!\n   Wave to interact with a colorful cast of Bots!\n   Enjoy RECREATION beyond the theoretical limit in immersion-inspiring destinations!\n   Splash in the silicon sea and bask in simulated sunlight, all without getting sand in your hands! \n   Get lost connecting with your roots, nodes, and branches... then get actually lost on a hike! \n   Elevate your ice-sculpting skills to new heights and reach peak cozy by knitting mittens for a snowhuman!\n   Exist in a comfortable, all-inclusive VR experience free of motion sickness AND seasickness!", "Purchase section": "$29.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Roomscale, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Puzzle, Simulation", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Argentina), Spanish (Chile), Spanish (Colombia), Spanish (Mexico), Spanish (Peru), Spanish (Puerto Rico), Spanish (Venezuela)", "Version + Release Notes": "1.1.0-34280", "Developer": "Owlchemy Labs", "Publisher": "Owlchemy Labs", "Website": "https://www.vacationsimulatorgame.com/", "Release Date": "December 12, 2019", "Developer Privacy Policy": "Absurd and highly polished games.\nBlog\nGames\nAbout Owlchemy Labs\nJobs\nSpeaking / Community\nPrivacy Policy\nHaving a well-defined privacy policy is important to us at Owlchemy Labs!\n\nWe are doing science after all.\n\n\n\n\n\nYou can geek out over privacy by viewing our policy here: https://www.google.com/policies/privacy/\n\nSocial\n\nWe love to hear from fans and friends! Follow us on social media:\n\n   \n\nJoin Our Discord Community!\n\nContact\n\nWould you like to chat with the Owls? Drop us a line right here and say hello!\n\nFor support:\n\nowlchemysupport@google.com\n\nFor business inquiries:\n\ninfo@owlchemylabs.com\n\nAbout\nBrand Guidelines\nGames\nContent Creator Policy\nSupportTerms of ServicePrivacy Policy 2020 Owlchemy Labs", "Developer Terms of Service": "Absurd and highly polished games.\nBlog\nGames\nAbout Owlchemy Labs\nJobs\nSpeaking / Community\nTerms of Service\n\nHaving a well-defined terms of service is important to us at Owlchemy Labs!\n\nWe are doing science after all.\n\nYou can geek out over terms (and services!) by viewing our ToS here: https://policies.google.com/terms\n\nSocial\n\nWe love to hear from fans and friends! Follow us on social media:\n\n   \n\nJoin Our Discord Community!\n\nContact\n\nWould you like to chat with the Owls? Drop us a line right here and say hello!\n\nFor support:\n\nowlchemysupport@google.com\n\nFor business inquiries:\n\ninfo@owlchemylabs.com\n\nAbout\nBrand Guidelines\nGames\nContent Creator Policy\nSupportTerms of ServicePrivacy Policy 2020 Owlchemy Labs", "Space Required": "1.08 GB"}



["5 stars\n83%\n4 stars\n10%\n3 stars\n3%\n2 stars\n1%\n1 star\n2%", "Benny_ChainzJun 28 at 2:11 PM\nAlot of fun an totally addicting!\n\nThe big Question Answered:\nPeople keep comparing Vacation Simulator to Job Simulator but there's really no comparison other than graphically. One is a puzzle-quest game and the other is truly a job simulator. So if you like puzzles and questing you'll probably like vacation sim but if you like a funny parody of work get the job sim. I liked both and both are great!\n\nThe Game:\nVacation Simulator has 2 pretty hard puzzle games. (Sand Castle building and Ice Castle building) and they get more difficult in stages and there are 5 stages (basic, beginner, intermediate, advanced and master) There are between 2 and 5 puzzles per stage and you can beat the game without completing the master and advanced stages. You can always complete them later though if you want the achievement.\n\nReplay value:\nAfter I beat the game I thought I'd never play it again but I was wrong. After a few weeks away from the game I missed it and decided to try to speed run it and it was fun! The puzzles were also way easier the 2nd time!\n\nGraphics:\nI used to be paid professionally to do graphics so\nmy only critique is I felt like the game textures could have had a little more depth to them like you might see in World of Warcraft. Also, maybe slightly more dramatic lighting. I liked how in the Vacation Forest they made it night time for the 'scary stories'. That was cool.\n\nSo definitely get this because it's a lot of fun and totally addicting! It also does a great job of creating the total vacation vibe and who doesn't want that, especially now!\n\nHelpful | 73", "LyimJul 23 at 10:29 AM\nEssential Game\n\nIf you're considering purchasing Job Simulator or Vacation Simulator, consider Vacation Simulator first and then consider Job Simulator while it's on a sale or something. Vacation simulator is a drastically better game than Job Simulator. Although they are both great games and what I would consider essential to have as a quest owner. Vacation Simulator just has much more to do!\n\nHelpful | 9", "i_ambeastatRDRMay 31 at 4:55 PM\nPlease add infinite overtime!\n\nI loved job simulator and this is a lot better, I have been playing non stop for a week and I finally beat the game. I havent ran into any bugs! I just wish they had something like infinite overtime because after you beat the task and get the memory, it wont give you anymore tasks and its kind of a bummer :(\n\nHelpful | 160", "FrostHollow6582 days ago\nLove this game\n\nBest game I have bought so far, especially since I bought it in the Summer sale. I have even stopped playing Best Sabre for the past 4 days as I am totally addicted to getting 100% in this game. Have got enough memories for the party which was such a surprise and lots of fun. One of the great things about it is that you have to search all over the place for objects and ingredients which makes it such an interesting game to play. I will happily do the whole thing over again as a different character. That is another good feature, there are 5 characters to use so all the family can play at the same time without spoiling anyone else achievements. I also had fun playing with the extra features which do not add to memories but keep you looking around the game (loved the room service and playing basketball in the bedroom). I have eaten over 500 berries now and I plan to see how many more I can eat. Only major difficulties I had were the sandcastles and ice sculpting but, after watching you tubers who seem to manage them with ease (thank you you tubers) I am slowly getting through them. I obviously have no sense of logic to work them out myself. Overall, an excellent game and good value for money, even at its normal price.\n\nUpdate - now at 99% and only need to do last 3 sandcastles. Stuck on ABC (even you tube videos are not helping) but will keep persevering. I have now eaten over 800 berries. My favourite bot is the artist in the forest based on Bob Ross, he has such a soothing and relaxing voice, just like the real thing.\n\nHelpful | 1", "Dneail2 days ago\nGreat game!\n\nThe game is amazing! I love it! Are you going to make a third game? I think you should make School Simulator.\n\nTHE GAME\nIn the beginning, you go into your suite and theres tons to do there! Then you go into the islands but EfficiencyBot says you have to use memories. So, yeah. You need 5 memories to go to the next stage and finish that part of the island. And yeah, thats the game. Theres tons to do along the way, though and it worth the $40!\n\nHelpful | 0", "d0xisJun 28 at 6:12 PM\nAlmost perfect.\n\nIf you enjoyed Job Simulator you will almost definitely enjoy Vacation Simulator. I do have a few minor complaints. For starters it's almost TOO MUCH like Job Simulator. It's not as straight forward, but a lot of the mechanics are 1:1 same deal. The other thing is due to the extra freedom here that you don't get in Job Simulator there are a few issues moving around both in and between the different areas. For sure it's a 5/5 and a great improvement over Job Simulator and I can't wait to see where they go from here.\n\nHelpful | 9", "Kevinonon9 days ago\nAmazing Game!\n\nHonestly, best VR game I ever played, graphics are great and the bots are amazing! This game is a game for people to see what vacationing is like and how to earn memories everytime you visit that place! This game was a great experience for me and I love it! 5 Star rating from me.\n\nHelpful | 0", "Mattplus096 days ago\nDone Buying Quest Software!\n\nThis is a fun collection of mini-games for the whole family. Good stuff! However...I won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\n\nHelpful | 3", "Annie1122Jul 21 at 9:04 AM\nSo much fun!\n\nThis is such a creative game! You can literally do whatever you want! You can have your own little vacation with friends/bots. You have your own suit with; bedroom, bathroom, kitchen and tv-room! (Including that you can PLAY games on the TV!). You get enough memories in each vacation place and explore new stuff. I can tell something I love about every vacation island :)\n\nBeach: If you get 5 memories, you can go and explore a underwater adventure!\n\nForest: You can paint your own paintings! We all gotta be creative with Bob MOSS!\n\nMountain: SNOWBALL FIGHT!\n\n-\n\nSomething I also love is that you can change clothing based on what island your going to! I really do recommend this game as family friendly. Its super easy as well if youre not that comfortable with the controls and how youre supposed to use the VR.\n\nRating: 5 stars! (Of course) :D\n\nHelpful | 2", "ColdTurkeyJul 12 at 1:50 PM\nReally fun\n\nI think that this game is a must have. People are right that it is not like job simulator and you cant really throw someone into the game. But I still think that it is cool. The one bad thing that I have to say about the game is I cant figure out how to do the sandcastle and ice pick building thing. Even after I looked up how to do it. But maybe thats just me. Overall just get it and thanks for reading this.\n\nHelpful | 3", "Mr_Rob20 days ago\nWhat a strange, likeable game\n\nNot played job sim, so this is my first step to this. It is very strange, but good fun to play. The puzzles are well thought out and I can see myself coming back to them just to complete it.\nIt's very cartoony in style, the movement between locations can feel clunky as you almost feel there should be more ways to get to somewhere.\n\nOverall quite fun, and makes me feel the real world is a strange place after playing this! :/\n\nHelpful | 3", "ShadowProgrammer5 days ago\nYay!\n\nI [EMOTION] Vacay! This is my favorite [SIMULATION]! The Bureau of Simulations should continue expanding this [MEDIA]!\n\nHelpful | 2", "JenspadMay 3 at 11:08 PM\nLove it didn't think I would this much!\n\nI bought this on sale as I was itching to play something new after I beat most of the new releases that came out at the end of March I already purchased job simulator and liked that a lot so I figured I would like this too but I was worried it would be too short like job simulator was but it's not. This is a nice long game with so many different things to do so many little mini challenges to collect memories and it seems like the big goal to achieve everything is to have a big party. Still playing it still have lots to do and it is something I can literally spend two hours a day on and still haven't beat it in full. Bot Ross was hilarious btw..... great game highly recommend! \n\nHelpful | 37", "AbbiliciousMay 23 at 11:54 AM\nBetter than job simulator?\n\nI really love this game. There is so much to explore and you can spend so much time just doing random tasks or messing around. Its great that there are so many different things to do but I love the fact that you dont have to move around much. This is great to show off to friends and family. In my opinion, its definitely an upgrade from job simulator even though job simulator is such an amazing game.\n\nHelpful | 12", "Deckard2049Jul 13 at 3:21 PM\nVacation Fun!\n\nHey! If you cant go on vacation why not vacation virtually. Vacation Simulator is worth its price for both young and old alike. I enjoy playing and so do my kids (limited time). Since the Oculus doesnt allow multiple profiles, Im happy that this game has five profiles so the whole family can save their own progress. Job simulator is fun too.\n\nHelpful | 1", "snowzink10 days ago\nLove it!\n\nThis game is awesome and my kids love it! I love how they have a smaller person switch at the beginning of the game it really helps \n\nHelpful | 0", "M0nd0_0wadaJul 18 at 7:53 PM\nLots of fun\n\nSeems to have more than job simulator. A little more involved and difficult which is nice. Daughter is having a blast.\nI agree with other reviewer, would be nice to have the \"extra\" stuff like overtime, anti gravity etc. But geared towards vacation SIM.\n\nHelpful | 1", "jnich123 days ago\nGreat!\n\nI love this game, it is too fun! But when does the back to job dlc come out?\n\nHelpful | 0", "JuiceHavocJul 15 at 8:16 PM\nSuper fun\n\nI could play this for hours and it would never get boring. I do have one problem though every time I press the oculus button to exit the game it just sends me to a black screen and I have to restart the whole headset is that a common bug or is it just my headset\n\nHelpful | 0", "GonyangCJul 28 at 6:19 AM\nI truly Love Owlchemy Labs Games\n\nMy favorite gmae series. So fun! Such a immersed experience! Very good interaction!\n\nDeserves more stars than only five!\n\nHelpful | 2", "kimbiecookieJul 10 at 11:29 PM\nI  Vacation!\n\nThis is absolutely the best game I've played in VR! So many things to do. Lots of tasks, quests, puzzles and minigames. I you liked Job Simulator you'll love Vacation Simulator! Great funny and awkward gameplay like JS. Lots to explore and you can examine and play around with EVERYTHING. Hours upon hours of endless fun! You dont have to get all the memories to access all areas of the game which is cool but you do have to have a certain number of memories to go to the \" special excursions \"\nNote to developers: Thanks for a spectacular game but please fix the share photo to FB option in the backpack slot on Quest. When you try to upload the photo and it accesses the quest menu it gives you a message its unable to share at this time (everytime) then crashes the game. I dont know if this is an Owlchemy or Oculus fix but it would be nice to be able to share the selfies and other wacky photos you take with the \"in game\"camera! Thanks!\nUPDATE: Even though I haven't gotten all the memories ( I'm just terrible at river rafting)I keep discovering new things with this game! Explore! Play! The details and secrets they put into this wonderful game are amazing!\n\nHelpful | 0", "LigeFamJul 4 at 9:48 AM\nI loved it!!!\n\nI love the vacation simulator it was so much fun to go to all the different places and do the different things. I also loved how they were secret places that you could go I didnt even know about and it was such a fun surprise. The only thing I wish is that you didnt have to get so many memories to do stuff. But I would definitely recommend this game if youve never had it its so much fun I loved it!!!\n\n\nHelpful | 0", "kathryn.gulkoJul 5 at 1:48 AM\nBigger backback\n\nI think this is one off the best games in group personally and my family is addicted but I wish you could unlock a bigger backpack if you get a certain amount of memorys like in the under water chest with all the items\n\nHelpful | 2", "willardsVRJul 22 at 11:44 AM\nVacation time!!!\n\nThis game is amazing! I love the freedom it gives you with choosing what you do. There is no real story line and you can explore and do loads of different games. All in all a fantastic game! Would recommend\n\nHelpful | 1", "VanceTheWeebJul 28 at 2:12 AM\nGood, But Not As Good As Job Simulator\n\nThis game was pretty fun but as a 13 year old it feels very target towards a younger age, its too simple, it not that fun. I have a nine year old brother and its great for him but its quite boring and simple for an older audience. Regarding the time issue, its a pretty long game, depending on how you play it can get you like 20 hours of gameplay. If your deciding between job sim and this game, chose job simulator. To make it worth the price i would lower it down to 20$\n\nHelpful | 3", "payam.pourghassem5 days ago\nAMAZING\n\n10/10 would recommend\nDefinitely for fans of Job Simulator\n\nHelpful | 0", "peice_of_crap16 days ago\nA great game!\n\nI usually go here after an argument and it calms me right up! Its a great happy place for me and its awesome!\n\nHelpful | 0", "ryokoshuMay 12 at 12:54 PM\nSo much fun!\n\nI played the original job simulator so I was so excited when the new game came out!\n\nSo many new things to explore. Wonderfully immersive. Its one of my first beginner games along with the job simulator to let friends try on a first time vr experience. Family friendly and can be witty and funny. I love the small switch to shrink everything short then even the smaller kids can see whats up! Bright and cheery!\n\nHelpful | 10", "DaytonFlyer78715 days ago\nvery fun game\n\nthe best place to vacation at is the snow place\n\nHelpful | 0", "Su_tart_officalJul 26 at 8:14 AM\nVery cool\n\nThis is the best game ever! I have nothing else to say. If you are bored this is the game for you. Because of quarantine and the looked down this is the perfect game.\n\nHelpful | 1", "joe_magJun 27 at 12:45 PM\nIt's entertaining, but..\n\nI really wish there was a \"vacation at night\" version similar to infinite overtime, for instance a mode to do the burger cooking stand at the beach for a longer time than just a few levels.\n\nHelpful | 3", "DragonSlayer_996 days ago\nReally addicting, so much fun\n\nSuper fun, helping robots, only human and funny\n\nHelpful | 0", "guerreroerinlJul 22 at 6:30 AM\nFun Getaway!\n\nWe got our Oculus during the stay at home order and desperately needed this game. Its very VERY well done. You can definitely lose yourself in this game and vacation for hours. The only complaint is that many of the tasks are repetitive and the game could be much, much longer. Hoping there will be an update with more experiences added on.\n\nHelpful | 0", "eucalyptiJul 9 at 5:37 PM\nBeyond Words\n\nThis game was an absolutely amazing experience period. Also, the number one problem I had with Job Simulator was fixed, this game is really long unlike its predecessor. Cant wait for the dlc and whats next from Owlchemy Labs\n\nHelpful | 0", "jamielshyMar 6 at 5:00 AM\n3 things\n\nThe difference between job simulator and vacation simulator has three things.vacation simulator : you can teliport to move around in this game. Now I think this doesn't mean job simulator is bad. Because I think that they didn't have teloportation movement for a reason, and that is they dont need it. 2 Stuff: vacation simulator has more stuff in it, beach ball, skiing, roasting marsh mellows, taking a virtual bath. 3 human: in vacation simulator you have a somewhat body that you can costume. Like- hair, shirts, eye color.\n\nHelpful | 326", "Dramallama1010 days ago\n\nI love this game .so much game play\n\nHelpful | 0", "VR_Pers0n24 days ago\n\nI absolutely love this game! It is so addicting. I also love how there is a small person mode!\n\nHelpful | 0", "Icelord160Jun 4 at 3:56 PM\nWow\n\nThis is a great game. What I have seen from many 1 star reviews is that they are rating 1 star for technical difficulties. If they didn't have that, I am sure they would give 5 stars. This is a great game that everybody should play. It gives you quite a few hours of gameplay, and you don't get bored of it. While I haven't completed the game, I have beat it, and even the small amount I have experienced is amazing. Owlchemy Labs, ya did an amazing job. This is the best NOT JOBBING experience one could have. Seriously get this game. It's worth every penny.\n\nHelpful | 2", "Emikondy25 days ago\nI love it!\n\nI really love this game! It's one of my most favorite games on the Oculus quest! There's so much you can do. I did ran into some bugs. But they weren't too bad.\nSo... I really love the new update. I'm happy that this game still gets updates. I'm still hoping that there will be a sink in the bathroom and a knife to cut the food yourself(if it's possible since this game is suppose to be for kids)\n\n\n( so excited for Vacation Simulator: Back to Job)\n\nHelpful | 1", "wren735 days ago\nGood game but\n\nThis is one of my favorite games to play but sometimes its so hard to make memories otherwise love everything about it\n\nHelpful | 0", "KawaiiShortcakeMar 29 at 3:52 PM\nWORTH. THE MONEY.\n\nEDIT: IT WAS NOT $60. I got it at $30. I goofed, my bad! (': STILL A GREAT GAME. It took me a while to finish the whole thing and it was a BLAST the entire time! Kids will love this game, adults too (I'm 25 and freaking adored it.)!\n\n\n\nLet me tell you, $60 seems like a lot for a VR game (unless the price has dropped, then horray for you) but it is well worth it my friend! There's so much to do in this game it's insane! It isn't just some 2 hour game you can blow through. The puzzles and actitivies keep me engaged and it's overall just a big thrill. I give this game 2 BIG thumbs up!\n\nHelpful | 43", "Galapagos12Jul 13 at 7:43 PM\nA New Kind Of Job\n\nAs other reviews have said, this game is much largerand more ambitiousthan Job Simulator. More environments, more characters, more activities. Its a very fun game with decent writing and a simple gameplay style.\n\nId say its main flaw is that the activities you participate in become slightly repetitive. Though the pretense for each is different, the gameplay itself rarely is. This, however, doesnt take very much away from this amazing game. Though expensive, this game is very much worth it.\n\nHelpful | 1", "MouradBros11 days ago\nLogging out in the middle of the game\n\nThe Game itself is amazing and fun but I keeps logging me out for unknown reasons I tried to return but the refund request get REJECTED it is OK TO KEEP IT but please advise how to sort the logging out issues\nPS I purchased lot of games from Quest store only this game has the crash Glitch\n\nHelpful | 0\nDeveloper Response10 days ago\n\nThank you for bringing it to our attention. Please email us at owlchemysupport@google.com so we can take a closer look and get you back to having fun.", "TheMinerNoob21 days ago\nAmazing\n\nI really like this game this is a great game\n\nHelpful | 0", "ella.artisJul 27 at 8:33 AM\nGood but...\n\nI love hos it smade and everything but when ur done u have nothing to do tho.\n\nHelpful | 1", "scotty341Jul 7 at 3:20 AM\nA great sequel to Job Simulator.\n\nI loved this game but I didn't feel like it had the same replayability as Job simulator and some of the tasks were just not fun. The worst area by far is the winter level as it just feels like they ran out of idead and tried to fill dead space with boring puzzles. Still probably one of the best VR games just a dissapointment it isn't as good as Job Simulator.\n\nHelpful | 0", "ThomTom1Jul 5 at 11:49 PM\nNeeds some sort of infinite overtime\n\nOk so Ive played both Job and Vacation simulator and honestly think they are the best games Ive played so far. The only thing I think vacation simulator could improve on is adding some form of infinite overtime which I think worked really well on Job Simulator.\n\nP.S If you havent got the game already I definitely recommend you do so.\n\nHelpful | 0", "goldenguy808Jul 22 at 2:07 PM\nGreat game\n\nIt is so much fun to play and has a lot of places to go and a lot of things to do.\n\nHelpful | 1", "Blue03_YtMay 15 at 9:07 PM\nI think it is amazing!\n\nI first started watching job simulator on YouTube when it first came out. I was new to VR so I was surprised and I wanted a VR headset really bad. I got one almost about one year from when this game was released and I bought it and I did not care how much it cost. Really good scripted and a really good game with mind bending puzzles in it! If you ever get annoyed by the guardian popping up just put a bed sheet or something like that on the floor and just make your guardian go outside of your house or just make it a little bit more bigger then the sheet or whatever you put down.\n\nHelpful | 3", "AidandoesstuffJun 25 at 6:44 AM\n\nIts a great game theres nothing I dont like and all the little features such as the phone and your sweat and the computer are really cool if they make another game I would definitely play I hope they do.\n\nHelpful | 1", "Epicminion23Jul 19 at 11:32 AM\nEpic\n\nThis game is epic\n\nHelpful | 2", "vortexwave643Jul 19 at 2:35 PM\nBest VR game\n\nI had no issues with this game runs really good and a fast download also very fun to play\n\nHelpful | 1", "GenericKiwiApr 20 at 7:48 PM\nMuch better than job simulator\n\nThis took me a very long time to finish, which is a good thing. There is so much to do and explore, and you'll keep finding more as you play. There is no shortage of objectives to complete, many of which require you to solve puzzles and go between the three areas to collect various items.\n\nHelpful | 10", "dimdom211Jul 26 at 7:24 AM\nBrill\n\nA must have. the 1 star reviews are just 2 year olds\n\nHelpful | 1", "XtremeGaia21 days ago\nGreat, with a side of crash\n\nI really enjoy the game, but it keeps crashing whenever I start it up. Maybe I just need to reinstall it, but i'm enjoying it none the less.\n\nHelpful | 0\nDeveloper Response19 days ago\n\nThank you for letting us know what you are experiencing. We are sorry, and we want to get you back to having fun! Please shoot us a quick message at owlchemysupport(at)google<dot>com so we can take a closer look.", "firenut34Jul 27 at 3:14 PM\nAwesome\n\nMy kids loved it. Couldnt get them off!\n\nHelpful | 1", "Freddy9287Jul 23 at 10:10 AM\nOne of the best games ever Made\n\nJust like job sim. Its one of the best games ever made\n\nHelpful | 1", "villasenordanielJul 17 at 11:03 PM\nVery fun\n\nIts better than job simulator in my opinion but I still think job simulator is fun.\n\nHelpful | 1", "johnperezjr.Jul 16 at 11:34 AM\nA good game\n\nThis game is longer than job simulator and fun thats all Im saying you should buy it\n\nHelpful | 0", "Cyborg_DemonXMay 28 at 7:03 PM\nAmazing\n\nI got this game as my 1st VR game.\nReason 1: jacksepticeye is voiced in it.\nReason 2: explore\nReason 3: read reason 1\n\n\nHave fun trying to get all the memories\n\nHelpful | 5", "thijs.de.hekkerJul 25 at 2:54 AM\nBest game ever\n\nI like IT so much its Nice\nMake more tasks\n\nHelpful | 1", "Chad54321Jun 29 at 11:06 PM\nBest game ever!\n\nI didn't think it was gonna be that long but it has a ton of content and its a great game which means you can have a lot of fun for a long time without finishing the game.\n\nHelpful | 1", "agirlnamedkirstenJul 4 at 7:09 AM\nMore, please!\n\nI wish there was more of these games or just almost unlimited amounts of things to do. Preferably, more of theses games.\nJust make more, please!\n\nHelpful | 0", "howtheturntables20 days ago\nTHICC\n\nGood game\n\nHelpful | 0", "brownjacksonJul 18 at 9:13 PM\nA Very Good Game!\n\nI love it!!!!!!!!! Its one of my favorite games that i got recently\n\nHelpful | 1", "Teddy.ShervheimJun 18 at 6:45 PM\nFINALLYNo more jobbing\n\nStop reading this review and buy the game NOW! Its soooo fun\n\nHelpful | 3", "MattybearoJul 15 at 11:06 PM\nFUN FUN FUN\n\nThis puts me in a headspace tooo juuust reeeelax. But also gather memories ;)\n\nHelpful | 0", "SWOOSHOJul 8 at 7:34 PM\nVacation simulater\n\nIt is a good puzzle game, but dificulut to get all trophie, if you have the mind set of a 3 year old like me.\n\nHelpful | 0", "VacuousApple7417 days ago\nGood game except a bug\n\nVery cool and fun game but it always crashing left and right and I dont know why\n\nHelpful | 0\nDeveloper Response13 days ago\n\nHi! Sorry to hear you are experiencing this, and thank you for bringing it to our attention. Please email us at owlchemysupport@google.com so we can get you back to having fun.", "DamianElDestroyJul 18 at 12:01 PM\nI love it!\n\nI love if you reach 30 or 40 memories you get a party\n\nHelpful | 1", "dargologMay 29 at 7:01 PM\nGood fun game to start VR with\n\nStarted this one up and it was a very fun and comfortable first step into the world of VR.\nThe point and highlight to your next location made it easy to move and the insane amount of objects to interact with helped me with the ABCs of basic VR controls.\nIm playing more hardcore games now but I always go back to this one if I just want to take it easy.\nWould recommend to just about anyone.\n\nHelpful | 1", "Beta-AIJul 18 at 7:49 PM\nThis game makes me feel so [Hype]\n\nI'm feeling [relaxed] except the fact I have to run across the whole map I also love the game keep it up\n\nHelpful | 1", "DeepMellowJun 18 at 9:12 PM\nWorst game I ever played.\n\nOnly a few places different play areas. If you like picking stuff up and putting it down this might be for you. Game was made for a 5 year old. Terrible graphics about the same as a Nintendo 64. Gets old real fast. Dont waste your money trying it out. You can be denied refunds without warning if you have too many. Got stuck with it. Support was rude. Was told to read the refund policy.\n\nHelpful | 7", "Emuly_RoseJun 29 at 11:49 PM\nIt's good but not great\n\nIt's cute and silly. There's some of the mini game I love and will turn on the game just to play; the painting, the ski jump and climbing wall.\n\nDon't know if they plan on any future updates, but bigger item storage in bedroom and a photo album would be nice!\n\nHelpful | 0", "Fares_gamer2007Jul 8 at 7:43 AM\nAmazing But...\n\nIt Needs Infinite Overtime Or Something like that and It needs Walking With Joysticks\n\nHelpful | 1", "Kyan010Jul 30 at 12:06 AM\nYeah!\n\nIts really good! I like the cooking, its so much better than the cooking from job sim! I like it!\n\nHelpful | 1", "SliableJul 27 at 2:40 AM\nExpensive trip to a fair\n\nThis is like doing a scavenger hunt at a fair. More a diversion than a complete experience. If you are looking for lots of tasks...there are many. However, theyre mostly similar. It is light and flippant just not engaging. I havent finished it and I probably only will because Im on the hook for it - I bought it as a part of a package. I can only see it being redeeming if it devolves into the horror genre.\n\nHelpful | 0", "Creeper_Derek9May 27 at 9:04 PM\nThis is great except the constant lag\n\nWhen you play it for at least 30 minutes its starts to lag other than that its Great! And although I hate school you could make a school simulator that is multiplayer or you can just play with bots I have job simulator and vacation simulator wouldnt hurt for one more\n\nHelpful | 1\nDeveloper ResponseMay 28 at 2:41 PM\n\nThank you for sharing your VACATION experience! Please email us at owlchemysupport@google.com so we can take a closer look and learn why this happened.", "andrewiscoolzx9Jul 20 at 9:35 AM\nfun\n\nfun\n\nHelpful | 1", "VR_User0Jul 28 at 8:53 AM\nBest sequel ever\n\nOn if the only sequels thats better then the original great Job!\nMaybe a third installment\n\nHelpful | 0", "SypiethebossJun 22 at 2:48 PM\nAmazing\n\nJust so amazing. wishing you could add a mode like infinite overtime in job simulator into this game. But other than that it is perfect.\n\nHelpful | 1", "SilentNinjaJoshuMar 1 at 12:42 AM\nReally good game\n\nIt is a really good game and it doesnt crash as much now but sometimes the game crashes when loading and takes ages to even get out of the app . But over all it is a really good game and has much more content that Job sim and has some of most funniest characters. AND JACKSEPTICEYE IS IN IT!! Except from the crashing (Might just be my Quest) the game is a perfect 5 Stars. I would even give it 10 if I could!\n\nHelpful | 37\nDeveloper ResponseMay 6 at 4:29 PM\n\nWe are thrilled to hear that you love our game! Thank you for letting us know what you are experiencing. We are sorry, and we want to get you back to having fun! Please shoot us a quick message at owlchemysupport(at)google<dot>com so we can take a closer look.", "MagicalFireflyJun 15 at 8:14 AM\nVacation simulator\n\nI absolutely love this game theres so much to do, and you always busy with something and if you dont want to do anything I gotta you can always just mess around and I love it.\n\nHelpful | 0", "brofireninja336May 4 at 7:16 PM\nGreat!!!\n\nI got this game as a starter game for my quest and it is amazing from the graphics to the gameplay and everything in between. My only issue is the hand gestures aren't that great and I preferred the gestures for job simulator. Otherwise great game.\n\nHelpful | 3", "SkinSuitJul 13 at 4:01 PM\nGood game\n\nVery good game\n\nHelpful | 0", "Sunshinec26Jun 30 at 2:12 PM\nIts a fun game that has a few issues\n\nI enjoy playing this game but sometimes it has issues just like any other game\n\nHelpful | 1", "PegasusaxtMay 25 at 12:51 PM\nSo much fun\n\nI love Job Simulator but this is even better. There is a larger variety of tasks and the three locations and constant jokes make this a great game for a quick time-out from reality.\n\nHelpful | 1", "Ali_KittyApr 11 at 4:50 PM\nFun!\n\nIts a fun and enjoyable game. Some of the puzzles are a little complex (sand castle/ice carving) but fiddle with them and youll get it. But otherwise its fun and enjoyable and Im glad I got it!\n\nI will say that I dont typically get motion sickness but after about an hour or so of this game I do have to stop because I start getting queasy. Its all the turning I think. You have to turn around to navigate and see things. So just bear that in mind.\n\nHelpful | 6", "NotfunnycakeJun 30 at 7:26 PM\nVacation simulator rocks.\n\nVacation simulator is the best game ever my family loves to play it.\n\nHelpful | 0", "DijitalBlueMay 25 at 11:19 AM\nTotally worth it!\n\nI love the way the mini games are set up, and the way the environment is so well laid out. Its really a joy to play, and its clear that they took a lot of time and effort to make the game this much fun.\n\nBuy it. You wont regret it.\n\nI rated it 4 stars because it tends to crash on my Quest occasionally. Not sure if its my headset or a glitch in the game.\n\nHelpful | 2", "ElliottTBakerJun 9 at 1:12 AM\nGood Game for a BIT of time!\n\nI love the game: Good physics, Funny VacationBots and much more BUT... Ive been playing for a few weeks now and Ive done all of the tasks. I know you can make new people as well but you just do the same thing again. Please add more things. I would also like to see a mode with multiplayer (even local multiplayer would be fine) so that me and my cousin could play this wonderful game together! Great game but PLEASE add more worlds and tasks! Thanks.\n\nHelpful | 0", "StrongitJun 16 at 7:31 PM\nFantastic Game\n\nI love this game. It takes what job simulator did and adds a bit of story, a LOT more to do and the same kind of humor to everything.\n\nUnfortunately I had to knock off two stars due to the game's performance on my quest. I constantly get frame drops in the game which makes me quite nauseous and when I try to exit the game my headset either freezes up or loses it's tracking forcing me to restart. Normally I would suspect the device but it's brand new and no other software I use has this issue. I wish I had bought it on steam instead so I could really appreciate what the devs did here.\n\nHelpful | 2", "SpicyMooseJul 22 at 8:23 PM\nGreat game at the start but meh...\n\nI Enjoyed This game for a long time, but after you complete it, it sorta becomes a deadweight, once you reach the last area and finish it, you stop playing, I liked the game until that point\n\nHelpful | 0", "Derpy_Lad101Jul 3 at 1:02 AM\nThis is fun\n\nIt has lots to do and lots to see :)\n\nHelpful | 0", "cotheturtleApr 3 at 10:30 AM\ngood game even after you beat it its sti\n\nUPDATE IT PLEASE AND ALSO ... good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun good game even after you beat it its still fun\n\nHelpful | 12", "simchiJun 6 at 7:36 AM\nMore than a vacation\n\nMy daughter requested this game after home schooling since she's been stuck at home for 2 months due to the lockdown. I was hesitant first since we already have the job simulator & it didn't have too much replay value. This gives better & longer playing time than its predecessor however replay value can be improved. Still, thanks for the fun game from both of us.\n\nHelpful | 0", "sir-forkJun 26 at 5:24 PM\nReally fun, then the same old game\n\nWhen you first launch Vacation Simulator, youll fall in love with it, but after a while, the game gets boring very quickly. Its just not as enticing as I expected. I feel like it would be better if it wasnt just build, cook, catch bugs and collect memories. This game really didnt fulfil my expectations. Unfortunately, I would not recommend it.\n\nHelpful | 2", "MegaCole1904Jun 3 at 2:19 PM\nShort\n\nWhen I started playing the game I loved how they kept the interactive side of the game from the hit job simulator and went forward adding a body to your character. This being said I have had no problems but wish the game was longer and had some more task to complete, once I got to like 40% stars he credits for the game started. I was able to restart the game and continue but I found after 3 hours of play time it began to drag on.\n\nHelpful | 1", "RydioactiveMar 7 at 3:17 PM\nYup\n\nYes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes Yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes Yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes Yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes Yes yes yes yes yes yes yes yes yes yes yes yes Yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes Yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes Yes yes yes yes yes yes yes Yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes yes\n\nHelpful | 376", "InfinytyJun 7 at 7:44 PM\nA little slow to start, but great game.\n\nThis game is fun! It takes a bit to get to the point, but once everything is kicked off, it becomes a blast. Overall, a great game!!!\n\nHelpful | 0", "Hollis12345Mar 23 at 3:35 PM\nAmazing game with lots to do\n\nThis game is one of my favorite oculus quest games. Theres a lot more freedom and stuff to do compared to job simulator. The comedy is great even the dumbest jokes cracked me up. I also like how they included Jacksepticeye to voice a bot in this game it was very fun to listen to. I also like the new feature to customize your self. I really like the camera because its fun to take pictures of vacation island. The ending was one of my favorite parts of the game it was so much fun. Thats why I think you should by the game and complete it.\n\nHelpful | 7", "Kayden2121Jul 19 at 2:15 PM\nReally fun\n\nIt's really fun and doesn't take long to load\n\nHelpful | 0", "x_blitzzzJul 17 at 3:04 PM\nMph\n\nIt was ok I dont like the 30 memories for game beat\n\nHelpful | 0", "diegomontoya28Jun 24 at 10:14 PM\nAmazing I recommend buying this game\n\nAdd the free dlc for this game plz\n\nHelpful | 0", "supremelmo69Jun 18 at 8:44 PM\nUm plz add a dlc\n\nCuz it what just be so cool cuz it felt like it was so short\n\nHelpful | 1", "EbicCringeJun 27 at 5:18 PM\nGood\n\nIts Good\n\nHelpful | 1", "DragonSlayerMountainJun 18 at 10:01 PM\nI want to sit or lie down on vacation\n\nI barely got started with this game, but I like what I have seen so far. Its pretty clever and most of all, its vacation! We need these experiences during a time like this. I do hope it has enough variety as opposed to reviews Ive read about the lacking thereof.\n\nOk, the game page clearly says its a game for standing, buuuuut it is vacation and itd be great if it had the mechanics for sitting. I really want to kick back on my virtual vacation, be lazy, and use as little effort possible to look around and get the items I need.\n\nSomething I would love to see added in a version update is the ability to use the right joystick to look around. I get that its vr, but its hard to play while sitting down. Again, not a game for sitting, but itd be a lot cooler if I wouldnt need to physically turn around to see something I need thats in my wall. I want to be on vacation! Its tricky to grab a sand dollar thats in my couch when my beach lounge is backed against a sea wall.\n\nThe other problem I have with this game is..again Im at my couch...its really hard to pick up objects that arent directly at arms length or in my couch! When I see something I want to pick up, its always in my sofa or side table. The items do hover up if you are almost directly over them, but forget it if its a foot away where the lamp is. I really like how the game I expect you to die uses their hand controls. You can point at and object and float it toward your hands. That would be a great update!\n\nIf I had to pick between the 2 issues since it is a standing game, I would pick the latter which is the ability to float items to my hands so I can easily pick them up. If that happens, Ill delete this review and give this game 5 stars.\n\nHelpful | 1", "INKling309Jun 26 at 1:11 PM\nIs good game\n\nIs good game\n\nHelpful | 0", "chokymilkJun 27 at 12:47 PM\nAmazing\n\nAmazing\n\nHelpful | 0", "Lachie_DanielMar 25 at 1:06 AM\nVacation Simulator\n\nProbably one of the best games Ive played! After having Job Simulator on PSVR I can tell you this one has endless possibilities , catch fish in a river, skim rocks, build sand castles, deep see diving, cooking for customers, through a party with the bots and thats probably not even an 8th of what you can do!\nLove it.\n\nHelpful | 5", "MajorDGamerMar 21 at 2:29 PM\nThis is the best VR game in existence\n\nThis VR game is so awesome, with the story, comedy, and the fact that you still have stuff to do after you complete the story. And the secret of JobBot after you collect every memory just tugged at my heart strings! It is a known fact that this virtual reality game is the best ever (next to Job Simulator).\n\nHelpful | 6", "XxdarkdeathxX21Jun 23 at 11:15 AM\nGreat!\n\nOverall Amazing!\n\nHelpful | 0", "OGxFUBARMay 23 at 5:13 PM\nGreat Game A Little Repetitive\n\nThis review is based on a few hours of gameplay.\n\nThe idea behind this whole game is genuine, enjoyable and can be a bit of a laugh to say the least.\n\nIts got good settings with an array of tasks and options to partake in.\n\nI found a lot of the tasks so far have ended up being a rinse and repeat style attraction, this is the ONLY reason I have a 4 star review. Now albeit there is some extra activities in each section it ends up being a, almost grinding experience to collect your memories of the vacation.\n\nIm in the slightly older group of gamers here but my eldest will be far more involved with this, no age group determined with this game! Just hit it with the right mindset!\n\nHelpful | 1", "Pepperw2Apr 18 at 9:04 PM\nDisapointed\n\nI was disappointed in this game.\nIt is more my preferences than the game itself. I take that back, the robots did miss the mark in a few areas.\nStill gave 4 stars because it is still a well built, well written game, with some funny moments ($1.00 drink with $69 surcharge lol)\nI just thought there was more to it. Like an actual vacation simulator.\nFor me, Vacation Simulator misses the mark on a few things\nFirst, the puzzles feel like a chore. They are just not fun (especially the sand castle game, which is less if a puzzle and more figure out this random blueprint ).\nSecond, when it comes to getting to the dive site. I got slightly excited when I thought I was going on a virtual cartoon boat ride. Instead, we start the boat, then get a blank screen and we are at the dive site. Someone needs to tell the robots how we humans like to ride fast boats.\n\nI want to leave this review on a positive note because there are some good things too, and this game definitely has its audience. . The sports games on the beach are fun, and I liked the painting challenge(I think that is on the hiking trail). The fishing game (hiking trail)is a great challenge , and is very clever regarding fish color. (no spoilers here)\n\nHelpful | 4", "Tommy1234567891Jun 5 at 4:05 AM\nGreat game\n\nI got this game a few days ago and I already got the party. I think you should have to get more memories\nOn the other side, its a great game\n\nHelpful | 0", "ChillkjcoolJul 25 at 8:55 PM\nI didnt really like it\n\nThere is not as much action in the game as I anticipated and the game finishes way too fast\n\nHelpful | 2", "tehdenFeb 13 at 6:15 AM\nLoved it even more than Job Simulator!\n\nBeen playing this game on and off over the past month, nearing 100% completion and hours upon hours played. It has everything Job Sim has, and more. There are 3 (4 if you include your hotel) distinct areas with different activities to keep you interested. From cooking to painting, photography to rock climbing, there is no lack of variety of content here. I found the photo quest/puzzles to be especially rewarding and a good level of challenge. Also, the game is downright gorgeous and runs amazingly well on Quest. The only things that drag the game down are probably the sand castle and ice sculpting activities (especially master level).\n\nVacation Simulator is well worth its asking price and my only regret is that I'm almost done with it. Wish there were more games like this!\n\nHelpful | 28", "barbeedoll12Jun 10 at 11:35 PM\nReally fun\n\nI love these games and I would buy more\n\nHelpful | 1", "afuwithJun 10 at 4:12 AM\nGame is god\n\nI like Game becus i play and i go hapy\n\nHelpful | 1", "CDF888May 27 at 4:13 PM\nAwesome\n\nI love this game but When I first started it kept crashing but I think it was the lightning for the tracker\n\nHelpful | 0\nDeveloper ResponseMay 28 at 2:10 PM\n\nThank you for letting us know, we are pumped to hear you love it! We want to learn more about your experience. Please email us at owlchemysupport@google.com so we can take a closer look!", "J0NATHAN2Jun 11 at 12:36 PM\nLove It!!!\n\nPlease add more memories to do.\n\nHelpful | 1", "krysta.camp.5Jun 11 at 1:59 PM\nAwesome\n\nBest game Ive ever played\n\nHelpful | 0", "P-NuTTyMay 10 at 2:22 PM\nA must have title!\n\nSpent hours and hours completing all tasks in the game. Not all at once mind you.\nLots of fun puzzles, quite sad when it was all over. Hope a new version comes out soon or even a DLC.\n\nHelpful | 1", "KauzicomMay 20 at 11:28 PM\nThe most fun ive had in vr!\n\nThe game is a lot of fun and its perfect if you have friends over. We giggled the whole night about the stupid and funny things!\n\nHelpful | 0", "Balakae.exeApr 24 at 11:19 AM\nBest GAME!\n\nThis game is my favorite vr game! It has a good story, funny characters, and many things to do in the game. While being a bit pricey, I found every penny worth it. This game gave me many memories and I will not forget them. 11/10 keep up the good work guys! :)\n\nHelpful | 1", "Teh_FeckJun 3 at 8:13 AM\nGreat for kids\n\nMy daughter loves this game! Fun, user friendly, immersive.\n\nHelpful | 0", "Capt_Quint620Apr 15 at 11:09 PM\nLot of fun overall (4.5 stars)\n\nDefinitely a lot of content for your money. And it is more open than Job Simulator, allowing you to do as you please. The tasks are usually light enough that it seems less like work (like Job Simulator) and more like relaxing fun. Some of the minigames, like food orders and photos, are repetitive, but I won't dock a whole star for that.\n\nI won't even do so for the sandcastle/ice sculpture puzzles that were too tedious to be fun. Maybe other people get them, but I needed help for those.\n\nBut, for your money, you get hours and hours of fun, and there's enough enjoyable activities to return to. I, for one, love the painting activity, mainly because the brush was really well done. The bots are amusing as usual. I highly recommend it.\n\nHelpful | 1", "PeytonTheAlienMar 22 at 9:08 AM\nSo much fun\n\nI looooved job simulator and while this game brought whole new concepts the heart and soul remained the same. The story line is great , the quests are great, its just so much fun! Ive already spent hours playing and it hasnt gotten boring or anything. Id say the playibility is good\nSomething I think would be worth adding is more places to put photos in the hotel room\nIve found that I love taking pictures but just dont have much room to display them.\nI feel like it could be done with having another place on the wall or adding picture frames and such\nAnyways just and idea\nId 100% suggest this game especially to those who enjoyed job simulator but also to those who hadnt played it!\n\nHelpful | 3", "kazz7982May 24 at 9:22 AM\nGreat Game, but . . .\n\nGreat game to play, with the different worlds and games in each one. But I have yet to play without it glitching. The screen freezes then goes black. You can't exit it out to the main menu and have to wait minutes for it to reset.\n\nHelpful | 1\nDeveloper ResponseMay 26 at 11:05 AM\n\nSorry to hear you have been experiencing this. Thank you for letting us know, and we are happy to hear you like our game! Please email us at owlchemysupport@google.com; we want to get you back to VACATION!", "aklegendMay 23 at 10:55 AM\nVery impressive..but\n\nI dont like how there is no clues ...hints..etc when doing the sandcastle, ice sculpture, or rock climbing that the little humans can use like job simulator has...other than that we really enjoyed the game..please provide hints on these for the little ones!\n\nHelpful | 1", "kplworldApr 17 at 7:19 PM\nKids love it\n\nMy kids love vacation simulator. Im not too much of a fan. It keeps the kids (7 and 9) occupied for hours. Working wonders now that we are stuck in the house\n\nHelpful | 3", "oculusquestfangamesrMay 25 at 7:14 AM\nSo good game in covid 19 time\n\nIts a good game in covid 19 time because you Can go to Beach forest pt mountains\n\nHelpful | 0", "DaWorstPlayrEvaMay 7 at 1:55 PM\nA lot of fun for all ages\n\nMy 8 year-old daughter and I both love playing this game. Its cartoony, fun, and humorous. This game paired with Job Simulator are a great addition to the oculus quest.\n\nHelpful | 0", "r.allegro2 days ago\nLove it\n\nMuch more involved game then the job sim which I also love. Its great that you can set this up for multiple people.\n\nHelpful | 0", "RumpelforeskinJun 7 at 5:35 PM\n\nYes\n\nHelpful | 0", "UsurpingSquare5Apr 24 at 10:43 AM\nJust needs some easier explaining!\n\nSo far I have had a great experience in this game, my mom and dad also love it. Although my mom is a bit confused on how this game works and the point of it. So maybe that should be cleared up for non tech savvy people\n\nHelpful | 1", "MansuitJul 11 at 4:23 AM\nToo glitchy\n\nWhen I played the game it was fine at first but then it started to bug\n\nHelpful | 0\nDeveloper ResponseJul 22 at 9:48 AM\n\nHi there- we are sorry to hear this. Thank you for letting us know! We are really interested in learning more. Could you email us at owlchemysupport@google.com so we can take a closer look?", "leon.carpin.790May 7 at 12:38 AM\nGreat game\n\nI love this game because of how much there is. Same with job simulator. Both great games, worth the money I highly reccomend it especially to kids.\n\nHelpful | 0", "jared_coppinJul 29 at 1:27 AM\nBetter than job sim\n\nThis game has lots more content and area to explore than in job simulator, the teleporting works so well and after the update there are zero crashes and it all runs so smoothly. Its one of the best games you can get on oculus, it really feels more like a fully developed game than lots of previous vr games like job sim that feel like a test or unfinished when vr was very new and experimental, this is in no way like that, it really is a proper GAME\n\nHelpful | 1", "kermiternsMay 30 at 3:06 PM\nGreat\n\nIt's funny charming and great\n\nHelpful | 0", "Killer-kiteMar 25 at 7:00 PM\n\nThis is an amazing game. I loved job simulator but after a while it got boring. Unlike job simulator there is much more of a plot and their is so many more missions. I love missions in games it gives me something to do so I really liked this game. There is much more of a plot and a storyline where job simulator lacked that. So happy I bought the game it is totally worth the money!\n\nHelpful | 2", "Unknown_PawsMar 21 at 9:02 AM\nWorth every single cent\n\nLike job simulator this is an excellent game but with job simulator you were more confined and it was harder to get a feeling of new after completing the main part, but with vacation there is so much. Just like job simulator there are four places but all in the same world, so once you enter you are in a resort which is the first place and has so much already there to do. There are so many secrets too. Then there is a beach which has more obvious things that one can do as the resort is there to come across as a resort and there is a forest and another place. The way it makes things harder as you go and gives you a reason to do stuff (with these memories) is great, in addition it has an interesting mini story which had me in the floor.\nThis is a great game (but why cant you copy stuff in the printer!!!)\n\nHelpful | 2", "landon_OusleyApr 29 at 11:25 AM\nAmazing\n\nIm playing this during quarantine, and it feels like this game is taking me to a different dimension.\n\nHelpful | 2", "19King896 days ago\nAdorable \n\nThis game and job simulator is one of our favorites It's fun, funny we just can't stop laughing keep up the great work\n\nHelpful | 0", "K8sueApr 12 at 1:00 PM\nfun\n\nfun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun game fun\n\nHelpful | 1", "karen.leekrystieMay 31 at 5:19 AM\namazing my brothers like it my cousins\n\ni even like it\n\nHelpful | 0", "alcushMar 29 at 11:04 PM\nAwesome game\n\nI recommend this game to any oculus quest buyers because this is a great game so much detail put into it really fun good quests good voices and if youre a fan of Jacksepticeye Hes on it too and you will love it just telling you can carry the radio in your backpack so if youre going to find the abominable snow bot take that with you The last setting I think it is on the radio is the best so if you think about it definitely purchase\n\nHelpful | 2", "Lfanvr19 days ago\nIt's nice to get away!\n\nLoved Job Simulator and this is like that but expands on the idea with so much more to do. Love the little quests you have to do too but building sand castles is hard!\n\nHelpful | 0", "RyanRamenVR12 days ago\nMUST HAVE!\n\nThis game is gold. It has amazing puzzles and awesome gameplay. Ive played Job Simulator and I love sequels but this is the best ever.\n\nHelpful | 0", "JackAttack0601Jun 1 at 4:22 PM\nGREAT GAME\n\nThis is a great game!\n\nHelpful | 0", "schmoo104May 21 at 6:31 PM\nCamper world\n\nYou should add a camper to drive around in all vacations and store valuable items. And hire drivers from different vacations. Drivers will accept the money associated with their vacation.\n\nHelpful | 1", "MandyFTWMay 28 at 2:20 PM\nI love this game.\n\nSo entertaining!!!\n\nHelpful | 0", "questtwinsMar 22 at 6:49 PM\nLOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE\n\nLOVE LOVLOVELOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE E LOVE LOVE LLOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE OVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVLOVE LOVE LOVE LOVE LOVE LOVE LOVE LOVE E LOVE LOVE LOVE this game\n\nHelpful | 3", "MonkeyKingPt2Jun 6 at 8:58 AM\nKids love it unfortunately its unstable\n\nSeems like a great game. Kids love it. Unfortunately it crashes very often. Ive played more stable beta builds of games. Very frustrating as am running the latest version of the operating system and nothing else I run has had any problems.\n\nHelpful | 0\nDeveloper ResponseJun 8 at 9:13 AM\n\nSorry to hear you guys have been experiencing this. Thank you for letting us know. Please share more of your experience with us at owlchemysupport@google.com so we can take a closer look.", "kittykats987May 14 at 1:49 PM\nAMAZING!!\n\nI been playing this since I bought my oculus quest and I have no complaints at all\n\nHelpful | 0", "happylittleaccidentsMay 19 at 6:49 PM\nDont buy this game!\n\nYes, its a really fun game. At the beginning. Then it becomes boring and uneventful. It was way below my high expectations. I attempted to get a refund, but apperently my brother has been playing it without my permission for hours.\n\nHelpful | 2", "Shadowflame9May 4 at 8:00 PM\nIm loving it!\n\nId played this a few times, through friends and what-not but I was able to buy it very recently and Im just in love!\n\nHelpful | 0", "Dogball12May 9 at 12:45 PM\nIts really good\n\nIts really good\n\nHelpful | 2", "Jo_doggApr 22 at 3:01 PM\nAmazing\n\nHave had it for less that a hour and it has been a blast\n\nHelpful | 3", "yeetVR2009A day ago\nfun\n\nthe game is fun and addicting alot of things to do\n\nHelpful | 0", "IssacSeth19Apr 27 at 2:31 AM\nGreat game\n\nThe whole game seems like a new adventure with new features added\n\nHelpful | 2", "tashauhl1May 8 at 11:34 AM\nKiddo loves it\n\nHe like Job simulator and now with a virtual vacation during COVID 19 he is ecstatic.\n\nHelpful | 1", "KingLunikkApr 21 at 10:54 AM\nWonderful Game\n\nLovely Game. A must-have for every owner of the quest. Like many Oculus titles, it could use some major updates instead of new content. However, its worth every cent.\n\nHelpful | 0", "TrisolaransMay 13 at 2:28 AM\nDisappointing kids game\n\nI bought this game after seeing all the positive reviews, I heard the mini games were fun but I haven't enjoyed any that I've encountered so far. Im disappointed after 3hrs of play j can't get my money back\n\nHelpful | 5", "agitokazuDec 12 at 10:34 AM\nBrilliant just like Job Simulator\n\nSequel to the game that first got me into VR all those years ago in my brother in law's garage :)\n\nBought it on steam on the day it Released and stopped playing it since I heard of the quest versions release :)\n\nGlad to see that it looks the same and plays the same\n\nWorth the purchase\n\nNow hope to see Rick and Morty VR make it over\n\nHelpful | 441", "GeurtspowerApr 6 at 7:03 AM\nA ma zing\n\nIts an amazing game with lots of content.\nThe animation is a lot more lively than in job simulator. I love the memorie system. It really makes you feel that you can finish the game. And Jacksepticeye is awesome as MOUNTAIN SHOP SELLER!!!\n\nHelpful | 0", "louisfriedmann13Apr 6 at 9:48 AM\nGreat Game\n\nIt really feels like Im on vacation, its awesome!!! This game is worth the money!!!!! All of the amazing details in this game will keep you playing for hours.\n\nHelpful | 2", "FatSheamusFeb 11 at 4:27 PM\nSo Much to Do!\n\nHow can I describe this game except to say that it's like a toddler's activity toy that's just sophisticated enough to be entertaining for an adult. Big bright colorful and silly, but actually taxes your brain Just enough to remain entertaining for hours. This is the perfect sequel to job simulator and its tongue and cheek archival of human life humor. Definitely worth the purchase!\n\nHelpful | 7", "NoSolicitingDec 13 at 2:29 PM\nSO MUCH CONTENT!!!\n\nOne of the most frequent complaints I hear about VR is that everything feels like a tech demo, which is somewhat true. But vacation simulator has officially killed that reason to not get VR. Its one of the best experiences Ive ever had in VR. The only complaint that I have is that Ive crashed more than a few times but Im willing to blame that on my oculus quest and not the game itself. Even with the crashes its still worth $60 even though were only being charged a fraction of that.\n\nHelpful | 133\nDeveloper ResponseFeb 25 at 10:45 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "RetroPigJun 11 at 7:29 PM\nIts ok\n\nFantastic game. Once you do the more obvious quests, it becomes harder to have fun. The first part of the game (first ten hours) is fantastic overall.\n\nHelpful | 0", "brynleycharleshillMar 28 at 6:00 AM\n\"VACATION\"\n\nSeriously if you need a vacation and can't get out because of the new laws, this is the game for you. With 3 exotic locations and with many things to do, it's a great way to vacation your way.\n\nHelpful | 2", "MonkeyojackoYTApr 28 at 7:17 PM\nRecommended\n\nNo questions needed its just good\n\nHelpful | 1", "Sfrossmo14 hours ago\nThis games is the best\n\nIts so fun\n\nHelpful | 0", "JaminMcReadyApr 1 at 10:06 AM\nGreat but ...\n\nIt a great game there is just one problem.\n\nI have had to restart about 3 times because my HUMAN account keeps getting deleted by mistake but there is no other problems with the besides that and it still deserves a 5 star rating in my opinion.\n\nHelpful | 1", "Spoonyg0dMay 23 at 1:53 PM\n.\n\n.\n\nHelpful | 0", "loueythelampMay 13 at 4:36 AM\nThe best\n\nThis game is so fun!\n\nHelpful | 0", "Drew119119Apr 27 at 10:25 AM\nLove it\n\nNo problems! I love it\n\nHelpful | 2", "A_person15069May 12 at 8:19 AM\nAmazing game\n\nI love this game\n\nHelpful | 0", "NathanB4TSApr 24 at 4:06 PM\nFun time!!\n\nIve 100% the game once and am working on it again, its super fun and never gets too dull or boring!\n\nHelpful | 1", "flufymoustachioApr 26 at 10:00 PM\nEs very nice\n\nEs very nice\n\nHelpful | 2", "ShapedriftJun 17 at 2:31 PM\nVery boring\n\nI hoped the experience would be similar to the job simulator, but it is not comparable. Unfortunately the time to refund has passed.\n\nHelpful | 1", "DoritoDanApr 26 at 9:28 PM\nTHE BEST VR GAME INCLUDING JOB SIMULATER\n\nThis game is so so fun I would recommend and also job simulator is fun too. \n\nHelpful | 1", "Neolee75May 6 at 4:26 PM\nGreat fun when it works\n\nGame frequently crashes my quest less than 30 min in to the game, where I have to power down and restart game.\nSuper fun when it works and the kids love it.\nNo other games cause my quest to crash.\n\nHelpful | 2\nDeveloper ResponseMay 6 at 4:49 PM\n\nSorry to hear you're experiencing that! Shoot us a message at owlchemysupport<at>google[dot]com so we can get you and your family back to VACATION!", "sweston2312Apr 3 at 10:45 AM\nExactly what I wanted\n\nI am a puzzle and task gamer. I love to earn points for completing tasks... the more difficult the better. This is a game you can do at your own pace and I am totally addicted. Thank you!\n\nHelpful | 1", "Crofty2005Jul 9 at 12:17 AM\nh\n\nmy dog died irl\n\nHelpful | 6", "imperfect-key478Jun 26 at 7:14 PM\nJust as good as the original\n\nThis game is just like the original job simulator. It is fluid, the graphics are cartoony and it has some great jokes with it as well. This may actually be better than job simulator. Honestly, this is another must have game for a person with a quest.\n\nHelpful | 0", "CH3MISTRY1Apr 1 at 9:23 AM\nFun and casual\n\nFun to play. I for some reason like sitting in the water, maybe because the physics of it are so realistic. Only downside is the challenges in the different regions are very similar\n\nHelpful | 0", "mattman6886Mar 31 at 7:10 AM\nWould be five stars but still freezes!\n\nI applaud the developers for all the hard work they put into this great game and for releasing updates to try and resolve issues where the game freezes. But for me I still get frequent crashes when booting it or hitting the home button and disorienting game freezes that force me to hard reset my Quest.\n\nHelpful | 4\nDeveloper ResponseMar 31 at 2:59 PM\n\nSo happy to hear you enjoy the game! We're really interested in what is causing your game to freeze and possibly crash. Could you send an email to owlchemysupport<at>google(dot)com ? This way we can see if we can figure out what's going on.", "thekillercake21 days ago\nTons of fun but has its problems\n\nIs this game fun? Yes, very. But man it has its hickups. If you wven think about leaving your gaurdian the game decides its done and crashed. I also will get random crashes when transitioning between different main areas too quickly(ie the vacation zones and main hub). I also get a crash when I take the quest off for more than a minute or two to go to the rest room or to grab a drink. But besides the crash here and there the game is great and would recomend if you are willing to put up with the crash or hard restart every so often.\n\nHelpful | 0\nDeveloper Response20 days ago\n\nThank you for letting us know what you are experiencing. We are sorry, and we want to get you back to having fun! Please shoot us a quick message at owlchemysupport(at)google<dot>com so we can take a closer look.", "Scarekrow75Mar 25 at 12:44 PM\nAstonishing\n\nIm very impressed by everything in this game. The amount of detail, the challenges, the fun, you name it. I highly recommend this game to anyone who, let me think, exists. I believe anyone can find joy in this game.\n\nHelpful | 1", "BladeshotJun 15 at 6:26 PM\nGreat Game!\n\nI really loved job simulator so I decided to take a chance on this one. I was kind of skeptical about the price but I bought it anyways. Let me tell you, it is really worth the price. If you liked job simulator your gonna love this. There is actually a small story line and way more content. There is even small features like actually having to open a chip bag and eating them individually rather than how it was in job simulator. The game is really fun and worth the $30. It is even good for some of my friends that have a small space and struggled on job simulator due to their play space, but since they can teleport its much easier now. Really recommend this game to everyone!\n\nHelpful | 0", "christianhernApr 28 at 9:42 AM\nAmazing!\n\nThis game is amazing! It entertains a lot.\n\nHelpful | 1", "MegaNarwhalBlastDec 12 at 12:21 PM\n\nI just snuck a peek during work, made my character and hung out in my suite, and I cannot wait to play all night. There looks like so much to do and discover, I am so excited. I put so many hours into job simulator and am going to do the same here, I just know it! The only thing that would make this the best game ever would be to make it multiplayer. I'd like to be able to play and be silly with my husband.  but either way! Very much looking forward to playing this and anything else you guys come up with!\n\nHelpful | 73", "stephenjgolding123May 19 at 2:23 PM\nReally fun\n\nReally fun but honestly I don't think it can beat the original\n\nHelpful | 0", "EJsuperfanMar 30 at 12:01 PM\nGreat Game but some mini games are hard!\n\nWhen you have to take pictures of items to get memories sometimes the pictures are hard to read and you dont know what to do. Also, when you are cooking for the bots, they arent specific if you should give the food to bug bot in that world or in the other world. Also the sandcastle making and the ice sculpture making is soooo hard and there isnt even a tutorial!!! It is soooo confusing and I cant get it so I cant get the memories!!! I want to beat the game but it is too confusing. A real bummer, this game could be soo much more.\n\nHelpful | 0", "campbellino9May 1 at 1:02 AM\nYes\n\nYes\n\nHelpful | 0", "cheezy.sergalApr 16 at 9:51 PM\nPretty awesome\n\nI think its a great game, my sister loves it, I like it. Overall pretty great\n\nHelpful | 0", "NS1595Jun 9 at 1:11 PM\nJust bought this game and loved it!\n\nI love his game, its really interesting and the concept is really great. I couldnt stop playing it, its so much fun! I would really recommend buying this game, its definitely worth it! There is so much to do and explore, I didnt think I would love it this much. However, I would like to recommend having more options to customize your look. Besides that, this is a wonderful game!\n\nHelpful | 0", "MyNamesNotZeldaMar 28 at 8:15 AM\nMassive step forward\n\nThis game is a huge step forward from job simulator- and is a fantastic game for anyone who wants to get distracted by constant activities for the foreseeable future\n\nHelpful | 1", "Virtual-LifeMar 28 at 2:03 AM\nOne of the best Quest games\n\nI loved Job Simulator but this takes that formula and improves upon it in every way. The quest makes this game even better with roomscale. This game is a must have.\n\nHelpful | 0", "freddy.rudasApr 23 at 7:52 PM\nGood game\n\nIt's very funny 100% recommended\n\nHelpful | 1", "kenderlendApr 17 at 10:21 AM\nNiceee\n\nThis is great. I loved job simulator and this is even better.\n\nHelpful | 1", "josephw18Apr 14 at 5:39 AM\n\n\n\n\nHelpful | 0", "KingDerp12Apr 21 at 2:22 PM\nGreat game!\n\na little labor intensive, but fun.\n\nHelpful | 1", "sieraashleyalvarezJul 2 at 9:55 AM\nLove it! But...\n\nI totally loved job simulator . And I love this one too but , on the beach I can never get through building the sand castle even following the blueprint , I think theres something wrong there. Its a simple blueprint too , it keeps saying the right side of the castle doesnt match but it really does I even spent hours experimenting with the other blocks available but to no avail . Id love it if the developers could fix this problem. I have no trouble changing the rating later ..but thats my only complaint.\n\nHelpful | 0", "AnonMomApr 1 at 11:04 PM\nFun for all ages\n\nMy kids and I have been playing this in quarantine. There's a lot of things to do and interact with. I bought this on sale for $25 and I feel it's worth it. I wish there was a bit more instruction though, I get lost at times and dont know what I am supposed to do.\n\nHelpful | 0", "Mr.RitchieApr 10 at 11:05 AM\nHours of fun\n\nGot this for my niece after she devoured job simulator, yet again another great game!\n\nHelpful | 0", "josh.cobb.9279Mar 21 at 10:37 AM\nVacation awesome\n\nAmazing game \n\nHelpful | 0", "abear17Apr 17 at 4:25 PM\nDaughter Loves it\n\nMy daughter would play this all day if I let her.\n\nHelpful | 1", "SirfantyMar 30 at 6:53 AM\nThought Job Simulator would be better...\n\nI was thinking that job simulator was the way to go but this game really is. With the seemingly endless puzzles and mini games I played for hours waiting to see 90% complete. But I was met with an 18% instead. Recommend it to all.\n\nHelpful | 4", "CasualCheetahFeb 26 at 9:26 AM\nMemorable and Welcoming!\n\nNot only is it really accessible to VR newcomers, but there's a ton of activities and fair bits of challenge. It's a joy just to be present in the stylized environments and to interact with all the props and quirky bots (although most of my shared users ignored the 'story'). The game looks gorgeous and even has some pretty impressive physics that push the Quest to its limits. Because of this, the game can be pretty glitchy at times (waving not registering, missing/misplaced props, missing textures) so it'd be great to see the game receive a bit of additional support.\n\nNonetheless, Vacation Sim is a fantastic asset for the Quest's wirelessness and it evokes a playfulness indicative of VR's strengths.\n\nHelpful | 0", "janerabMar 20 at 2:37 PM\nVery good!\n\nIt is definitely better than job simulator with tons more activities to do. I love how they have the ability to have multiple IDs so you can have a different people on a different ids.\n\nHelpful | 0", "TeddyEdFeb 10 at 12:21 PM\nBrilliant\n\nI got an oculus quest for Christmas and I instantly bought this game and I personally think its the best game out there. The story plot is amazing and it has lots of gameplay in it and its fun to just play around ! I recommend this game if youre looking for a good game to play.\n\nHelpful | 9", "kittecuiteJun 29 at 2:32 PM\nMeh\n\nIts fun, but over time, it gets boring. There are a couple of glitches that happen when you first play the game. For example, at the beach, when you make burgers for some of the bots, it doesnt get the burger when i hand it to them. I had to go this multiple times without it working at all. Other than that, its a pretty amazing game.\n\nHelpful | 0\nDeveloper ResponseJul 22 at 9:49 AM\n\nHi there- sorry to hear this. Thank you for letting us know! Could you email us at owlchemysupport@google.com so we can take a closer look?", "brandon2965Feb 24 at 2:34 AM\nFun\n\nI enjoyed the first title so was anticipating this release and i think it lived up to the expectations probably even surpassing its predecessor. I love the humor. You can teleport around in this one and there is a ton of stuff to do and find. For instance there is a TV in the hotel part and you can find different video game cartridges throughout the world and play them on the TV. Lots of other cool ideas to keep you entertained for a while. I recommend trying this game if you liked the first one. I think you'll get more playability out of it too.\n\nHelpful | 0", "WalmartWayApr 14 at 3:13 PM\nVery good\n\nSo good my mom likes playing this more than me.\n\nHelpful | 0", "2noob4uApr 7 at 5:52 AM\nGreat game\n\nA Beautiful, entertaining, relaxed game. A massive improvement from job simulator.\n\nHelpful | 0", "GamerTiger19Feb 23 at 6:34 PM\nReally Good!\n\nI love everything about this game, the plot is hilarious but genius, the jokes are super funny, and let me just mention that this game breaks the fourth wall so much with pop culture references that there really isnt a point in rebuilding it, I do admit some of the mini games are a bit dull, but they are all fun nonetheless. Other than that the game is amazing! I recommend it highly, and its super cool the amount of detail in everything with the Easter Eggs and all. Such a great game!! :) <3\n\nHelpful | 1", "Ender17898Apr 12 at 6:47 AM\nAwesome\n\nVery good loved job simulator and love this it amazing\n\nHelpful | 0", "SankyuApr 11 at 7:33 AM\nLag in Beach area grill spot\n\nI don't think this has happened before, but would like to address this so I can let you know :) The FPS goes down and I notice this especially with my hand movement and when I look at the waterfall from the grill spot in the beach area.\n\nAddendum: Once I start cooking up and slicing food. More items/food that I handle, then the lag comes. No lag if the area is clean and unused.\n\nHelpful | 1", "ShawnQuest3Mar 15 at 12:40 PM\nVery good game\n\nI bought this game because I saw some YouTube videos about it, and it was really fun! Some parts are a little repetitive, but the game is still fun, even after you complete the main story.\n\nHelpful | 1", "EllisssMar 20 at 5:28 AM\nNot for me\n\nI've recently purchased vacation simulator and I don't feel fully imursed in the game (same goes for job sim ) it feels like I'm there but not there and I still love the cartoony visuals and the very funny dialogue\nBut it's not one of them games were you can just keep playing for a long time because you feel like you've done everything but I guess that's the design of the game.\n\n\nJust a note I think game is great but it's not for me if that makes sense and I believe loads and loads of people will enjoy it but just incase maybe watch the trailer first\n\nHelpful | 1", "DontReallyKnowApr 20 at 4:52 PM\nGood\n\nGood\n\nHelpful | 0", "Detective_SuperheroApr 12 at 5:07 PM\nGreat game\n\nMy daughter loves this and job simulator.\n\nHelpful | 0", "lilEYOsticksApr 19 at 8:40 AM\nGood\n\nGood\n\nHelpful | 0", "LinkFox01Dec 27 at 9:15 AM\nGame review\n\nThis game is a blast!!! I just bought it yesterday and Im in love with it! For me I love testing 1 the tracking 2 the physics 3if I can bounce this with my hand. This game is were your on vacation and you get to visit three different settings a beach a forest and a snowy mountain and with each setting theres a series of quest your supposed to do and as you do these quests you can unlock different things in that setting for example in the beach do five quests you unlock a dive boat you can go diving and find treasure stuff like that I hope this review was even a little bit helpful for what your buying\n\nHelpful | 29", "EeveekittyMar 8 at 4:41 PM\nBugs and being forced to reboot\n\nI like this game, great intention from Job Simulator, but after I got to about 80%, things got ugly. On Oculus Quest, I started to see and experience red flags. Overall, after 3 minutes in, there will be lagging and bugs that seem to be making things choppy and unplayable. Then it would just black out, forcing me to shut down the game and rejoin, and sometimes, I dont fell like rejoining again.\n\nHelpful | 4\nDeveloper ResponseMay 6 at 5:09 PM\n\nSorry to hear that you encountered those issues when we want you on VACATION! We are really interested in learning more about what could be causing this. Please shoot us an email at owlchemysupport(at)google<dot>com so we can take a closer look!", "3HonyocksJun 23 at 11:36 AM\nI LOVE THIS GAME\n\nIt is the best VR game yet and I also love job simulator I just needed a vacation I shouldve spent $1000 on it because it is so good not a troll I promise\n\n\nHelpful | 0", "EddieEvansJun 22 at 1:13 PM\nGreat game but,\n\nThis is an awesome game but, I wish there was more content like more place to go like theres a Beech Forest and a mountain thats all I ask not only that there should be more things to do in these places like its the same formula repeated but like its a nice game because you actually feel like youre in these places not only that you were like doing new things but like you know same formula. So every single place you have to find a certain type small animal that gets scared easily for a tiger robot. And then the others will ask you to do something but theyre different so you get what Im saying. Some more places more things to do and, different formulas in different places.\n\nHelpful | 0", "AndrewdaTNTgamerJun 23 at 5:47 PM\nDefinitely Recommend buying!\n\nRecently I got this game as a gift, and even in the first hour or two, it was still super fun! Really good for people who want to go on a vacation, but cant!\n\nHelpful | 0", "AyingerMar 31 at 6:57 PM\nLoved it\n\nBest games since Job simulator loved it cant get enough of it worth the money.\n\nHelpful | 1", "adamusaworldMar 31 at 6:51 PM\nGreat Game!!!\n\nI love this game I always jump into vacation simulator whenever Im on my VR\n\nHelpful | 0", "CraziebgirlMar 12 at 2:49 PM\nPerfect \n\nPerfect game that has amazing content In it, love the cameos of you tubers and both games (job simulator and vacation simulator) are the best game Ive played EVER!!\n\nHelpful | 0", "LHansonMar 22 at 6:44 PM\nExpanding on a very fun idea\n\nGreat game. Had everything i was hoping for from the original plus more details and mechanics to enjoy. I liked it.\n\nHelpful | 0", "BooallenJul 7 at 5:07 PM\nLove it!!!\n\njust all around fun and very creative! Favorite so far is the mountain!\n\nHelpful | 0", "ellabellabakeryMay 22 at 9:38 AM\nAmazing sequel to job simulator!\n\nIf you love job simulator youll love this even more! I havent gotten too far into the game but I already no its amazing. I love just exploring the places and getting memories. Its so worth the money because there is so many things you can do within the game! So far it is my favorite game on the quest!\n\nHelpful | 0", "RuztikJul 7 at 6:44 AM\nWell made!\n\nBrings smiles and happiness to everyone, children and adults alike :)\n\nHelpful | 0", "BraxmolJul 6 at 2:39 PM\nVery good\n\nIt is literally the best breakfast game of all time nothing more to say\n\nHelpful | 0", "n3rd_h4v0cJul 15 at 12:11 PM\nAwesome!!\n\nBetter than Job Simulator!\n\nHelpful | 0", "lightning7765May 21 at 8:31 AM\nBrings lots of vacation happiness:)\n\nI have loved this game so far. I played the old job simulator on a friends PSVR so had heard a little about this sequel. The gameplay is bright and colorful and I didnt get motion sick after playing and moving around my room for hours. My favorite feature about the game is the fact that you can take selfies with youre own camera. Thats so cool. If helps you capture all youre favorite experiences in the game and then put them on a wall back in youre vacation island room. LOVE IT ALL and highly recommend. Great job Owlchemy Labs!\n\nHelpful | 0", "camerv0517Mar 22 at 12:47 PM\nSo fun, and lots of content\n\nI spent half an hour just in the bath tub, this game is packed with content, must have for all VR users\n\nHelpful | 0", "KevinthecocoJun 23 at 5:48 AM\nLove it! But buy the first game first\n\nThis game is one of my all time favorites! But you won't get the same experience unless you play job simulator first. Five star game!\n\nHelpful | 0", "ovrbiFeb 16 at 3:19 AM\nThe best, infinite orders pls\n\nThis game is the best with so much CONTENT and INTERACTIBILITY. Even inspired me to work in real life afterwards or make a SANDWICH. Would love to get PROCEDURALLY GENERATED orders and such though\n\nHelpful | 2", "NeverWrongFeb 6 at 5:33 PM\nFabulously Fun!\n\nI could not wait to get this game after falling in love with Job Simulator. I like the environment and funny characters. Its fun, polished and quirky.\n\nI dont love is having to earn a set number of memories to unlock certain areas/activities and truth be told, most of the activities in each vacation area are the same (cooking, puzzles - build a sand castle/build an ice sculpture, scavenger hunting). That being said...There is enough variety to keep me entertained. I can tell that a lot of thought went into this game. Its the little details (like the game console with playable games) inside your vacation suite, that really ups the fun factor for me.\n\nKeep making these simulator games Dev team and Ill keep buying them!\n\nHelpful | 2", "cosmicwDec 15 at 9:35 AM\nWow! Now I can go on Holiday in VR!\n\nI loved Job Simulator and this is an amazing Vacation set in the same world. If you're wondering which to go for they are different enough to justify getting both.\n\nThis one is like a relaxing holiday with your own apartment with a giant bath and big bed and fantastically stocked mini fridge and internet access and video game console and TV and holidays on the beach,forest and mountains.\n\nThere are lots of activities some different to job sim and some similar like making hot drinks and food. It's at a slower pace than job sim, and the world is much larger.\n\nIt's one of the largest and most in-depth titles on Quest, and suitable for everyone. And funny too!\n\nHelpful | 15", "ludusvrFeb 11 at 11:57 PM\nAMAZING!!\n\nThis game is amazing! There are so many challenges and achievements to unlock as you go through. Its a reason why to get the Quest. This is an amazing experience to play in Virtual Reality. Big one for the quest with a fraction of the price its worth!!\n\nAmazing!\n\nHelpful | 1", "firstspringdayMar 16 at 1:02 PM\nSuper fun\n\nThis is a great beginner game. Hours of fun and exploring\nI love the different places you can go vacation\n\nHelpful | 1", "sugxrkatMar 16 at 11:14 PM\nlove this game\n\nloved job simulator, love this too\n\nHelpful | 2", "DarkLightningXXFeb 16 at 5:26 PM\nBest Game Everrr!\n\nFun games in general Fun-quests and fun things to do, you can have yourself spending an hour doing whatever you want and having fun whatever you can do this game. This is an ultimate game of relaxation and doing puzzles.you should try it out if you could\n\nHelpful | 1", "SteveHxrveyJul 11 at 11:15 PM\nGlitching\n\nI was at the beach, I was also delivering a hotdog to sports bot. But all of a sudden it was a black blocky mask, and everything started to glitch. I tried to start it again, but it wouldnt go away! It ruined my whole experience, as I just started this game just for it to glitch. Oh well, Im thinking on getting a refund if not fixed.\n\nHelpful | 0\nDeveloper ResponseJul 22 at 9:48 AM\n\nHi there- we are sorry to hear this. Thank you for letting us know! We are really interested in learning more. Could you email us at owlchemysupport@google.com so we can take a closer look?", "adam.murdoch.7731Jun 28 at 1:56 AM\nGreat! Definitely recommend!\n\nI think it is really good and Ive barely started! I definitely recommend it!\n\nHelpful | 0", "TrentyBoy3Feb 6 at 2:21 PM\nReally good sequel.\n\nSo I'm gonna go ahead and say that Job Simulator was amazing. And it still is. But that game is more limited. But this game is kind of like that games mechanics, but enhanced. So in this game you have WAY more control over what to do and lots more activities. But it is a different style of gameplay. One thing, though, is that it does keep the original style of lots of levers and buttons to push for everything instead of just one thing. But I'm not saying this game's better, because they are two different styles of play, for me. But I do recommend this game, totally.\n\nHelpful | 4", "saltyspencerMar 11 at 8:53 AM\nAwesome game!\n\nIt is very fun and theres lots of things to do, the only suggestion may be to make the sandcastle activity a bit easier\n\nHelpful | 0", "Emily55555Jan 1 at 11:23 PM\nVery fun... they thought of everything\n\nWhat impresses me most about this game is the level of detail put in when interacting with objects. For example when you put a pineapple in the waffle maker, you get a pineapple shaped waffle. You can use a beach ball in the knitting template and make a knitted beachball. The amount of thought that went into thinking about how every combination of objects react together is incredible. Even the radio, television,video games and computer all work within the game and have a lot of content which can keep you entertained. Great job developers! This is an amazing experience/game.\n\nHelpful | 17", "very_cool-asaurusMar 12 at 6:24 PM\nOne of the best games I have\n\nGetting to inter act with the bots is so fun and theres so Much to do! It also feels great to play. Get it if you can\n\nHelpful | 0", "RoseBud1233Feb 10 at 7:16 AM\nJust Wow!\n\nThis is literally the best game I have on VR. When I was little I used to watch like 20 videos about this game so I pretty much know how to do everything. Now that I actually get to play it, it's even better than I imagined! Keep up the great work!\n\nHelpful | 2", "Llama.5539Feb 16 at 11:11 AM\nRead\n\nThis game is so good and you can do so much and once you get all the memorized then job bot comes its awesome and is a step up from job simelator so yes this a must buy but the only bad thing is that its a little pricy but worth it.\n\nHelpful | 0", "AristylesFeb 15 at 10:46 AM\nShocked\n\nWay more things to do than job simulator. I completed job simulator in 2 hours but this game Ive played for like 6 hours and not even close to finished. Recommended\n\nHelpful | 2", "lileagle01Feb 3 at 12:08 AM\nA million stars if I could\n\nHonestly, the price may look scary but hear me out! Obviously, it's just like a job simulator but with more to it, like a lot to it. If you ever dreamed of snacking on an infinite amount of berries, drink sun lotion by accident (because it looks like a beverage) then this game is all you need for VR fun! With way more snacks and toys to play with and eat compared to job sim, and a lot of activities. I feel like I've done a lot and thought I was close to beating it, but nope im only at 32% of the game completed, it's that much. So stop stalling and start INSTALLING!\n\nHelpful | 1", "WooLFiE6911Mar 14 at 12:01 AM\nPerfect\n\nIts fun, has endless mini games to play and the small Easter eggs from the developers are so fun.\n\nHelpful | 0", "iwanoculusJun 24 at 2:02 PM\nThe best game to start out with\n\nThis is the best game to start with its fun creative and kinda adventures\n\nHelpful | 0", "Devils_RejectsMar 25 at 6:35 AM\nKids just love it\n\nGreat follow up to job simulator\n\nHelpful | 0", "NCR_Ranger18Jan 29 at 2:45 AM\nIt's pretty great\n\nWay more content then Job Simulator which was also great. The charming characters definitely make you want to come back also you can interact with everything you can think of even things out of reach that you have to chuck things at. The price is a bit steep but I think it's worth it. :)\n\nHelpful | 2", "victor_321_Mar 22 at 7:04 PM\nPlay it\n\nIf you dont play this game youre dumb\n\nHelpful | 0", "bigfishhy2365Jun 27 at 2:59 AM\nVacation sim\n\nAmazing give it a go worth the price tag definitely\n\nHelpful | 0", "yourlocaleggDec 13 at 3:42 PM\nWorth it.\n\nThis game is incredible. I enjoyed Job Simulator alot and I have been waiting for this game to drop for a month and the wait was worth it. There is so much content and so much stuff to do and play. A few glitches here and there but nothing to severe. If you can but this game, I HIGHLY recommend it!\n\nHelpful | 24", "ViruZAngelMar 11 at 10:50 AM\nOk\n\nI have two things 1 way to long loading screens and 2 cant record on there i dont know IF this is software or hardware bug otherwise epic game\n\nHelpful | 0", "IGOR_THECREATORApr 2 at 5:46 AM\nNice game\n\nIt even has jacksepticeye in it\n\nHelpful | 0", "returntripMar 19 at 1:08 PM\nThis game is awesome!!!!!!!!!!\n\nI think this game is good for everyone, it's creative, fun and AWESOME!\n\nHelpful | 0", "XenodermusDec 21 at 3:03 PM\nI love vacationing over working!!!\n\nVacation Simulator was much more open and free unlike job simulator.\n\nThere was so much more to do like visiting the different locations and when moving around using the 'look where you want to go' mechanic.\nYou could explore way more than in job simulator and they even brought in the voices of some people you may know...... JackSepticeye *cough cough*\n\nHelpful | 6", "LukakooMar 14 at 6:29 PM\nlit\n\nWorth it its good trust me its good if you like job simulator you love it\n\nHelpful | 1", "BadWolf_M0dd3rApr 6 at 2:21 PM\nBug/Crash\n\nFirst I play I encountered a glitch and the second the app crash....but its a good game and for the price!\n\nHelpful | 0\nDeveloper ResponseMay 6 at 4:56 PM\n\nWe are sorry that you are encountering issues. Thank you for letting us know, and we are glad that you enjoy our game! Email us at owlchemysupport(at)google<dot>com so we can take a closer look at what you are experiencing.", "ThemanwithOculusFeb 27 at 1:06 AM\nSo many things to do!!\n\nIt surprised me that there is so much content they put in the game it was worth the 35 bucks I wouldve even paid 50 for it one of my favourite games\n\nHelpful | 0", "stoney67Jan 18 at 4:41 AM\nGreat game !\n\nGame looks great and has ran fine with so much to do. Im taking it very slow but might unlock all I can then go back and take my time because I just want to see everything. Only one problem Im having is I cant close the game. Every time I try to go to oculus home to hit quit the screen where you click quit is all scrambled. I have to reset the quest every time. Im assuming its a quest problem but if anyone knows whats going on or a fix for me I would appreciate it. It hasnt crashed or anything I just cant quit. I still recommend this game. Its probably just my bad luck. Lol\n\nHelpful | 5", "mining_dimondsJul 3 at 8:47 PM\nGood game\n\nIs good\n\nHelpful | 0", "ChancellorPalpsFeb 17 at 3:12 PM\nAmazing in every way.\n\nI recently wrote a review saying that it was great, but I couldn't get the ski helmet back. I was stupid. I restarted the quest and everything was back. This is one of the best games on the quest.\n\nHelpful | 0", "MagicKing1432Jan 26 at 12:38 AM\nAwesome Game!!\n\nThis is a great game ! Although i nearly broke my controller while playing it, but it is great! Worth the price too, but i was wondering for an update, if Owlchemy Inc. could add another location like a city or the moon. :)\n\nHelpful | 1", "landon.smith.1044186Jun 28 at 10:27 AM\n\nThis game is amazing!\n\nHelpful | 0", "JellyfishManiacMar 13 at 8:08 PM\nHANDS DOWN BEST VIRTUAL REALITY GAME\n\nLoL still finding new things! Play around see what u find!\n\nHelpful | 1", "tom.bacottiApr 8 at 6:46 PM\nIncredible but...\n\nThe game is absolutely fantastic, but there is a chance that it with completely crash your console ( I have an Oculus quest) , it is so bad that it is permanently stuck on the loading screen.\n\nHelpful | 1\nDeveloper ResponseMay 6 at 4:52 PM\n\nSorry to hear you're encountering issues! Thank you for letting us know. Shoot us a message at owlchemysupport<at>google[dot]com so we can get you back to your VACATION!", "BreenaBabyMar 18 at 9:58 PM\nWorth every single dang penny\n\nLove this series. Plz make more\n\nHelpful | 0", "LiexnecJan 18 at 12:30 PM\nDays worth of content!\n\nBeing serious, I read the reviews from this game saying there is a ton of content.. and at first was a little skeptical on how much there really was. I hate VR games that just end when you finish them, it really bugs me, especially when the game is $30. But Im serious, I spent probably about 6 hours of this game and Im not even 10% done with it. Theres just so much too do! You can customize your avatar in a suite room with a console and computer, there are three vacation spots, the beach, forest, and mountain, you can put items in a backpack, god theres just so much to do! Highly worth this purchase I wouldve paid more than $50 if Im being honest. Great job devs!\n\nHelpful | 3", "jwcruz0810Jun 4 at 5:40 PM\nPlease add some more puzzles\n\nI played through the game and when I finished I thought \"this game needs more levels or bonus puzzles(kinda like infinite overtime)\"\n\nHelpful | 0", "Skny_BoyyFeb 12 at 7:38 PM\nGreat But Be Aware Of This\n\nIts a great game overall but the only reason this doesnt have 5 stars is because when o purchased it I wasnt informed that I need a 6.5 x 6.5 foot area I had to open my door and put my hand out to do some things so be\naware but still a great game.\n\nHelpful | 2", "Goldenminecart4310Jun 17 at 12:29 PM\nPerfect.\n\nNot much to say here its just perfect. 10/10 must have VR game\n\nHelpful | 0", "PickleBJan 26 at 4:29 PM\nTHE GAME IS AMAZING BUT...\n\nI WISH i could give this game 10 stars! Everything is amazing except the fact that my game keeps glitching and crashing. I play on Oculus Quest. Idk if its the quest or the game, maybe you should check it out.\n\nHelpful | 2\nDeveloper ResponseFeb 25 at 10:41 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "yiliazJun 22 at 10:21 AM\ngreat\n\nGirls would love it! Great interaction!\n\nHelpful | 0", "Freakshow-EMar 15 at 1:57 PM\nAMAZING \n\nThe best vr game I have ever played.\n\nHelpful | 0", "nmbrsnltrsMar 16 at 10:13 AM\nNice Game\n\nPerfect sequel to Job Simulator\n\nHelpful | 1", "granger5Mar 26 at 2:29 PM\nAmazing\n\nBest VR game Ive ever played!!!!!\n\nHelpful | 0", "KeithTheEditorJan 6 at 9:05 AM\nAm I missing something?\n\nPeople talk about there being \"so much to do\". . its litterally the same five activities just different themed. Catch a butterfly/moth/bird. Make a castle/ice sculpture/carving. Make a hamburger/fish sandwich/hotdog. Over and over. Just in a different land. Where's the variety?\n\nHelpful | 24", "LuckyMaster100Jun 22 at 4:33 PM\nSuper good\n\nI love every bit of it\n\nHelpful | 0", "E2_ERROR12Feb 11 at 3:49 PM\nGREAT GAME BUT\n\nBelieve me this game is so fun and I love it so much but its kind of short on what to discover it would be so much better if there was more locations or new areas to go into\n\nHelpful | 1", "PigfordFamilyMar 13 at 1:24 PM\nAmazing\n\nSo much fun to play and watch\n\nHelpful | 0", "dom2611Mar 8 at 7:46 AM\nVacation simulator Rocks\n\nGreat game lots of fun just like job simulator!\n\nHelpful | 1", "XxXBLOODTHIRSTYMar 7 at 10:08 PM\nFun\n\nGreat time killer and just overall funny and fun game\n\nHelpful | 0", "SkinlessPotatoDanMay 22 at 7:29 PM\nGood game, just 2 flaws.\n\nI bought this game because I absolutely adored job simulator and thought this would be a good sequel. It was, and it exceeded my expectations. I love the atmosphere and theres just so much to do! I especially like the food order activity because its a nice throwback to the gourmet chef job in Job Simulator. Theres just one problem. The sandcastle and ice picking activities are so much more difficult than they need to be. The instructions are very vague and even the basic ones can be impossible to newcomers including myself.\n\nHelpful | 0", "teledorktronicsMar 14 at 8:00 AM\nQuest needs more games like this\n\nYoungins love it\n\nHelpful | 0", "DrakonOQFeb 22 at 6:08 PM\nBest game for the Oculus Quest yet!\n\nIt has so much more to it than job simulator. You can move and the are so many more places to go.\n\nHelpful | 2", "Realpersonthe2ndFeb 28 at 1:57 PM\nOne of my favorite games. Worth it\n\nIf you like job simulator you will like vacation simulator. I recommend this to anyone\n\nHelpful | 0", "djmorleyJan 1 at 2:28 PM\nWow\n\nIf you love job simulator in there is no doubt in my mind that you're gonna absolutely love vacation simulator this is by far better with a whole lot more things to do. Job simulator is still an amazing game but when you jump into this this you'll be blown away. If you have kids in your family they are going to love this game.\n\nHelpful | 2", "WalkingCreepFeb 15 at 4:29 AM\nPretty Fun\n\nThe game is great so far, I havent figured out how to turn around in the game and the moving system is a bit iffy but Im down with it. \n\nHelpful | 0", "HappySliceMay 27 at 8:13 AM\nIce Carving is the best\n\nA lot to do in this game! I like the ice carving and sand castles the best. Can sit on the floor and do most stuff. Very comfortable!\n\nHelpful | 0", "SyecakeMar 1 at 7:49 PM\nOmg it is great\n\nI really like the game I he's job simulator and I decided I liked it alot\n\nHelpful | 0", "jenneeburkeJan 9 at 11:37 AM\nWorth Every Penny!\n\nI enjoyed Job Simulator, so I figured I'd give this a shot after reading the reviews. It is worth every penny! The thing I dislike about VR games is that they are usually over pretty quickly without much content. This game has HOURS of playtime content. You won't ben disappointed !\n\nHelpful | 5", "Chewbacca33Jun 24 at 7:39 PM\nAdd infinate relaxation\n\nBoth Job simulator and Vacation simulator are very fun games but Vacation does not have its own version of infinite overtime\n\nHelpful | 0", "blister90Mar 3 at 9:25 PM\nFrustrating!\n\nThis game needs an update or something soon. We are constantly having to reboot it because it freezes up. Must be a bug in the system. Very frustrating and I cant get a refund! \n\nHelpful | 6\nDeveloper ResponseMay 4 at 12:10 PM\n\nSorry to hear youre encountering issues! Were happy to help you get back to VACATION! Shoot us a message at owlchemysupport(at)google<dot>com!", "DragveonJun 20 at 2:08 PM\nNuff said\n\nNuff said\n\nHelpful | 0", "millstash122Mar 5 at 8:15 PM\nMy favorite game\n\nI loved job simulator and this was even better.\n\nHelpful | 0", "ChariioFeb 22 at 2:44 PM\nVery fun!\n\nAfter a really good experience with Job simulator, this game expands and made it even better :)\n\nHelpful | 1", "MaxGamerBoss27May 17 at 11:00 AM\nAWESOME GAME!\n\nI finished the hole game in 2 days but the fun thing is that when you are finish the game you can still restart or you can keep playing the game and still having a lot of fun.\n\nHelpful | 0", "BananaPoet14May 25 at 11:33 PM\nBUY THIS GAME!\n\nThis game is so much fun! You can spend hours on this game. I prefer it over Job Simulator- there seems to be so much more to do!\n\nHelpful | 0", "Zach-SchoenfeldMar 3 at 4:26 PM\nI love this game!!!\n\nSo much better than job simulator! Very entertaining!\n\nHelpful | 0", "Themuffinman7Feb 8 at 5:47 AM\nReally fast loading time\n\nFor a game this big it loads instantly. You can be playing and not realize it had been 5 hours becuae of the fun you are having in this virtual vacation\n\nHelpful | 2", "Benclan000Feb 6 at 10:20 PM\nSo much better than job simulator!\n\nThis game is so fun!!! As soon as it came out, I got it. I recommend this game because it has so much to do! I love the concept of the game. Each quest is new and intriguing. BUY IT!\n\nHelpful | 0", "Mr.SanboJan 1 at 4:36 PM\nAmazing!\n\nThis game was by far my favorite vr experience I loved the atmosphere, gameplay, and the surplus of content! Seriously I spent my first 3 hours just in the starting area! I one hundred percent recommend the purchase, but to the developers, Please add an infinite overtime mode for cooking! The cooking is so much fun and it would be great to have an infinite mode.\n\nHelpful | 6", "TheLastAngelusFeb 6 at 1:37 PM\nLove and hate it\n\nI love the game a lot but it has its problems here and there of course. It takes me so long to find things in the area which is quite frustrating so I end up having to search up where it is. I hate having to do that considering it shouldnt be infuriating to play. Rather play blind then have to watch someone show me where it is.\n\nHelpful | 1", "WX-78Feb 29 at 9:46 PM\nIt good\n\nI dont have to say anything else its all up there^\n\nHelpful | 0", "PopularGamesMay 29 at 10:49 AM\nVery Fun and Relaxing\n\nJust like Job Simulator, except there is way more stuff to do. Really fun and sometimes challenging.\n\nHelpful | 0", "lec0422Jan 23 at 12:08 PM\nFun as heck\n\nThis game makes it seem like your on vacation. There's lots of stuff to do and things to break or build. Find the abominable snow bot was interesting. I would recommend reading the many books they give you as clues on how to find him.\n\nHelpful | 0", "JMDATUBEFeb 1 at 11:32 AM\nGreat sequel \n\nIts a sequel to job simulator if u liked job simulator the I would recommend it to u but I would say get job simulator first and complete it then get vacation simulator \n\nHelpful | 0", "Cajun_PilotJan 28 at 10:57 PM\nGreat Game for kids\n\nI bought this game for my granddaughter. She loves it. Ive never played it so I couldnt teach her how but I didnt need to. She figured it all out. She enjoys playing it when she comes over.\n\nHelpful | 0", "kyelee.kicklighterMay 31 at 8:56 AM\nIt is awesome!!! Worth the money!\n\nI didnt think I would like it but... I LOVE ITTTT!!!!!! Highly recommended\n\nHelpful | 0", "YeetboyggJun 6 at 6:36 PM\nAmazing\n\nThis is not a fake review it was really good\n\nHelpful | 0", "dcamardaMay 15 at 7:21 PM\nYes\n\nGood game I havent done much yet but I am loving it I have only seen the beach so far but I cant wait to see what the forest and mountain paths hold\n\nHelpful | 0", "DronePilotP4Jan 8 at 12:32 AM\nRound 2 - After job simulator.\n\nThe job simulator was my first purchase when I received the VR GOGGLES QUEST and I'm glad I made that choice.\n What fun this is and it gets you hooked, there's plenty to do to keep you entertained and I found I kept picking up the headset daily and going back to the fun.\n I can't fault this game or it's predecessor, brilliant graphics, sound, entertainment.\n Recommended for sure......\n\nHelpful | 1", "Kuriatko1Feb 7 at 12:37 PM\nVery good game!!!\n\nI think that actually 'Job simulator' Is alot of space and is very cool But 'Vacation simulator' takes a bit of space and is very amazing!!! :3\n\nHelpful | 0", "mysimlifeMar 1 at 9:32 PM\nAmazing\n\nAmazing no questions asked\n\nHelpful | 0", "sammcfaddenDec 25 at 1:08 PM\nVacation Sim is better than the first!\n\nVacation simulator is the long awaited sequel to the first Simulator game called Job simulator. Now you might be thinking while vacation sounds fun isn't 30$ pricey compared to jJb Simulator well if you want to compare the content of both games then no Vacation Simulator has so much more than job Simulator you can move to to three different locations that are way bigger than job Simulators and you have a vacation home that is bigger than job sims chef area office area and gas station area combined if your counting the areas you can move in. It has way more content like rock climbing playing many different sports on the beach and building sand castles and ice castles this games is so much better than job Simulator Final rating 4.8/5\n\nHelpful | 6", "george.e.sentenoMar 2 at 11:12 AM\nI EMOTION vacation simulator\n\nIts really FUN!\n\nHelpful | 0", "SamaritanManDec 31 at 10:26 PM\nGreat vr experience, but the locomotion?\n\nIt's a great vr experience, but it's a really strange thing that on a Quest, the free locomotion is not supported.\nIt would have been enough to add the locomotion with one of the two thumbsticks and the game would have been perfect.\nEven in a not small environment like the one I use, I have some problem getting into one of the initial paths of the game.\nIf a game already has all the animation management and vr texture movement, the work to add thumbstick locomotion is very small, so I would have given 5 stars, but for this banality I am forced to give only 3 stars.\nIn Job Simulator, that was and old vr game and the vr space movement was limited to small independent scenarios, it was much more acceptable, but this is no longer valid for a game born for a 6dof untethered device such as the Quest and that involves many shifts between the various game scenarios.\nAny Quest game, to be a good one, should allow total smoothness of movement and above all, it should not oblige the player to look for an hangar to have a satisfactory experience of the game itself.\nIt's a shame, but I'm ready to change my evaluation as soon as this aspect is fixed.\n\nHelpful | 12", "Dishsoap33Jan 3 at 2:13 PM\nJust what Id expect from the sequel\n\nI loved job simulator, and I love this too. When I first got the game I thought, its probably not even close to as good as job simulator but boy was I wrong. You can move around freely and there is a ton of gameplay. They even have a tv in your room that you can play other games on! Overall I loved it you can swim, peak mountains, or camp out and hear ghosts stories while chowing down on a snore!\n\nHelpful | 1", "kattykatprescottFeb 11 at 6:44 PM\nAmazing game... just one draw back\n\nIt's an amazing sequel and plays perfectly, but the teleport mechanic makes me motion sick and nauseous, otherwise great game\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:52 AM\n\nOh no! The teleport should not make you motion sick. If this is still happening could you email us at owlchemysupport<at>google[dot]com?", "OtherCannonJan 3 at 6:44 PM\nGreat game, Had some bugs\n\nI've really enjoyed this game so far and have spent a lot of time on it. However, I have encountered two very important bugs:\n1. In the Mountain section, when I took a photo of Snow-bot, with the telephoto lens and without the telephoto lens, the shopkeeper would not accept my photo and always said the Snow-bot wasn't in it, despite the fact it obviously was.\n2. Also in the mountain section, The bot by the rock climbing game did not give me the memories. Despite the sound playing when I hit the goal, the bot wouldn't talk to me.\n3. In the beach section at the burger area, when you have to deliver a marshmallow and chocolate burger to Photo Bot 2, the photo is of Photo Bot 1\nOther than these bugs, this has been a great game, but I would like to see them fixed.\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:43 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "Zomanassar1980Feb 21 at 6:55 PM\nAmazing\n\nProbably best game Ive played on the Oculus Quest\n\nHelpful | 1", "rubixlinxer1306Feb 23 at 11:42 PM\nGood game\n\nJob sim was ok but this is amazing\n\nHelpful | 1", "DinoCakeJan 26 at 5:07 AM\nFun but shuts down\n\nIt's fun but when I put in my passport it's a black screen and it never loads. But sometimes it works and loads. Please help -_- edit: I found out it's just person one. Everyone else works.\n\nHelpful | 0\nDeveloper ResponseFeb 25 at 10:41 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "DargoTheGreatJun 24 at 7:52 AM\nPretty good\n\nI personally think job simulator is better but its a solid game\n\nHelpful | 0", "dankoliciousFeb 15 at 11:21 PM\nYes\n\nIt is great and I a good little adventure. It is fun he. Your cooking and chilling in your hotel suite.\n\nHelpful | 0", "beachteen1Feb 17 at 11:12 AM\nThis game is great!!\n\nLove it! Everything about it is awesome! No problems or complaints!\n\nHelpful | 1", "PusulikiDec 22 at 2:13 AM\nBetter than Job Simulator by far\n\nLove the Job Simulator and now this one even more. Was afraid it won't live up to my high hopes, but man it does... The Quest and what devolopers do with it is amazing.\n\nWhat makes Vacation Simulator so powerful is the way it offers so many different things for players to do  so many more than the original  while ensuring that players are almost never lost and practically never uncomfortable.\n\n3 worlds to explore with such an amazing scale of tasks to do, photos to take and friends to make. I just lived the whole Quest battery load in it (2 hours) and it truly felt like an exciting trip.\n\n-Top immersion and tracking\n-Full of fun, humor and fantasy\n-So much creativity\n-Even when you did everything, there still is so much more there\n\nGet lost in it and just have an awesome time, while chuckling and laughing a lot.\n\nHelpful | 12", "ochojakersFeb 29 at 10:42 PM\nInsane\n\nGood game\n\nHelpful | 0", "Zack_GalacticFeb 14 at 9:33 PM\nThis is epic game\n\nThis game is AMAZING it is filled with mission and you can do your own thing if you want.\n\nHelpful | 0", "VinceJinJan 6 at 6:39 AM\nAwesome!\n\nVacation simulator is masterpiece! Full of thing to do and very funny. The only thing that I don't like is that the bag pack is too small and I have to come back home a lot of time to \"save stuff\". Also the space at home is not enough for all the stuff that you could collect in game\n\nHelpful | 0", "supersj99Feb 18 at 2:26 PM\nVacation simulation\n\nIt is so nice and lovely this was my daughter birthday present\n\nHelpful | 1", "alex._.-Dec 31 at 1:04 PM\nSo Many Things To Do Definitely Worth It\n\nOne thing that some people said about Job Simulator is once you finish the jobs it can start to get boring due to the 4 jobs and a few setting options.\n\nBut Vacation Simulator has 3 vacation areas to explore and do so many things! I love the aspect of doing activities in the 3 spots and earning memories that can be used to unlock more things.\n\nThe areas are fun and awesome but something that I think was an amazing detail was the suite you stay in. In Job Simulator you are referred as Human, which is the same in this game, but you could only see your hands and such, but in Vacation Simulator you can have hair, glasses, facial hair, and there are a lot of accessories like hats, glasses, gloves, and a few other things.\n\nThe rooms the suite has have a lot of fun and new features that some of us dont even think of!\n\nThis review is a bit lengthy but I just wanted to let other people know how cool this game is and its definitely worth the buy.\n\nHelpful | 1", "CoatedSeven8Jan 30 at 8:47 PM\nThis game rocks\n\nI ALWAYS LOVED JOB SIMULATOR, BUT YOU CAN DO MORE IN THIS GAME!! I HIGHLY RECOMMEND PURCHASING THIS GAME IF YOU WANT TO SIMULATE YOUR CARTOONY DREAMS\n\nHelpful | 1", "tman6000Apr 8 at 7:30 AM\n\nIts not as cool as the cover its stressing not comfortable\n\nHelpful | 0", "chantingpeachJan 16 at 9:23 PM\nGreat game\n\nIt is unusual for a sequel to be better then the original but this game is amazing. There is so much more to do and more opportunities on explore. I definitely would recommend to get this game for any age level! 5/5\n\nHelpful | 1", "leaper1981Dec 23 at 2:06 AM\n\nWell yet again these titles never fail to deliver. Great fun especially for younger players. It retains all the humour & fun of the previous titles & is probably my favourite of the 3. Only thing I would like as an option is the ability to move with thumb sticks & turning. Other than that its VR perfection.\n\nHelpful | 4", "SlothWick1May 21 at 6:34 PM\nGood game, bad glitch\n\nOkay so I got this game and I liked it but the second time I started it, it was bad to say the least so I went to human 1 started and repeat of beep beep beep I was stuck with that until it died which is disappointing\n\nHelpful | 0", "JMD123_Jan 18 at 6:39 AM\nThis game is A ton of fun\n\nI played job simulator and had so much fun. And this is just like it. I love the story of getting memorys. And all the bots are unique and I love that. I had so much fun with this game\n\nHelpful | 2", "Rangernash61Feb 1 at 9:27 AM\nTHE BEST GAME EVER!!!\n\nI thought job sim was the best game ever and that its so involved but then they came out with an even better and more involved game\n\nHelpful | 0", "Wyatt46xFeb 16 at 1:38 PM\nLove it\n\nI plated it so much I lost track of time and was sweating\n\nHelpful | 0", "Lizarddude10Dec 27 at 6:44 PM\nFantastical Game\n\nThis is one of the best games I have played in vr! The graphics and hand motions to get robots attention is great!I also love how you can have a customizable avatar. That is a great feature, because of the lack of it in job simulator. With all that is said, I think that there should be more areas like a cruise or something. But, vacation simulator is a great game!!!\n\nHelpful | 1", "Bubbles3766Dec 30 at 5:27 AM\nSo much content\n\nI watched videos on f this game being played and the puzzles being solved but I wasnt board when I was playing unlike how I felt when I played job simulator. Also there are so many ways to solve the puzzles, and a lot of the games include being creative and solving them in interesting ways. Finally it has a great story line.\n\nHelpful | 2", "zekeymanDec 21 at 8:03 PM\nPerfection\n\nWhatever your doing with these games, keep it up. I mean it sounds kind of goofy. But it just is a game thats meant for vr. Its not as relaxing as job simulator (ironically). But its way more of a game. You actually have a motive and you have to try more. So if I just wanna goof around, Im going job. But any other day Im going vacation sim. Heck just buy them both there both the best\n\nHelpful | 6", "Locomotive23Jan 31 at 1:01 PM\nGreat Game\n\nI got this game to introduce my mom into the world of VR and she loves it. It is a great family game or a fun game to play by yourself.\n\nHelpful | 0", "ViviGamerPookDec 25 at 9:49 PM\nLove it.\n\nIn game, my daughter closed the fridge door twice (because it bounced back open the first time), brushed her teeth (and put the cap back on the tube), bathed (though she did drop the whole bottle of bubbles into the tub, like normal), and put herself to bed. And she had fun the whole time. It was infuriating TBH. But we had a blast together after I figured out how to hack my PC into displaying the video feed wirelessly on my laptop. Should be stock available. Oh, that's a Quest review, sorry. This game is awesome to share. But hard to share on Quest.\n\nHelpful | 2", "whymemelordFeb 26 at 6:16 PM\nGood\n\nGood\n\nHelpful | 0", "stephen.craig.75098Feb 3 at 6:15 PM\nWorlds best game\n\nI see you tubers play this and when I play it it is so different and I love it I love it I love it I love it !!!!!!!!!!\n\nHelpful | 0", "TrevorP100May 24 at 11:06 AM\n\nI love this game and I like that you can teleport. 5 starts\n\nHelpful | 0", "Yobro04Jan 6 at 10:04 AM\n\nThis game made my day the graphics are awsomme and the game is perfect and the price is maybe a little high but stil its high quality I think it should have been like 25$ or 20$ but its realy realy polished you deserve nothing but my respect to this game\nUPDATE this game is worth 30 $ I played trough it all and there is so much content if you have 30 memories the robots do a party for you and that made my day also devs I wish you would make more games like this maybe a school simulator because I need more also pls add a desert location on vacation island and also a jungle and water park if you add those 3 locations this would be so game changing for the game pls do it it would be so so so BOTastic and I dont mind if you increase the price with 10$ if you add those 3 locations\n\nHelpful | 6", "TheMightyMonkeyMageJan 2 at 1:04 PM\nJust as good as Job Simulator!\n\nIts very fun and has the same physics. I love how I get to listen to less mono toned voices and not the same voices all the time. Highly recommended and a very good game. Hope theres another sequel! Because I cant get enough of Job Simulator and Vacation Simulator!\n\nHelpful | 0", "I_NeedHELPMar 8 at 10:36 AM\nKool\n\nCool but a little slow to start and messes up sometimes but I still love it!\n\nHelpful | 0", "blank_75May 9 at 12:47 AM\n\nI would 100% rate the games it some much fun and but I would like it even more if they add like a dlc pack with more locations\n\nHelpful | 0", "mmead3May 28 at 8:47 PM\nWay more than the first\n\nWay more to it than the first.\n\nHelpful | 0", "clintlandonDec 23 at 2:40 PM\nLike Your Own Personal Amusement Park!\n\nI bought this for a friends kid. I figured I should play it enough to help him if he had trouble figuring anything out.\n\nI ended up having such a great time with all of the various activities Ive gotten through most of the Beach region and and so excited to do the rest.\n\nIf you liked Job Simulator but got burnt out on the formula, this game is way more freeform in a way that keeps it fun because you can wander around and do whatever interests you at that moment.\n\nHelpful | 4", "xiphidMar 12 at 12:09 PM\nLove it\n\nPlay it ,role play do everything you wanted to do all it needs is some multiplayer..SIMP\n\nHelpful | 0", "jamesbarclayhJan 28 at 8:03 PM\nWow \n\nThis game is seriously so fun I cant stop playing it and its probably the best game that I purchased for the quest so far 27/10\n\nHelpful | 0", "questloverDec 20 at 3:47 AM\nABSOLUTE BEST GAME ON QUEST!!!\n\nnow, I a absolutely loved owlchemys previous game, job simulator, but this, vacation simulator, I ADORE IT! there is so much stuff to do, I have been playing this game for about half an hour and there's so much stuff that I haven't even left my suite yet and I'm already hooked, there is nothing bad about this game, it's just absolutely brilliant. Well done owlchemy\n\nHelpful | 3", "GabrielartgJan 18 at 3:46 PM\nAmazing\n\nI love it and my kids love it too, I can spend hours on it without getting tired. It's amazing! There are so many things to do, and the fact that you can move around easily is great!\n\nHelpful | 0", "AviPrimo11Jan 11 at 12:19 PM\nAmazing\n\nThis is awesome its just like Job Simulator but you have a a lot more options compared to Job simulator and it introduces new features like the memories,suite, and the coins this game is a must have\n\nHelpful | 1", "secretNASA10Feb 5 at 11:56 AM\nBest [relaxing]game Ive played\n\n10 out of 10 must buy if you want if you have motion sickness you will be fine like me\n\nHelpful | 0", "benparker394Mar 31 at 1:03 PM\nBeautiful graphics and truly immersive\n\nI played the first game on the PSVR and can I just say this is a massive step up with a huge amount of variety and things to do across all worlds it Is truly amazing the sheer scope this game has... id recomend this to everybody who has a quest despite the bigger price tag it is defiently worth it\n\nHelpful | 0", "GUNSANDBUTTAFeb 5 at 4:40 PM\nThe best vacation game to relax\n\nMountain,forest,beach three good vacation places to relax \n\nHelpful | 1", "acethebaseMay 19 at 6:24 PM\nReally fun game but...\n\nThis game is really fun on quest. The only problem I have with it is that it crashes a whole bunch and glitches. If you were a fan of job simulator I suggest getting this game but expect crashes every 30 minutes to an hour. Its a great game if you put the chess Hong and glitches to the side\n\nHelpful | 0\nDeveloper ResponseMay 20 at 2:41 PM\n\nWe are glad that you enjoy our game, but we are sorry that you are encountering issues! Thank you for letting us know. Email us at owlchemysupport@google.com so we can take a closer look at what you are experiencing.", "teziFeb 4 at 8:23 AM\nI love this\n\nAlmost feels like a real vacation. Really enjoying all the different activities\n\nHelpful | 0", "What2232Feb 13 at 12:28 PM\nGreat game\n\nThis game is sooooo fun\n\nHelpful | 1", "Unknown_Kid0Dec 12 at 10:26 AM\nvery good game. continue the good work\n\nI enjoyed job simulator and now vaction simulator is very funny. The game runs very smoothly and didn't have any major problem's. Now i'm waiting for Rick and Morty VR.\n\nHelpful | 20", "UnitaceMay 6 at 4:41 PM\nAmazing hame\n\nMy first time playing it was a amazing vacation experience still havent completed it tho but still anazing\n\nHelpful | 0", "ShortStuffPlaysDec 29 at 6:53 AM\nSuper immersive\n\nThis is one of the only games I've purchased, and though I thought it might end up pretty lame looking and feeling, this completely surprised me. It's super immersive, and the way the haptic feedback is used UoU perfection. I highly recommend this!\n\nHelpful | 1", "Fantasmic2019Dec 12 at 12:52 PM\nGraphics\n\nI have this on PSVR and loved it. The only downside was the graphics. You couldnt tell what some of the objects were. Now, on the Quest, the graphics are much clearer and I can make out all of the objects (so far) so I can get my memories.\n\nHelpful | 10", "Wi11b1azeFeb 10 at 2:48 PM\nAwesome!\n\nWorth the money! Hours of entertainment!\n\nHelpful | 0", "Jasekopi9Dec 12 at 7:25 PM\nGreat game....\n\nI love this game soooooo much and its even better then job simulator I LOVE IT!!!....but it crashes soooooo much for me personally... and just now it crashed and I lost my entire save data and went from 40% completion back to square one. I enjoy this so much to where Im going to keep playing to get back to the point I was originally, but May I ask at least to make updates to try and fix possible bugs and possible crashes. Thanks!!! Keep up the good work!\n\nHelpful | 4\nDeveloper ResponseFeb 25 at 10:46 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "superyeetmanMay 21 at 9:58 PM\nPerfect\n\nJust perfect no other words\n\nHelpful | 1", "SoccerIsFunFeb 1 at 9:44 AM\nBest game ever\n\nTheres 3 different vacations then once you get 5 memories you unlock something\n\nHelpful | 0", "Robbin12392Jan 13 at 10:17 AM\nAmazing\n\nThis is the first \"Simulator\" game I've played, and it's really amazing! I love the humor in it. It's easy to understand and there is a lot of content! Really great!\n\nHelpful | 1", "Lightning7574May 21 at 4:45 PM\nExtremely fun\n\nThis game is very fun.\n\nHelpful | 0", "Ant217acDec 31 at 5:52 AM\nAmazing\n\nIt was very fun and even like the little details they added like splashing in water, seeing yourself in the mirror and many more are just amazing.\n\n\nThe ending after you get all the memories surprised me so much and I was filled with joy\n\nHelpful | 0", "DigitalSnowballJan 18 at 6:47 PM\n\nIf I could give it a million stars, I would! The colors are so vibrant and happy that leaving the game made everything in the real world feel dull\n\nHelpful | 0", "emil.laushDec 13 at 7:48 AM\nOne of best apps\n\nGraphics awesome!!!\nITS ONE OF BEST GAMES IN OCOLUS RIFT.\nI liked job simulater and now vacation simulater.\nIt very funny it should have 5 stars! You need only 0.1 I believe in you creators of vacation simulater!!!\nYou can do it!\n\nHelpful | 10", "andrewstroboDec 14 at 2:23 AM\nThis truly is amazing!\n\nI was a little disappointed it was $30 dollars but I was shocked to find just how much there is to do this time around. There is plenty of content here worth the price of admission. Happy vacationing!\n\nHelpful | 3", "jonhathanJan 14 at 5:27 PM\n\nI rate it a four star it is a great game but when i was taking photos for a memory the game showed a black glichy thing it covered most of the screen it only happen when in the game not when loiding in between major teleports i did not had anything on my face when it started\n\nHelpful | 2\nDeveloper ResponseFeb 25 at 10:42 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "mikerandrupFeb 10 at 7:42 PM\nDid not enjoy optimal relaxation\n\nLong initial loading times: I didnt buy this game and strap a hot screen to my face just to stare at your static logo. A long one to get to initial menu scene, fine. An even longer one to get into game after selecting save file? Bogus. Make a quicker save file selection scene or something along those lines please.\n\nUnskippable robot NPC intros: Dont freeze my teleporting while digital windbags erode my enthusiasm. Maybe this is an opportunity to slip in some loading??\n\nAnnoying mechanics: Backpack full? Really? Just trying to stash some coins the second time I ever played it\n\nSpecial button to teleport, even in location hubs with no other interactions? Too easy to forget special button during early sessions. Keep it simple.\n\nEnded both sessions in annoyance at mechanics and above. Not even slightly as delightful as Job Simulator was.\n\nI absolutely can not hand my Quest over to as many people with this title as I easily have with Job Simulator. The Quest is more accessible than ever, and yet you seem to be sequeling your way out of those new users entirely. This is not a wonderfully accessible VR title to be out there with as the market keeps expanding. Maybe thats by design and this is the upgrade product? Dont like as much, sorry\n\nHelpful | 1", "GoldenHusky263Dec 13 at 9:20 AM\nJACKABOY\n\nSo this game I have been waiting for 2 months and it was so worth the wait I pre ordered it when I first saw it when I played I went to the beach best place ever then I went to the mountains I saw jacksepticeye I did not think a popular YouTuber would be in a great game like this you can also play games and watch tv in you apartment it is so much FUN\n\nHelpful | 2", "yt_blurJan 22 at 2:33 PM\nAmazingly hilarious\n\nJust like job simulator and definitely worth the price. This game has wider range of features great for people new to be\n\nHelpful | 0", "MunchyDumplingDec 13 at 4:49 AM\nThis game is awesome\n\nWhen I got this game I thought it would be like job simulator and you only have four options but no,instead of having four limited options you have a whole vacation wonderland of things fun things to do! This is a fun game that is relaxing to play after an bad school day or a hard day of WORK. :)\n\nHelpful | 2", "Noah_2019Feb 2 at 1:59 PM\nVacation simulator\n\nIt is a great game so fun and you should definitely get it ?\n\nHelpful | 0", "SlipperySliimeDec 27 at 8:33 AM\nThis game rocks!!!!\n\nThis game is a major step up from there very entertaining game job simulator with was also great and all but there new game vacation simulator has so much to do and is such a big map and it gives you so many options I really recommend this game!\n\nHelpful | 0", "Supercharger6000Dec 26 at 9:08 AM\nLots of fun, also challenging.\n\nI have seen YouTube gameplays of this game a lot and Ive had a lot of fun playing it myself. I just started on Christmas, and it can be a bit challenging at first. But, youll get the hang of it eventually. You definitely should give this a go!\n\nHelpful | 0", "hummus-Jan 23 at 12:59 PM\ngreat game\n\ntheres a lot to do, you can interact with basically everything you can see around you. well done game, worth the money\n\nHelpful | 0", "AshleymationsJan 2 at 4:13 PM\ngame is amazing\n\never since i first went round my friends house to first play job simulator, ive always wanted to try this. the game is beautiful, fun and you wont get bored. theres so much to do in the game.\n\nHelpful | 1", "HardcoreHarlowJan 2 at 8:10 PM\nVery Well Done, like My Hot Dogs\n\nThis is a very well put together game. Very interactive environment and super cute. There is a lot of playtime here. If you are a fan of Job Simulator, go ahead and grab this title. If you have children borrowing your headset, this one is sure to please. 4 out of 5 stars, an excellent game.\n\nHelpful | 5", "Swamp_rocket97Dec 12 at 12:10 PM\nAwesome!\n\nVacation simulator is very nice! I love it! It does have a bug that Glitches your Selection screen on the oculus home but its the best game by Owlchemy since job sim! I think you should get this if you like a little comedy and job simulator! So much to do!\n\nHelpful | 7", "magicismight92Dec 12 at 6:11 PM\nGreat Game to Demo the Quesf\n\nLoved Job Sim, but Vacation Sim has a lot more to do. More zones and activities. Will be using this game to demo the impressiveness of the Quest and VR in general to relatives at Christmas. Love the humor, the variety of things you can do, and the responsiveness of the tracking.\n\nHelpful | 3", "HappyToast405Jan 18 at 9:49 AM\nGood\n\nGood\n\nHelpful | 3", "FirefoxBatmanJan 18 at 12:13 AM\nAmazing\n\nNever played job simulator but looking at other reviews I think job simulator will be the same (amazing,fun,cool)\n\nHelpful | 1", "FriedDumpsterDec 28 at 2:54 AM\nGreat sequel with lots of content\n\nI really liked Job simulator, but it wasnt a game i returned to much after beating it. Although i havent beaten vacation simulator yet, i already know there is way more content in this game, and i would 100% recommend it\n\nHelpful | 0", "KawaiiGirl_131Jan 18 at 6:54 AM\nBest game!\n\nYou guys should really by it! Its so cool I love the room you get too! You guys will love it!\n\nHelpful | 2", "blestash2704May 16 at 9:29 AM\nGood\n\nVery good worth it\n\nHelpful | 0", "ColzzFeb 7 at 1:11 PM\n\n\nIt good\n\nHelpful | 1", "Daniele_LapienyteJan 9 at 8:45 AM\nDa best game ever!\n\nI love it so much that I cant stop playing but my mum doesnt let so that long I still love the game and can you please do a gaming simulator I would love it\n\nHelpful | 0", "stream1412May 11 at 7:53 AM\n\nWish it would have a bit more stuff to do\n\nHelpful | 0", "BaileyBunchJan 24 at 8:24 AM\nKid love it!\n\nThis is the game my kids play 90% of the time. Great variety of activities.\n\nHelpful | 1", "FestivoFeb 15 at 4:10 PM\n\nFun game. But it crashes from time to time, the screen would go black and you have to hard reset the quest.\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:50 AM\n\nGlad to hear you love the game! Sorry to hear you're having issues. Could you send us an email at owlchemysupport<at>google[dot]com?", "RogueCeeday58Jan 28 at 7:09 PM\nvacation simulator\n\nbest game i have ever played...And it is just like job simulator\n\nHelpful | 0", "PokemonMaster5BJan 7 at 5:58 PM\nGame Crashes When Exiting.\n\nI really like this game like I loved Job Simulator. I get lost doing everything in the hotel because there is so much to do. However, when I try to leave the game. The Quest crashes when I try to leave. It goes black and I can't do anything. I just have to wait and hope it doesn't break my quest.\n\nHelpful | 0\nDeveloper ResponseFeb 25 at 10:42 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "BoopDoop_123Dec 16 at 11:21 AM\nI got it today and Im in love\n\nAfter seeing countless great reviews and some people playing it, I decided it was for me. Ive only been playing for about 20 minutes and havent really even started yet. Im only in the tutorial. Im already enjoying it a lot, and I cant wait for more\n\nHelpful | 1", "Loudini12Jan 13 at 3:55 PM\nSo much to do\n\nIs there even a end to this game?? This game is soo fun as theres many activities with lots to do. Great replay ability.\n\nHelpful | 1", "Emily2725Jan 2 at 11:25 AM\nA lot of fun!\n\nI find this game sooo much fun, what makes it cool is that there are different things to do in order to get 100% out of the game! My mother even played it for an hour!\n\nHelpful | 2", "Glitchy09Jan 30 at 6:21 PM\nVery addictive\n\nThis game is so addicting I can't stop playing\n\nHelpful | 0", "OhBill193Jan 7 at 10:19 AM\nAmazing\n\nIt has so much more to do than job simulator it is not even as easy to beat it has so much to do and is really fun I like the way they set it up really well!!!\n\nHelpful | 0", "cheesecake59Feb 1 at 1:02 PM\nGreat game\n\nSooo much fun and is a great buy\n\nHelpful | 0", "LegitPanda81Jan 14 at 7:53 AM\nIncredible\n\nI could spend endless hours playing this game. So much more immersive than Job Simulator and so much more to do!\n\nHelpful | 1", "Jk_DubsJan 5 at 3:05 PM\nFantastic\n\nIts just like job simulator and thats a great thing but they add so much its longer,you can move in the game and there more unique things. Highly recommended\n\nHelpful | 0", "sam.foot.771Jan 10 at 1:15 PM\nGreat\n\nI love this game soo much, jacksepticeye is in it as well which is a bonus, bigger and better than job simulator, can't wait to play more.\n\nHelpful | 0", "Mr.CozmoDec 28 at 8:06 AM\n\nThe game is vary good I recommend it for everyone.it is a funny game and there is a good story.It is a relaxing game If you get the game I hope you like it .\nThanks for reading \n\nHelpful | 1", "SupercarXBOJan 26 at 3:34 PM\nSo much freedom\n\nSo many things to do. You will never run out of content\n\nHelpful | 0", "Qcaulf_17Dec 24 at 1:44 PM\nEverything is Amzing\n\nThe possibilitys in this game are nearly endless. Its fun 2. I got this after I finished job simulator because I was sad it was over and this game was not only just as good as job simulator. But it was even better.\n\nHelpful | 0", "VoidConstructDec 28 at 10:08 AM\nPhenomenal game!\n\nI haven't visited the mountain area, but already this game was an amazing experience. I felt immersed in the game, and the moving mechanic is a plus. Overall, I would recommend this game to all ages.\n\nHelpful | 0", "nulnulqashJan 25 at 4:55 AM\nLove it\n\nThere is so much things to do and the graphics are so good.\n\nHelpful | 0", "Itz_Robs_HyperJan 5 at 7:08 AM\n5/5 Great game worth the 30$\n\nI own this game and job sim this one has way more replay value and is always fun great game for VR newcomers and even people who have had VR for decades.\n\nHelpful | 0", "enderchickenMar 28 at 8:36 PM\nAmazing\n\nThis game is awesome, it is a step up from job simulator which is already and amazing game. It has a lot more content and I spent so much time just screwing around In the hotel room. This is a must have game for anyone who likes fun\n\nHelpful | 0", "larid8400Jun 11 at 11:22 AM\n\n\nThe memory machanics sucks but other than that it is a good game, but not,\nas good as job simulator\n\nHelpful | 0", "LightningBJan 3 at 1:43 PM\nAmazing, but...\n\nWhen I search for Hand Tracking in the store, it says that this game has it, yet when you start it, it says not supported. If that feature wont be added, can the tags be corrected?\n\nHelpful | 0", "TypicalGunmanGamingMay 10 at 1:24 PM\nBest game ever\n\nBest game ever\n\nHelpful | 0", "jokingbirdDec 30 at 3:25 PM\nGreat, but repetitive\n\nThis game is amazing. There is so much to interact and mess around with. Ive had plenty of fun playing this game and explored countless environments. You can tell lots of hard work was genuinely put into this game. So many characters are just so easy to love like bob moss or vacation bot. However, when going in between islands you start to see trends. Although games are fun and differ from environment, they all have one basis. A cooking system, some sort of building station and a 5 memory evoirment. they begin to feel the same and unoriginal. After collecting all the memories in game, i didnt feel like replaying most of the memory interactions and such, but if you like job simulator i totally recommend this game\n\nHelpful | 1", "cincobossmayoJan 31 at 6:00 PM\nGreat game\n\nHours of gameplay\n\nHelpful | 0", "AspenLJan 28 at 6:19 PM\nGreat game!\n\nMost of the Things that get you memories are repeated but replaced with somthing to fit the vacation area but it is still fun! Tons of things to do.\n\nHelpful | 1", "dunlmath86Jan 18 at 1:55 PM\nKids love it\n\nThe kids love it and I get a good laugh every time they play.\n\nHelpful | 1", "crystal.staffeld.9Jan 13 at 5:45 PM\nFun.\n\nThis was the first game I bought, I love it and it's easy for the kids to play too.\n\nHelpful | 1", "dannyroo2001Dec 25 at 10:25 AM\nA master peace\n\nL got a 128gb quest with this game and although k watched other people play it l was amazed that they was so much to do if you have a bro headset GET THIS GAME you wont regret\n\nHelpful | 1", "YoshiXCatJan 20 at 5:17 PM\nLove it,\n\nThis game is very detailed and amazing\n\nHelpful | 2", "chowardleachJan 25 at 6:00 PM\n\nAmazing sure to make a lot money\n\nHelpful | 0", "babyzulu1Dec 13 at 12:37 PM\nMy review\n\nPlaying the game was beautiful I love the bots even the ones I want to punch in the face.so I hope you guys enjoy this game I did I yea.the only thing I hate is the drinking sound in this game.I like the drinking sound in job simulator\n\nHelpful | 1", "dlyons6906Dec 13 at 12:18 PM\nLove this game but...\n\nThis game is so expansive and i been waiting for it to come to oculus but the only problem is i cant get the memorys from ice sculpting bot it wont let me go past that so i cant get 100% but i would love if i could find a fix\n\nHelpful | 2\nDeveloper ResponseFeb 25 at 10:45 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "keigmanJan 19 at 8:55 PM\nGreat game\n\nGreat game nice ways of earning achinmens Grammer mistake\n\nHelpful | 0", "TwoFaceTrayDec 26 at 3:05 PM\nFun game\n\nThe games was fun but some of the missions should be easier like when you had to get creamer for a food orderly the forest I did not expect it to be back at the hotel also the sandcastle missions in the beach and the ice sculpting I had to search\nUp on YouTube in how to do the sandcastle but other than that fun game would play again 8/10\n\nHelpful | 1", "DiamondsarefunDec 30 at 11:11 AM\nReally good game!\n\nI love this game just like job simulator. I played through the game did some stuff in the beach and in forest but then I went to the mountains which was fun at first I completed some things but then I talked to the vending machine worker and he told me the computer Bigfoot story. But all of a sudden black pixels filled the front of my screen and started flashing rapidly, I could still see the corners of my screen though. Knowing this could just be a 1 time thing I quit the game and went back in. BUT THE PIXELS WERE STILL THERE. Too see if my system was broken I tested another game and I played it flashing pixel free so I know its not my quest acting up. Please try to fix this bug/ glitch, because the game is basically unplayable. If the bug is fixed (If I can) I will change my review to 4 stars. They fixed this so Im going to say that its good. It has a big amount of content and Im always finding new things.\n\nHelpful | 2\nDeveloper ResponseFeb 25 at 10:43 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "Freddie31Jan 16 at 12:26 PM\nIts amazing\n\nIve always wanted a seaquel if job Simulator so here it is!\n\nHelpful | 1", "BenceFamDec 27 at 10:49 AM\nGood but\n\nWhen you finish all the memories there is nothing to do so maybe you could have something like infinite overtime in job simulator\n\nHelpful | 4", "Awesomedude251Jan 25 at 9:04 AM\nAmazing\n\nThis is an amazing game\n\nHelpful | 0", "rachel.bryan.370Dec 31 at 8:51 AM\nAbsolutely brilliant\n\nI love it!\nSo much to do\nEnjoyable, not easy..gets you to use your brain and think about how to do things.\nWell worth getting, I highly recommend\n\nHelpful | 0", "FueFue54Dec 20 at 5:34 AM\nOne of the best games Ive played!\n\nVacation simulator was one of the best games Ive played yet! I love that there is now a story that you can complete and multiple tasks that you can do to 100% the game.\n\nHelpful | 3", "scooby_4_uDec 28 at 4:10 PM\nBETTER THEN ANYTHING!!!!!!!\n\nI have been waiting forever but when it first came out it wasnt for the quest but when it came out for the quest i didnt get it but I got it for Christmas\n\nHelpful | 0", "flyingaway11Jan 13 at 4:22 PM\nSuper fun!\n\nSo much fun, I really hope they come out with more games like this!\n\nHelpful | 1", "XNerfherderXJan 26 at 9:35 AM\n\nPretty epic\n\nHelpful | 0", "Ally6875Jan 12 at 3:32 AM\nBrilliant\n\nThis is a really good game you can do really whatever you like. My kids love it.\n\nHelpful | 0", "JEM_CMar 31 at 3:06 AM\nThis is good for every one\n\nI am finding this really fun loads to do easy to get into and no need for going anywhere ever again just get it. NOW! Its really good why are you still here just buy it go. Bye.\n\nHelpful | 0", "MajinpootDec 18 at 5:25 AM\nTons of fun!!!!\n\nI love how much preparing of food you have to do in this game. Super fun finding all the ingredients to get the job done. Lots of fun and stuff to keep your busy. My daughter also love this game so much.\n\nHelpful | 1", "sammieallen88Jan 26 at 2:08 AM\nGreat sequel\n\nJust wow\n\nHelpful | 0", "SunkenMistJan 13 at 4:47 AM\nGreat game!\n\nIve played job sim awhile back and this is the perfect sequel to it!\n\nHelpful | 0", "supersean23Dec 26 at 4:20 PM\nAwesome! A must have !\n\nA must have game! I love it. Family friendly and a joy to play!\nGraphic are good and many things to do in the game. You cant go wrong with this game. Buy it!\n\nHelpful | 1", "Jayden_2007Apr 29 at 11:51 AM\nSuper fun\n\nThis is a super fun game!!!\n\nHelpful | 0", "JE-SilverDec 26 at 10:10 AM\nBest VR Game!\n\nThis game is astounding! You constantly have things to do, but do even have to do them! The jokes are funny, the art style is cute, overall just a fun game.\n\nHelpful | 0", "NateyripDec 24 at 11:40 AM\nBest game on Quest\n\nThis game has more content than any other game Ive played in VR. This is not a linear game. You can do whatever you feel like doing without anything stopping you.\n\nHelpful | 0", "Bamma4Dec 26 at 8:31 PM\nWow\n\nI thought this game would be the same as job simulator go here,do this, move on. But it was very surprising that you can do whatever you want buy this game\n\nHelpful | 1", "3DpyroJan 4 at 10:29 AM\nA great game\n\nIts beter then job simuletor. It has so much content and its very fun. Its a great game fore new quest pleyers\n\nHelpful | 0", "Jojobean66Dec 17 at 3:49 PM\nAMAZING!!\n\nThis game has so much for you to do. I played this game for hours and am only 15% through three main story! Even past the story there are so many fun things to discover and interact with, I love it!\n\nHelpful | 0", "100waterbaresJan 24 at 5:21 PM\nEpic\n\nBig epic\n\nHelpful | 0", "bandgsFeb 18 at 5:31 AM\nIts okay\n\nNot the best, in my opinion job simulator is better\n\nHelpful | 2", "venomsnake321Dec 25 at 12:58 PM\nAmazing\n\nIts a lot better than job simulator because of they amount of conntent i could easly just spend an hour in the room it has so many features it is brilliant\n\nHelpful | 0", "Cool_Dude_JeerJan 23 at 2:06 PM\nVery fun\n\nLove this game but certain quests get repetitive farted a while such as sand castle bot nut I love the game other than that.\n\nHelpful | 1", "Derpy_ManateeJan 9 at 3:37 PM\nI love it\n\nIts got so much more content than job simulator and so much more interaction\n\nHelpful | 0", "CaptainInsano8Dec 27 at 7:38 AM\nBest game ever\n\nI got this are on Christmas two days ago and Ive been playing this vacation simulator but I its just amazing for real.\n\nHelpful | 2", "miniuniverseDec 14 at 8:05 PM\nIm amazed.\n\nI have been wanting this game ever since the quest even came out, and wow. I am very impressed at the amount of detail and effort that Owlchemy Labs put into this. I would definitely recommend this.\n\nHelpful | 1", "GuenfferJan 13 at 5:59 PM\n\nThis game is very [VACATION]\n\nHelpful | 3", "liam.banas476Jan 22 at 3:27 PM\nVery great game!!!!\n\nOverall it is an amazing game except whenever I visit the dessert stand in the Forrest my game always glitches abunch and sometimes even crashes.\n\nHelpful | 0\nDeveloper ResponseFeb 25 at 10:41 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "WonderTrashy114Mar 29 at 5:38 AM\nMade me want to get vr\n\nVacation simulator is amazing there is so much stuff you can interact with nearly everything its just so much fun played it for hours after I got it thanks owlchemy labs\n\nHelpful | 0", "The.True.KrakenDec 15 at 8:10 PM\nImmersion breaking experience\n\nBeach level was fun with a few glitchy spots but as soon as I went to the forest area the game self-destructed. Dev's, please dont meet deadlines and give us games like this. Job sim was a staple in VR yet you port this over to quest like this? This is the first VR game I've actually gotten somewhat motion sick from and that's because it was freezing everytime I moved before my oculus became completely inoperable. I have no doubt that you'll fix the issues but I dont know if I'll care to finish the game when that happens. 10/10 for immersion breaking expectations\n\nHelpful | 6\nDeveloper ResponseFeb 25 at 10:44 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "mr.smickersonApr 29 at 10:43 AM\nPretty good\n\nIts amazing just one problem, it tends to glitch a bit, the middle of the screen will go black and I have to restart the game, so just be aware\n\nHelpful | 0", "OH_zkrDec 12 at 2:20 PM\nWaaay higher than my expectations\n\nMuch so much to do, Ive only completed 3%. Totally worth it.\n\nP.S. Put the radio in your backpack and take it with you.\n\nHelpful | 11", "NINJASQUIDYTJan 5 at 11:55 AM\nAmazing\n\nThis game is amazing you can do so much like river rafting,hot tub chilling and even grilling\n\nHelpful | 0", "tomisthebest_969Jan 12 at 7:51 AM\nRuined my Quest\n\nThe game is great. That's why I would give it 5 stars, but one time I was playing it and wanted to go back to the Oculus Home Menu. I pressed the Oculus Button on the right controller, and it showed a loading screen. Approximately 10 seconds later, everything went black and I couldn't do anything. The Quest was permanently put into sleep mode, and now I can't even factory reset it! What do I do?!?!\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:42 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "RPGenius5Dec 25 at 12:07 PM\nVery vibrant\n\nI had seen and heard about this game and I realized there was so much more than I originally thought! There was a lot of functions that were fun.\n\nHelpful | 0", "Digital_PixelsJan 2 at 12:55 PM\nYes\n\nJust... Yes... That's all I have to say . That's all I feel..................... Yes\n\nHelpful | 2", "carter.chase.737Jan 12 at 11:17 AM\nBetter than you would think\n\nHuge fan of job simulator and this game is even better\n\nHelpful | 0", "epiclp92Jan 19 at 9:18 AM\nGood\n\nGood...for reasons\n\nHelpful | 0", "northbandJan 3 at 7:34 PM\nVery fun\n\nDaughter has taken over my quest because of this game. Now shes begging for the job simulator.\n\nHelpful | 0", "Jerboa5Jan 3 at 7:48 PM\nBetter than job simulator\n\nIMO both are fun, but vacation sim seems more packed and I enjoyed it a lot. Highly recommended.\n\nHelpful | 0", "RantingRexJan 14 at 5:18 AM\nAmazing\n\nA great game would recommend\n\nHelpful | 1", "GavinKornyeiDec 24 at 6:30 PM\nAmazing!!\n\nThis game is amazing and I would recommend for everyone with a quest!! Also Im waiting on a Rick and Morty port and a Blade and Sorcery port\n\nHelpful | 0", "owo_sunflowersJan 15 at 11:14 PM\nEh, its nice.\n\nI absolutely love the game! But there's two memories that I don't like. There's sandcastle sandbox and the ice block carver. I just can't figure it out!\n\nHelpful | 3", "NVRflameDec 15 at 12:14 AM\nThumbs up!\n\nAt $46 its probably a little expensive but living in Australia we are more than use of tech companies taking advantage of us Aussies.\n\nThat said the game itself is really well made.\n\nHelpful | 0", "aimee.moorehellerJan 2 at 5:38 AM\nLov it\n\nMy daughter can't stop playing the game. She loves it, We love the game and our VR!\n\nHelpful | 1", "EC-NavDec 16 at 6:52 PM\nFun game but needs some tuning on Quest\n\nSo far Im liking this game a lot and so is my son. Bonus points for having multiple player saves so we can both play our own character. I only tried Job Simulator briefly on another system but Vacation Simulator is much better. There is an actual game to it which keeps us playing. My son has checked out all 3 areas but Im still at the beach and havent run out of things to do yet in the few hours Ive played. The sand castle building is fun and challenging.\n\nIt would get a 5 out of 5 if it didnt keep crashing or messing up the Quest when going to the menu. It seems to get worse the longer we play so it may be a memory leak. Casting so I can help my son also works great if we start it right away but if I request to cast after he has been playing for more than 20 minutes, things go downhill fast. Hopefully this gets fixed soon!\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:44 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "BobNGamesJan 15 at 10:16 AM\nVery fun\n\nIts a fun game\n\nHelpful | 1", "Jacko1213Dec 20 at 4:03 AM\nSo much fun!\n\nIts way better and more difficult then Job sim because it has a storyline, you can also just go were ever you want, and over all best game of the month\n\nHelpful | 0", "stevejordan1stDec 13 at 7:21 PM\nLove it!\n\nEven better than the last! Don't get me wrong, I love job sim and still play it sometimes for the cooking mostly but this game has it all and more! A lot more content keeping you busy forever!\n\nHelpful | 0", "PinappleOnPizzaApr 29 at 12:33 PM\nTo real\n\nWhen I tried to put my controllers on the table it would go thought anyway I'm trying to say it a good game and you should try it\n\nHelpful | 0", "CreeperyaDec 15 at 5:05 PM\nJust incredible\n\nAs a sequel to job simulator this game had extremely high expectations and even then it still blew me away with is great visual and amazing gameplay. Definitely a must buy\n\nHelpful | 1", "ClayKrayJan 1 at 7:27 PM\nStunning\n\nThis game runs very smooth and has many fun activities to keep you playing for hours.\n\nHelpful | 1", "Sea_Crust56Dec 30 at 12:17 AM\nMore options\n\nThere are more things to do here than in Job Simulator. It's really fun and I would recommend.\n\nHelpful | 1", "masmangamerFeb 10 at 12:43 PM\nAMAZING\n\nThis is amazing good idea!\n\nHelpful | 0", "shanklilMay 3 at 11:54 AM\nGreat for kids\n\nA bit to interactive for me. I prefer to go right to playing but itll definitely keep someone occupied.\n\nHelpful | 0", "DungewarDec 24 at 12:33 PM\nBest game E-ver.\n\nPlayed for 30 minutes and I'm already looking forward to play again. I have one question thou: How can you get more backpack space?\n\nHelpful | 0", "bizzeuFeb 8 at 6:53 PM\ngame is good kids love it but..\n\nplease remove the obligation to obey to these robots to pass to vacation! that's annoying and it is hard for kids. it was so good to ignore them in the first game\n\nHelpful | 0", "azwrangler71Feb 8 at 9:17 AM\nDoesnt work\n\nWorked fine for a day. Now just a black screen. Tried reinstalling. Still nothing.\n\nHelpful | 3\nDeveloper ResponseFeb 25 at 10:53 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "bro_nobyeDec 26 at 7:18 AM\nI loved it\n\nIts amazing I hope it updates and grow. I very much recommend this for all ages and its great fun for everyone.\n\nHelpful | 0", "Kmc853Jan 15 at 3:05 AM\nFriggin amazing\n\nAmazing\n\nHelpful | 1", "Demon_of_Wolves_6226Jan 12 at 4:33 PM\n\nIt's pretty cool an fun to play\n\nHelpful | 0", "shreder856Dec 12 at 4:15 PM\nSooo much content\n\nWay better than job sim, so much to do and lots of little details\n\nHelpful | 3", "CannonMannonDec 26 at 3:27 PM\nGreat game\n\nI only played at little bit in the mountain area but that little time was awesome cant wait to play more of it.\n\nHelpful | 0", "IcyPanda150Dec 12 at 7:53 PM\nI love vacation simulator\n\nVacation simulator is so fun! I have been waiting so long for the game for so long and it is finally here!!! I hope everyone will enjoy the game and have a fun time playing!!\n\nHelpful | 1", "ClarkGriswold1357Jan 7 at 6:03 PM\nAwesome game\n\nLooks great on the quest lots of fun to mess around on\n\nHelpful | 0", "Jordyn2007Jan 9 at 4:55 AM\nI love this game\n\nIts one of the best games for me to play\n\nHelpful | 0", "VVVictor07Dec 12 at 3:38 PM\nAwesome, even better than job simulator.\n\nThis game is much better than job simulator. I think you should add a city vacation feature, I don't know if that is possible but I would love to see something like that in the game.\n\nHelpful | 2", "jakelonerDec 15 at 3:15 AM\nBBEST GAME EVER\n\nWOAH I MEAN THIS GAME IS AMAZING ITS WAY BETTER THEN JOB SIMULATOR ITS SO POLISHED AND SO SMOOTH ITS AMAZING AND THE BOTS ARE ANIMATED WOAH I MEAN YOU SHOULD ADD HANDS\n\nHelpful | 0", "GavinStanleyyJan 8 at 2:23 PM\nYeet\n\nThis game is awesome America ww3 baby\n\nHelpful | 1", "LizzyBriDec 26 at 6:42 PM\nGreat game but...\n\nThis game is a amazing game and has potential! But recently this black glitch came in and only shows when i load into the game... I was wondering how to fix it because I can't see anything well when i try to play! I hope you fix this!\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:43 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "MagnusssDec 26 at 8:33 AM\nFun and exciting!\n\nI found this game fun and exciting, The best part about it is that you can go to any world you want! No limits.\n\nHelpful | 0", "ManlyMan6Jan 11 at 10:51 AM\nHighly recommend.\n\nWorth every dime and then some.\n\nHelpful | 0", "ryguytheflyguyMar 31 at 3:34 PM\nGreat game\n\nThis game includes of multiple levels and fun mini game you can interact with almost every thing and choose your character.\n\nHelpful | 0", "Baby_on_the_wallJan 4 at 7:21 AM\nVacation of a life time but a short one\n\nI really enjoyed this game. And gathering memories was really fun and theres lots of exploring to do. But the game is pretty short and I beat it in like 3 day. Other wise this game is amazing.\n\nHelpful | 0", "CR1T1CALHITZJan 1 at 2:04 PM\nONE OF THE BEST GAMES I OWN\n\nMan I cant stop playing this! Soo many things to do? I really recommend it\n\nHelpful | 0", "tsturgill08Jan 12 at 3:25 PM\nFun\n\nFeels like a vacation\n\nHelpful | 0", "Blacknight2009Jan 5 at 2:13 PM\nBEST EVER\n\nit is the best game ive played on the quest i been bored\n\nHelpful | 0", "LHRoberdsJan 12 at 1:45 PM\nAwesome\n\nGreat game\n\nHelpful | 1", "Rob_norb17Dec 23 at 11:27 AM\nGreat time wasting silly game\n\nGreat change to the original job simulator, allows much more freedom with multiple areas but keeps the same sillyness!\n\nHelpful | 0", "RavaspJan 8 at 9:27 PM\nBrilliant\n\nLove it just as much as job simulator\n\nHelpful | 0", "CsaliHUNDec 13 at 2:56 AM\nGood for first-timers, fun for veterans\n\nReally loved Job Simulator, because it was the game that wanted me to get into VR. Now this, this is just beautiful. Tons more to do, and so simple, yet fun.\n\nHelpful | 1", "luke.petrovich.15Dec 30 at 12:34 AM\nEndless content\n\nThis game has so many things to do, it had me coming back for more for a long time\n\nHelpful | 0", "JoseECDVDec 12 at 1:30 PM\nGreat game\n\nI love this game, I have been waiting for it for months untill it finally came, it is worth it and great to show friends and family\n\nHelpful | 4", "VaoDec 31 at 1:30 PM\nI love this game!\n\nIt's so charming and original and it nails all the things it sets out to do.\n\nHelpful | 0", "pixelomanDec 25 at 8:51 AM\nBest experience\n\nI didn't like th first one that much but this is probably one of the best Tiels in th store right now\n\nHelpful | 0", "happy24mrDec 28 at 3:45 PM\nGood but....\n\nThis game is fun and the story is cool but sometimes the game will freeze, crash, or even completely break with black squares appearing. I love this game but these errors are very annoying to encounter.\n\nHelpful | 2", "Pur3BoltDec 15 at 8:31 AM\nMust play\n\nI find Vacation Simulator much more enjoyable than Job Simulator, which waa also a very fun game to play! I would say this is one of the must buys for VR.\n\nHelpful | 0", "barabba9174Dec 15 at 2:29 AM\nBetter then Job Simulator\n\nI loved Job Simulator, but it was quite repetitive and controllers werent so precise.\nThis is much better! Im still playing and I have a lot of fun!\n\nHelpful | 0", "starwars2.0Jan 13 at 5:05 AM\nA really good game for a sequal\n\nThat's it\n\nHelpful | 0", "CoolDude212Dec 31 at 11:01 PM\nMan my memories of job simulator\n\nDude when I first got job sim my mind was blown now threes a sequel\n\nHelpful | 0", "reddog132Jan 3 at 6:29 PM\nAwesome game\n\nIn this game there is basically no end its nonstop fun\n\nHelpful | 0", "SavageJerDec 12 at 6:23 PM\nSavage jer\n\nIve been waiting for this game to come out on the quest for ever since it came out and I am so addicted to it I cant wait to play it all day tomorrow.\n\nHelpful | 1", "Original_Fly_GuyJan 11 at 7:03 PM\nGood game\n\nLots of content\n\nHelpful | 0", "BiobonMar 29 at 11:23 AM\nNew to VR? PERFECT!\n\nIt's so optimal for newbies. Very simple and easy to grasp! Couple of hours of really fun content lots to interact with\n\nHelpful | 0", "HenDeBeast89Jan 6 at 3:57 PM\n\nIt is such a good game to have fun in\n\nHelpful | 0", "VRfannajaFeb 12 at 5:45 AM\nProblems\n\nIt is very good game but there is glitches and i need to start over again. Please fix that or i want my money back.\n\nHelpful | 0\nDeveloper ResponseFeb 25 at 10:51 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "sam.rohan.39750Mar 28 at 12:56 PM\nNice sequel\n\nVery fun just as good, if not better than Job Simulator. Still stuck on some things but that's part of the fun I guess.\n\nHelpful | 0", "Virtualman13Dec 23 at 6:41 AM\nWill there be another Game like this\n\nThis game is absolutely amazing I want to know if there will be others like it.\n\nHelpful | 2", "KiritosofiaDec 20 at 2:15 PM\n\nAwesome! I tried both Job and Vacation simulator and both of them are brilliant! Thanks for such a good game!\n\nHelpful | 0", "murckylobster07Mar 23 at 9:51 PM\nTheres a bug but a grate game\n\nSo me and my sister were just play the game like normally but when she went into the forest vacation a black pixel popped up and was covering the players view and couldnt see but had to turn it off and back on but just letting the creator know that there is a bug\n\nHelpful | 1", "MoneyMan234Dec 22 at 2:48 PM\nIts just great\n\nI think I spent almost 10 minutes in the bathtub in the beginning just messing around INSTANT 5/5\n\nHelpful | 0", "MobKillerPCDec 27 at 4:21 PM\nSo fun\n\nIts a great game thats all I need to say about it it is just great\n\nHelpful | 0", "Mortal66Jan 26 at 6:55 PM\nVERY underwhelming.\n\nNot as fun as I thought It would be.\n\nHelpful | 3", "djthecoolDec 27 at 3:11 PM\nGet it\n\nAs soon as I got I started and was like this better than job simulator.\n\nHelpful | 0", "Foreigner124Jan 6 at 1:20 AM\nDope\n\nU just kinda mess around and interact. Sometimes it seems like a chore completing tasks but at least 95% of the tasks are enjoyable. Very thorough game.\n\nHelpful | 0", "RhysblitzDec 27 at 10:35 AM\nAmazing\n\nLoved this game, just like job simulator! Amazing! \n\nHelpful | 1", "bstenzel85Dec 12 at 3:06 PM\nThe Superior of the \"Simulators\"\n\nThis is way more expansive than Job Simulator, so much more to do!!! I knew I was right to pre-order this after loving Job Simulator.\n\nHelpful | 1", "ilanit.ouzielDec 14 at 11:07 AM\nToo much bugs\n\nThis game looks awesome but unfortunately it gets stuck after couple of minutes and when you click on the oculus button to return to oculus menu the screen turns black and restarts\n\nHelpful | 6\nDeveloper ResponseFeb 25 at 10:45 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "Puggo24254Apr 15 at 7:05 AM\nVery good\n\nGood game\n\nHelpful | 0", "Alex593Dec 14 at 2:47 PM\nI love my dog\n\nMy dog is so fury just like my Christmas tree and also I love my pet box and rock and sunscreen in side playing vr with my Christmas tree\n\nHelpful | 0", "BeckcitoJan 2 at 1:12 PM\n\nAmazing but hard to get memories\n\nHelpful | 0", "GoLuckyFlameDec 14 at 7:36 PM\nAmazing!\n\nFunny, Cartoonish, Enjoyable. In my opinion this game tops Job Simulator even though I love that game too.\n\nHelpful | 2", "J-B0yJan 5 at 3:45 PM\nYes\n\n\n\nHelpful | 1", "basiliskjoshDec 13 at 4:13 PM\n\nSO WORTH IT!!!!! I tried this game, and I just cant stop! Its a sequel to Job Simulator, and it has so much to do! You never get bored.\n\nHelpful | 0", "Jbell1232Dec 14 at 3:46 PM\nBest game EVER\n\nHass to be the best game I have hands-down ever played if you have a vr get this game its the best game ever\n\nHelpful | 1", "freezie11Jan 1 at 8:16 PM\n\nHad such a fun time playing it\n\nHelpful | 0", "XxminersxDec 16 at 4:02 AM\nBest game i've played so far!\n\nThe game is just absolutely brilliant. The graphics are nice, the music is calming and the levels are amazing!\n\nHelpful | 0", "frogdangoApr 1 at 9:04 PM\nFun\n\nJob simulator with an incredible amount of open space and freedom!\n\nHelpful | 0", "ryantartagliaDec 25 at 10:03 AM\nSo good!\n\nI cant stop playing, easily the best Quest game out there.\n\nHelpful | 0", "Rices2000Mar 30 at 9:13 PM\nI love this game\n\nThis game is so fun Im almost done with the game and I just started today\n\nHelpful | 0", "tkkariApr 23 at 3:26 AM\nThe best 100% recommended\n\nA big difference between job sim vs vacation sim but not what I expected still the best\n\nHelpful | 0", "Coble516Dec 12 at 8:32 PM\nSooo much to do!!!\n\nHas way more to do than the first one. much more detail in everything. Its all around a great game.\n\nHelpful | 2", "jpmargDec 13 at 8:58 PM\nSo good\n\nSo much better than I thought it was going to be. Open world and a goal in the game. Its great\n\nHelpful | 2", "SdempseyDec 13 at 9:31 PM\nA TON of content here!!\n\nThis is far better than Job Simulator! I got lost trying new things. Must have title for your quest.\n\nSo much fun!\n\nHelpful | 0", "Priormichael151Dec 12 at 7:18 PM\nGreat game\n\nI have been playing for a couple of hours now and it has been the best experience in a game I could ever have!\n\nHelpful | 1", "NodeTechDec 31 at 5:20 AM\nGreat game!\n\nThis is a fun game for anyone that enjoyed job simulator. It does become tedious to collect memories after the first 30, but the game is still fun to play.\n\nHelpful | 0", "SawyersneatDec 22 at 3:05 PM\nAmazing!\n\nGot it and couldnt believe how much there was to do! WORTH IT!\n\nHelpful | 0", "TheSerpentGamerDec 15 at 10:40 PM\nEven better than job simulator!!!\n\nIts so fun and engaging. I love the extra new features like cameras and backpack! So fun!!!!\n\nHelpful | 0", "january_samuraiDec 30 at 3:37 PM\nSo much fun.\n\nGreat game. Lots to do!\n\nHelpful | 0", "ReadyPlyr1Dec 12 at 10:27 AM\nO YEA\n\nOculus thank you for best sequel ever O YEA\n\nHelpful | 7", "AF07Dec 13 at 1:27 PM\nGreat but glitchy\n\nIve encountered some glitches but if you restart the game as in quit out and join in it fixes\n\nHelpful | 1", "DJninjaJODec 13 at 11:12 AM\nThis was amazing\n\nIve been waiting for this game since I got job simulator. I can home early from school just to play it.\n\nHelpful | 0", "matsmuddeDec 12 at 10:19 AM\nGreat game\n\nIts great\n\nHelpful | 10", "NorpaJan 2 at 12:45 AM\nMy kids loved it.\n\nSuperb. Packed to the brim with great games.\n\nHelpful | 0", "DrFrost_Apr 9 at 12:47 PM\nAmazing\n\nSuper fun\n\nHelpful | 0", "NSS-Dec 25 at 10:17 AM\nExcellent\n\nA lot better than job simulator. Good job.\n\nHelpful | 0", "ThevrcatDec 12 at 8:03 PM\nBest game ever\n\nThis has to be my most anticipated game of the year ever since I herd it was coming holiday 2019 I flipped\n\nHelpful | 0", "ProfessorPiggosDec 12 at 8:16 PM\nOne of the best VR games I've played\n\nThis game is amazing. It's. Like job simulator, but it has length. Very good use of 30 dollars.\n\nHelpful | 1", "loopurDec 17 at 7:29 PM\nBetter than job simulator\n\nThis game has way more to do and is a must for any other oculus users.\n\nHelpful | 1", "BootToTheHead7Dec 25 at 7:19 PM\nGreat game\n\nThis is a perfect game to just relax in\n\nHelpful | 0", "puggythegreatDec 14 at 2:45 PM\n\nI loved all the different options and places. I also loved all the different activities!!!\n\nHelpful | 0", "liongaming12Dec 12 at 7:41 PM\nIts finally here!!!\n\nIts soooooo fun Ive been waiting for this for a long time and its great like job simulator\n\nHelpful | 0", "NameChanger5189Mar 21 at 9:50 PM\nGreat Game\n\nI love this game got it for my Birthday which is today March 21. I cannot Stop playing it \n\nHelpful | 0", "Leonardo_The_LegendDec 13 at 7:31 PM\nMy new favorite game on the Quest!\n\nThis game is the best game on the Quest so far...thats all I have to say...\n\nHelpful | 1", "Chaser6907Dec 29 at 9:53 PM\nAwsome\n\nAwesome\n\nHelpful | 0", "MalteseDadDec 16 at 11:06 PM\nNot for me unfortunately\n\nBought it on the basis of the great reviews. This game reminds me very much on those casual party games on the wii console, except as with everything on the quest it is largely a solo experience (casting onto a tv is still experimental and laggy). The graphics are super cartoony with simple textures and low polygon counts. This makes for a smooth experience as the quest can handle it so it was a disappointment that the locomotion within the game is so fixed. You can only move from one fixed location to the next fixed location and the most cement feels very unreal. The gameplay is very kid friendly but it feels disjointed and not part of a story. On top of that, it glitches. Less than an hour in the game I started getting large black pixels on two thirds of the screen which remain even if I start and stop the game. Now this is not a deal breaker if the game was more engaging but given everything else, I have to say thanks but no thanks to this one.\n\nHelpful | 3\nDeveloper ResponseFeb 25 at 10:44 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "RenazlDec 14 at 10:19 AM\nAmazing\n\nThe game is very fun and there is so much to do i am still trying to complete it\n\nHelpful | 0", "TheCuCuChickenDec 25 at 6:35 PM\n\nGood game had fun with it\n\nHelpful | 0", "Lil_Eazy_E_97Dec 14 at 5:44 PM\nAmazing!!\n\nGreat!!! Freaking!!! Game!!! For those who are barely starting in VR\n\nHelpful | 1", "Lazer241Dec 19 at 2:55 PM\nMy favorite game\n\nThis is my favorite game and even though its $30 I would pay $100\n\nHelpful | 4", "sneaky_assassin795Jan 3 at 4:04 PM\nRefund\n\nDid not like the game that much just not for me. When I tried to get it refunded they denied it even though every thing met up with the refund policy\n\nHelpful | 4\nDeveloper ResponseJan 6 at 2:57 PM\n\nSorry to hear that. Unfortunately refunds are entirely handled by Oculus and the Quest Store. If you believe that there is an issue with your refund please reach out to Oculus Support. https://support.oculus.com/", "brrrrStickemDec 26 at 5:54 AM\nSimple Fun\n\nI enjoyed playing Job Simulator with my son and this was no different. Felt a little more challenging on the puzzles for him, but he figured it out.\n\nHelpful | 0", "GiftedKennyladMar 29 at 4:52 PM\nHi\n\nFun game\nRecommend buying it\n\n\n\n\n\n\n\n\n.\n\nHelpful | 0", "khm2008Dec 21 at 1:50 PM\nJob sim with way more content\n\nTitle says it all, kids love playing it\n\nHelpful | 0", "ReubenTwoSocksDec 26 at 3:27 PM\nGood\n\nGood\n\nHelpful | 1", "horseygirlDec 27 at 6:14 PM\n\nI love it\n\nHelpful | 0", "B.SupremeDec 25 at 9:06 PM\nFun\n\nIts really fun.\n\nHelpful | 0", "PicklecatpersonDec 27 at 10:15 PM\n\nAmazing\n\nHelpful | 0", "kingdedede1273Dec 26 at 11:13 AM\nAmazing\n\nPretty good\n\nHelpful | 0", "chase.overmireDec 15 at 8:00 AM\nTo each their own\n\nI'd like to start by saying I loved Job Simulator. Technically speaking vacation Sim is a great game but I just couldn't get into it like I did with job sim. The world's more vast but some how feels less interesting. I'll keep playing and maybe it will grow on me. Disappointed, I'd rather play job sim\n\nHelpful | 5", "sek3175Dec 15 at 7:14 AM\nGreat\n\nH the is is a great game made by the same people as Job simulator\n\nHelpful | 0", "Godislove4uJan 3 at 3:04 PM\nThing is cool\n\nMy fav is those cartridges in the suite. Jesus God's Son is mankind's sole hope...My Lord and Savior !\n\nHelpful | 0", "jake.hopson.35Dec 25 at 10:26 AM\nAwesome\n\nIt is awesome.\n\nHelpful | 0", "SpyingPear08Dec 17 at 11:21 AM\nAmazing Game\n\nIt is an amazing game please make rick and morty VR\n\nHelpful | 0", "Dr_AAJan 3 at 2:21 PM\nFun but\n\nIts a fun game but there is a glitch when it spawns like 100 radios and keeps on spawning more\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:43 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "Canada1212Dec 13 at 4:14 AM\nLag\n\nI love this game so much! Its a great sequel to Job simulator. But when Im in mountain and forest, I turn my head and everything freezes and half my oculus goes black. Is there a way to fix it?\n\nHelpful | 4\nDeveloper ResponseFeb 25 at 10:45 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "RatedO4UDec 13 at 1:13 AM\nAmazing game I love every detail\n\nI love this game it's so fun it's really just amazing in every way\n\nHelpful | 0", "lolmaster3656Dec 18 at 7:03 PM\nThis game is awesome\n\nThe ways you play it is awesome\n\nHelpful | 1", "Deboss9999Mar 17 at 7:18 PM\nSo much to do\n\nI got trapped in the lounge for a while left with so much to do, honestly recommend it\n\nHelpful | 1", "VinnyVRDec 12 at 5:39 PM\nCool\n\nThis game is really fun and cool! Would recommend to friends.\n\nHelpful | 1", "MiniWhopperJrMar 16 at 3:25 PM\nAwesome\n\nThis is the first game that I got into and it is everything I was expecting of VR and more!\n\nHelpful | 0", "spyro13Jan 20 at 10:49 AM\nHELP\n\nMy safe file just blinked out of existence when I started the game one time can someone please help and tell me what happened\n\nHelpful | 0\nDeveloper ResponseFeb 25 at 10:42 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "Sharktrainer07Mar 31 at 7:27 PM\nGreat\n\nIt is very good\n\nHelpful | 1", "dark37Dec 12 at 8:13 PM\nI love it\n\nI loved the game and now its on quest this game made my day\n\nHelpful | 0", "coleymoley67Dec 12 at 4:17 PM\nLove it\n\nThis game deserves five stars but I have one problem every time you enter the tv spot the radio regenerates over and over making a mess\n\nHelpful | 2\nDeveloper ResponseFeb 25 at 10:46 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "HellePelleDec 14 at 1:14 AM\nGreat Game\n\nOne of the Best VR Games THX for this.\n\nHelpful | 1", "PigWigglerDec 13 at 5:19 AM\n\nGreat game. One of the reasons I got my VR\n\nHelpful | 1", "asherpuffleDec 14 at 3:40 PM\nGreat game\n\nGreat game nothing more nothing less\n\nHelpful | 1", "dannysuseDec 12 at 1:20 PM\nOHHHH I love this game\n\n$$$$$\n\nHelpful | 5", "HeLpIveFallenDec 16 at 6:47 PM\n\nThe best VR game I have ever played\n\nHelpful | 0", "FlowFloorer_Dec 12 at 10:51 AM\nYes\n\nYes\n\nHelpful | 7", "Venstarx4Dec 12 at 4:02 PM\nawesome Game\n\ni was wating forever for this! :)\n\nHelpful | 2", "TallMidgetDec 21 at 10:21 PM\nLag and crashing\n\nSo dont get me wrong, this game is tons of fun, but it lags a decent bit and it comes and goes but its not too bad, my problem is: when the VR sends you something like power low or if you left your guardian, or even if you take it off, it will just crash and doesnt open, its okay at first but restarting the oculus and opening the games several times become pretty painful after a while. A\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:44 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "collin.york.5492Jan 18 at 5:17 PM\n3/5\n\nIt was great at first, but after a while it got a bit repetitive, still a great game though, would recommend.\n\nHelpful | 0", "EmilyJasonDec 21 at 6:47 PM\nLess fun then it looked\n\nStill very fun, I would recommend it to anyone who liked job simulator. But I must admit that it is not as fun as it looked\n\nHelpful | 1", "futuristerDec 16 at 3:18 PM\nSo much to do\n\nSuper fun!\n\nHelpful | 1", "McOcarTheGrouchDec 14 at 6:53 PM\nGreat\n\nGreat game\n\nHelpful | 2", "joseph.childreeDec 16 at 10:08 PM\nSon's favorite\n\nLoves the new game\n\nHelpful | 0", "HaloBoss1376Dec 13 at 3:23 AM\nWell made\n\nVery fun game to play\n\nHelpful | 1", "Memes_R_UsDec 16 at 1:10 PM\nAmazing\n\nRead the title\n\nHelpful | 1", "cyangrubDec 12 at 1:06 PM\nGreat game\n\nWow very good\n\nHelpful | 2", "AgentK77Dec 12 at 4:21 PM\nFun but laggy and restarts\n\nEnjoyed it but it gets laggy, parts of the screen go black and restarts. Maybe an update will fix it.\n\nHelpful | 11\nDeveloper ResponseFeb 25 at 10:46 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "ChrimsonDec 14 at 4:58 AM\nOne of the best looking quest games\n\nThis looks almost the same as the pc version\n\nHelpful | 2", "ClintGADec 27 at 11:47 AM\nGreat sequel !\n\nSo much more to do than job simulator plus support for more than one player!!!\n\nHelpful | 0", "Ilian007Dec 15 at 11:26 AM\nGood game but\n\nIts a good game and waiting since the teaser for this game i am impressed but after a 30-1h session it gets boring and it really hurts!\n\nHelpful | 0", "toyiesDec 26 at 11:22 AM\nShort\n\nDidn't last me very long but I had a lot of fun!\n\nHelpful | 2", "InkyDeathDec 12 at 4:18 PM\nGlitch\n\nI have this glitch where black pixels appear on my screen and its only in this game. This my favorite game so please fix it.\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:46 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "LordnuggetMar 16 at 5:30 PM\nEpic\n\nScawy snowman thow\n\nHelpful | 0", "toykerJan 4 at 5:05 AM\nGood\n\nSo good buy now\n\nHelpful | 1", "FadedStockerDec 15 at 2:40 PM\nI cant move\n\nEvery time I load into the game it says press X to move but every time I do I dont move if I want to move I have to Press the Oculus Home button and then load back into the game to do it I checked to see if it was The controller but the controller works perfectly fine I got the game because I love job simulator and Rick and Morty but I cant even move its irritating and bothering\n\nHelpful | 2\nDeveloper ResponseDec 15 at 7:11 PM\n\nSorry to hear youre encountering issues were happy to help you get back to VACATION! Shoot us a message at owlchemysupport(at)google<dot>com!", "d0sieJan 20 at 4:31 AM\nGood\n\nGood\n\nHelpful | 2", "z00dsquadDec 13 at 4:00 PM\n\nMy Oculus won't let this game download. I like the simulator games, but it's hard to play without the game.\n\nHelpful | 3\nDeveloper ResponseFeb 25 at 10:45 AM\n\nSorry to hear that! Please reach out to Oculus support. They can help you!", "Lizardman22Dec 14 at 7:31 AM\nPreety good man\n\nBut..... like more I think what if they added more hype by more content\nYour welcome\n\nHelpful | 1", "clarkdanielDec 26 at 4:04 AM\nIm confused\n\nI bought this as it said it supported hand tracking so I turned on handtracking and it wouldnt let me play it\n\nHelpful | 1\nDeveloper ResponseDec 26 at 8:12 AM\n\nSorry to hear that! We haven't announced support for hand tracking at this time. If that changes in the future we will definitely announce it over social media!", "darkziDec 15 at 12:14 PM\nLaging\n\nIt keeps laging to me after playing it for a while \n\nHelpful | 3\nDeveloper ResponseFeb 25 at 10:45 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "Spinny97Dec 17 at 1:07 PM\nBoomers\n\nGood game.\n\nHelpful | 4", "Zachary_BasketteDec 25 at 7:06 PM\nI havent played it yet but its cool\n\n(I()I)\n\nHelpful | 0", "RattlebonemanJan 5 at 8:28 AM\nNot as good as the original\n\nIts good but not as much fun as the original\n\nHelpful | 0", "MicrowaveLouieDec 23 at 11:21 AM\nbroken but fun\n\nthe game is so much fun but every 10 mins or so the game will freeze and force me to shut it down so i lose all of my progress :(\n\nHelpful | 1\nDeveloper ResponseFeb 25 at 10:43 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "Squirrel-manDec 15 at 8:12 AM\nHelp\n\nI keep crashing when I go onto the forest or the mountain plz fix it I love the game but I cant play it without crashing\n\nHelpful | 3\nDeveloper ResponseFeb 25 at 10:45 AM\n\nWe have recently released a major update of the game! This update addresses a ton of stuff, including things you pointed out in your review. We would love to have you check out the game!", "DuckOssieDec 12 at 9:41 PM\nWfewgbeufinjdanxnrdiz\n\nXhjsdxfousdcigwbzinwoucwdjbxwdkb wdlkxsqlnihsnxojrgnvijcdwbcjoencihwkfwpediyrtghosqnhiwebsojqqnzhiqqmLkqwaioerjojfebhixvuwdgvdiqhwdnhiqwsnsqwojsmpywurbdpkqnIZhqenxinqs zindwndewhubedriujxqsiqanxdhurcwfiywehdbzqwrhkhecqfuoheqdcbuqehejdwqiejke. Kbdxbhcsv shbdhvxbjsd confer vxjb sc jbcs. Bec. Bc s c an. S cqhvv sc hbda c hivqfecowuqfgc dwciqh decqilhbcda Linda Ljvqceb. Cqejlb eccqljb eccqjlbqfec life bq qe fjlb cfqeljbf e wjbqcwf fwcqbwbqfcljb\n\nHelpful | 365"]