{"App Title": "VARK", "App description": "VARK is a live concert venue platform for virtual artists.\nVirtual artists, or VTubers, is a rising movement of online artists and influencers who express themselves using real-time motion captured avatars. They are exploding in popularity through video sites and social media, especially in Japan and other Asian countries.\nWith VARK, virtual artist fans can go see their favorite artists perform shows, up close and personal in VR. Sounds like your cup of tea? Come on in!\n\n* A virtual concert experience with stage effects impossible in real life\n* Motion-captured virtual artists sing, dance and talk right before your eyes\n* Audience participation through messages, gifts and more!\n\nThe virtual artist revolution is on - here at VARK!\n\n# Notice:\n* You must purchase digital tickets to participate in an event, much like how a real life concert requires tickets.\n* Since most concerts are performed live, you can only participate when a show is on. Check the app for show schedules.", "Purchase section": "FreeAdd to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User", "Supported Player Modes": "Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Music, Social", "Languages": "English, Japanese", "Version": "1.15", "Developer": "VARK Inc.", "Publisher": "ActEvolve Inc.", "Website": "https://vark.co.jp/", "Release Date": "December 3, 2019", "Developer Privacy Policy": "LOADING\n\nHOME EVENT MANUAL RECRUIT CONTACT ACCOUNT COMPANY\n\nINFORMATION\n\n\n\nVARK\n2019/2/4\n\n\n\nOculus Go\nOculus Go100%\nOculus Go\n\n\n\n\n\n\n\n\n\n1. \n\n\n2. \n2-1 \n1,\n2,\n3,\n4,\n5,\n6,Oculus ID\n\n2-2 \n1,\n2,DM\n3,\n4,\n5,\n6,\n\n3. \n\n1,\n2,\n3,\n4,\n5,\n\n4. \n\n1,\n2,\n3,\n4,\n\n5. \n5-1 \n\n5-2 (1)(2)\n\n5-3 6\n\n6. \n\ninfo@actevolve.com\n\n7. \n\n\n<PREV\n\nNEXT>\n\n2020\n8(2)\n7(2)\n6(1)\n5(1)\n4(2)\n3(7)\n2019\n12(2)\n11(2)\n8(2)\n7(1)\n6(1)\n4(6)\n3(1)\n2(2)\n1(1)\n2018\n12(5)\n11(8)\n10(1)\n\nCopyright  2017- VARK Inc.", "Space Required": "198.1 MB"}



["5 stars\n23%\n4 stars\n7%\n3 stars\n5%\n2 stars\n12%\n1 star\n52%", "ABucketMay 14 at 1:47 PM\nPretty niche, but well-done\n\nYou need to have certain interests to like this. Are you interested in Japanese? Do you like anime characters/vtubers? Would you pay money for a virtual concert where the performer has a little interaction with the audience but have no idea what theyre saying?\n\nFor me, I can check all of those boxes. There was a free concert in March that would make me decide whether I keep this or not. I attended and had a blast! I really hope they have more free concerts to give people a better taste on what Vark has to offer. Are the tickets expensive? Yeah, a bit. Im looking at a 3 concert pack for about $120 cad. You can toss bouquets onto the stage but like theyre $5-10 each. But this is also supporting a creator who I assume wrote the songs or at least spent a lot of time practicing. They design how the lights shine like an actual concert. Me personally, Im willing to pay those ticket prices because I think its worth it, but you have to make that decision yourself\n\nHelpful | 56", "blackknight2020May 29 at 1:17 AM\ntickets tooooooo expensive.....really \n\nneed to get a grip on things with silly prices ,come back down to earth\n\nHelpful | 11", "xander.fajardo9 days ago\n\nIts really good\n\nHelpful | 0", "DerpyEagleFeb 4 at 8:10 PM\nSpend your money elsewhere.\n\nI'm a simple man; I saw Hatsune Miku in the preview trailer for this app and downloaded it immediately.\n\nI saw all the one-star reviews. I realised that I'd have to buy virtual tickets to attend these concerts, but this was okay with me. I'd love to support the artists that I listen to and the VTubers that I watch. One of the benefits of holding concerts in VR is that without the cost of a traditional venue, pricing can be far, far lower than a physical concert, allowing for much cheaper ticket costs. Come on, how much could a virtual ticket cost-- $5? $10? I assumed that most of the one-star reviews were just people that felt misled by the app's \"free\" price on the store, a position that is valid but didn't stop me from wanting to try it out myself.\n\nIn the app, I went to see how much the next Miku concert would cost me. There's no scheduled programming for 2020, so to find the price to expect, I went to the last concert that had Miku in it.\nWhen I saw that it had cost just under $70 CAD, I'm pretty sure I coughed up a little blood. I scrolled through the list of other events in abject horror, realizing that this wasn't even the most expensive event. There were ones that were cheaper, but I didn't see even a single event under $15.\n\nI love Hatsune Miku (and I saw some other names I wanted to see, too), but I'm a student, and if attending these concerts and events means blowing my food budget for the month, no chance.\n\nFor those like me who are interested but can't afford this app: watch 360 vocaloid videos in VRChat with friends. Go to the MMD dance world if you want a more 3D experience; it's comparable to what this app (seems to) offer, on-demand, totally free, and has a greater degree of user customization.\n\nDevelopers of this app: you are getting bad reviews because you charge way too much for tickets to each event. Even half of the price you have now would still be too much.\n\nHelpful | 245", "GlowBoxDec 3 at 11:21 AM\nNot Enough VARK Coins.\n\nNot enough VARK coins.\nOpen VARK coin purchase menu?\nNo, I do not believe I will.\n\nAnd also, during the trial concert the users hands are stuck together holding a glow stick, and is unable to move around. Just stuck in place. I have a policy against giving free games 1 star, so have 2.\n\nHelpful | 184\nDeveloper ResponseDec 22 at 10:42 PM\n\nHi GlowBox, thanks for the review! Just to make sure, VARK is not a game nor an animation/music editing tool; rather, it is more like an actual concert venue, where professionally produced & staffed concerts by avatar-donning artists take place according to predetermined show schedules. Hence, much like how admission fees apply in real life concerts, we ask users to purchase tickets to join the events. We want to ensure that the performers we invite onto our platform can gain profit from the concerts they hold. Also, we have updated our app description to better communicate the cultural background; please take a look! As for the hands being stuck together in the trial concert, that doesn't seem to be our intended behavior. We will look into it.", "Jcbuk2usFeb 4 at 11:51 PM\nInteresting but not for me\n\nI get the whole VTuber thing, I do. People make anime cartoon versions of themselves (or Idols) and those idols are what people attach to. I've seen a lot of BeatSaber Videos with Idols and they do make it more interesting to watch.\n\nI wouldn't pay for concerts in Japanese but I might if they were translated. I'd defiantly buy a ticket to see Markiplier live so I can understand what service this app provides.\n\nFYI, maybe one free concert per new user might help, or even a few minutes access to a concert before needing to pay. The free trial helped too.\n\nHelpful | 5", "Zero_VRJan 3 at 6:12 AM\nGood, but...\n\nI really want to support this app because I love this kind of stuff and it doesn't deserve the hate it's been getting, but it does need some improvements, such as more frequent concerts. Being able to change the time zone would be nice as well, or at least having the ability to watch previously streamed concerts. Also, I understand that the artists need to profit from their shows, but the prices on tickets are very high.\n\nHelpful | 17", "GalaxyWolf2134Dec 4 at 5:52 PM\nIt's good but...\n\nIt's good because of the Japanese songs and virtual singers but there no point of getting it because you have to pay to join the performance, which to me why the f*ck would you make an game free but cant go into the performances for free. Dont waste you time on this game\n\nHelpful | 39\nDeveloper ResponseDec 22 at 10:45 PM\n\nHi GalaxyWolf2134, thanks for the review. The reason we charge users to join concerts is because they are performed by actual people on-the-spot. It is much like an actual concert venue, except artists in VARK are defined by their avatar identities, and move and talk through their avatars using motion capture technology. We want to ensure that the performers we invite on to our platform can gain profit from the concerts. Thanks for understanding!", "KrymBaltimoreDec 4 at 11:34 AM\nBooooooo!!!!!\n\nI hated this. Wasn't at all what I thought. I thought this was an app that allows users to put on their own concert. (Lol I'm sure that's completely my fault for not being able to read the info on their website). I had very limited info on it but, when I saw it was free, I figured \"what the hell,\" and downloaded it. It is single player which makes no sense for a concert. It is a anime type girl singing on stage in Japanese while you stand and watch. I was bored to tears within seconds. Still I gave it a bit longer to see if maybe I missed something and noticed that what I was watching was a free sample concert! They expected me to pay for one of these????!!!! HAHAHAHA! Never. I don't know what they were aiming for but I hope this wasn't it. Don't waste your time.\n\nHelpful | 122\nDeveloper ResponseDec 22 at 10:43 PM\n\nHi KrymBaltimore, thanks for the review. We have updated the app description on the Oculus Store to better communicate what our app is about, and the cultural background surrounding it. We hope this gives you a better understanding of the app's concept.", "NinaKuhlJan 1 at 3:33 PM\nABSOLUTELY NO!\n\nALL EVENTS CLOSED and from the \"trial\", it sucks also. Who wants to stand in front of an anime cartoon performer with a bunch of other sheep (greyed out, faceless, expressionless body forms waving glowing batons. This is by far the WORSE app that I loaded. I purchased a lot of apps over the holidays...I hope I didn't spend one dime for this anti climatic worthless app..Don't wast your money. Honestly, it does not deserve even one star. I've tried apps that were bad...this was by far the worst of the worst.\n\nHelpful | 13", "RavnicarJan 18 at 9:06 AM\nTHIS IS NOT A GAME! ITS LIVE PERFORMANCE\n\nI noticed many 1 star reviews dragging this application down and all of them seem to be confused as to what this is.\nIt is not a game. It is not a music viewer. This is to watch live performances from virtual singers and artists such as Hastune Miku, Kisuna Ai, and Kaf. Like a real concert, the performances have scheduled times, and you pay admission. There are some mild interaction like cheering and clapping and you can even purchase big interactions that everyone can see such as fireworks, or throwing flowers. That being said this is to watch a concert love with other people, so your mostly going to be in one spot, watching.\n\nPersonally I think this is a great application for a specific fan base. Most western audiences may not quite get the point, but for those who are familiar it even curious about virtual artists, it's a great (and kinda meta) way to experience seeing them live without having fly to Holo concert.\n\nHelpful | 7", "jmalmstenDec 4 at 11:11 AM\nYeah... Nope.\n\nSo at first glance it seems innocent enough. But you open it and is greeted by mystery meat navigation. A plethora of concerts by artists I've never heard of that is labled \"closed\". After fumbling around I realize it's live stream only. And because of livestreaming they are all early in the morning and somehow I was looking at events that was streamed back in april. So I stumble around some more and see that there are two events upcoming. They are sold for roughly 500 varks (yep it's a \"freemium\" title). Whatever the going rate for that is...\n\nSo I still gave it the benefit of a doubt. Tried the trial event. And that was... A generic jpop song. There are glow sticks in your hands sometimes when I bring them together they stick awkwardly to each other and make a clapping sound. The area is filled with barely moving black silhouettes lifelessly looping their animation and to top it all off the head tracking is limited to 3dof... motion sickness inducing 3dof. In a 3D polygonal world...\n\nYeah, nope. This simply is not for me. And I cannot really guess who it's for either... Because surely the jpop fanatics have better venues for these things?\n\nIt just comes off as a moneygrubbing shovelware. These platforms really need to limit these low effort freemium titles . It ruined mobile gaming and if we aren't careful they could ruin the perception of VR too.\n\nHelpful | 53\nDeveloper ResponseDec 22 at 10:44 PM\n\nHi jmalmsten :) Currently our main audience is Japanese users, hence the concert times are aligned to Japan Standard Time. The reason we charge users to join concerts is because they are performed by actual people on-the-spot. It is much like an actual concert venue, except artists in VARK are defined by their avatar identities, and move and talk through their avatars using motion capture technology. We want to ensure that the performers we invite on to our platform can gain profit from the concerts. Thanks for understanding!", "AquilnyJan 25 at 1:53 PM\nIts alright.\n\nThis is however targeting a Japanese audience but it should be spread out. The prices are high to pay the performers we know, but it will never be capable of comparing to the actual experience of a real concert making the price of it unreasonable. Although this app doesn't deserve this backlash on my own opinion. I do believe this app has a lot of potential but much improvement is needed for graphics and pricing. If you aren't happy with the app I wouldn't bother going on a rant but instead point out what you see from your perspective without going to the extreme about it. It would still take a lot of time and effort to make a game like this and I doubt many of us could do it so we should just be greatful.\n\nHelpful | 3", "RedwaireDec 6 at 5:16 PM\nVR idol dedicated live stage\n\nThis is a live stage dedicated to VR idols.\nIt is not a game or personal song delivery tool.\nIt's like Oculus Venues.\nOccasional and popular Vtuber is invited to live.\nIt is a popular software in Japan.\nHowever, it may be difficult for non-Japanese people to understand what to do.\nVery enjoyable software.\n\nHelpful | 35\nDeveloper ResponseDec 22 at 10:45 PM\n\nThanks for the review, Redwaire! Your support really means a lot to the team.", "mizkunDec 24 at 5:49 PM\nAwesome live experience!\n\nFinally I could meet with my favorite VTubers, Omega Sisters and Suzuka Utako, thanks to VARK. It cannot forget that fabulous experience. I love VARK's system named \"Gachi-koi system\".\nI don't think the price is expensive since the experience they provide cannot be exprienced with other platforms. Thanks VARK!\n\nHelpful | 9", "TwomixDec 10 at 6:35 PM\n\nA very good app for viewing VR virtual idol concerts. I think many US consumers are confused by the product hence the 1 star but how this works is essentially you buy tokens and the tokens can be redeemed to view a concert (which is live streamed). As long as you don't consume the tokens it's on your account so it doesn't get used up even if you miss the concert (unlike a real life virtual idol concert ticket which is used up whether you attended or not). And this platform allows you to view the concert from whatever view you like (no more rushing to get good seats). I can understand this may not be acceptable for some US users (which prefers to \"own the content\" and view the content at their own time and leisure). The price may also be a factor. $50-90 per show is the standard Japanese rate for these types of show (yes they're not cheap at all due to the preparation, design and programming involved). They typically last about 3 hours. Why are they expensive ? Because often shows involve trademark characters from various \"franchises\" plus the amount of work involved to bring you a wonderful and unique experience.\n\nHelpful | 16\nDeveloper ResponseDec 22 at 10:49 PM\n\nThanks for the review and explanation Twomix! We are working to communicate the concept of our application better to western audiences.", "NukemarineDec 19 at 2:41 AM\nIgnore the in app purchases\n\nGiving this three stars only as the free app. You get a five minute video which is OK. You're put is three scenes throughout with some interactive items such as waving a wand, throwing confetti, flowers, and such.\n\nIt does not have positional tracking which is weird. Also the audio from the singer is not positioned in space. Still it's free so don't expect much.\n\nIf this were a paid app it'd have zero stars. There's nothing redeeming for that.\n\nHelpful | 1", "Aaronb3434Dec 5 at 9:09 AM\nIts Ok\n\nBut the environments, graphics, details and audience can be improved. instead of having black figures as the audience, maybe have them look anime or realistic with details, actions etc . and maybe have the concerts look more like the real thing instead of less details and a void background. look forward to improvements and cool updates for the quest version.\n\nHelpful | 5\nDeveloper ResponseDec 22 at 10:50 PM\n\nThanks for the feedback, Aaronb3434! We are working to make the audience look less intimidating, along with other graphical improvements. Please look forward to updates!", "Snake0457Dec 7 at 4:39 AM\nFree to...nothing?\n\nThis free app has no content. I was excited to finally get a virtual concert app on Quest, but I dont understand the point when you have to not only pay for everything, but each event seems time limited too. The demo concert looked okay, and I imagine the paid events are better, but even if I wanted to pay for an event, upon opening it there werent even any available. At least let me pay for older concerts to rewatch whenever I want, or something.\n\nHelpful | 3\nDeveloper ResponseDec 22 at 10:52 PM\n\nHi Snake0457, thanks for the feedback! Shows in VARK are provided according to predetermined schedules, much like an actual concert venue. However, we intend to ramp up on the frequency of the shows, so please check back soon. As for rewatching older concerts, we do have plans to rebroadcast past events, and we are also considering an Archives functionality where you can watch past events anytime you want.", "kayla_kazeDec 4 at 1:13 PM\nA bad Moku Moku Dance scene player\n\nGraphically, this looks like Moku Moku Dance (the VR version of Miku Miku Dance) at low graphics settings. With that said, I'll judge it as if it was a MMD scene. Imagine you were watching someone's first attempt at making a MMD concert and the player you were using didn't allow you to change your viewpoint, but you could wave glow sticks. That's what this \"trial concert\" is. Now image how hard you'd be rolling on the ground with laughter when the creator says \"Now I want you to give me lots of money to watch more.\"\n\nHelpful | 12\nDeveloper ResponseDec 22 at 10:48 PM\n\nHi kayla_kaze, thanks for the review! Just to make sure, VARK is not a game nor an animation/music editing tool; rather, it is more like an actual concert venue, where professionally produced & staffed concerts by avatar-donning artists take place according to predetermined show schedules. Hence, much like how admission fees apply in real life concerts, we ask users to purchase tickets to join the events. (We have updated our app description to better communicate the cultural background; please take a look!) Thanks for understanding!", "cjmaster2448Dec 10 at 8:10 PM\nWhy the price\n\nGood concept\nGood execution\nBUT WHAT IS WITH THE PRICE LIKE CHRIST\n\nIf it was like 5 bucks for a concert then yea it would be great but 50 bucks on average is just insane like why\n\nHelpful | 5", "SwordboyDec 16 at 12:46 PM\nWaste of time.\n\nVirtual experience like this are hardly a 'live concert'. First of all mostly Japanese music is what I'm seeing and not much free content there. This dressed up doll anime girl thing won't do it for 95% of the vr population. And having to pay for basic functions, such as the popcorn and fire crackers? What the? Who would pay for something that should just be included? This is just an expensive 'free-mium' version of YouTube with very limited capabilities. Don't waste your time with this one.\n\nHelpful | 2", "dingofoxvrfoxDec 9 at 10:46 PM\nBoo this garbage should be removed\n\nFirst this game is plagiarizing the hasu miku game and trying to charge 50.00 a pop for what they call a live streaming concert which is bull crap this title should be removed from the oculus store and the developer fined for copyright violations and illegal mis appropriation of funds this is completely garbage dont download and the details lie in the store it doesnt mention in the details that it costs 50.00 u.s per concert even Japanese Americans are not that stupid to buy this\n\nHelpful | 6\nDeveloper ResponseDec 22 at 10:51 PM\n\nHi dingofoxvrfox. First of all, we want to make clear that we are not violating any copyrights - We have signed contracts with all the companies and artists for them to appear within the app with their names and appearances. The reason we charge users to join concerts is because they are performed by actual people on-the-spot. It is much like an actual concert venue, except artists in VARK are defined by their avatar identities, and move and talk through their avatars using motion capture technology. We want to ensure that the performers we invite on to our platform can gain profit from the concerts.", "PurpleTripod10Dec 8 at 10:50 AM\nNot worth it\n\nJust starting off by saying that the prices are absurd. The lowest price is probably around 40-50$ U.S. dollars. Everything is so badly detailed its not worth looking at, the only good thing about the concert was the singer themselves(the demo concert). Anything besides that is straight up bad. The mechanics are awkward and the environment is poorly made almost as if it was copied and pasted with 0 effort. How did this get even allowed to be in the oculus quest?\n\nHelpful | 1\nDeveloper ResponseDec 22 at 10:52 PM\n\nHi PurpleTripod10, thanks for the feedback. The reason we charge users to join concerts is because they are performed by actual people on-the-spot. It is much like an actual concert venue, except artists in VARK are defined by their avatar identities, and move and talk through their avatars using motion capture technology. We want to ensure that the performers we invite on to our platform can gain profit from the concerts. That said, we do have plans to host free or more affordable events (10-20USD), so please check back soon.", "Tacocat4642Mar 31 at 2:51 PM\nAwesome app\n\nVery well designed, and good graphics. Really immersive! However I wish that there was more free content. As a point of improvement, I would change the clap mechanic to be with motion and not by hitting the grip buttons (which is kinda annoying)\n\nHelpful | 0", "jamie.sparrow.00Dec 8 at 3:38 AM\nIs this really free?\n\nThis doesn't actually count as a free game surely? More like a demo free as if you want to listen to anything other than the trial you have to pay for it. You're watching a concert that isn't in English but I assumed you could do a bit more but that's not possible. Maybe if you pay but I wasn't willing to pay out for something that the trial showed as a very boring experience. Sadly this is not worth the space on your vr.\n\nHelpful | 0", "LoneRunner907Dec 6 at 3:21 PM\nRIP OFF\n\nThe only way to watch a concert you need to pay 500 Vark coins which equals $50! For one virtual concert, at a specific time, WE ARE NOT MADE OF MONEY. There is a trial concert but it got boring after the first song.\n\nHelpful | 5", "Boltz_N_BulletzDec 15 at 1:22 AM\nEeew... microtransactions everywhere!\n\nCant enjoy this app without throwing money at it! And it has its own currency system too. U gotta buy there so called credits to watch a show... jeez, ive saved more money in a strip club!\n\nHelpful | 1", "Roku-hokageDec 5 at 12:32 PM\nSad\n\n4990 (50$) for a ticket ..\n\nto see a virtual show...\n\nat a specific time and date....\n\n... once ....\n\nNot gonna hapen...\n\nHelpful | 13\nDeveloper ResponseDec 22 at 10:47 PM\n\nHi Roku-hokage, thanks for the review! The reason we charge users to join concerts, and concerts take place at specific times, is because they are performed by actual people on-the-spot. It is much like an actual concert venue, except artists in VARK are defined by their avatar identities, and move and talk through their avatars using motion capture technology. We want to ensure that the performers we invite on to our platform can gain profit from the concerts. Thanks for understanding!", "RedwolfieDec 5 at 2:35 PM\nHorrible\n\nWhy does it start with you only having 0 coins to see a concert like why do u need coins to see the concert things and its just dumb like make it where everything is free and u can see the concert and not waste money on the coins\n\nHelpful | 3", "Mjr-MunkfishDec 7 at 4:40 PM\nHmmm\n\nEver wanted to be one of those sad, lonely, Tokyo men with glow wands, getting wet over schoolgirls singing, then get this. If your a normal person save yourself the bother lol\n\nHelpful | 2", "furtinDec 10 at 2:45 PM\nShouldnt be in the Oculus store!\n\nReally, why is this on the Quest?\n\nHelpful | 3", "GiantRobot115Dec 13 at 11:24 AM\nI hate it\n\nThis app sucks pp sub to epic pp man\n\nHelpful | 3", "Indigo-04Dec 10 at 11:11 PM\nYou must pay\n\nYou are forced to pay money if you want to use it\n\nHelpful | 2", "mavado22Dec 9 at 1:25 PM\n\nPay to play I dont think so.\nNot es hat I thought the game it was \n\nHelpful | 1", "ArmisisMar 9 at 6:35 PM\nReally?\n\nIdiots pay for that nonsense? What's wrong with this world...\n\nHelpful | 0", "hammerdinniiDec 15 at 2:55 PM\nBad\n\nJust it sooo bad\n\nHelpful | 1", "SparrowsunJan 2 at 6:46 AM\nTo those who think this was just a game.\n\nI'm sure a good few of you hopped into this thinking\n'This is a neat *game* that you can watch on'\nCause that's what a few of the reviews I've seen have essentially said.\n\nWhat I'm getting from this, and the description that clearly says what it is.. it's obvious.\n\nThink of it like a live concert. You don't get in for free, hence why you need to pay to attend these live performances. You're most likely only stuck on one spot because they only have one camera that is enabled for this type of software. If you thought you were going to get the stage with Miku, you thought wrong.\n\nThis is nice for folks that can't go to see it in person, but still basically are, since they're Vocaloids and whatnot performing.\n\nHelpful | 2", "vrgamer228Dec 6 at 9:43 AM\nDon't even bother\n\nIt's just bad\n\nHelpful | 2", "FadedFelixDec 6 at 1:17 PM\nSHOVELWARE FREEMIUM CRAP. NO!\n\nJust no! Oculus, remove this junk from your store. Protect your console and act like you care about the user experience.\n\nHelpful | 7\nDeveloper ResponseDec 22 at 10:50 PM\n\nHi FadedFelix, thanks for the review. We have updated the app description on the Oculus Store to better communicate what our app is about, and the cultural background surrounding it. We hope this gives you a better understanding of the app's concept.", "agitokazuDec 12 at 5:50 PM\nTerrible\n\nHow was the app allowed in the store!\n\nHelpful | 2", "Krusty_Dec 8 at 12:40 PM\nHastune miku\n\nDominos and hatsune milu\n\nHelpful | 2", "King-BDec 8 at 5:23 AM\nHow has this made it on to oculus store?\n\nJust no.\n\nHelpful | 3"]