{"App Title": "Virtual Virtual Reality", "App description": "In the near future, what is the purpose of humanity? Activitude, the Virtual Labor System, is here to help. Your artisanal human companionship is still highly sought by AI clients. Strap on your headset. Find your calling.\n\nPssst. . .  \nSure, you could function like a therapy dog to an AI in Bismarck and watch your work ratings climb, but dont you yearn for something more: adventure, conflict, purpose? Escape behind the scenes of Activitude by putting on VR headsets to jump between realities, or vacuum up the world around you with your Activitude Brand Poly Cleanup Tool! Outrun Chaz, your manager, as he attempts to boot you out PERMANENTLY. Along the way, uncover the deeper story of Activitudes evolution from VR start-up to the human purpose provider it is today.\n\nFeatures\n 50+ explorable virtual virtual realities\n Edible virtual snacks in the break room\n State of the art whale simulation\n An artichoke screams at you", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Casual, Exploration, Narrative", "Languages": "English, Chinese (Hong Kong), Chinese (Taiwan), French (France), German, Italian, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "1.8.13", "Developer": "Tender Claws", "Publisher": "Tender Claws", "Website": "https://tenderclaws.com/vvr", "Release Date": "May 21, 2019", "Developer Privacy Policy": "TENDER CLAWS PRIVACY POLICY\n\nLast Updated:April 25th, 2018\n\nTender Claws, LLC (\"we\" or \"us\") makes interactive products for personal entertainment. Collectively, we describe our products and servicesincluding our websites, content, and software productsas our \"Services.\" This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services.\n\nBy visiting or using our Services, you consent to the practices described in this Privacy Policy. If you have questions about this Privacy Policy, please contact us at info@tenderclaws.com\n\nPlease be advised that your use of our Services may also be subject to additional privacy policies created by the software platform (the Software Platform) that you use to access our Services, which could include, without limitation, any of the following policies:\n\nThe Oculus Privacy Policy: https://www.oculus.com/legal/privacy-policy/\n\nThe Steam Privacy Policy Agreement: http://store.steampowered.com/privacy_agreement/\n\nThe Google Privacy Policy: https://www.google.com/policies/privacy/\n\nThe Samsung Privacy Policy: http://www.samsung.com/us/common/privacy.html\n\nNOTICE: If you are curious about our privacy policy with respect to our project Tendar, please click here.\n\nI. What kind of information is collected?\n\nDepending on which Services you use, we collect different kinds of information from or about you, such as:\n\nInformation You Give Us. We collect the information you give us when using our Services. For example:\n\nWhen you start using our Services, we may gather information that you provide to the applicable Software Platform in accordance with that Software Platforms privacy policies.\nIf you buy something on or through our Services, we will connect you directly to our payment gateway.While we dont have access to the information you provide for that transaction, we might serve as a conduit of that information through our Software Products and servers.\nWhen you communicate with us, you may provide us with information that you voluntarily provide, like your email address.\n\nInformation Automatically Collected About You When You Use Our Services. We also collect information automatically when you use our Services. Depending on how you access and use our Services, we may collect information such as:\n\nInformation about your interactions with our Services, like the duration of a session;\nInformation about how you access our Services, including information about the type of device you're using (such as a headset, PC, or mobile device), your browser or operating system, your Internet Protocol (\"IP\") address, and certain device identifiers that may be unique to your device;\nInformation about content or other apps installed on your device or provided through our Services;\nLocation information, which can be derived from information such as your device's IP addressand device settings;\nInformation about your physical movements and dimensions when you use a virtual reality headset; and\nInformation collected by third-party service providers and Software Platformsabout you through the Services, as described elsewhere in this Privacy Policy.\n\nInformation from other sources. We may also receive additional information about you from third parties, including partners that provide us information that is publicly or commercially available, and may combine that information with the other information we collect about you.\n\nII. How do we use information?\n\nWe use the information to do a number of things that help us provide our Services to you and our partners. Here are some examples:\n\nTo provide our Services. We use the information we collect to provide you with the Services you use or request. For example, we use this information to:\n\nProvide you with content, games, apps, and other experiences;\nCreate accounts and user profiles;\nCommunicate with you about our Services, including updates and new Services;\nEnable user-to-user communications;\nProvide technical support;\nNotify you about updates to our Services;\nCustomize your experiences based on your online activities, including the content, games, apps, and other experiences you interact with; the other online services you use; and other information we collect; and\nImprove and develop your experience.\n\nWe also use the information we collect to understand and improve our Services and to develop content for virtual reality, augmented reality, and mixed reality. For example, we may use the information to:\n\nSolicit and analyze input and feedback about our Services;\nIdentify and address technical issues on our Services; and\nConduct and learn from research about the ways in which people use our Services.\n\nTo promote safety and security. We use the information we collect to help promote safety and security, such as by investigating suspicious activity or violations of our terms or policies and protecting our or others' rights or property.\n\nIII. Who can get information about me?\n\nOur Services help you engage with the content in virtual reality, augmented reality, and mixed reality and others that interact with that content. To provide and support our Services, information we have about you may be shared in certain circumstances. Here is who can see information about you when you and others use our Services.\n\nPublic Information. Certain information you post to our servers or in a profile hosted by the applicable Software Platform, such as your username and avatar, will be public and visible to people on and potentially off our Services.\n\nService providers. We may share the information we collect with vendors, service providers, researchers and other partners (including the applicable Software Platform), who work in partnership with us to support the Services (such as hosting our Services, analyzing the way people use our Services, providing customer service, or sending electronic communications for us).\n\nOther parties in connection with certain business transactions. In the event that the ownership of Tender Claws, LLC (or any portion of our assets) changes as a result of a merger, acquisition, or in the event of a bankruptcy, information from or about you or your device may be transferred to another company.\n\nConsent. We may share information about you for any other purpose for which you give us your consent.\n\nWe may also share de-identified or aggregate data with others for any purpose. De-identified data means information where we have removed your name or contact information. Aggregate data is data that has been combined with other data so that it doesn't identify any specific person.\n\nResponding to legal requests and preventing harm. We may access, preserve and share information in response to a legal request (like a search warrant, court order or subpoena) if we have a good faith belief that the law requires us to do so. This may include responding to legal requests from jurisdictions outside of the United States where we have a good faith belief that the response is required by law in that jurisdiction, affects users in that jurisdiction, and is consistent with internationally recognized standards. We may also access, preserve and share information when we have a good faith belief it is necessary to: detect, prevent and address fraud or other illegal activity; to protect us, our Services, you and others, including as part of investigations; or to prevent death or imminent bodily harm. Information we receive about you, including financial transaction data related to purchases made on or through our Services, may be accessed, processed and retained for an extended period of time when it is the subject of a legal request or obligation, governmental investigation, or investigations concerning possible violations of our terms or policies, or otherwise to prevent harm. We also may retain information from accounts disabled for violations of our terms for at least a year to prevent repeat abuse or other violations of our terms.\n\nThird Parties that Provide Content, Marketing, or Functionality on Our Services. Some of the content, marketing, and functionality on our Services may be provided by third parties that are not affiliated with us. For example, we work with companies that help us understand how people use our Services.\n\nOther companies may collect information on or through our Services to market to you on or off of our Services. These and other third parties may collect information about your use of our Services, including through the use of cookies, device IDs, local storage, pixels and other technologies, and this information may be collected over time and combined with information collected on different websites and online services.\n\nIV. Security\n\nPlease note that no data transmission or storage can be guaranteed to be 100% secure. As a result, while we strive to protect the information we maintain, we cannot guarantee or warrant the security of any information you disclose or transmit to our Services and cannot be responsible for the theft, destruction, or inadvertent disclosure of information.\n\nV. International Users\n\nWe are based in the United States, and, regardless of where you use our Services or otherwise provide information to us, the information may be transferred to and maintained on servers located in the U.S. or other countries. Note that the laws, regulations and standards of the country in which this information is stored may be different from your own country. By using our Services, you consent to this collection, transfer, storage, and processing of information to and in the U.S. and other countries.\n\nVI. Changes to this Privacy Policy\n\nIf we make changes to this Privacy Policy, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address you've provided, providing notice through the Services, and/or updating the \"Last Updated\" date at the top of these Terms.\n\nVII. Contacting Us; Data Access and Deletion\n\nIf you have any questions about this Privacy Policy, or if you would like to deactivate or delete your account or access data associated with it, please contact us at info@tenderclaws.com. Content deleted from the Services may remain in backup copies and logs for a period of time.", "Developer Terms of Service": "END USER LICENSE AGREEMENT\n\nLast Updated: April 25th, 2018\n\nBy installing, copying, or otherwise using a software product (a Software Product) developed by Tender Claws, LLC (Developer, we, or us), you are accepting the terms of this End User License Agreement (this EULA or these Terms) in connection with that Software Product. We are delighted to provide you access to the Software Product you downloaded for your personal use. Before installing a Software Product, please make sure that your computer meets the minimum technical specifications for the proper operation of the Software Product.\n\nYour use of a Software Product is also subject to the applicable terms of use and privacy policies for the platform or store where you downloaded the Software Product (the Software Platform), which could include, without limitation, any of the followingagreements:\n\nThe Oculus Terms of Service: https://www.oculus.com/legal/terms-of-service/;\n\nThe Steam Subscriber Agreement: http://store.steampowered.com/subscriber_agreement/;\n\nThe Google Terms of Service: https://www.google.com/intl/en/policies/terms/; and\n\nThe Samsung VR Terms of Service: https://samsungvr.com/portal/content/tos.\n\nThis EULA does not modify the applicable terms and conditions of using the Software Platform.\n\nBY ACCEPTING THIS EULA, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THIS EULA IN ITS ENTIRETY.\n\nTHIS EULA CONTAINS IMPORTANT TERMS AND CONDITIONS THAT AFFECT YOU AND YOUR USE OF THE SOFTWARE PRODUCT, INCLUDING, UNLESS YOU CHOOSE TO OPT OUT, A PROVISION REGARDING BINDING ARBITRATION OF DISPUTES (OTHER THAN CERTAIN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) AND A WAIVER OF CERTAIN RIGHTS TO JURY TRIALS AND/OR CLASS ACTIONS.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SOFTWARE PRODUCT WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THIS EULA. MAKE SURE TO REVIEW THIS EULA WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nWe reserve the right to change or modify this EULA on a going-forward basis at any time and in our sole discretion. If we make changes to this EULA, we will provide notice of such changes as appropriate, such as by sending an email notification to the address youve provided, providing notice through the Software Product and/or updating the \"Last Updated\" date at the top of these Terms. Your continued use of the Software Product will confirm your acceptance of the revised EULA. If you do not agree to the revised EULA, you must stop using the Software Product. We encourage you to review this EULA from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Software Product.\n\nThis agreement was written in English (US). To the extent any translated version of this agreement conflicts with the English version, the English version controls.\n\n1. Your Use of the Software Product\n\n1.1Software Product License. We hereby grant you a limited, non-exclusive, non-sublicensable license to access, install, and use the Software Product solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software, except as expressly permitted by Developer or as permitted under applicable law. Any unauthorized use of the Software Product is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n1.2Third-Party Content. Your use of services, applications, or content provided by third parties made available through the Software Product (Third Party Content) may be subject to additional end user agreements. Developer has no responsibility or liability with respect to your access to or use of the Third Party Content, or any content or functionality contained in such Third Party Content, your rights to which are solely provided pursuant to a license between you and the provider of such Third Party Content. In no event shall Developer or the applicable Software Platform be considered the licensor of the Third Party Content, to have granted any rights to use the Third Party Content, to have assumed any obligations with respect to the Third Party Content, or to have made any representations or warranties with respect to the Third Party Content.\n\nIf you are not presented with an end user license agreement when you acquire access to Third Party Content, the following license terms apply to your use of such Third Party Content: (a) the third party providing the Third Party Content (and not Developer or the Software Platform) is the licensor of such Third Party Content; (b) such party grants you a limited, nontransferable license to access and use the Third Party Content only for your personal and noncommercial purposes; and (c) you may not modify, reproduce, decompile or disassemble the Third Party Content in whole or in part, or create any derivative works from or sublicense any rights in or to the Third Party Content, unless otherwise expressly authorized by the third party or as permitted under applicable law.\n\n1.3Trial Access to Software Product. We may offer free trials or other limited versions of the Software Product so you can preview the Software Product before you purchase the full version. These versions may have limited features, restrict permitted time of use and contain other limitations.\n\n1.4Availability of Software Product after Purchase; Updates. The Software Product may rely on services provided by third parties for some or all of its functionality. The Software Product may not function properly or may become inoperable if these third parties discontinue their services.\n\n1.5Support. The Software Platform, and not Developer, will be responsible for all billing questions related to the purchase of the Software Product and for support with respect to the Software Platform. Developer, and the not the Software Platform, will be responsible for all support obligations relating to the Software Product, including but not limited to customer support, bug fixes, live operations support, and general technical support. Neither Developer nor the Software Platform is obligated to provide support for Third Party Content. You acknowledge that we are under no obligation to update or patch a Software Product.\n\n1.6Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Software Product, and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\n2. Software Product Purchases\n\n2.1Purchasing Software Product from Software Platform. If the Software Product is a paid product, the license granted to you under this EULA is conditioned upon your valid purchase of the Software Product pursuant to the applicable Software Platform terms and conditions of purchase.\n\n2.2Content Transactions. You may have the ability to purchase digital content through the Software Product. You also may have the ability to purchase additional or enhanced functionality or media content within a Software Product (collectively, In-App Purchases). Any content developed by us that we provide through In-App Purchases is subject to the licenses, terms, and conditions stated in this EULA. Except as described in these Terms, we have no responsibility for any transactions you enter into with a third party for Third Party Content and assume no liability for Third Party Content.\n\n2.3Virtual Items. Your purchase of a virtual item or in-game currency within the Software Product is a payment for a limited, non-assignable license to access and use such content or functionality in the Software Product. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Software Product can only be used in connection with the Software Product where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Software Product for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n3. Acceptable Use\n\nBy accessing or using the Software Product, you agree that you will not: (a) access or use the Software Product in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Software Product, including, but not limited to, defamatory, harassing, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content; (b) damage, disable, overburden or impair the functionality of the Software Product in any manner; (c) access or use the Software Product for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates these Terms, community standards or any other terms or policies provided in connection with the Software Product; (d) use or attempt to use another users account without authorization from such user; (e) modify, adapt, hack or emulate the Software Product; (f) use any robot, spider, crawler, scraper or other automated means or interface not provided or authorized by us to access the Software Product or to extract data; (g) circumvent or attempt to circumvent any filtering, security measures or other features designed to protect the Software Product, or third parties; and (h) infringe upon or violate the rights of Developer, our users, or any third party. Notwithstanding the foregoing, we reserve the right to revoke or reduce your access to any multiplayer functionality in our Software Products at any time, with or without cause.\n\n4. User Content\n\nOur Software Product may include interactive features and areas where you may submit, post, upload, publish, email, send, or otherwise transmit content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, User Content). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. By submitting User Content through the Software Product, you grant Developer a worldwide, irrevocable, perpetual (i.e. lasting forever), non-exclusive, transferable, royalty-free and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform and distribute such User Content in connection with the Software Product. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content.\n\nYou are solely responsible for the User Content you make available through the Software Product and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Developer the rights specified in this section; and (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations.\n\nDeveloper does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Developer has no responsibility or liability for User Content made available through the Software Product, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\n5. Privacy Policy\n\nOur Privacy Policy, which is available at http://tenderclaws.com/privacy/PrivacyPolicy.htmlis incorporated into these Terms and sets forth how we treat data, including how we collect, use and disclose information.\n\nIn addition, certain third parties (such as the applicable Software Platform, developers of Third Party Content, and the manufacturers of your computer, mobile phone or other devices) may collect information about you when you use the Software Product. These third parties have their own privacy policies and will treat the information they collect about you according to these policies. We encourage you to review these privacy policies before providing any information to third parties. We are not responsible for the accuracy of any third partys privacy policy or for ensuring that third parties comply with their privacy policies.\n\n6. Ownership and Intellectual Property\n\nUnless otherwise indicated, the Software Product is the property of Developer or its licensors and is protected by copyright, trademark and other laws of the United States and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark, or other proprietary rights notices incorporated in or accompanying the Software Product.\n\nTender Claws and the Tender Claws logo (the \"Developer Marks\") are trademarks or registered trademarks of Tender Claws, LLC. The Developer Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, including as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder.\n\n7. Feedback\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials, or other information about Developer and our Software Products (collectively, Feedback). You agree that Developer and its affiliates shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n8. Copyright Complaints\n\nIn accordance with the Digital Millennium Copyright Act (DMCA) and other applicable laws, we have adopted a policy of terminating, in appropriate circumstances and in our sole discretion, accounts of users who are deemed to be repeat infringers. We may also, in our sole discretion, limit access to the Software Product and/or terminate the accounts of any users who infringe any intellectual property rights of others, whether or not there is any repeat infringement.\n\nIf you believe that anything on or available through the Software Product infringes upon any copyright which you own or control, you may file a notification of such infringement with our Designated Agent as set forth below:\n\nPhilip F Weiss PLLC\n\nphil@philweisslaw.com\n\nPlease see 17 U.S.C. 512(c)(3) (available athttp://www.copyright.gov/title17/92chap5.html#512) for the requirements of a proper notification. If you knowingly misrepresent in your notification that the material or activity is infringing, you will be liable for any damages, including costs and attorneys' fees, incurred by us or the alleged infringer as the result of our relying upon such misrepresentation in removing or disabling access to the material or activity claimed to be infringing.\n\n9. Disclaimers\n\n15.1 WE MAY PROVIDE HEALTH AND SAFETY WARNINGS IN CONNECTION WITH A SOFTWARE PRODUCT. YOU REPRESENT AND WARRANT THAT YOU WILL READ ALL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS WE PROVIDE BEFORE USING THE SOFTWARE PRODUCT.\n\n15.2 YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SOFTWARE PRODUCT IS AT YOUR SOLE RISK. AS BETWEEN YOU AND DEVELOPER, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS AND DEVELOPER EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES, AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, DEVELOPER DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS; (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY DEVELOPER WILL CREATE A WARRANTY. THE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\n10. Indemnification\n\nYou agree to defend, indemnify and hold harmless Developer and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, Developer Parties) from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Software Product; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Developer, the Software Platform, or a third party in relation to the Software Product, (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\n11. Limitation of Liability\n\nTHE DEVELOPER PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SOFTWARE PRODUCT, EVEN IF A DEVELOPER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE DEVELOPER PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SOFTWARE PRODUCT EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SOFTWARE PRODUCT. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU. NOTWITHSTANDING ANYTHING TO THE CONTRARY IN THESE TERMS, NOTHING IN THESE TERMS EXCLUDES OR LIMITS OUR LIABILITY FOR FRAUD OR FOR DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE.\n\n12. Dispute Resolution\n\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO SUBMIT TO BINDING ARBITRATION (JURY TRIAL WAIVER) OF ANY AND ALL DISPUTES (OTHER THAN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) WITH DEVELOPER AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM DEVELOPER (NO CLASS ARBITRATIONS, CLASS ACTIONS OR REPRESENTATIVE ACTIONS OR ARBITRATIONS).\n\n12.1Binding Arbitration; Disputes; Small Claims.You and Developer agree to waive any right to a jury trial, or the right to have any Dispute resolved in any court, and instead accept the use of binding arbitration (which is the referral of a Dispute to one or more impartial persons for a final and binding determination); provided, however, that you have the right to litigate any Dispute in small claims court, if all the requirements of the small claims court, including any limitations on jurisdiction and the amount at issue in the Dispute, are satisfied. You agree to bring a Dispute in small claims court in Los Angeles County, California. Dispute as used in this Section 12means any dispute, cause of action, claim, or controversy arising out of or in any way related to Developer, these Terms, the subject matter of these Terms, or access to and use of the Software Product, including but not limited to contract, personal injury, tort, warranty, statute or regulation, or other legal or equitable basis and disputes that involve third parties (such as developers of Third Party Content), except any dispute, cause of action, claim, or controversy relating to Developers intellectual property (such as trademarks, trade dress, domain names, trade secrets, copyrights, and/or patents). You and Developer empower the arbitrator with the exclusive authority to resolve any dispute relating to the interpretation, applicability or enforceability of these terms or formation of this contract, including the arbitrability of any dispute and any claim that all or any part of these terms are void or voidable.\n\n12.2No Class Arbitrations, Class Actions or Representative Actions.You and Developer agree that any Dispute is personal to you and Developer, and that any Dispute shall only be resolved by an individual arbitration and shall not be brought as a class arbitration, a class action, or any other representative proceeding. Neither party agrees to class arbitration, or an arbitration where a person brings a Dispute as a representative of any other person or persons. Neither you nor Developer agree that a Dispute can be brought as a class or representative action whether inside or outside of arbitration, or on behalf of any other person or persons.\n\n12.3Federal Arbitration Act. You and Developer agree that these Terms affect interstate commerce and that the enforceability of this Section 12shall be governed by, construed, and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (FAA) to the maximum extent permitted by applicable law.\n\n12.4Confidentiality. The arbitrator, Developer, and you shall maintain the confidentiality of any proceedings, including but not limited to, any and all information gathered, prepared, and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator shall have the authority to make appropriate rulings to safeguard that confidentiality, unless the law provides to the contrary.\n\n12.5Process. Our goal is to resolve claims fairly and quickly. Accordingly, for any Dispute that you have against Developer, you agree to first contact Developer and attempt to resolve the claim informally by sending a written notice of your claim (Notice) to Developer. The Notice to Developer must be sent by certified mail addressed to: 4111 W Sunset Blvd #550 Los Angeles, CA 90029. The Notice must (a) include your name, residence address, and the email address and/or mobile telephone number associated with your account; (b) describe the nature and basis of the claim; and (c) set forth the specific relief sought. If you and Developer cannot reach an agreement to resolve the claim within 30 days after such Notice is received, then either party may, as appropriate in accordance with this Section 12, commence an arbitration proceeding or file a claim in court. You and Developer agree that any Dispute must be commenced or filed within one (1) year after such claim arose; otherwise, the Dispute is permanently barred.\n\nIn the event that you and Developer cannot resolve a Dispute and you do not pursue your claims through small claims court, you or Developer shall promptly submit the Dispute to binding arbitration at the office of the American Arbitration Association (AAA). In the event AAA declines or is unable to administer the arbitration, you and Developer agree to use an arbitration forum or arbitrator that you and Developer mutually agree upon. If, after making a reasonable effort, you and Developer are not able to agree upon an arbitration forum or arbitrator, AAA or a court having proper jurisdiction will appoint an arbitration forum or arbitrator. The arbitration will be conducted in accordance with the AAA Consumer Arbitration Rules (AAA Rules) then in effect. The AAA Rules and other information about AAA and arbitration are readily available athttp://www.adr.org, by calling 1-800-778-7879, or by mail at 120 Broadway, Floor 21, New York, NY 10271. By entering into these Terms, you either (1) acknowledge that you have read and understand the AAA Rules or (2) waive reading the AAA Rules and waive any claim that the AAA Rules are unfair in any way. You and Developer agree that these Terms govern the arbitration, and that the applicable AAA Rules shall be subject to changes in procedures that AAA may make from time to time.\n\nAs limited by the FAA, these Terms, and the applicable AAA Rules, the arbitrator will have the exclusive power and jurisdiction to make all procedural and substantive decisions concerning the Dispute; provided, however, that this power does not include the power to conduct a class arbitration or a representative action, which is prohibited by these Terms (as stated above). The arbitrator may only conduct an individual arbitration, and may not consolidate more than one persons claims and may not preside over any form of representative or class proceeding, or any proceeding on behalf of or involving more than one person or persons.\n\nUnless the arbitrator finds the arbitration was frivolous or brought for an improper purpose, you and Developer will equally share in all filing, AAA, and arbitrators fees and expenses.\n\n12.6Right to Opt Out. You may opt out of this agreement to arbitrate. If you do so, neither you nor Developer can require the other to participate in an arbitration proceeding. To opt out, you must notify us in writing within thirty (30) days of the date that you first became subject to this arbitration provision, and must include your name and residence address, and a clear statement that you want to opt out of this arbitration agreement. Any requests to opt out must be sent to: 4111 W Sunset Blvd #550 Los Angeles, CA 90029.\n\nUnless you choose to opt out, this dispute resolution provision in Section 12shall survive termination of these Terms.\n\n13. Governing Law\n\n13.1 Developer is based in the United States and our Software Products are subject to U.S. law. We make no representations or warranties that the Software Product is appropriate or available for use in other locations.\n\n13.2 The laws of the State of California, excluding its conflicts of law rules, govern your access to and use of the Software Product. Your access to and use of the Software Product may also be subject to other local, state, national or international laws.\n\n13.3 To the extent the provisions in Section 12do not apply, you further agree that all disputes, causes of action, claims, or controversies arising under these Terms that cannot be settled through informal negotiation will be resolved exclusively in the state and federal courts located in Los Angeles County, and you agree to submit to the personal jurisdiction of such courts for the purposes of litigating all such claims.\n\n14. Modifications to the Software Product\n\nDeveloper reserves the right to change, suspend, remove, discontinue or disable access to the Software Product or particular portions thereof, at any time and without notice. In no event will Developer be liable for the removal of or disabling of access to any portion or feature of the Software Product.\n\n15. Termination\n\nWe reserve the right to terminate your right to access and use the Software Product if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\n16. Severability\n\nIf any provision of these Terms shall be deemed unlawful, void or for any reason unenforceable, then that provision shall be deemed severable from these Terms and shall not affect the validity and enforceability of any remaining provisions.\n\n17. Assignment\n\nYou may not assign these Terms or any of the rights granted hereunder without the prior written consent of Developer, and any attempted assignment without such consent shall be void. Subject to the foregoing restriction, these Terms will be fully binding upon, inure to the benefit of, and be enforceable by us and our respective successors and assigns.\n\n18. Nonwaiver\n\nAny failure by Developer to insist upon or enforce performance by you of any of the provisions of these Terms or to exercise any rights or remedies under these Terms or otherwise by law will not be construed as a waiver or relinquishment of any right to assert or rely upon the provision, right or remedy in that or any other instance; rather, the provision, right or remedy will be and remain in full force and effect.", "Space Required": "514.1 MB"}



["5 stars\n80%\n4 stars\n11%\n3 stars\n5%\n2 stars\n2%\n1 star\n2%", "PeakBreak911375Jul 11 at 8:03 PM\nthe best game Ive played on the quest!\n\nAt first I admit I thought that this game was gonna be just your average oculus quest game but then I went in and... wow the game has a lot of things to do in it at least 3 days.. for me atleast.. and when you buy this game I EXTRA PROMISE you will NOT regret it.\nThis game is just great and I love it\n\nHelpful | 87", "Mattplus097 days ago\nDone Buying Quest Software!\n\nThis is intelligent software design and a fair price!\n\nGoing back to PSVR on PS5...\n\nI won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\n\nHelpful | 6", "ErinDorgsJul 21 at 1:36 PM\nSavour it while you can!\n\nThis game is a masterpiece. I actually stopped playing it at times just to savour it - its that good. You know when you start to read/watch/play/listen to something and you think - Im going to wish this was all new to me when its over - this is one of those for me. And if you like funny, colourful dystopian, creepy, hilarious & terrifying worlds - you will not be disappointed!\nSavour it while you can, youre going to miss when it was new to you!\n\nHelpful | 17", "MenNoIronJul 21 at 2:28 PM\nGreat Fun\n\nVerry fun game with a nice plot. At the end you, sort of, know what happened to... Everything.\nOr do you?\nI ayed through it in two sessions. (About 2  hours or so total) whitch is rather short.\nReplayability isn't great because you have seen most scenes multiple times allready the first time. So \"only\" 4 stars.\nWould be 5 if it were twice as long with twice the amount of different scenes.\n\nI had great fun.\n\nHelpful | 12", "TheSpyHunt3rMay 29 at 3:13 PM\nA Delightful, Trippy Fun Time\n\nThis was the first Virtual Reality game I purchased. To this day, it remains one of my favorite experiences with Virtual Reality. It is a hilarious adventure with a fun twist of donning varying Virtual Reality headsets... while playing on a Virtual Reality headset. If you like games with puzzles and humor like Portal, you'll love Virtual Virtual Reality. Just stay away from Butter. Butter is weird. And yes, until you play the game, this part of the review is going to sound really weird. Lol.\n\nHelpful | 52", "MistaTeeJay6 days ago\nWow.\n\nI dont really no what to say but... wow... that game was good. I remember playing it at my friends house a couple months before I actually got a quest and this game, and I thought it was this super happy and casual vr game. But uh... well... play this game. Youll find out.\n\nHelpful | 0", "bennybooquestJun 25 at 2:10 PM\n100 percent worth time and money\n\nThe game is not short in any sense, which is what I love. The game took me a week or so to finish, which is a lot. There are many secrets and a ton of freedom. The game is super well done, music and graphics. As far as I know, there are multiple endings.\nThe game starts off goofy and fun, and then you start to see secrets and interesting things. This game is one of my favorites, if not my favorite. You should totally buy this.\nMINOR SPOILER HERE\nIt honestly gave me goosebumps haha. Not scary either though, just creepy and interesting. You have a choice to reset the system yada yada.. or continue being a good person and do what you do. This game is sick. Totally worth time and money.\n\nHelpful | 9", "B3ARUSHA13 days ago\nEerie\n\nIt's hard to explain my experience, something about it just makes you feel connected. I wish the game could go on forever. There were multiple times where I had chills and my spine was tingling, never felt that in vr. It's a game you have 2 experience to understand I don't think a review can explain the feelings u get. It's eerily deep and of course ur own mind will determine how deep this experience will be 4 u. I enjoyed every min.\n\nHelpful | 0", "Mackattack200617 days ago\nThis is one of the best Quest games\n\nThis game is so much fun, has a lot of content, a good story, comedy and a bit creepy. The clients in the game are so much fun and the game has a dark story as well. There is something called a butter loop where your only client is a giant talking stick of butter but once you get past that the game is much more fun. The ending is really good to. I nearly cried. This is a must buy. Took me a week to finish. I definitely recommend.\n\nHelpful | 0", "ummwhatsure19 days ago\nTrippy good fun\n\nThis games is excellent! Probably the most produced looking game the quest has to offer! The graphics and art style work together perfectly. This is the kind of vr game i wish other developers looked to. Meaning, a game that could not be played or experienced on a flat screen.\n\nIf you don't have it then you are really missing out on what VR can do.\n\nHelpful | 0", "YungTweakJul 17 at 2:49 PM\nTheres more than meets the eye\n\nGreat game with simple visuals and a complex, twisted story. Honestly got chills at times, had to stop and read a walkthrough to get past the infinite butter cycle - but after finishing, Im glad I decided to play this well thought out adventure.\n\nHelpful | 3", "wheatley2.05 days ago\nFantastic freedom of choice\n\nThis game is amazing it really feels like you're playing it yourself with nothing forcing you to play one particular plot and you feel like you can do literally whatever you want\n\nHelpful | 0", "Crofty200515 days ago\nAmazing (to say the least)\n\nWhen I got this game, I was skeptical about the gameplay and story. When I finished, I came out of the Oculus wanting more. This game is mine blowing end worth every penny. My all time favorite game on Oculus Quest.\n\nHelpful | 0", "Skypirate77Jul 9 at 1:09 PM\nStew-pen-dus\n\nAbsolutely hilarious, and so much to explore! You get to some areas and you can help but \"woooooowwwww\" under your breath. I played it twice just so I could go back and see all the different rooms. One of my all time favorite Quest games. The giant pink skull with the flying brooms? And the massive three story multicolored hollow square in the rainbow room? I LOVE IT.\n\nHelpful | 2", "jellyfishmaiyaJun 8 at 12:26 PM\nFreaky and Fun\n\nThis game was so cool. I was able to explore new worlds and uncover dark secrets. I love how this game starts off happy but it turns into a dark weird game. The stuff you had to do was tricky, starting off in the beginning there wasnt anything challenging about the game. As I went on further I had to figure out what stuff I had to do and what headsets I had to put on. I hope that you can make a sequel to this because I feel like there should be more secrets to uncover. This game is amazing! \n\nHelpful | 9", "Rat_M4n14 days ago\nGreat game but....\n\nThis game is absolutely incredible but its way too short. It took me maybe an hour or so to complete and it want all that difficult either. I wish there was more to do. Even though its short i would say its still worth 15 dollars and it was extremely immersive.\n\nHelpful | 1", "YaBoiDarken8 days ago\nMuch fun\n\nI had a lot of fun playing, good story, cool characters, and plenty of secrets to find. 10/10 game, would highly recommend to others\n\nHelpful | 0", "ChiliMangoJul 30 at 1:03 PM\nHilarious. Quirky. Futuristic. Complex.\n\nVirtual Virtual Reality. It's all in the name. If you like layered, meta, quirky storytelling that fully embraces the concept of VR, you've found your game. It leaves a lasting impression and puts a smile on your face.\n\nHelpful | 0", "Trickytenders15 days ago\nGreat Game and concept\n\nAmazing game, I love the storyline and the gameplay is very entertaining definitely worth the money, I just wish there was more gameplay. But the game is amazing!\n\nHelpful | 0", "wisxx25 days ago\nTop 5 Quest purchases\n\nDefinitely no regrets buying this game. If there was a longer more expensive version I would definitely get it (a sequel maybe?). Great story, the characters were memorable and unique, and I loved the moments that gave you a bit of a creepy vibe. This was a game where I immediately looked it up after finishing so I could read about other people's experiences; something I do when a game is so good I'm not ready for it to be finished yet.\n\nIt's about 3 hours long. The only reason I'm giving four stars is I wasn't a big fan of the little mini games (or jobs), when doing them I was mostly waiting for them to be finished so I could continue the story. There are some puzzles and I did enjoy those, maybe more of them in a future game.\n\nDon't let that discourage you though. I would 100% recommend buying Virtual Virtual Reality.\n\nHelpful | 1", "IeizazelJun 12 at 12:10 AM\nWeird but amazing Game\n\nWhen i played to this game, i thought that all IA characters were mad, it is a story about virtual reality and implemented his mind into a computer to live in an eternal dream...And the result is very brilliant, we never know if we are in \"reality\" or not, we got deeper and deeper in layers of virtuality. we see also the limbos of the IA \"paradise\" where some characters (maybe formely humans) are lost and in a cupboard. Anyway you need to play it to see what is it talking about. If you like inception, matrix, you will probably like this game, the thematics are pretty similars.\n\nHelpful | 3", "HMcflurry2610Jul 19 at 12:03 PM\nMental\n\nIt's kind of insane how much you get out of this game for the money you pay, its all incredible with an extreme amount of depth to the story. I really didn't expect it\n\nHelpful | 2", "Cian28Jul 1 at 12:34 PM\nIts like a VR version of Portal2!\n\nThe story is really great, and I very much enjoyed my time with V-VR. Unfortunately, there is very little replayability. You can go back in the the story later-on and explore the facility, plus unlock another ending, but thats pretty much it. I think it would be great to incorporate a survival game mode, where you try to run away from [Spoiler], avoiding his attempts to catch you. Or something like that.\n\nThe graphics and physics engines for this game are absolutely brilliant, and I can see an amazingly large amount of work went into the development of this game. I would consider this to be a VR Must-Have for those who are into quirky, story-driven games.\n\nI believe that this game has massive potential for gameplay updates in the future, especially with how little we know about the true size of the virtual facility. Theres no telling how many hidden secrets could be lying around, and how much could be added in the future.\n\nOverall, I want to thank the Dev team for an amazing experience, and a fantastic story! V-VR really is a great game!\n\nHelpful | 3", "Coconutboy2Jun 8 at 11:24 AM\nIt was awesome\n\nThe game was cool awesome I would kill to get a second game but I dont decide for this group also the story is a bit short but you can always replay the game once you beat it also you can go back to see mr.butter if you like too!!! But to be Serious I think everyone should try this game out its fun and cool I hope Id be able to see a second game thanks for the opportunity to play this game devs \n\n(And please think about making a second game or another game in a different universe but if has something to do with this game) thanks\n\n\nHelpful | 3", "pravusdas22 days ago\nFunny fun game\n\nIt's a funny, fun game. It gets a little tedious later on, and can be frustrating at parts where you are designed to fail. But enjoyed it a lot, and thought the premise was pretty imaginative and storyline was engaging!\n\nHelpful | 0", "icebear20067Jul 14 at 5:38 PM\nFeels like portal\n\nIf you have ever played any of the portal games you are going to have a blast with this game one of the best story based vr experiences I have had\n\nHelpful | 1", "AnroonJul 11 at 4:02 PM\nLoving it so far with one issue\n\nHas a cool imaginative style to it, its really funny and weird and I cant wait to see where it all goes. But Im having one issue thats making it all feel a bit uncomfortable to play. Im lower to the ground than I should be so I feel like Im standing in the floor a bit. Like the floor and objects on it are about knee level. I havent felt this in any other game. I wonder if its something Im doing wrong, but Im not sure cause I found some people complaining about the same feeling on other platforms.\n\nHelpful | 0", "chaska9019 days ago\nLove!\n\nThis game was really great. It reminded me a lot of Portal. Wish it were longer!\n\nHelpful | 0", "LozzatronJun 29 at 1:18 PM\nInventive\n\nA very inspired game that was certainly very story driven. Got a little creepy and I was worried it would become too disturbing for my liking, but fortunately it didn't get too unsettling (though I'm quite a coward!). Overall, thoroughly enjoyed it!\n\nHelpful | 1", "vik.sharma.1220 days ago\nEnjoyable\n\nGreat story with a variety of fun characters! The gameplay was very immersive. Overall, it was a great experience but the game only took me 2.5 hours to beat.\n\nHelpful | 0", "Pheonix5520 days ago\nVery fun game, but\n\nIt is a very fun game, but it takes a little bit long to get to the point of the game\n\nHelpful | 0", "Kidflash227Jun 26 at 3:56 PM\nAmazing\n\nWhen I first played the game I found it very boring. After awhile it's starts growing on you all the different places but it really takes you by the surprise definitely recommend this to young and old people really weird and it keeps you on your toes.\n\nHelpful | 0", "yeetskadeetJul 27 at 11:25 AM\nGreat experience\n\nThiss game is great though it may be short if you know the way its still fun to play through\n\nHelpful | 0", "BryanMelugin1977Feb 27 at 8:26 PM\nFrom weird to profound\n\nIn short, an amazing combination of fun, humor, intrigue, whimsey over a layer of suspense, drama, and even philosophy that culminates in a touching story. I'll try to avoid spoilers: What begins as a quirky little game about being a servant for hire working for various Artificial intelligences eventually becomes a much deeper story about the history of the company and the people who built it. Your job is to do whatever task these AI ask, from making toast and planting flowers to playing with a doll house or recreating a parade. But under this fun and colorful collection of side quests lurks a revolution, a sudden thrusting of spy work and maybe even danger. It's amazing at every level- the humor is very funny, the drama is tense, the story is ultimately moving, and the world is several layers of beautiful storytelling. As someone who loves good story telling and inversive world building, I loved this game more the longer I played it. The mechanics of diving deeper into virtual worlds was brilliant and very well used. It was like going into the Matrix and then jacking into another matrix via VR headset, over and over. A truly wonderful experience that I will play again.\n\nHelpful | 132", "TheFithElement199724 days ago\nButter!!!\n\nLove it! So many adventures! Beautiful and exciting.\n\nHelpful | 0", "Ohyaboii17 days ago\nGreat Game!\n\nThis is a great game! It is funny, but also sincere at times. Its a fun story driven game to have fun on!\n\nHelpful | 0", "ChillahGorillaJun 10 at 4:55 PM\nCrazy Crazy Crazy\n\nThis game is so unique, I've never seen anything like it. It caught my interest immediately, and I ended up playing through it in about 3 sessions of a couple hours each. I just had to figure out what was going on! It was an awesome experience. My only complaint was a period where I got kind of lost and wasn't sure what to do next, but I found out where to go after some trial and error.\n\n5! Perfectly indulgent\n\nHelpful | 0", "anonymousqwertzApr 5 at 4:01 PM\nBest game for the Quest!\n\nWhen I first got this game, I thought that it would just be another story based game that I would play and then forget about. But the story, the concept, everything, just adds to the game. It has a really great story where you are slowly introduced to more and more of the deep and dark secrets it has to offer. By the end of it I found myself scratching my head, trying to figure out what the heck just happened. It's a great game. Don't listen to the one star reviews.\n\nHelpful | 19", "dont_askJun 27 at 7:55 PM\nI enjoyed it\n\nThis is a very charming game on the surface, fun characters, funny jokes, and very nice visuals that look great on the quest. The 4th wall brakes are also really well done, its sudden and instantly changing the currant mood, it scares/unsealing the beast way possible. My only thing I dont like how you can't skip the dialogue, for when you want to try to get a different ending.\n\nHelpful | 0", "cupnoodleslover31Jul 17 at 2:37 PM\nSuper immersive\n\nBruh strait up feel like one day ima take off my headset and chaz gonna be there all like HELLO BEE\n\nHelpful | 2", "GJCorban9 days ago\nFunny writing masks a boring game\n\n- More a compilation of humorous experiences than an actual game\n- The writing and voices are all very entertaining\n- Polished graphics\n- Basically Job Simulator with more creative scenarios but less fun\n\nHelpful | 1", "Knarf76Jun 8 at 10:36 AM\nI think I don't understand this game\n\nI bought this game in a pack together with 'fisherman's tail' which I really wanted.\n\nSo I checked this game and it has extremely positive reviews and decided to buy the pack.\n\nYesterday I played the first 2 levels or something. The second one I just watched a balloon parade and listen to some voice mumbling things... I have no clue what that level was about.\n\nAfter this level I stopped (and my both sons also) while thinking : 'this is boring as hell'.\n\nI tried to refund then. But since this was in a pack you cannot get a refund.\n\nSo today, because the game has such high reviews I played some other levels. Some level where you have to water plants. I found it boring.\n\nAnother level blowing thumbleweed around. Also pretty boring and a very, very basic mini-game.\n\nAnd then a sunset level. Where the voice starts saying you have to put your controllers down. It seems you actually just have to do this. And then watch a sunset for some minutes to complete the level without actually doing anything (since your controllers are on the floor) ????\n\nAnd in between levels there are a bunch of weird things happening with vacuuming up levels, and entering an elevator, I remember a stapler ringing as a phone, and god knows what else....\n\nI really don't undestand this 'game'. Maybe I don't have enough knowledge of the English language to understand some subtleties of this game.\n\nI should actually give 1 star. But I can see it is well made and really well polished with all the voice acting and nice graphics and stuff so I gave 2 starts, but I really don't understand the 'game' part of this game...\n\nIf I could refund I would.\n\nHelpful | 8", "TheReptileGangApr 21 at 2:02 PM\nBeautiful story and gameplay\n\nWhy arent more people talking about this game? It has an incredible story, a stunning art style, and many twists and turns which left me in awe. How can a game featuring bossy artichoke and seductive butter leave me in tears?\nReally, its an incredible game that is severely underrated. Please, please play it.\n\nHelpful | 6", "LARS_POWDERDRYMay 27 at 7:36 PM\nBest story Ive seen on VR\n\nMost creative VR game Ive come across, funny script, intresting use of environments and the way you interact with them, this game seems to understand that the VR platform is unique and deserves to be manipulated. This is the direction Id like to see more occulus titles go.\nMy only downside is its not a very physically active game at all, and I got kind of tired of pointing at a space in the distance and doing small teleports as a locomotive system.\n\nHelpful | 1", "pointbreak075May 11 at 9:46 PM\nGreat story, great mechanics, great game\n\nIn the beginning of the game, I thought huh this is pretty weird but as the game moved on it got progressively better especially with the story. It had a touching story that almost made me shed a tear at the end. The humor and suspense was also a game changer. The way the developer created moments that were both funny and almost frightening at the same time absolutely amazes me. This game is totally worth the price ($15) and to be honest, I would totally buy this game for 30 just because of the sheer beauty and awesomeness of the game\n\nHelpful | 2", "BananaPoet14Jul 5 at 6:48 PM\nA DOoZY!!!!\n\nThis game is WILD! I truly enjoyed playing this game. It has a really cool plot and is quite fun!\n\nHelpful | 0", "conski13May 8 at 1:26 PM\nWhat a bizarre experience\n\nHow can one even begin to describe this game?\n\nGetting stuck (since there are no actual instructions) can be frustrating at first, but exhilarating when you figure out how to move forward.\n\nThe characters are unique and compelling. The environments are delightful. The tasks almost beside the point.\n\nHighly recommended as a showcase for creative use of VR as a medium.\n\nHelpful | 2", "munseyjames1965Jun 11 at 10:37 AM\nGreat game!\n\nI love this game! Lots to do and really amusing AI characters, BUT, where is the freaking exit!?!? I am having this issue on most of the games, and considering the limited number of Quest games you would think you could manage an exit.\nFix this and my rating would be five stars instead of three, I'm not going to rate any game that doesn't have an exit any higher than three stars.\n\nHelpful | 3", "FluffytheMeekMay 5 at 4:20 PM\nVery cool game!\n\nThis was the first game I bought on my oculus quest and I have to say it was a great first game! Very easy to play and immersive. I have a hard time enjoying straight horror games, but this was a perfect mix of mild horror and humor. Would definitely recommend!\n\nHelpful | 3", "DonChangJun 11 at 12:49 AM\nAbsolutely amazing\n\nI've always wanted to play a game of this sort, a game where things are trippy and strange and your goal is to get out\n\nHelpful | 2", "oztengJun 10 at 7:48 AM\nGreat writing\n\nAmazing game. I experienced a lot of emotions. The writing is hilarious and all around the game is very well put together.\n\nHelpful | 2", "Goodcents14Jul 27 at 11:54 PM\nAwesome\n\nGreat game screws with your mind\n\nHelpful | 1", "Hudbud1May 16 at 11:34 PM\nOne of the greatest games on the store\n\nThis was my first game I ever played on an oculus. I played it first on the GO and it was mind blowing and breathtaking how crazy the game is. Serious must buy and I hope that make another game like this one in the future :)\n\nHelpful | 2", "AssassinBlasterJun 28 at 10:35 PM\nStraight. Up. Terrified.\n\nWhen I bought this game, I had suspicions because the game looked a horror game. When I loaded in, it looked a colorful and beautiful game, but when I got into the game, something went wrong. I knew when I saw the headset with the wires coming out it that this game was a horror game. I was right. When I saw the skeleton and the headset with the tentacles, it scared the the living soul out of my body. I could not sleep. This game and the story is all around amazing. The fact that these rooms had no music and all you could hear was the noises of the pitch black void. Good job, looking forward to more good games!\n\nHelpful | 13", "shannanewkirkJun 5 at 10:49 PM\nIncredible\n\nI honestly didnt have much hope downloading this but the storyline and infinite possibilities make this game so incredibly addicting. Its so much fun! I hope they make another one.\n\nHelpful | 1", "MariPandaJun 20 at 6:03 PM\nMore of an interactive story than a game\n\nToo much taking and not enough playing for my taste. When I play a game I want to actually play, not spend 90% of the time listening to to figures in the game talking.\nBut the story is intersting. It's fine, just not my kind of game.\n\nHelpful | 2", "KirbysCheeksJun 7 at 2:19 PM\nFun and mysterious\n\nIt starts off as an innocent simulator, then it gets interesting and a little spooky, still not done with it, really like it though, more stuff like this!\n\nHelpful | 0", "IandasurferJun 19 at 5:13 PM\nGood but a little short\n\nGood but a little short overall it was an amazing game and I want no I need a sequel\n\nHelpful | 0", "SelfDestructo17Jun 8 at 1:29 PM\nConfusing, and great\n\nI didnt think I would like it, but its a very fun play\n\nHelpful | 2", "Sydney_RobsterJul 26 at 9:48 PM\nI am the 5%\n\nIt appears the appeal of this game is it's wackyness and 'humour'. I wan't feeling it though, and just gave up on the game.\n\nHelpful | 0", "S_an_DJun 17 at 5:31 PM\nAmazing! A magical experience!\n\nSuper funny, clever, don't miss this game. It's an absolute joy to play.\n\nHelpful | 0", "EverBread116 days ago\nI wasnt expecting much, but wow.\n\nI dont even know where to begin with this. This game is so great. You are already wasting time of your life just reading this review, go ahead and buy it now! First of all, the graphics and controls are great. The story and writing is wonderful. Ive only played for an hour so far and Ive laughed out loud already multiple times. The game has so much freedom on what to do. Be a good worker, or rip the place to shreds. Or even a mix of both! If youve ever played Portal, its kinda like that except you dont have a portal gun. Dark secrets and discoverable areas to explore. All in all, I love this game and its probably my favorite one. I would even say its underpriced from the experience you get from it. Anyway, 5 stars. You did great making this game.\n\nPS, dont trust Chaz.\n\nHelpful | 0", "SquidDaddy81May 1 at 6:27 AM\nFrigging awesome\n\nThis game had me hooked as soon as the narration started. LOL. Its not often that I come across a game that shares the same kind of humor I have. I thoroughly enjoyed the heck out of every part of this game... the mini games, the environments, the narration, the characters, the story... it was all fantastic. If you need a break from VR to play in VR, this is your game!\n\nHelpful | 0", "TypicalBobMay 21 at 6:00 PM\n\n\nIdk\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSorry\n\nHelpful | 7", "vrgirl2102Apr 13 at 4:55 AM\nAmazing vr game\n\nI got the pleasure of playing this game first on my quest for my YouTube channel! I did a whole game play. I'm so happy I chose this game!\nAt first you think its just a cute little game with funny little task. But the longer you play you realize there is much more to this game!\nThe story is amazing and a surprise twist! The puzzles are not like any puzzles I've seen. They are challenging and new. You never feel like your in \" just another puzzle game\" because your not. This is a adventure... with new twist and turns!\nI didn't want to put it down!\nYou really feel like your in control of the story and how it turns out! This is amazing!\nI downloaded this game because of the comments and I'm so grateful I did. Don't play it for a few min.. play it out.. you will see how amazing it is! Thank you Tender claws for creating this game!\n\nHelpful | 2", "XxdarkdeathxX21Jun 23 at 11:11 AM\nLol\n\nMore please\n\nHelpful | 0", "celestie81Apr 25 at 3:42 PM\nReally fun!\n\nThis was even more fun the 2nd time I tried it from the beginning. You cant do what you wanna do, youre an employee of AI clients who critique you on your performance. Meet a city that wants you to admire its floats in the parade, help a pinwheel grow his flowers, explore an outpost in the dark with a phone booth ringing, help a tumbleweed have a good time. Its inception, Vt within Vt within Vt-can you escape?\n\nHelpful | 0", "EasotJun 7 at 9:01 PM\nAn interesting adventure\n\nIt was an experience. I was able to finish it in a few days but I have no regrets.\n\nHelpful | 1", "TheHouseOculusJun 7 at 3:10 PM\nAmazing!\n\nWhat a great concept! I would recommend this title to anyone!\n\nHelpful | 1", "JediunfallenApr 30 at 10:17 AM\nFun and replayable\n\nThe graphics look great! I love the way the story unfolds, very interactive. Unfortunately it is quite short. What fun and immersion I experienced is what many VR games on Oculus quest should be. Thank you for the experience and let's get a sequel!\n\nHelpful | 0", "The.Ath.Wonder23 days ago\nA MUST PLAY GAME FOR QUEST USERS!\n\nDon't judge by its cover. Seems at first as if not a lot of thought when into it, but within the first 5 minutes of play... I simply could not stop. I had to finish. Seemingly endless puzzles and levels to traverse in different ways. For it's price, its the best game I have.\n\nHelpful | 0", "Duderbutt11 days ago\nOne of my favorite games ever!\n\nI really want to say how much I appreciate the people who created this game they did a fantastic job!\nThis game has good graphics and a slightly weird sense of humor but I loved it anyway. It has good puzzles that aren't too difficult. So if you like puzzles and a little bit of creepiness this is a game for you!\n\nHelpful | 0", "TyIsSticksApr 3 at 7:08 PM\nC.H.A.Z.\n\nDefinitely a very strange game, but an enjoyable one. Its not overly long and has many weird, and sometimes disturbing things along the way. I think this game was great and ends up telling a great story. It does a great job of developing the story along the way and not revealing anything too early. The mechanics of diving deeper and deeper into VR are way cool and is something I enjoy. If you enjoy the Matrix, Inception, or just want to be enveloped in a new VR game, VVR is a great choice.\n\nHelpful | 2", "DudeBro789Jun 4 at 11:24 AM\nWish it was longer\n\nThis was an amazing game but I wish it was longer\n\nHelpful | 1", "Speedy0423Apr 28 at 9:56 AM\nWondering why I didnt try this sooner\n\nIm just going to say it. It brings you in fast if your willing. The only thing that needs some work it grabbing things(sometimes it doesnt recognize the object is there. ) once that it fixed it will be a perfect game\n\nHelpful | 0", "reed_proApr 26 at 4:42 AM\nImmersive, fun, but slow\n\n(Spoiler free) This game truly makes me feel like I am there. There are often times where physically react to something that happens, and I find myself behaving like I would in real life. Sometimes I end up feeling a little unguided. It helps with immersion, but I don't know what the game wants me to do. There is a puzzle aspect that can be challenging as well.\n\nThe worst part for me is I can only really play VR for about an hour a day, so it can feel like the game is wasting my time when I want to progress but there is no clear path how.\n\nHelpful | 1", "MakinItFancyMay 28 at 7:19 PM\nGreat game!\n\nThis is one my favorite oculus quest games\n\nHelpful | 0", "Two_thicc_boi203Apr 8 at 11:08 AM\nWow\n\nIts a simple but effective game that uses VR to tell a beautiful story about a corporation from funny to horrifying to awesome to sad this game has an amazing story that few games let alone VR games have to offer\n\nHelpful | 2", "KingViper186Apr 18 at 8:50 AM\nThis game is awesome can we get a part 2\n\nAt the beginning I was confused of the purpose I was just sticking bread to a piece of butter then I was in a room with vr headsets flying all around me then I got caught\n\nPlease make a part 2 I enjoyed this way to much during quarantine\n\nHelpful | 1", "CottonIsDeadMar 15 at 12:29 PM\nMy new favorite VR game\n\nI played this game for around 20 minutes and realized that this is my favorite VR game. Its so trippy to play. There were times it was calming and times when it was disturbing and I loved it. I definitely recommend this game.\n\nHelpful | 5", "DERP3May 24 at 1:14 PM\nInteresting game\n\nAll I want to say is its very interesting \n\nHelpful | 0", "Westboys32 days ago\nWish was longer\n\nThis game is very interesting. Has a good story and I like the graphics style, but it is pretty short. I suggest this game if you dont mind spending 15 bucks for a fun couple of hours.\n\nHelpful | 0", "BtracchiasMay 9 at 9:12 AM\nGreat game\n\nI liked this game but somethings were a little hard to figure out like how to get the key in the elevator but overall its worth the money\n\nHelpful | 2", "jblakerApr 21 at 7:05 PM\nAmusingly fun and weird\n\nThis was definitely a unique experience. I really appreciate what the devs did here, taking me somewhere new and unexpected. If you want a fun and weird ride for a great price definitely check this out.\n\nHelpful | 0", "PianoGuy124Jul 30 at 1:50 PM\nA Must Have!\n\nThis is one of my favorite game on the oculus quest! It has the perfect mix of comedy, mystery, and creepy moments. It feels a lot like Portal 2. Definitely get this game it's worth the 15 bucks.\n\nHelpful | 0", "MaelwolfApr 19 at 11:09 PM\nUnderwhelming\n\nIt was fine, however, I disagree with comparisons to Portal. Portal was a good game that was elevated by its story. There isnt much game to be had here, and the story isnt deep enough to carry everything by itself. There really isnt any reason to play this again once you beat it, and I doubt itll stick with me.\n\nHelpful | 3", "yu.EliseMar 31 at 4:08 PM\nLOVE IT\n\nIts my favorite one I ever got so far, the moods change often so you get to feel tons of emotions. Definitely for people that are mature it can be and sometimes. Its really interesting but all though its depressing when over and theres not a lot you can do after its over :(\n\nHelpful | 1", "BIGChocolate203May 12 at 2:02 AM\nVery fun\n\nIts so cool I played it on every oculus oculus I have which is all of them.\n\nHelpful | 0", "BloomieBloom1Dec 19 at 8:45 AM\nBlown Away\n\nIm new to VR and only have a few games. However this is my most recent one and its just another level when it comes to inventiveness. The thinking behind this is Twilight Zone quality. I feel like there are endless worlds within worlds created by geniuses who fully know how to utilise the technology. A sixth star please.\n\nHelpful | 100", "v._.keyMar 24 at 3:14 PM\nIgnore the 1 stars\n\nHonestly, I cannot stress how brilliant this game actually is. The 1 star reviews say that its bland and goes nowhere, they are evidently illiterate. Im the kind of person who is put off a game by a single 1 star review among a plethora of 5 star reviews, so when I read the 1 star review of this game I almost did not buy it. Im so glad I did. This game has opened my eyes to what humanity could become, its a STONKING BRILLIANT GAME. If Im honest, I would have payed 22.99 for this. Parts made me laugh, parts made me want to cry. JUST GET IT ALREADY, WHY ARE YOU STILL READING THIS REVIEW? JESUS CHRIST. Please just get it, at a 4.7 star rating, I believe that its underrated. This is better than Beatsaber. PLEASE JUST GET IT, PLEASE ITS SO GOOD I WANT U TO EXPERIENCE THIS OMG.\n\nOh yes... I forgot to add... I ALMOST CRIED WHEN BUTTER CALLED ME INCOMPETENT... i know... makes no sense to you... WHICH IS WHY YOU SHOULD DOWNLOAD THISSSS!\n\nHelpful | 6", "ahayreDec 26 at 11:40 PM\nBest VR Game Ive Played\n\nOk. Wow. I have owned an HTC vive for two years, and this was the first game I decided to play on my quest. Funny enough, this was the best game Ive played on any headset. The variety of emotions you feel is insane. There were times I felt so alone and scared, and there were times I was sad and teary eyed. I for one absolutely hate anything scary in VR. But honestly, if you can get through the couple eerie moments in the gameplay then your fine. There arnt any moments actually meant to scare you. Some moments are just meant to make you feel alone. One of the best things about this game was its ability to make you feel like your contribution to the game mattered. And without saying anything, it made you feel like what you did actually changed the story. After taking the headset off I havent thought of the real world the same. My only complaint is that I feel the story isnt completely clear. That might be my failure to comprehend all the situations. But I sometimes feel important dialogues were too rushed or not repeated enough. Idk. Anyways this is the best game Ive played and am so excited to play the studios second game, the under presents. Please buy this, you wont regret it.\n\nHelpful | 55", "FleshyMonkey12 days ago\nNot my style\n\nI appreciate this game, but I unfortunately dont enjoy it. Its clever, from the story to the characters to the mechanics of grabbing and manipulating objects, but the little mini-games the game is comprised of really just frustrated me rather than engaging or entertaining me, and I found myself wanting to skip through dialogue only to get on with the next tedious task to get further through the story. I admit I gave up just as the real meat of the story got started, the secret human uprising and undermining of the corporate overlords, but I just couldnt care by that point. I found myself just trying to find ways to knock, yank and drag that annoying robot around rather than really paying attention to what it was saying. The storyline may be cute but I felt like it was dragging, I guess. 3 stars from me because its not a bad game, just not a game for me.\n\nHelpful | 0", "Cyber_FoxApr 5 at 4:19 AM\nBetter than I expected\n\nLet me get straight to the point\nIT WAS AMAZING\nThis is a must play especially if you have a quest so you can look around without getting tangled up in wires\n\nHelpful | 2", "Jettski1923 days ago\nAmazing\n\nI have a YouTube channel (jett be) and I have been lacking. Inspiration for a game to play till I found this\n10/10 nuggets\n\nHelpful | 0", "qtartistApr 12 at 2:55 AM\nThe ideal story driven VR experience\n\nWhat more can I say? This game is short, comedic, and full to the brim with secrets, encouraging multiple replays! Games such as this are hard to come by! Well worth the money!\n\nHelpful | 1", "aaron.culpApr 5 at 1:05 PM\nThe best game Ive ever played\n\nI really cant say anything bad about this game. Should definitely start putting out a whole bunch of stories. This game is DOPE.\n\nHelpful | 1", "SnillorJul 26 at 7:50 PM\nGreat game\n\nI'm very glad for the other reviews that sold Menon getting this game. Definitely worth the money and I don't think you'll be disappointed.\n\nHelpful | 0", "the_newbMar 15 at 11:24 PM\nIncredibly fun and entertaining\n\nOk I dont know if Im just obsessed or something but I love this game at some points it seems like your stuck but you look deeper and realize your not. Its really beautiful all the countless worlds you can explore and the story behind them. This game was made by people who know how to correctly utilize technology to there benefit and others enjoyment it truly is amazing. Could we get a second one?\n\nHelpful | 1", "theman_themythJun 22 at 1:36 AM\nThe perfect Quest game\n\nI originally stayed away from this game because just from off the store it didn't really appeal to me. But I looked into it further and it's just perfect.\nWith Portal vibes, mystery, a compelling story, great graphics and dystopian feels it couldn't be done more perfectly. This is what I've been looking for in a vr game\n\nHelpful | 0", "AlechjoJun 20 at 11:53 PM\nOMGGGGGG\n\nOH MY GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOSH\n\nI regret not buying this before. It's a must play!\n\nHelpful | 0", "BlankCanvasYTJun 21 at 6:19 AM\nMind Boggling. Think Inception meets VR\n\nBuy. This. Game. You wont regret it. As soon as I purchased this game I tried it, and couldnt put down my (real) headset at all. There were plenty of times I took off a fake headset inside the game as I swerved and dove through new different realities. Be prepared to spend hours in this game exhausting every single choice you can make. Favorite VR game yet.\n\nHelpful | 0", "Yankee_wit_no_brimApr 13 at 9:57 AM\nMind bending!\n\nI bought this thinking it would be another game 40 minutes in and Im hooked. I cant wait to wake up tomorrow and play it again... thats if I sleep!\n\nHelpful | 0", "Frankie5524Mar 4 at 3:31 PM\nBest Game So Far\n\nThere was one point I almost took off my head set bc I was in such a mind-f. This is incredible game. Im curious how many paths there are and how my game play effects things. So much fun. They need more games like this!\n\nEdit after finishing : Incredible Game. Not sure what else to say\n\nHelpful | 2", "kdawg618Jul 1 at 10:07 PM\nIncredible\n\nThe story and the gameplay were just incredible. This game forces you to face the harsh realities of our consumerist society, and consider where technology might take us in the not-too-distant future. Cant wait to play through again!\n\nHelpful | 0", "bloopysoupJun 22 at 9:35 PM\ngreat gameplay, great story/lore\n\nalthough im being a but generous with a 5 star rating, this game is very good for its price. the game is very fun and at the same time it is creepy as well. i would definitely recommended this game to anyone trying to buy a few hour long story driven game. :)\n\nHelpful | 0", "Protector78Mar 29 at 5:44 PM\nFun but confusing\n\nReally unique game. Had a great time playing and if they put out a sequel Id buy it in a second. However I was confused in the beginning at to what the goal and direction was. A little repetitive but if you like a little bit of trial and error to see what works. This is for you.\n\nHelpful | 1", "DoolaheeMar 25 at 7:44 PM\nJust Meh\n\nI'm not sure why this game has such a high rating. It is just meh. The story is not as deep and interesting as everyone is saying and the game play is incredibly repetitive and boring. There is zero replay value with this game as well. If you have extra money and have played everything else then I guess you could give it a try but it's not a must have like everyone is saying.\n\nHelpful | 4", "0neEyedSnakeApr 5 at 12:58 AM\nWay overblown and flawed\n\nUpdate: After vacuuming butter several times and wasting a few hours being miserable because I couldn't get the game to progress I broke down and looked online for a hint. Ironically the developer has a walkthrough online. It would have been better to just have some in game explanations as other players have also mentioned or even a hint if the player gets stuck instead of letting them get more and more frustrated. Some of us prefer not to have to cheat. It turns out the vacuum has some other function I wasn't aware of because the game doesn't explain anything. After reading that I gave up on this game in disgust. I would refund the game but it is too late, so I definitely will never buy anything from this developer again.\nThis game is the biggest disappointment I have experienced on Oculus, just ahead of Vacation Simulator. They are both boring and repetitive. After vacuuming butter several times I became very bored and frustrated and gave up on this game. Before I bought my Oculus Quest this was one of the games I was most looking forward to so this has been a huge disappointment. Please don't believe all the stars, there is nothing impressive or fun about this 'experience'. If you need to waste $15 on a game get something else.\n\nHelpful | 10", "debksurApr 3 at 1:50 PM\nJust doing the same thing.\n\nI thought this game looked good but since playing it,it seems meaningless.\nI am finding it boring after doing some very boring tasks that were immature.\nI just keep getting butter wanted to be sucked,by the hoover of course.\nI have unistalled it,worse money spent.\n\nHelpful | 4", "TaarnakJun 7 at 10:49 AM\nWeird and short\n\nStill worth it for 10$\n\nHelpful | 1", "Nosey-Jul 27 at 2:02 PM\nUnexpected\n\nI came in thinking it was one thing when its way more. Its an amazing game and I 100% recommended it.\n\nHelpful | 1", "CjMasonFeb 23 at 3:03 AM\nGreat and different game\n\nI am new to VR and would say that this game is within my first 10 purchases for the Quest. I have bought other titles such as Beat Saber, Drop Dead and Space Pirate trainer, and while all extremely good games in their own right, sometimes they feel a little linear without a story. Virtual Virtual Reality is definitely not the case, it is innovative, creative and unique. While still building my VR legs this game has given me several funny, strange, stupid but most importantly enjoyable experiences and I cant wait to play more. Definitely worth a purchase if you are new to VR, or wish to try something with more unique twists and a story compared to other arcade-like titles.\n\nHelpful | 0", "mazcunanMar 17 at 2:43 PM\nAmazing\n\nAt the beginning it was just funny... but once done... I havent feel this way since The Dig or I have no mouth but I must scream. This should have a book... amazing.\n\nHelpful | 0", "iguagofernandoApr 18 at 3:05 PM\nAmazing!\n\nA must to have\n\nHelpful | 0", "Enderbomber101Mar 16 at 9:23 PM\nAbsolutely amazing\n\nThis game is just amazing, it really makes you question reality after awhile and can make you feel so immersed, would highly recommend and is a great vr game for any buyer!\n\nHelpful | 0", "OuterShadowMar 17 at 6:40 AM\nNice!\n\nThis game is just awesome. Its great to dig deeper. Well, I dont want to spoil anything. But whoever reads this: If you havent already, you should buy this ;)\n\nHelpful | 0", "diazXmemori9876Feb 15 at 7:56 AM\nAwesome game\n\nAwesome game, the other reviews convinced me to buy it, but it is a bit short. Dont get me wrong, its nothing like those games you install and 20 minutes later youre done. No, i sunk a good 4 hours into this. Final review: Awesome\n\nHelpful | 2", "EllisssApr 13 at 6:08 AM\nFrom weird to profound\n\nGreat game amazing\n\nHelpful | 0", "AustinMLJun 7 at 4:41 AM\nWeird, funny, and a little amazing\n\nI picked this up in a bundle thinking it was the title I was least interested in. I was wrong. While the graphics may me simple, the way they use them along with some amazing voice work, is awesome and often surprising and hilarious.\n\nHelpful | 0", "ShadecyphrusMar 5 at 7:52 AM\nGreat story so far\n\nIt's a great story and very dystopian, if you played bioshock infinite or watched rick and Morty it's very similar but goes on a whole different of crazy and weird and I could see this as a movie, I have not finished it but I'll try to keep this review updated If I do but so far 4 stars, just because controls are a little frustrating.\n\nHelpful | 1", "SakurachaekMar 9 at 10:09 AM\nWeird and fun!\n\nIf you like Inception, youll like this game. Very meta, with a fun storyline. It takes a little getting used to, though. Quite short (maybe 3-4 hours). Lots of fun little details and an unexpected plot twist. However, there should be more choices in the plot line.\n\nHelpful | 1", "Tummie555Jan 23 at 1:31 PM\nGlad I finally went for it\n\nThis game didn't have the same appeal to me\nlike blockbuster titles, beat saber, pistol whip, star wars, moss, but it was on my wish list since the beginning. (Because of high ratings) It's just that most puzzle games seem to be really well built, but every time I play them, the initial hype fades really fast into a same-old feeling. Even if the concept was new and unique, throughout the game it fades quickly by having to do the same trick in every different puzzle. (For example Shadow point).\nTHIS GAME HOWEVER never felt like this. It's so cleverly built, it took me back to Metal Gear Solid 1. Where you had to figure out a way to prevent psycho mantis from reading your mind, or lookup the radio frequency on the back of the actual game-case.\nWhile the game-mechanics never change, the goals change massively throughout the game. It's one of most clever games I've ever played. It let's you be the director. Without saying a word. It gives some hints if you're alert, but other than that, it's mindblowing freedom for your own solution-thinking. Definitely a masterpiece.\n\nHelpful | 12", "HinkenborpJun 16 at 5:36 PM\nExcellent game.\n\nSuper great story and it's a fun time. Gives me vibes of Please Don't Touch Anything and Portal 2. Buying it would not be a mistake, it would be a great decision.\n\nHelpful | 0", "SeventhKiller07Feb 8 at 3:15 AM\nI only wish there was more\n\nThe first time I heard about this game was from a trailer when I decided to buy and try it out I did not know how much time I will lose just figuring out my way through it but how much I enjoyed it. When you first start it's a bit scary when you see friendly yet intimidating robot walk towards you introducing itself to you saying how excited to work with you and the many activities we've going to do. The game takes you to several worlds with funny, charming, and annoying characters within it. One time it's bright and friendly then it turns into a dark and mysterious story that shares a inception, portal like don't get caught like experience that really makes you use your brain then you get into the real meat of the game. I would recommend you to go into this game blindly with little to no spoilers as possible. vvr is one game you should add to your collection.\n\nHelpful | 0", "Cinderingshadow24Jun 13 at 2:09 PM\nGreat but can be short\n\nI had lots of fun while playing this game it was the first game I bought and it was worth it. It was so fun that I had beat it in one day and the story was on point.\n\nHelpful | 0", "CadeWhateverFeb 29 at 3:23 PM\nOpen your eyes.\n\nThis game is nothing but the reality. Do not miss out and purchase this game. If you want a game with a story and twists, highly recommended. Please check it out if youre new to VR.\n\nHelpful | 1", "sillykid123-Jun 29 at 8:49 PM\nAmazing And Spoopy\n\nThis was an amazing and spoopy game that I suggest to anyone who is readying this.\n\nHelpful | 0", "getbosJun 11 at 10:19 PM\nI TURNED IT OFF AFTER 10MINS!!!\n\nThis game is AMAZINGLY unique and I want the experience to last! This is the type of experience I been looking for in VR. This is a MUST play!!! MORE LIKE THIS PLEASE!!\n\nHelpful | 1", "QTbirbJun 16 at 5:38 PM\nActually incredible\n\nThis game was SO fun. I was not prepared for this game seemingly based on comedy to give me the feels. Thanks for a great game. 10/10 recommend.\n\nHelpful | 0", "lanjos1Mar 8 at 9:19 PM\nBest game ever\n\nI love this game. Its so much fun figuring everything out and going through the game. Would recommend highly. I think he would like the rating to.\n\nHelpful | 0", "metaforyouMar 20 at 12:20 AM\n\nThis is the most meta game Ive ever played, and Im in love with all of it.\n\nHelpful | 1", "notmystlMar 10 at 6:01 AM\nAn incredible game\n\nThe only problem with this game is its pretty short and I wish there were more endings then just the two. Hopefully they make a second or many a similar game in the future. Overall it is an incredible experience\n\nHelpful | 0", "Alx3115Jun 7 at 9:30 AM\nBeatiful\n\nI was not expecting this I thought it would just be a weird task simulator but turned into one of the best and emotional games I've ever played. Truly something else.\n\nHelpful | 0", "WingsOfFireHornet12Mar 26 at 10:12 AM\nHard to Follow\n\nAt first it was easy but once I got into the game I had a hard time finding what to do and how to do it. I also find some parts extremely annoying. This game over all was fun at times but the quite frustrating. I dont highly recommend this game.\n\nHelpful | 1", "LoganIce2209Jan 31 at 7:56 AM\nGreat Game!\n\nI have bought and returned so many games on my oculus. I thought I would never find a good game. But yesterday this game popped up in my recommendations and I thought I would give it a try. This is probably the best game on the store and if you dont have it already you need to get it. Its full of mystery and I love every moment of it. I also like how you can have multiple accounts so me and my family can all play it.\n\nHelpful | 0", "Psychotic_WaffleFeb 21 at 3:57 PM\nMind. Blown.\n\nHonestly the story that you find out eventually is a lot deeper than one could think. And it's very interesting to see that this all takes place not to far in the future than where we are now.\n\nHelpful | 0", "razialoJun 8 at 8:20 AM\nYup - great Story driven magic\n\nI wish there would be more experiences like this. Love it. Loves it on daydream. Love it on the quest. Juicy graphics and amazing story line haha\n\nHelpful | 0", "Jza16Feb 18 at 8:39 PM\nAn Unforgettable Experience\n\nIf you have reservations... throw them out the window and get this game. This app took me on a journey I never saw coming... again and again and again. An absolute must have for anyone with a VR Headset.\n\nHelpful | 0", "Jlhirondelle56Jan 11 at 3:26 PM\nBuy This Game Please\n\nV-VR was not something I expected to be one of my favorite VR games when I went into it, I only bought it because I had 17 dollars laying in the balance and I had heard vaguely good things about it.\nWhat I expected was a fun little experience I'd be happy with, but what I got was an intriguing story, great gameplay, a pile of laugh out loud moments, all wrapped together in a VR game.\nThe concepts explored and the comedic moments made it feel very Portal-esque, which is always a good thing. Absolutely worth the price. Thank you, Tender Claws. You've made my week.\nAnd to make it up to you, I'm going to buY THE UNDER PRESENTS RIGHT NOW I NEED MORE-\n\n(P.S. For your first VR game this is phenomenal! So much potential!)\n\nHelpful | 11", "awesomegamer21Jun 5 at 6:45 PM\nGreat game\n\nIts really good and I love how interesting and interactive and it has several endings that take a long time so it definitely worth your money\n\nHelpful | 0", "laura.timermaneNov 3 at 1:25 PM\nIt was the coolest experience\n\nI don't usually write reviews but for this game I have to. I have been buying and trying out a lot of games on Oculus and this game is everything I was looking for. Writing, characters, visuals, surprise elements, gameplay, levels, interaction, engagement, design = 10/10. Can't even explain how mind bending, visually strong and exciting this game is. Saw a lot of reviews stating that the game was too short. I personally didn't mind the length of this game and I will definitely be replaying it countless times. I'd say the price for this game is very fair. Most truly hope for another chapter...\n\nHelpful | 59", "Nogard007Jun 12 at 2:24 PM\nClever fun\n\nThis game is fun both in game play, and the mechanics they employed. It is well worth playing.\n\nHelpful | 0", "AntCRJun 30 at 1:17 PM\nAmazing for the price\n\nI often hear complaints above game length of vr games. Although I can often agree, VVR is an exception. For its very cheap price tag, I was pleased with the amount of content, humour, and story. The effort put into this game is apparent and I recommend this game for everyone.\n\nHelpful | 0", "Breaks23Jun 24 at 8:46 PM\nQuirky, trippy, and funny\n\nOne of my favorite VR games!\n\nHelpful | 0", "KernallolMar 4 at 12:28 PM\nGreat goofy game\n\nI absolutely loved this game, its casual enough that anyone can play it and have fun.\n\nHelpful | 0", "MrBigBod69Jun 7 at 7:10 PM\nWeird, But FANTASTIC\n\nConfusing, Funny, Entertaining, and just downright fun! Definitely one of my favorite games on the Quest\n\nHelpful | 0", "Every_name_is_takenMar 7 at 9:15 PM\nWow\n\nJust buy it, it's worth it. (for some reason the trailer makes it seem like your touch controllers are in 3dof, don't worry their not)\n\nHelpful | 0", "DunlaplyMar 8 at 10:43 AM\nWeird in the best way\n\nThis game was unsettling and charming in all the right ways\n\nHelpful | 0", "8bitbit_ytJun 6 at 12:06 PM\nAn amazing experience overall\n\nIt was pretty great and I finished it in one go and I waited the 52 minutes for the secret ending \n\nHelpful | 0", "mattkepp29Mar 4 at 7:23 PM\nGood\n\nHavent really got the hand of it yet, but so far so good!\n\nHelpful | 0", "Rade0nFighterFeb 7 at 4:54 PM\nSlightly overhyped but good nonetheless\n\nThis is one of those games everyone bangs on about so I had quite high expectations going in.\n\nThat said it is different to the usual games, and if you appreciated the humour in portal 2 you may well like this.\n\nGameplay is a bit simplistic but there is a lot of variety in terms of the different scenes.\n\nHavent got round to completing it yet as been distracted by other titles (which might say something) but would buy again.\n\nHelpful | 0", "iNovaaMar 7 at 6:05 AM\nProperly funny\n\nHitchhikers guide to the galaxy vibes\n\nHelpful | 0", "simchiJun 6 at 8:18 AM\nAnnoyingly brilliant\n\nWheatley is that you? Twisted & sometimes awkward humor with pleasantries\n\nHelpful | 0", "lol.comMay 22 at 11:16 AM\nAmazing!\n\nIt was so fun it had so many twists and turns when the skull and the headset with tentacles came out I was so scared and I definitely recommend it.\n\nHelpful | 0", "GiftKidApr 20 at 3:26 AM\nShocking and fun\n\nThis game has some very fun moments in it and it's just overall charming.\n(Spoilers ahead)\n\nThis game reminds me a lot of portal 2 with its behind the scenes parts I love the shock factor from when it turn into a horror game but it's not too terrifying because the game isnt advritized as horror both endings are great and I look forward to more vr games like this one.\n\nHelpful | 0", "jherek1Feb 26 at 10:54 AM\nIs this real life?\n\nIf you like Portal or The Stanley Parable then you'll love this!\n\nHelpful | 1", "kizmo48Mar 5 at 11:01 AM\n\nI Truly love this game\n\nHelpful | 0", "dawn.medina.79Mar 5 at 9:02 AM\nV v r\n\nIt is a good game\n\nHelpful | 0", "LoangunnerFeb 1 at 4:01 PM\nJust listen \n\nThe game is awesome. On the surface it looks like a cute very game with a nice robot but weird things start to happen. Its just to cool. Good for the price highly recommend.\n\nHelpful | 0", "Isak_SkyJan 8 at 7:51 AM\nAmazing\n\nThe great thing about this game is that i first expected small simulations without much of a story(probably because i didnt read into the game before i played it) but sertainly it took a big turn into the creepy, fun and unexpected. Which i love about this game. Please make a V-VR2 because that would just be amazing. Definitely gonna play that title if i see that poping out.\n\nHelpful | 0", "TycouncilFeb 24 at 1:10 PM\nWow...just wow!!!\n\nIncredible...a work of art. Truly an interesting game\n\nHelpful | 1", "CosmoshiMar 1 at 11:53 PM\nBit short but otherwise great\n\nI loved playing around with all the items and the robot yet the story felt too short and it was over too soon and with such a large wall to fill its a slight disappointment. I also wished there was even more fun stuff to play around with\n\nHelpful | 1", "theoryofeverywhereDec 27 at 9:48 PM\nWhat just happened\n\nI went into this one knowing very little. I felt kind of confused for much of it, not really knowing what I should be doing or what the point of things were. But this experience is really just somehow kind of magical. The visuals are beautiful, and the music is fantastic as well. This game/experience is truly one of a kind. It really is hard to explain what just happened, but I loved it. I will definitely be playing through this one again and trying different things.\n\nHelpful | 5", "KooPakooJan 5 at 1:01 PM\nBest.Game.Ever\n\nAs a massive fan of portal and portal 2, this game was brilliant. The ideas for the ending and characters were amazing. At times, I was in shock at how brilliant the concept was of putting new headset on, just to then put another one on. 10/10, will be showing to friends and family.\n\nHelpful | 2", "ruder2004Feb 20 at 12:34 PM\n\nIt was great and honestly I was scared in the beginning of it.\n\nHelpful | 0", "3PercentNinjaDec 31 at 11:33 PM\nJust Wow\n\nI usually don't write reviews but this game is sooo trippy! I went to one world that scared me and couldn't take the game headset off quick enough like nope let me try a different one lol I spent 2 hours on this game without even realizing it until I was notified that my Oculus battery was very low  anyway game is amazing and worth getting, Loved it.\n\nHelpful | 0", "FwakJan 20 at 4:56 AM\nA unique trip\n\nInception, with the story/feel of portal.\n\nOnly about 2 hrs long, and low replay ability, but flawlessly executed and a fantastic, different experience where you come out thinking wow!\n\nHelpful | 1", "ellidnDec 30 at 9:45 PM\n5* BUT had moment of bugginess\n\nJust finished and loved this game, can see myself going back in and making different choices because I cant wait to figure out all the different ways to get through. I did have one very frustrating moment (see below)\n\n\n\n\n*****SPOILER ALERT*****\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStarted and saved game about an hour in, just as I was figuring things out. Next day couldnt get into gameplay again. Put on headset in backstage area after vacuuming butter for the 10^6th time, but the elevator wouldnt let me get on, no matter what I did. Theres only so much butter vacuuming I felt like doing . Was not happy being stuck after looking forward to getting back into this.\n\nHelpful | 1", "Stoplight001Dec 28 at 12:03 PM\nWOW JUST WOW\n\nOk I would have never bought this game if it didnt go on sell. The cover photo dosent attract me enough to consider it. But I took a chance and got it. Now I'm like holy crap I would have missed out on the most incredible, beautiful and eerie game of a lifetime. Developers you out did yourself. I played for 30 min and I was like omg whattttt is happening but in all the good ways. It looks like a long game and well worth the money. You have nailed it on being able to capture the mood. One second your smiling the next your in the scariest place ever. Like incredible sooooo much interaction. Grab and play with everything! Already shown 3 of my friends and even they loved it! I cant wait to see what happens next.\n\nHelpful | 0", "sjhughesDec 28 at 9:29 AM\nQuirky and fun\n\nLove the concept and overall attitude expressed by this game. Maybe a thinking-persons VR puzzle-solver(?) Excellent crazy and goofy characters. Fees almost more than a game.\n\nI bought The Under Presents because it is made by the same studio. Cant wait to see what these guys put out down the road.\n\nHelpful | 0", "superozzyJan 9 at 4:23 PM\nSimply superb\n\nSuch a ridiculously well thought out, fun and imaginative game. Not always easy and tough to crack open wide, but well worth the money, every second is amazing! I hope to see more games with the depth of VVVR. A huge thank you to the devs!!\n\nHelpful | 0", "xx7xxJan 16 at 8:31 AM\nIve never played anything like it\n\nLet me start by saying I would have given it five stars but the controls are kind of awkward on the oculus quest.\n\nYou are forced to teleport instead of smoothly moving around with the thumb stick. Also I found myself removing the in-game virtual virtual reality gear when I wasnt Trying to... and unable to remove the virtual virtual reality headset when I wanted to.\n\nThe sound effects and music are amazing. I love when Im listening to the chas radio and I push it out far away from me, the sound volume goes lower.\n\nI completed the game in about 10 hours. I personally didnt care for either one of the endings, but that is subjective.\n\nI liked it because it was something different than the normal shooters I usually play. Well done.\n\nHelpful | 1", "epayne021Feb 4 at 5:47 AM\nGreat!\n\nVery well done! It was very high quality and refined. All characters and story were fully fleshed out.\n\nHelpful | 0", "LQbanoJan 17 at 4:58 PM\nJust AMAZING!\n\nDon't know how I missed this GEM until now that I got it on Quest. So much creativity, gorgeous visuals. Better than anything any of the major AAA big devs have created for VR. A+++\n\nHelpful | 1", "diZLeXiKDec 28 at 3:01 PM\nTwisted AI VR Masterpiece\n\nI feel like anyone rating this less than 5/5 doesnt get it. If youre a fan of any of the games/movies mentioned over and over again in other reviews (Portal, Inception, etc) then this is an absolute must-play and you will not be disappointed. The storyline is terrific and the characters and voice acting are top-notch. The game feels very polished and there are a multitude of hidden gems throughout if you take the time to appreciate every scene and situation. I will insta-buy anything these guys put out in the future.\n\nHelpful | 0", "ClareAdkinsJan 30 at 3:04 PM\nAmazing!\n\nThis is so wonderful!!! Absolutely gorgeous! The story line, and playing it was awsome! I hope that make a new one too!\n\nHelpful | 0", "nikzykFeb 14 at 12:42 PM\nLove it\n\nGreat concept and left me wanting moooooore\n\nHelpful | 0", "poayoFeb 28 at 3:22 PM\nAmazing but pretty short\n\nI love the story, mechanics, etc, but the story feels quite short\n\nHelpful | 0", "Regee_Jan 25 at 8:21 AM\nFantastic. Needs more content!\n\nEasily a 5 star game. But is getting 4 stars because of lock of extra content. Developers should put more story lines in the game, or different modes with more virtual worlds. Loved it though so much definitely recommended.\n\nHelpful | 1", "FruitarianJan 21 at 2:32 PM\nBoring\n\nI wanted to like this game but it was just boring. It perhaps serves as an introduction to vr, but even then, there are better things to try. I liked the concept but I was bored with what I had to do. There is a narrative but most of the time I wanted it to hurry up so I could move on.\nIf you want to listen to someone drone on about a sunset while you have nothing to do other then move random objects around, then by all means, this is your game.\n\nHelpful | 2", "nick16727Feb 1 at 1:44 PM\nFantastic game\n\nThis game is so immersive, and I love the plot line. It really made my oculus quest 10x better.\n\nHelpful | 0", "jazzymike33Feb 16 at 5:23 PM\nIts great.\n\nBuy the game.\n\nHelpful | 0", "LordGGFeb 3 at 12:04 PM\nThe best game\n\nI liked the ending of the and the story line of it hope for part 2\n\nHelpful | 1", "DeclannHayessMar 27 at 6:32 PM\nIncredible\n\nMy new favourite VR game - imagine Job Simulator + The Stanley Parable + Portal 2 + that episode of Rick and Morty with the Multiverse TV channels. This game was non stop incredible from start to finish, and I cannot wait to see what this team does next!\n\nSuperbly polished, stunning, controls like a dream - with an engaging story and witty dialogue. I am sure you will adore this game as much as I did!\n\nHelpful | 0", "PokemonMaster5BJan 3 at 7:00 PM\nVery Good Game\n\nThis is probably my favorite VR game so far. I really like the story and it was really fun to play. Hoping for a sequel or prequel. Prequel could work with the first human to enter. And start with the ending of this game.\n\nHelpful | 0", "Craft-TeaDec 13 at 11:12 AM\nAmazing story\n\nIts a short game, but I think it is the perfect length of time for a reality break. I was able to truly get immersed in this game. At the end of the game I found myself taking off headset after headset, only to realize it was time to take off the only true physical headset. Worth every penny.\n\nHelpful | 3", "win.smartApr 18 at 1:57 PM\nAmazing\n\nSuch an incredible experience. Great mix of story telling, tasks and amazing visual and audio experiences. Really takes you out of your world. Makes you think about the future too...\n\nHelpful | 0", "kynan.marshall.39Jan 26 at 11:47 PM\nOne of the best story games\n\nThis is one of the best Vr games Ive played and the story is just so fun and interesting\n\nHelpful | 0", "LokalhostNov 25 at 11:21 PM\nI never knew how bad I needed HR...\n\nI have to admit: I never would have bought this game based on its title. My limited mind was just not able to figure out what could be possible in V-VR. All the reviews talking about Portal-vibes made me buy it finally.\nAnd I must admit: they are totally correct. I loved the game from the first second. Everything about it. Sometimes I felt like being inside the movie Inception asking myself: How many levels of V-VR are you down now?\n\nAll that is left to say: the cake is a lie \n\nPS: pleas release more of these kind of games!\n\nHelpful | 12", "PauliuwJan 11 at 7:15 PM\nGreatest\n\nA very immersive game with great story, humour, graphics, audio, controls and everything else really. Really A+ execution and one of my absolute favourite on the quest!\n\nHelpful | 0", "ShibaBoyeNov 2 at 3:39 PM\nHonestly one of the greatest games\n\nThis game isnt just a good VR game, but possibly one of the greatest games in general. The writing is fantastic. Everything about the game seems like it was put together with passion. This game is worth more than theyre selling it for in my honest opinion. Hoping for a sequel or another great game from you folks.\n\nHelpful | 7", "TinyLittleFellaDec 27 at 1:57 PM\nWitty. Meta. Amazing.\n\nIm an hour into the game - and I adore it! Ive laughed out load many times. Dozens of brilliant, imaginative environments. The in game physics are excellent too - everything reacts how you would expect. Kudos to the devs\n\nHelpful | 0", "TurboBoarDec 25 at 9:13 PM\nMore an experience than a game\n\nThe idea behind is quite cute: a VR within a VR within a VR... This will definitely be up your alley if you're looking for an original, surreal experience. I cannot quite call it a game, but I've only devoted half an hour to it. It is quirky and amusing but some people will find it quite annoying, as the narration of the individual VR landscapes is something you have to sit through whether or not you may get bored with the setting or task imposed on you.\nPersonally, I found the first few \"realities\" drawing me in rather quickly but then I got supersized and glancing over a city where the task was to rip off parade balloons and have to listen to the voice of a visually unimpressive city.\n\nI feel really divided not sure whether to go on or ask for a refund. The unfortunate thing about the stage of VR entertainment is that it is still in its infancy in terms of graphics and many games feel like being inside an old Nintendo. When you are forced to sit through a storyline read by a talking yacht wreck on a beach, you do wish the view to be stunning realism not a pixelated environment that may be more captivating to the eyes of a six year old.\n\nI am definitely onboard with the concept but I think we're still a decade away from making such an experience truly enticing. Great effort though.\n\nHelpful | 4", "mitch.mulleyDec 11 at 4:08 PM\nWow.\n\nIve been playing this Inception style game for over an hour now and Ive only just scratched the surface. The developers have done an amazing job on the characters they all seem to have unique personalities and they all react differently to your actions which is so weird and wonderful and will definitely lead to multiple playthroughs to discover every scenario. Ive already been in to multiple universes each with different things to do and different ways to interact. I can already see the story starting to develop and unfold and I actually cant wait to jump back in to see where I go next. This is an amazing game that has you immersed from the very beginning.\n\nHelpful | 0", "VHUSKMar 19 at 3:21 PM\nA VR Experience Unlike Any Other\n\nAt first, I was hesitant to buy this game. After seeing all the reviews, I decided to take the plunge. I must say, I made the right choice. I ADORE how your choices act on how the game plays, and the puzzles and mystery of this experience are just incredible. Without spoiling the game, I can tell you that this game is deep. Like... SUPER deep. It's hilarious, but can also be disturbing at times. Nothing really scary... but it makes you feel alone and vulnerable to anything in the game. No jumpscares, though. And I will leave you with this message...\nCHAZ IS ALWAYS WATCHING.\n\n(Edit: At the time of writing, I have not completely finished the game. This is only at the time of writing the review, and this will change in the future)\n\nHelpful | 0", "beamer6Jan 13 at 2:09 PM\nWow\n\nIt had the mentality of job simulator but all the nostalgia of portal. Fantastic game. Would love to see a sequel.\n\nHelpful | 2", "Robblack6Jan 23 at 1:42 AM\nMind bending\n\nGreat game , very creative. Really enjoyed the concepts. Could have been abit longer\n\nHelpful | 0", "steveyboyyJan 21 at 8:03 PM\nLoved the story but..\n\nIt feels like it could have been longer and with more endings cause it seems like even if you tried to get a different result doing a task it would only lead towards the normal route if that makes any sense. I did love the story and very fitting aesthetics of each area. The voice acting was also very good. Overall it was nothing to special but it was nice.\n\nHelpful | 1", "rowee270Nov 16 at 5:33 PM\nFunny, bizarre and surreal\n\nThis is a really unique funny surreal experience that adventure game enthusiasts will love. What elevates this is how the story unfolds and keeps you captivated. My only gripe is that it's not very difficult to complete, but there's definately enough content to keep you entertained and I'm sure there's lots I've missed.\n\nHelpful | 3", "Ihrie4 days ago\nAwesome, must buy\n\nLoved it, Surprisingly deep game with a great central mechanic.\n\nHelpful | 0", "PointMaker59Jan 11 at 7:39 PM\nSo Funny\n\nHonestly one of the better Vr games out there, I definitely suggest it to those getting into and those who are already in Vr to try it.\n\nHelpful | 0", "snamandsnydJan 4 at 6:58 PM\nMY FAVORITE QUEST GAME\n\nThis is an amazing problem solving experience/game that isn't like any other, the story is well made and complex but possible to follow, my only problem with it is that there isn't a 2nd for me to enjoy!\n\nHelpful | 0", "FollowWingsOct 28 at 3:18 AM\nShocking unbelievable\n\nA collection of Surreal Worlds with full of unexpected actions and things inside with unlogical activities. A Surreal Total Overdose to your brain and I mean it! The goal is both solve the puzzles and do not put off your real Quest headset! Just like an escaping game while your mind is escaping really.\nPlease Dear dev make more games!\nPerfect description is:\n\"Forward, backward, inward, outward\nCome and join the chase!\nNothing could be drier\nThan a jolly caucus-race.\nBackward, forward, outward, inward\nBottom to the top,\nNever a beginning\nThere can never be a stop\" /Alice in Wonderland\nUPDATE 10.28.: I finally played it through, was a bit hard to me to 'escape'. Labirynth. Till I got to the end I had to do everything which made to feel every emotion. \"You plugged him out like it was nothing\" sentence made me near cry and felt depressed.\nInteresting deep story, totally worth a check!\n\nHelpful | 20", "CULLEN51Feb 3 at 5:19 AM\nGood\n\nVery good\n\nHelpful | 0", "Wanderer1999Jan 17 at 7:08 PM\nCrazy game\n\nDefinitely not what I was expecting when I first saw this game. But I loved where it went.\n\nHelpful | 0", "Gla_SNov 12 at 7:04 PM\nIncredible experience\n\nThis game provides what no other has so far it is just what I was looking for. You can go through the story line in many different ways and it does a great job of immersing the player. This title is one that will make you question everything you know but in a good way It does a great job of telling the story and making you feel like you are in control rather than scripted gameplay\n\nHelpful | 3", "BallsagnaDec 22 at 11:03 AM\nI enjoyed the puzzles\n\nThe premise of this game on its own is quite creative and as others have said pretty surreal.\n\nSome of the puzzles left more to be desired but overall I really enjoyed this game. Theres some good jokes, some parts that keep you on your toes and a little wigged out, and also some deep existential parts to it.\n\nI would give 5 stars if it had a longer gameplay or repeatability aspect to it like mini games or just a longer storyline. Overall, I would purchase a second addition and will recommend this game to friends who enjoy sci-fi and puzzles. Thanks!\n\nHelpful | 1", "pseudosquidDec 26 at 2:04 PM\nPerfect VR Experience\n\nThe VR element looks fantastic, the humor is spot on, and the gameplay factor is fun and exciting without being too stressful or frustrating. This will be a first recommendation for any VR users!\n\nHelpful | 0", "DankMemeMasterMar 16 at 9:45 PM\nOne of Vrs best!\n\nVirtual virtual reality really is the portal of vr. It perfectly contrasts humor with a dread like no other game I've played can. I laughed, cried and cowered in fear within 2 and half hours of playtime. Perfect balance between art and entertainment, a must buy for any quest owner\n\nHelpful | 0", "PinkPlumPieDec 11 at 12:59 PM\n5/5\n\nI loved this game. Great mystery element and the unsettling creepy atmosphere was executed very well. Definitely gives off some Portal vibes while still keeping its originality. It would be cool if a second game was made. Definitely recommend to anyone trying out VR\n\nHelpful | 0", "JUANJESUSCHRISTMar 26 at 12:29 PM\nA rich art piece\n\nI cannot believe how cool this story is. So many levels of thought provoking experiences, art and messages. It's like being in Wonderland but in the future. I am in awe of this game. Is it a game? It's like an immersive book.\n\nHelpful | 0", "HalfCountNov 30 at 5:42 PM\nAmazing!\n\nTender Claws is by far the best VR game company and this definitely is the best game! Theres so much to do and the puzzles are great. There were times I wanted so badly to look up how to do something but after exploring a little more you connect two things and beat the puzzle youre currently at. If there was a VVR 2 I would definitely get it!\n\nHelpful | 1", "CloudTurtle27Jan 11 at 3:22 PM\nKeep up the good work tender claws\n\nAfter playing \"the under\" knew I had to check this out. Another amazing experience by tender claws.\n\nHelpful | 0", "FantasticL2Jan 9 at 6:08 PM\nEnjoyed!\n\nI liked it and finished the game over 2 days, it was very different than other games I played. I wish it had multiple outcome other than the ones given. Please update and add to storyline.\n\nHelpful | 1", "SkoolULikeDevryJan 10 at 4:42 PM\nAmazing game\n\nDownload it, you wont regret it. Uses VR like it was meant to be used. Pretty good story line too!\n\nHelpful | 0", "CaptainFroglegsJan 2 at 10:22 PM\nFun Adventure Game!\n\nFun game, but dont expect to shoot anything. There is puzzles... but Its purely for the amazing experience. Definitely recommend\n\nHelpful | 0", "krxskyDec 17 at 1:30 AM\nWow\n\nReally like this game. Novel idea and beautiful scenes. (Hint: standing helps with teleport. Sitting on the carpet prohibited me to entering certain places, which sent me into a very desperate hour long loop.)\n\nHelpful | 1", "sydfkrJan 11 at 4:09 PM\nAmazing!\n\nAmazing graphics,and a crazy good storyline! Chaz is annoying,usually, making me go crazy.\n\nHelpful | 0", "lukewardoJan 12 at 7:24 AM\nForgot\n\nGood\nGame actually for me I am very picky on my games so this is very good\n\nHelpful | 1", "UmmActuallyJPDec 25 at 3:39 PM\nLove it!\n\nJust got it today, for Christmas and its amazing. Ive seen other people say its got portal vibes, and I agree. Its so cool, and I would love to see a second one.\n\nHelpful | 0", "PGDVenomDec 29 at 11:52 AM\nSolid game\n\nExtremely solid game with amazing controls. This is the first game that I don't hate the teleport locomotion option. Grabbing things feels very natural.\n\nHelpful | 0", "kate.libby.31Dec 27 at 3:05 PM\nStanley Parable + Portal\n\nThis game has a lot of fun things to do, and sort of has a Stanley parable vibe because of the narratorish character. Would definitely recommend!\n\nHelpful | 1", "HydraLDNJan 10 at 6:05 PM\nGood and fun but very repetitive.\n\nWell, I went into this game blind. I enjoyed the first hour or so and then it began to just be the same thing over and over. Dont get me wrought very different game to what Im used to playing so that might be why but I think everyone should give this game a try if they have never played or seen it before.\n\nHelpful | 1", "Memes_R_UsJan 30 at 1:27 PM\nCreepy...\n\nI got this game thinking it would be a happy little joyride.No.It gave me nightmares for weeks.Plus it made me feel trapped.Just a warning for anyone about to get it, its rated teen for a reason\n\nHelpful | 1", "nickmo123Nov 23 at 6:28 PM\nSuper Fun!\n\nI'm fairly new to VR, and the Quest is the first platform I've used. Since entering this world I've experienced some let downs, average experiences, and exceptionally immersive experiences. VVR has so far been the best download I've made. I really enjoy the confusion involved and since I'm not an expert, it's involved a lot of time for me. I only play an hour at a time to keep things fresh, but it doesn't seem I'll be done with this game soon. Thanks!\n\nHelpful | 2", "RoyiYDec 30 at 1:06 AM\nFun unique and original\n\nMost definitely a fun and original experience. After playing this game, Ill probably buy anything by the developers of this game.\n\nHelpful | 0", "neepsandtattiesDec 31 at 11:12 AM\nFun and funny\n\nGreat game. Not too long, but with enough breath to be very enjoyable. Feels a lot like Portal, but with original mechanics.\n\nHelpful | 0", "babeuscusDec 28 at 3:52 PM\nAbsolutely riveting game\n\nKept me on the edge of my seat every second of the way would recommend to anyone who just generally want to have a blast while playing vr\n\nHelpful | 0", "agirlnamedkirstenJan 5 at 7:51 AM\n\nOnly bad thing is (which is not worth removing a star) that I wish it were double the length\n\nHelpful | 0", "thejuggsterDec 4 at 12:50 PM\nQUESTCEPTION\n\nVr inception, im not even finished with the game after one and a half hours in, whats with everyone saying its short, its a replayable game.....COOPERATE WITH YOUR CLIENT....or dont\n\nSo fun, recommend to all, i wish all the good games were this price\n\nHelpful | 0", "Chacho108Jan 27 at 12:58 PM\nIts fun\n\nYou have to play this game blind\n\nHelpful | 0", "LucyTheKnightyDec 29 at 4:43 AM\nSuch a fun game\n\nIf youre a fan of inception and portal this game is for you, great plot, great visuals and a masterpiece of a game\n\nHelpful | 0", "WorldOfDarkness94Nov 18 at 5:31 PM\nImmersion\n\nThis title will have you bouncing around surreal worlds that all have this uncanny vibe to then,but feels real as well, the voice acting and diegetic sound design really brings out the environments, as well as the interface of going through the rabbit hole of vr worlds.vey pleased with this product and highly reccomend this app to anyone looking for more of a exploration type game.\n\nHelpful | 2", "mph2897Dec 2 at 11:32 PM\nA lot better then I was anticipating\n\nYall did a great job with this game, I wasnt expecting much of a story when I first started out but then the game got deeper and deeper and i couldnt help but get enthralled in the story development. 10/10 would play again\n\nHelpful | 1", "Connorh131Oct 17 at 7:29 PM\nA Great Title\n\nAbsolutely loved this game, I can definitely say that it is one of my favorite VR experiences. When you purchase this game, expect a story based puzzle game that will make you think, and of course feel, for the characters. It's relatively short, but a great experience nevertheless. I can't wait to see more from this developer, and hopefully they could potentially continue this story in any way.\n\nHelpful | 5", "Jonnycakes13Dec 17 at 5:34 PM\nPretty Nice!\n\nThis game has an amazing story to it. I like also how many twists this game has as well. Though I wish it was a bit longer and a little more difficult.\n\nHelpful | 1", "LennonrhNov 19 at 2:45 AM\nFantastic Narrative\n\nA fun exploration through numerous bizarre, beautiful worlds, aside zany and charming characters. Ive never had the pleasure of meeting such fun and well written characters before. They may be inanimate objects, or electrical grids, but I adored interacting with them all, finding every line line of dialogue, and exploring every reality they inhabit. The story was funny, immersive and thought provoking. Whilst not too short, I did complete it in a single day. With exploring all possible avenues it was probably around 5 hours long, and Ill definitely return to after a while, keen to replay it.\nOverall, VVR is one of the best games Ive ever played.\n\nHelpful | 0", "tceinDec 31 at 8:35 AM\nAwesome adventure!\n\nAn amazing story with all the little details and VR worlds to explore!\n\nHelpful | 1", "NiquangDec 15 at 3:21 PM\nAmazing Game\n\nWith a great story that subverts expectations and fun charm in almost every corner, I would definitely recommend this game to any of my friends.\n\nHelpful | 1", "HeyItsFinnJan 9 at 12:50 PM\nTrippy\n\n... and absolutely amazing\n\nHelpful | 0", "IndridColeJan 9 at 8:56 PM\nColl and a little scary\n\nI love your game!\n\nHelpful | 0", "pokie718Dec 30 at 6:10 PM\nThis game is amazing\n\nThis was better then I expected. I saw game plays of this I love it\n\nHelpful | 0", "Christopherrr007Dec 27 at 3:50 PM\nExcellent\n\nShades of one of the greatest games ever, Portal. A game for everyone in the family to play.\n\nHelpful | 0", "maazomaazoNov 24 at 9:43 PM\nI kind of like it and kind of don't.\n\nI admire the wacky, off-the-wall concepts on display here, but some of the scenarios go on a bit long for my taste. If you're looking for something with a bit of Douglas Adams' oddity and much trippiness, this is a solid choice. Competitive gamers need not apply. This is more a psychedelic art exhibit than a game, would likely be much more appealing if the graphics weren't so very rudimentary.\nI come back to it now and again when I get bored with the other content, but a single scenario usually sates my appetite for this app.\n\nHelpful | 4", "FadeLoxDec 11 at 11:42 AM\nLoved it\n\nThis was engaging and fun. It was a little confusing but I loved the ending and the story in general. Probably my favorite game so far!\n\nHelpful | 0", "HarryTheLoserDec 18 at 8:11 AM\nAccounting+ with better visuals\n\nWell it has a story and it doesn't have a white dude screaming at you about how he wants you out. But 4 stars because it only lasts 2 hours and there's not many places you can see.\n\nHelpful | 1", "zack.slotkowskiDec 26 at 7:55 PM\nAwesome\n\nSuch an amazing experience. A must have for the quest!\n\nHelpful | 0", "SNERTTTDec 14 at 3:43 AM\nWOW\n\nI had a blast! Problem solving, action, sad scenes, happy scenes, great plot, fun controls, funny. BUY THIS GAME!\n\nHelpful | 0", "Zor_AmDec 30 at 3:07 AM\nVery cool\n\nThank you for this game\n\nHelpful | 1", "IceBoi117Jan 2 at 10:16 PM\nYes yes yes\n\nYes\n\nHelpful | 0", "CardMagician209Jan 21 at 11:43 PM\nIt do be a bruh moment\n\nIts ok I guess\n\nHelpful | 0", "Wal_NutDec 31 at 7:03 PM\nMmmmmm\n\nIts fun\n\nHelpful | 0", "superduck033Dec 2 at 12:58 PM\nReally fun!\n\nI bought this game recently because of how positive the reviews were. It's a very fun game with some unsettling moments that are done perfectly. My only complaint is that it's a bit short, I wish there were more clients to interact with.\n\nHelpful | 1", "DobutsuDec 27 at 3:51 PM\nMarvelous!\n\nWorthy every dollar :)\n\nHelpful | 0", "mercygrace22Jan 6 at 12:15 PM\nReally liked but absurdly short\n\nI really liked the game but you can easily play it in an hour and it isn't the type of thing you would want to go through more than once. Definitely a mini-game.\n\nHelpful | 2", "Before_the_UnionNov 6 at 4:42 PM\nBest VR game by far\n\nI recently bought VVR but, through an hour of play, I instantly fell in love with it. The story is very interesting and the A.Is are very likable, something about their personalitys feels real. I just love this game 10/10 would recommend.\n\nHelpful | 3", "GrimmcragDec 29 at 2:21 AM\nShort but sweet\n\nGreat fun little puzzler, little bit on the short side but a lot of fun while it lasts.\n\nHelpful | 1", "BuddyJr1016Mar 21 at 4:29 PM\nI great\n\nI think it's great but if u can add when u get bad ending u bee get it u can be chaz\n\nHelpful | 0", "Sea_Crust56Mar 30 at 12:20 PM\nFun and Spooky\n\nIt's fun and spooky. Worth the money.\n\nHelpful | 0", "hakondaleDec 16 at 12:45 AM\nVery fun but short\n\nI would give 5 stars if the story was longer or if the game had more replayability. Otherwise incredibly creative and fun, with a surprising amount of depth.\n\nHelpful | 0", "PicklecatpersonDec 27 at 9:49 PM\n\nBeautiful\n\nHelpful | 0", "MylesMorOct 13 at 6:24 PM\nExcellent!\n\nAlthough a little on the short side (about 3 hours), this game is absolutely fantastic and really justifies its price. As others have said, I get strong Portal vibes from it which is great; it really balances the comedy and creepiness perfectly. Would absolutely recommend to anyone, especially those who like puzzles games and good storytelling. I'm hoping there will be a sequel in the future!\n\nHelpful | 2", "MrShplurgenOct 10 at 1:40 PM\nFantastic!\n\nI had this game on the Oculus GO, and it was amazing, but playing on the Quest is almost entirely a whole new experience! This game will spook you and make you laugh throughout the entire story. I loved the extra content they added that was not in the GO version, and in this version I felt like Chaz was a lot more likable, although I can't quite tell why.I would love to see a sequel or really any VVR related game in the future.\n\nHelpful | 11", "Dittoman17Dec 4 at 1:30 PM\nThe under presents vr vr\n\nKeep making these kinds of games. Maybe even a horror game? With your creativity it would be a\nmazing!\n\nHelpful | 0", "PATZMNDec 9 at 4:43 PM\nUnbeliveably incridible\n\nSuch a storyline it almost maid me cry! Must buy and great to show friends.\n\nHelpful | 0", "OctobastardDec 3 at 1:45 PM\nAnti capitalist, pro union game\n\nIt's complex, it's funny, it's deep, the gameplay is good. I have a new favourite game\n\nHelpful | 1", "Jackson217Mar 29 at 6:30 PM\nGreat\n\nGreat\n\nHelpful | 0", "PoconoPeteDec 3 at 8:30 PM\nCareful With This One\n\nThis might be a great game. Sometimes a game needs time to grow on you. I played almost to the end and havent gone back to finish. Someday Ill finish and maybe replay to give a fairer review. For now Im having too much fun with other titles. This is not a must own or for everyone in my opinion.\n\nHelpful | 3", "brent.avilaNov 21 at 9:08 PM\nExcited for VVR 2\n\nA little uncomfortable at times but in a humorous way. The storytelling and interaction is the best I've played. VR is getting better fellas.\n\nHelpful | 1", "UDontHaveMyNameNov 25 at 6:10 PM\nThis game is great!\n\nIts very memorable and I love how these devs try new things! Its hilarious and I love the crazy worlds they throw you into\n\nHelpful | 1", "WolfgangleaderOct 15 at 9:11 PM\nWonderful Experience\n\nI dismissed this at first, thought by namesake it'd be like First Steps or the like, just a collection of experiences, but I can happily say I was sorely mistaken. This game has a fun story, engaging concept, and is overall just an enjoyable experience. Worth every penny for sure, even if it only comes in at around 3-4 hours start to finish.\n\nHelpful | 3", "RobinAntimatterMar 20 at 5:03 PM\nA wonderfully surprising experience\n\nSo many ins and outs to explore.\n\nHelpful | 0", "alessandro2008Mar 15 at 9:55 AM\nTHE BEST GAME EVER\n\nThe game was really funny and just all put great.\n\nHelpful | 0", "Jake1027Nov 2 at 11:48 AM\nGreat game!\n\nI used to own this game on the go, and it was great. But it's even better on the Quest, because you have two hands and motion tracking! And to top it all off, it has a great story! I 100% recommend this game.\n\nHelpful | 1", "kostaskoutastrOct 15 at 3:35 PM\nThe best comedy- puzzle narrative game.\n\nIf you love irony. If you love puzzles. If you love mindbends. There is no other hand you can experience such a great story. Bravo! Keep making those type of games. My go to narrative game for newcomers. Really funny. Really fast and not a short experience. Oculus quest integration is perfect. Thank you developers for the great experience.\n\nHelpful | 0", "KittyCremeOct 11 at 9:37 PM\nStanley Parable BUT BETTER\n\nI had so much fun playing this, it reminded me both of portal and the Stanley Parable. Witty script likeable (and hatable characters LOOKING AT YOU SPRINKLES) it's all the mind breaking mechanics you want in a vr puzzle game. I would love love looove to see more story and characters in the future for a DLC over all very happy with this game.\n\nNote for parents: has moments where epilepsy may be triggered , but very kid friendly otherwise.\n\nHelpful | 2", "Dragonflies101Mar 12 at 7:27 PM\nInclined to give 1.5 for the memes\n\nBut deserves a 5 for the gameplay and story.\n\nHelpful | 0", "ChuncksterNov 16 at 1:19 AM\nGreat Game\n\nHave not finished the game yet, but as far as I can say, It's a great and humorous game. Would definitely buy again!\n\nHelpful | 0", "tedeschi.ikkaNov 25 at 11:59 AM\nGreat game!\n\nWill be waiting for a VVR II while enjoying \"the under presents\" :D\n\nHelpful | 0", "redalert33Oct 18 at 7:46 AM\nBland, frustrating, and pretentious.\n\nI'm sorry, no disrespect to those who worked on this game, but this was by far the worst Quest game I've ever played, possibly one of the worst video games in general I've played in 3 decades. I love surreal, cerebral, weird stuff that tries to do something different. That's what this game seems like at first, but it's not, by a long shot. You start off thinking it's just a bunch of weird pointless minigames, and it is... for about 2 hours until they finally \"lift the curtain\", so you think it's going to get interesting. Think again, it's just more boredom and confusion. At one point about 3/4 into the game, you literally just have to keep trying different headsets / levels over and over until you luck out and get on the right path towards the end of the game. That's when the game tries to get super philosophical and deep but it just doesn't work, at all. When the game finally \"ends\", of course it doesn't really end but rather puts you in a loop where there's no real ending. Total waste of about 4-5 hours and money. I wish I could get a refund but of course I'm beyond the warranty period. Not sure if everyone giving this good reviews was just high af when they played or what...\n\nHelpful | 18", "stefanatliNov 13 at 4:04 PM\ngreat story\n\nthis game is so fun. love everything about it. and it is fun to replay. credit to Chaz and the makers. I wanna say. best VR game out there\n\nHelpful | 0", "MitchchuOct 1 at 6:36 AM\nThe Mercedes Benz of VR gaming\n\nThis was the very first VR game I played after getting my quest, and it was the best decision I ever made. This game is zany and fun, all the while scaring you to your core. Why? I dont really know...but its scratches that weird itch that very few titles have managed to achieve in the past. Itll keep you on the edge of your seat with your headset on your face for hours on end. And almost perfect game in my opinion.\n\nHelpful | 3", "UnstableQuestNov 16 at 6:57 PM\nAmazing\n\nWords cant explain how good this game is. Jumping from one reality to another. Great starter!\n\nHelpful | 0", "waterzipperNov 2 at 3:05 PM\nAbsolutely amazing game\n\nThis is an absolutely amazing game, that being said I wish I was a little longer. It plays very similar to Stanley parable but with a significantly less plot branches. I would love to see more from this game studio I had a great time playing!\n\nHelpful | 1", "nintedo18Mar 17 at 6:48 PM\nAmazing experience\n\nThe only downside was the constant tonal shift during the beginning\n\nHelpful | 0", "JimZMNov 12 at 1:39 PM\n\nVery weird and interesting game. Also I got stuck for a long time because I forgot I could \"unsuck\" stuff.\n\nHelpful | 0", "MeowformebabyOct 4 at 7:54 PM\nSecond playthrough\n\nIm playing this again, Ive already finished it on the Go, but Im just as amazed as last time. There isnt a single VR experience that has topped VVR. VVR is incredible, funny, and immersive. I am obsessed and I cant wait for the devs new upcoming title!\n\nHelpful | 3", "Z_StewDec 1 at 9:40 AM\nWeird and scared the crap out of me.\n\n10/10\n\nHelpful | 0", "ZambiegoatNov 17 at 2:30 PM\nVery epic\n\nIts such a deep game and has such a cool plot and amazing graphics.\n\nHelpful | 0", "tigerbeatleNov 29 at 7:56 AM\nGood\n\nGood\n\nHelpful | 0", "raydefalcoOct 29 at 12:55 PM\nVery immersive\n\nThe game is super immersive. The puzzles are somewhat difficult and can be frustrating but the concept is very cool and I got lost playing it for hours.\n\nHelpful | 0", "8CNov 15 at 8:11 PM\namazing\n\nif i were to make a vr game it would be extremely similar to this\n\nHelpful | 0", "Ashley1226Nov 19 at 5:02 PM\nLove it!\n\nDefinitely a quick play but so much fun!!\n\nHelpful | 0", "Helmy366Apr 1 at 6:48 AM\nAmazing\n\nJust looks so good on the quest and is definitely worth the price. I love how it is so dark yet there is nothing really to scare you! And uncovering all of those secrets I thought was just amazing to be able to break the system in the game. So much fun! Virtual Virtual Reality 2?\n\nHelpful | 2", "furtinOct 4 at 1:41 AM\nFantastic game on the Quest\n\nThanks to the developers (and the publisher) I can now play the game that I bought on the GO in all its 6DoF glory on the Quest!\n\nFor those who didnt read all the other reviews: buy it! Buy it now! And enjoy one of the most creative VR games that are out there!\n\nHelpful | 1", "GamebuzzOct 12 at 9:47 PM\nCountless ways to play.\n\nV-VR is quite definetly a big favorite for me, and I recommend this game to anyone. V-VR has a large amount of ways on how you can do things. Anyone that just started playing on the quest, this game is a great starter.\n\nHelpful | 0", "gianni.belotti.33Oct 29 at 3:12 PM\nVirtual Virtual? I agree!\n\nIts very intriguing and leads to clever puzzle solving. Theres definitely a Portal vibe going on with a more bittersweet ending. I recommend this to any puzzle enthusiast with the need of something surreally fun.\n\nHelpful | 0", "goodbyeDeskOct 4 at 8:39 AM\nStellar Narrative Experience\n\nEverything you've read is true. The less you know about the game the better. Just know that it's a narrative experience. Game-play wise, it's more of an exploration experience with limited puzzle solving but this is because there is a really unique and fun story that's the forefront focus.\n\nPresentation 5/5 so much depth\nStory 5/5\nThe motion feel - 4/5\nGame play- 3.8/5 - (feels good doing it but its very scripted)\nValue 5/5 - (felt the price was well worth it)\n\nHelpful | 4", "thepatarazziNov 16 at 11:55 PM\n\nAbsolutely incredible!\n\nHelpful | 0", "dreemrOct 9 at 9:50 PM\nAbsolutely amazing!\n\nThis is more than a game. Its a mind-blowing experience and work of art. WOW! Im so happy with my first purchase. It was so entertaining that I drained my Quest just on this experience. Worth every penny!\n\nHelpful | 0", "PyroFlame717Oct 19 at 9:33 AM\nWeird wacky and awesome\n\nThis game is a perfect example of things that vr can do that doesn't involve shooting down wave after wave ( not that I mind shooters) this is a must have\n\nHelpful | 0", "beauregardenerNov 9 at 12:19 PM\nFantastic game\n\nOnly wish it was deeper and longer\n\nHelpful | 0", "Angryp1ckleNov 28 at 1:17 PM\nLike Portal\n\nEntertaining, immersive, silly.\n\nHelpful | 0", "KillYourTvNowSep 28, 2019 at 11:51 PM\nVery Awesome but Short\n\nThis game is amazing but falls really short with the amount of game play. From start to end the adventure seems to fly by. I just wanted to dive deeper and deeper but unfortunately there are only so many options. The preview makes it seem like there's thousands of headsets, but you come to quickly find out you are limited. Great game, just wish it was much more as it appeared.\n\nHelpful | 4", "UhluhtkNov 18 at 5:45 PM\nGood game\n\nThis game has a great story and is designed well, but it is not very replay able. I would recommend it to anyone, but, savor your first play through and dont rush through it.\n\nHelpful | 2", "OfficialSammyGOct 1 at 4:56 PM\nAwesome!\n\nIve only played this game for an hour but it is 10/10 it feels like super hot so if you played that you will love this it has this casual feel and then you get into this twisted dark dimension\n\nHelpful | 2", "MatthblueNov 8 at 3:06 AM\n\nBit short but great\n\nHelpful | 0", "CrispyCrabOct 20 at 1:24 PM\nVery good game, however...\n\nLet me start off by saying, I like this game a lot. It had excellent writing and awesome mechanics, as well as engaging puzzles.\n\nHowever, I could not recommend this game as it is currently priced. Overall, this game is roughly a 3-hour experience. I completed it in one day with frequent breaks.\n\nI would wait until it goes on sale or something, but if VR inception is your kinda thing, then get the game. It is well worth your time, but the money is a bit much.\n\nHelpful | 5", "zeldadrummerNov 2 at 10:42 AM\nAmazing writing\n\nSome points Im just laughing way too much\n\nHelpful | 0", "FauxDoadlesOct 18 at 9:51 PM\nScary good\n\nGreat writing, fantastic narrative, it feels like a a game hidden in a horror game and I was left wanting more\n\nHelpful | 0", "chrisdothtmlSep 10, 2019 at 7:14 PM\nThis is the game I've been looking for\n\nHonestly I'm pretty underwhelmed with most of the VR games out there, but this game is amazing. Everything about it is great; the movement mechanics, the ability to randomly play around with your environment, the attention to detail, the infinitely nested VR environments. I also agree with others that it reminds me a lot of the portal games which I also really love\n\nHelpful | 0", "Lucasw805Sep 25, 2019 at 7:17 AM\nGreatish\n\nSo I got it thinking it was a cute fun game and I played the game and my brain exploded. Its cool how it is one of those futuristic games and there can be a whole other theory or game explaining the past. All in all the game was great I think everyone should play this game.\n\nHelpful | 3", "DittoPandaSep 8, 2019 at 6:29 PM\nDont pass this game by.\n\nIm so glad I picked this game up, its perfect for anyone who wants a different experience with VR and has me incredibly astounded. Ive never played a game that is so outrageous, funny, and terrifying at the same time. The voice acting is wonderful, the story is unique and has a lot of replayability value, environments that are so crystal clear and controls that are fun and simple. It forces you to think and gives little direction in how to escape the cycle. I would gladly throw more money (and toast!) at a sequel in the possible future.\n\nHelpful | 0\nDeveloper ResponseSep 13, 2019 at 5:23 PM\n\naww thanks! Butter appreciates your offer! Next time, he wants them extra crispy.", "DDubs823Oct 29 at 11:58 AM\n\nSuch a great game. 10/10 would recommend\n\nHelpful | 0", "noahrobinson69Nov 3 at 3:33 PM\nFantastic\n\nExcellent game\n\nHelpful | 0", "DanOnWebSep 27, 2019 at 12:25 PM\nAmazing experience\n\nBeing a big fan of Portal, this experience is right up my alley. Love the style of narrative and the interactive environments. The graphics look great on the Quest. Im going back in!\n\nHelpful | 0", "LoneRunner907Sep 17, 2019 at 4:28 PM\nAmazing story!\n\nI love how this game takes a dark turn, the story making you wonder whats gonna happen next! The only issue I have is the game was short and Im hoping the developers of this game make a second VVR or DLC\n\nHelpful | 2", "Slo-Oct 22 at 3:29 AM\nButtery Smooth\n\nI never imagined id get to repeatedly suck up a strangely erotic sounding bar of butter until i actually found out what i needed to do.\n\nHelpful | 1", "willifosNov 14 at 1:32 PM\nkinda fun sometimes & kinda boring too\n\nI can see how some people might be into this game but its not for everyone.\n\nHelpful | 2", "PDaddy2006Oct 18 at 3:52 PM\nGreat game!\n\nA funny well made game with interesting secrets to be discovered\n\nHelpful | 0", "mcoops26Oct 9 at 8:33 PM\nSo underratted\n\nOh my god buy this game now. No one talks about it even though its one of the best games on quest.\n\nHelpful | 1", "christian.prisonOct 12 at 2:08 AM\nNot my type of game\n\nThe game is made with a lot of love for the details and gameplay as well as design are consistent. However, since I simply dont like this abstract type of games, I have to remove one star.\n\nHelpful | 0", "amber.rissewOct 20 at 10:51 AM\nAwesome game!\n\nIve enjoyed this game a lot so far!\n\nHelpful | 0", "Default_usernamOct 5 at 9:01 AM\nGreat\n\nI have not finished it yet but what Ive played has the perfect amount of silliness with seriousness\n\nHelpful | 1", "trekeyusSep 24, 2019 at 10:48 PM\nNight and day difference.\n\nThe Oculus Quest build is significantly better than the Oculus go version. This game is fantastic I'm glad I gave it a second chance with six degrees of freedom.\n\nHelpful | 0", "Black_To_The_PinkAug 15, 2019 at 11:11 AM\nWow, 1111111110% recommended for anyone\n\nIt is really amazing! I bought it thinking that I would just do jobs and everythings happy but as soon as I sucked up butter the first time, I liked it even more. I played it nonstop and I can tell theres more I havent discovered. It puzzled me a couple times so I had to look up what to do but I did some of it on my own . There was only 1 bug. The first one was that I couldnt step inside the elevator so I thought I wasnt supposed to go in there, so I wasted a lot of time, but then I exited the game to watch YouTube because I was getting frustrated and when I went back in it was fixed so it wasnt bad at all. If you are reading this and havent bought it yet BUY IT\n\nHelpful | 6", "FuzeMacOct 6 at 8:01 AM\nGreat game\n\nVery funny and cool. Definitely one of my favorites on quest and I very much recommend it.\n\nHelpful | 0", "kafkazorOct 25 at 6:07 AM\n\ni felt act 3 was rushed and i often wasnt sure what to do but i enjoyed it overall.\n\nHelpful | 0", "lettucegyySep 8, 2019 at 7:30 AM\nGood game\n\nThe game is very interesting and has a good story. I was wondering if you guys could add a button or something where you could look through all the headsets in the box that Chaz gave you but if its not possible i understand\n\nHelpful | 0", "VinesmemesNov 3 at 7:50 PM\nKinda disturbing\n\nTrippy still kinda fun\n\nHelpful | 0", "Gudboi8Oct 5 at 7:59 AM\nA masterpiece\n\nVirtual virtual reality is a very creative game with an amazing storyline\n\nHelpful | 0", "Aubei.BassemNov 1 at 2:44 AM\n\nFantastic but spooky and fun\n\nHelpful | 0", "MichaelKorenOct 14 at 8:16 AM\nAmazing game!\n\nLoved every minute of it!\n\nHelpful | 0", "gazzonatorMay 22, 2019 at 3:07 PM\nSo much depth\n\nIm getting a lot of Portal vibes from this title, very funny but the game is a little short, hoping for a virtual virtual reality 2\n\nHelpful | 388\nDeveloper ResponseMay 22, 2019 at 10:21 PM\n\nWe've got some big buttery ideas", "DakkardSep 30, 2019 at 10:50 AM\nExcellent silly fun game.\n\nGreat fun, really immersive and also a brilliant way to show off the quest to people.\n\nHelpful | 0", "dteMay 22, 2019 at 7:18 PM\nHeavy Portal vibes, brilliant writing\n\nIve been playing this game for about an hour and I absolutely love it. If you ever played Portal, this will strike a chord with you. Its appropriately creepy, bizarrely funny, and captivating gameplay.\n\nMy only gripe is that moving around in space makes me a bit nauseous! I wish that teleportation was instant instead of smooth/animated, a la Robo Recall.\n\nHelpful | 156\nDeveloper ResponseMay 22, 2019 at 10:18 PM\n\nThanks so much for playing! glad we hit our mark of creepy and bizarrely captivating", "anjanjanjAug 17, 2019 at 4:15 PM\nMy Favorite VR Experience By Far!\n\nVirtual Virtual Reality is an absolute masterpiece. Funny, boundlessly creative, dark and mind-bending in its own unique way. The visuals and music are gorgeous and sound design/voice overs are top notch. I thoroughly enjoyed the experience and was totally hooked by the story from beginning to the end, and plan to play through again.\n\nThis will be the best $15 you can spend on the Quest. Buy it!!\n\nHelpful | 0", "SomeoneRandom05Oct 1 at 2:27 PM\nBest vr game ive played so far.\n\nReally fun game kinda like portal.\n\nHelpful | 2", "idontkn0wAug 10, 2019 at 3:23 PM\nWow, just wow\n\n\"ive gone to get food brb\" still confused at that note but other then that I think I'm done and yet I'm going to play the entirety of it again just to see if I can get a different ending. Putting that aside the game got super deep and I very much enjoyed it\n\nHelpful | 4", "noozledJun 2, 2019 at 4:47 PM\nA Truly Mindblowing Masterpiece\n\nI dont want to spoil much but VVR is a truly one of a kind VR experience which has a familiar tone and style reminiscent of the Portal Franchise, a bit of Job Simulator (with a more mature darker tone) and even Black Mirror. If any of these titles are favorites of yours, this game is a must. It only has a playtime or maybe 2 or 3 hours if youre taking your time, and can probably be completed in just over 1 if you know what to do, but despite that I find this game totally worth it for its 15$ selling point.\n\nHelpful | 22", "dballot34Jul 30, 2019 at 5:29 PM\nAbsolutely Brilliant!!!\n\nI didnt have much expectation for this going in as a new VR owner and man did this blow me away! There are moments in this game that are mind blowing and the writing and humor is spot on.\nCant wait for more games by this developer.\n\nThe only thing I would change is to offer a free roam movement using the analog stick instead of the find a spot to travel and push A default in most games.\n\nHelpful | 4", "TipsyTopLightAug 9, 2019 at 11:19 PM\nLove it!\n\nThis game is awesome. The story line is solid, and the voice acting is superb. Many parts had me laughing out loud. The twist at the end is also fantastic. This game is seriously underrated. If you enjoy story-driven puzzles like \"portal\" you must give it a try!\n\nHelpful | 2", "AlabasterSlimAug 19, 2019 at 4:39 PM\nIncredible!\n\nAbsolutely incredible game. I was captivated from start to finish. As others have said it has a real Aperture Science feel but with its own twist on it. The end had me shocked! Can't wait to see what this team comes up with next. 10/10\n\nHelpful | 0", "diomarkJun 3, 2019 at 10:34 AM\nGreat sitting experience\n\nI wasn't planning on picking up this game, but I'm glad I did.. If you're looking for a less active title, then grab this one.. The various environments that they toss you into are awesome.\n\nEDIT - just beat it - really fun and creative game. Pick this up if you're on the fence.\n\nHelpful | 33", "PeaceEnlightensErrJul 22, 2019 at 6:27 PM\nFinally, a good story\n\nMost of the games on this store are great arcade-esk experiences. VVR on the other hand provides an involving story with gameplay that is truly its own. This game will scare you (I don't know how intentional it is but Chaz definitely gave me a heart attack a few times) but, more importantly it will make you feel something. The grid especially made me completely forget I was standing in my home. Buy it. Just buy it, you can thank me later.\n\nHelpful | 0", "jdawg57Jun 19, 2019 at 8:06 PM\nMakes the go version look like nothing\n\nI played this back on the oculus go and loved the trippy aspects and captivating environment. Playing this on the quest takes this game even further than I thought it could go. The graphics and colors really pop and it feels like a new game. My favorite environment has been the grid and the immersion it gave me. This game is amazing and I recommend it highly.\n\nHelpful | 4", "SpamFacedToolbagAug 25, 2019 at 7:23 AM\nInteresting, but not great\n\nThis game was fun, and really original. However it doesn't quite offer the expansive set of universes to traverse that it advertises. Very linear storyline for a game that boasts multiple endings, and not a huge amount of replayability beyond the first two playthroughs\n\nHelpful | 5", "synthem3scAug 29, 2019 at 7:21 PM\nFantastic storytelling\n\nSort of like The Stanley Parable meets Portal 2.\n\nHelpful | 2", "lefoulkrodJul 15, 2019 at 4:09 PM\n\nSuch a fun game. Its filled with all the small details that really make a vr game great. Lots of immersion through interactions with your environment. A wonderful story that slowly unfolds to a satisfying and unexpected conclusion. Its a smart game well worth the price.\n\nHelpful | 2", "DiamondgamerkingAug 16, 2019 at 1:09 PM\nAwesome\n\nThis game was really fun and interesting and fun but kinda short. Maybe 2 hours of gameplay. Really would enjoy a sequel\n\nHelpful | 1", "Mr._Golden_GuyJul 28, 2019 at 6:25 AM\nIssue on Quest Version.\n\nWhen you take your first job with butter and you need to vacuum up your mess, when he powers up your vacuum it doesn't suck him up. As a matter of fact, It doesn't suck up leftover bread or anything. The worst part is that you can't remove the virtual headset because it has been ADMIN LOCKED, SOFTLOCKING MY GAME. The only way to exit the game is open the oculus menu and press (X) \"Quit\". Please fix. I really want to advance in the game. Not sure if anyone else has the same issue. :( just got the game yesterday.\n\nHelpful | 6\nDeveloper ResponseAug 22, 2019 at 4:20 PM\n\nSorry about that, you can consume butter by using the index trigger to vacuum instead of the grip. Or with the latest patch either will now work.", "rattleheadxyzJul 6, 2019 at 10:15 AM\nAbsolutely Incredible\n\nWell, I just finished my first playthrough and I am just blown the heck away. This is exactly the sort of game that I got Into VR for. Its the sort of game that makes me feel like a kid again, when the entire world was a mysterious place and everywhere you looked, there was a mystery or surprise to discover. VVR starts off simple enough, but soon you learn that theres so much more going on, and when you begin to grasp the situation, it becomes something well and truly amazing. And yes, Im being vague. Youll thank me after youve played it.\n\nHelpful | 3", "CURTROCKJun 22, 2019 at 7:24 PM\nIm SHOCKED!\n\nI took a chance buying this, thinking it would be ok, or maybe even good...Holy CRAP! This goes way, way, beyond my expectations. The promo video of a cute/fun graphical style didnt prepare me for a down the rabbit hole kind of experience this is. This game proves that you dont need killer/photo-realistic quality graphics for an intense experience...understanding the VR MEDIUM and creativity is all you need. The Quest has more than enough horsepower to deliver wicked VR, and this game proves it. The makers of this game get it Mind - Blown!\n\nHelpful | 2", "HybridAlienAug 5, 2019 at 7:56 PM\nIncredible!\n\nBuy this now if you love butter and want to show off what your VR headset can do you wont regret it ! Please add a update for more content !!!\n\nHelpful | 1", "tristan116Jul 3, 2019 at 8:53 PM\nGet this game\n\nIncredible voice acting first and foremost amazing presentation I don't want to spoil anything about this game so IL just say I was impressed at this price I was expecting much less, I felt like this was a story you could only tell through the medium of vr there's even some moments with horror vibes if your into that ,\n\nWould highly recommend this game great experience and fairly priced great work Devs\n\nHelpful | 1", "tripleh3lixJun 8, 2019 at 5:27 PM\nAmazing sitting down experience\n\nFast to pickup. Fun. Beautiful graphics. The game is very much point and click or toting around with stuff, but it has a portal feel with the actual storyline. People who cant stand for VR on the Quest with disabilities will love this. Also the developers are incredible and quick to reply, theyre amazing people! Thank you!!\n\nHelpful | 3", "4RT1F1C1ALJul 1, 2019 at 6:37 AM\nAmazing VR Narrative\n\nI loved how V-VR utilized VR in such a way to enhance storytelling. A narrative like this in VR is what I've been longing for.\n\nThough my playthrough was quite short (found my way into the archives very quickly). A good example to keep exploration a bit longer is in \"Her Story\" which provides a clever method to prevent the player from immediately finding the end goal even though the game allows the player to view any video in any order.\n\nHelpful | 0", "smilingrobMay 27, 2019 at 10:57 PM\nOne of the top VR story games.\n\nIt takes a few hours to get through the story. I took my time, enjoyed the environments and story. I really like the crazy levels like the brooms swimming with birds chirping. I wish there were more adventure like puzzles, I think it would be so much better if you could carry 1 or more things around with you to solve puzzles. I also think a few more size levels would be fun, like the city one, but maybe a micro one too. Compared to every video game, this is a good game. But in the VR space, this game is fantastic 5 out of 5.\n\nHelpful | 5", "MystyTideseekerMay 26, 2019 at 7:18 AM\nAbsolutely worth 15$\n\nYou don't expect it going in, but this game can actually be slightly spooky (at times).but at other times.......the puzzles are wonderful, the interaction is amazing, and the concepts are GLORIOUS. The story really isn't that long, but it's definitely long enough to justify the price  give it a try!\n\nHelpful | 5", "Crazy_SaneJul 15, 2019 at 1:54 PM\nMuch better than expected\n\nI was on the fence for a while, but given the low price and high rating, I finally got it. Brilliantly written story, fun gameplay, and hours of content. Can't recommend it enough.\n\nHelpful | 3", "Ser2Jul 10, 2019 at 6:14 PM\nWho made this game!?!! Make a sequel plz\n\nWhat an unimaginable weirdness. Just loving it. Please make it last little longer. Unhappy tree or singing mountain goat in a shack... good job keep up the good work and sell it little more expensive.\n\nHelpful | 3", "Squirrel-manSep 6, 2019 at 4:23 AM\n\nIt was ok but if your into longer games I recommended you dont buy this game\n\nHelpful | 2", "irateoverlord23Jun 21, 2019 at 7:45 AM\n\nMan I went into the game without seeing any of the previews so by the main picture alone I thought this was gonna be a kid game in a way Im not too proud to admit that I was completely wrong this game was so much more than that very trippy and had a hack into the matrix type deal\nThe craziest thing about the game other than obvious story is when I was put on top of a windmill tower why you ask because I actually work on those lol cant wait for a sequel my only complaint is that I wish it was longer\n\nHelpful | 2", "mercilessqtipJul 9, 2019 at 2:23 PM\nOne of the best VR games PERIOD.\n\nOne of the best virtual reality games period. Interesting experience. Fun gameplay. I owned this for the Go originally and had no problem buying it again for the Quest. Even more fun being able to walk around and stuff.\n\nHelpful | 0", "galc75799Jun 28, 2019 at 3:34 PM\nMeh.\n\nIt's an interesting story but a.bit a let down on visuals. I was expecting a number of beautiful world's to explore but nothing more than a.bit of walking in some really vague environments, and some basic mechanics. Don't really get it why the high reviews on this game.\n\nHelpful | 11", "SorCarstenJul 9, 2019 at 11:47 AM\nGreat adventure!\n\nI think the marketing of this game straight from the game cover/poster to the description and promotional video do not do this game any justice. Fantastic game and experience, and the story line is excellent.\n\nHelpful | 1", "gone4daysJun 14, 2019 at 12:12 PM\nGREAT game\n\nI was looking for something different and I found it. It is a great game with lots of great environment and visuals. I found myself laughing out loud a few times. The writing is great and funny. I cant recommend it enough. Well worth the money. I look forward to more titles from this developer\n\nHelpful | 4", "steve13870Jul 3, 2019 at 1:06 AM\n????\n\nThis has very positive reviews so I bought it and yet I am about an hour in and I'm just not getting it .I understand that it's kind of off the wall I knew that going in .as I say I've played for about an hour so I'm intrigued and will finish the game and I will of course amend my review should my experience changes !\n\nHelpful | 7", "PeaceablecoltJun 11, 2019 at 3:37 PM\nBest narrative experience in Quest\n\nIf you like Portal mixed with some Justin Roiland esque humor, buy this game, 100% worth your money and time. Best narrative gaming experience Ive had in a long time.\n\nNote to the Devs: if you are reading this I have one issue I found near the end of the game (light spoilers). When getting the bad ending I went to the level select room and was able to select the good ending before beating the final boss. Sort of ruined the experience of beating the boss once I realized what had happened. I would recommend making sure that selection stays locked until the player completes that boss. That being said great job on the game!\n\nHelpful | 5", "ExcessPanacheJun 20, 2019 at 1:52 PM\nReally wonderful\n\nI took a gamble on this and went in completely blind. If you are in the same situation (and even if you arent, honestly) this is worth 11 or anyones money. Full of surprises, often amusing and affecting in a brilliant way... just buy it.\n\n(For all its brilliance though, the first toast encounter is apparently glitched and I had to restart the full game twice until it randomly worked. Frustrating but there are workarounds)\n\nHelpful | 0", "DAX_QcAug 30, 2019 at 10:50 AM\nNope, not for me.\n\nAnnoying little games that go nowhere. This game is not for me.\n\nHelpful | 7\nDeveloper ResponseSep 13, 2019 at 5:30 PM\n\nThis is the Human Labor Union, at first glance Activitude can seem a tedious place, but we are always standing by to free you from your absurd loop and assist those who want to go deeper.", "GeeBee2Jun 4, 2019 at 6:18 AM\nWow!\n\nI passed this game by on launch day but checked it out after ready about it on reddit. So glad I did, so much fun, confusion, frustration and laughs. Pure escapism, just buy it, best tenner you'll spend on here. Completed it but going to start again. And please, in VVR2 can we have a bit less butter? \n\nHelpful | 6", "InkyDeathJun 11, 2019 at 2:03 PM\nFor people who want to relax.\n\nIts so fun best be game ever and its not even pricey. Although for kids that are young dont play. Theres a part where a guy says s#*^, but other than that its cool. I got it for my birthday and it trumped all the other gifts. Thanks for making such a wonderful game. Well worth my time.\n\nHelpful | 2", "Death.Scythe.xboneJun 1, 2019 at 11:21 AM\nIf only it was longer\n\nI absolutely love this little game. Its worth $ and experience is fun. The game can be played quickly or if you have the patience you can extend it even longer exploring all the options you have. Its funny, weird, and overall plain fun. I recommend this to new and experienced players.\n\nHelpful | 6", "hahaha-hahahaJul 20, 2019 at 10:37 PM\nyou have to give it a try\n\nOmg this game I really loved it from my heart its really fun and awesome thank you for creating this game\n\nHelpful | 0", "RainbowAquarium88May 21, 2019 at 10:16 AM\n\nSo far this game has blown me away! There's so much depth, the immersion is incredible!\n\nHelpful | 30", "XlazJun 22, 2019 at 1:32 AM\nA underrated game with a great story!\n\nWhen I first downloaded the game I wasnt expecting much, but as you dive future in the the workings of activitude you find out whats really going on with hilarious dialogue and great puzzles everyone should try this game!\n\nHelpful | 0", "virtualusMay 24, 2019 at 2:35 PM\nHow to create a story 101\n\nThe story is amazing and truly makes you terrified of VR after playing this. SAO level stuff here.\n\nHelpful | 11", "ThanosFishMay 25, 2019 at 10:23 PM\nBeautiful Game, Fantastic Story\n\nWhere to start? While it took me about a day and a half to complete the game (or at least one pathway of it), that day and a half was one of the most interesting vr experiences of my life. From the gorgeous graphics that left me stunned, to the perfect characters that made me feel like I was talking to real people. All around an amazing game and I highly recommend it to anyone looking for a surreal experience.\n\nHelpful | 5", "gem2113Jun 2, 2019 at 2:54 AM\nYep!!!\n\nI loved this so much. I finished it quite quickly, so I would like to see a second game or an update to this one with more or a different storyline. I will probably play through the game again in a little while. Its very interesting, very detailed and its so exciting. I felt like such a rebel playing this, it was quite funny!!!!\n\nHelpful | 1", "Numbuh0May 31, 2019 at 10:56 AM\nBrilliant\n\nI feel compelled to communicate how amazing this game is; there is a real sense of novelty, mystery, and depth as you discover the story. I also appreciated the social commentary as the game prognosticates about the future of tech. I especially loved The Grid; I would love to explore that further (maybe I just want a full on Blade Runner game). Thank you to the developers for this experience!\n\nHelpful | 4", "ryanallen_comJul 14, 2019 at 8:34 AM\nAwesome puzzle game\n\nThis game looks and runs beautifully. The story is great and funny and the gameplay and puzzles are challenging enough to be fun without being frustrating. The amount of time I spent in the game also felt right for the price of admission.\n\nHelpful | 0", "crisisaliveMay 25, 2019 at 8:52 PM\nCause for pause\n\nThis game really gave me a bit of self reflection on technology as a whole. Its graphically simple but it works well. Not a fan of teleportation but its execution was great non the less. The music and voice actors all held there own, not quite to the level of glados.... but good, and they all filled there roles in unique and interesting ways. Im interested to see what this developer does next\n\nHelpful | 3", "S1DCMay 23, 2019 at 11:19 PM\nMore please.\n\nThe writers for this game deserve cake.\n\nHelpful | 15\nDeveloper ResponseSep 13, 2019 at 5:35 PM\n\nThanks! We will gladly take all the cake.", "NinjaMonkeyMarkJun 8, 2019 at 6:41 AM\nGreat Sci-fi Dystopia\n\nEngaging sci-fi experience which opens up and pulls you into its narrative. There is a lot to figure out and discover. The game doesnt hold you hand much (which I like), so there might be a little too much trial and error to sort everything out properly. But ultimately that adds to the experience and doesnt detract. Looking forward to more from this developer!\n\nHelpful | 5", "heckmanfrickJul 3, 2019 at 1:36 PM\n\nbutter makes me uncomfortable\n\nHelpful | 6", "brand019Jun 4, 2019 at 7:58 PM\nThe \"Portal\" of VR\n\nSolidly written and paced with a great sense of humor and attractive visual style, my only complaint is that the minigames could be more varied and involved -- I know they aren't the point of the experience, but it would have added some replayability to the game, which like a lot of VR games is a bit short. Still, I'd highly recommend everyone try it out.\n\nHelpful | 5", "galvanizedgazelleJun 17, 2019 at 7:40 PM\nHad a good time with this one\n\nI think I took a lot longer to beat this than the average player, but I still had fun with it the whole time. Despite being so simple, there's something charming about these environments. And I found myself wishing for another point and click style adventure like this one.\n\nHelpful | 1", "TrickxusJun 18, 2019 at 9:35 AM\nAn interesting game to say the list\n\nReminds me of Accounting+ and portal well worth the price there's so much to do and explore however I wish there was smooth locomotion the teleport feature just doesn't cut it for me\n\nHelpful | 0", "wevibhJun 6, 2019 at 1:31 PM\nPerfect\n\nThis was one of the most immersive games/ experiences I have played in years! I loved and enjoyed it all the way through. The voice acting is funny and really high quality. This is so much more than it seems and a must play title!\n\nHelpful | 1", "Deadman12215688Jun 4, 2019 at 9:48 PM\nThe best VR experience\n\nI have never played a VR game like this before there is so much depth to this game its actually insane this is the longest Ive ever spent in a VR game and Im totally amazed keep up the good work I hope there will be a second game!\n\nHelpful | 1", "kallanreedJul 3, 2019 at 10:34 AM\nGreat Story\n\nI really enjoyed this. A little bit of Portal mixed with a little bit of Soma and a lot of humor.\n\nHelpful | 0", "buswheelJun 15, 2019 at 9:54 AM\nBrilliant\n\nJust a brilliant game to play from beginning to end. Fun story writing, great worlds to play around and a sense of achievement when i finally completed it. Well worth the cash.\n\nHelpful | 1", "BanjoubuMay 24, 2019 at 7:22 AM\nLove it but too much white\n\nLove the idea of this game. Ive had some surreal moments. But I have to close my eyes have the time while in the main hub. Almost triggers my migranes, but I'll push through and wait for audio cues to grab stuff.\n\nHelpful | 8", "HoonBalloonMay 27, 2019 at 9:28 PM\nWorth the buy\n\nThis game is much more than a vr gimmick. It's the most unique story telling I've seen on the platform and very entertaining. I'd compare it to portal or stanley parable. Well worth the buy if you an immersive one of a kind experience.\n\nHelpful | 4", "DrachenherzJul 10, 2019 at 1:06 AM\nBeautiful Mind****\n\nImmersive, confusing and thought provoking.\n\nHelpful | 0", "ShemhamMay 21, 2019 at 1:13 PM\nI think I'm missing something!\n\nI paid 10.99 for this. What on earth is it! Gets great reviews but I'm struggling to see why. What do you actually do other than switch headsets and end up in little pockets of VR nothingness with very little to do?!\n\nHelpful | 34\nDeveloper ResponseMay 22, 2019 at 4:15 PM\n\nkeep playing, the human union looks out for all its members, ready to relieve them of the dullest labor", "OG-Aus-Jun 26, 2019 at 3:31 AM\nVery deep\n\nI loved this game it feels like it never ending I try getting as deep as possible its a great adventure\n\nHelpful | 0", "argerichJun 19, 2019 at 11:43 PM\nMust Buy!!!\n\nThis game is a must buy for all Oculus owners. It really shows off what is possible in VR. Reminds me of a PC game called Portal.\n\nHelpful | 0", "TedtousJun 2, 2019 at 5:52 AM\nJust awesome. Can't wait for sequel...\n\nThis game is really great. A little bit short but really cool. Nice musics and graphics. Story is inspired. Perfect with Quest.\n\nSo guys... Let's go make a Sequel !!!\n\nHelpful | 3", "8one6May 25, 2019 at 8:49 AM\nPost singul-arious\n\nI had a really good time with this one. It's a fun story with some nice characters.\n\nHelpful | 4", "smijaJul 1, 2019 at 7:29 PM\nHonestly a great story experience\n\nI wish I could play it again for the first time\n\nHelpful | 0", "DDDestielJun 6, 2019 at 6:34 AM\n()\n\nFull score, to Virtual Virtual Reality\n\nHelpful | 2", "SuperStar839Jun 5, 2019 at 7:27 PM\nMind-blowing! Amazing experience!!\n\nI had no idea how amazing this game would be. It was a great buy. Would recommend to all my friends. It was totally mind blowing! A must-buy!\n\nHelpful | 1", "MindbendJun 27, 2019 at 3:02 PM\nBizarre and humorous\n\n\"Oh, look, it's another do inane things in VR demonstration......\n\noh wait... I spoke too soon!\"\n\nNice one. Keep it weird!\n\nHelpful | 1", "CoveropMay 25, 2019 at 3:43 AM\nLooks just as good as on Rift!\n\nIt's amazing to watch/experience on Quest!\n\nHelpful | 4", "SphaxJun 8, 2019 at 10:52 AM\nVery cool but no french audio\n\nDespite the fact its wrote franais on the game thumbnail in Oculus store, the audio is not translated...\n\nHowever the game is great and a lot like Portal in the spirit! Love it but very short...\n\nHelpful | 0", "DrR0lfMay 26, 2019 at 2:28 PM\nFantastic, original and fun\n\nAn unexpected fun experience. The story, events and voice acting make this great. The visuals are basic, but work. A definite recommendation!\n\nHelpful | 1", "RGVJun 17, 2019 at 8:20 AM\nfavourite quest game so far\n\nFun clever game.\n\nHelpful | 1", "WillsQMay 26, 2019 at 4:35 AM\nMost VR moving experience I've had yet\n\nLoved the writing, voice-acting and detail of it all  atmospheric to the point of shivers!\n\nHelpful | 3"]