{"App Title": "VR Karts: Sprint", "App description": "The checkered flag is about to drop on an exciting Virtual Reality racing experience! \nGet in the drivers seat and race against other opponents in your own customized kart. Race through stunning tracks, collect power ups and use weapons to gain the upper hand over other racers. \n\nVR Karts is a fun and approachable Virtual Reality racing game.\nLets race! \n\nFeatures: \nSingle Player racing experience \nChampionship Trophy Mode \nOnline multiplayer mode \nKart customization \nA host of different weapons to slow down your opponents \nSpeed pickups to boost you to the finish line", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Racing", "Languages": "English", "Version": "1.18", "Developer": "Viewpoint Games Ltd", "Publisher": "Viewpoint Games Ltd", "Website": "http://www.vrkarts.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "CONTACT\n\nMore...\n\nPrivacy Policy\n\n1. THIS PRIVACY POLICY\n\n\n\n1.1\n\n\n\nWhat these Policy covers. This privacy policy (Policy) together with our terms and conditions of use (available at www.viewpointgames.co.uk/privacy) and any other documents referred to on it, sets out how Viewpoint Games Limited (Viewpoint) including its affiliates, collects, stores, and uses your personal data as a data controller (for the purpose of the Data Protection Act 1998) in connection with and in order to provide and develop Viewpoints mobile application, services, products and website (the Services).\n\n\n\n1.2\n\n\n\nWhy you should read this Policy. This Policy sets out the basis on which any personal data we collect from you, or that you provide to us, will be processed by us. Please read the following carefully to understand our views and practices regarding your personal data and how we will treat it.\n\n\n\n1.3\n\n\n\nAcceptance. By using or accessing a Service you are accepting and consenting to the practices described in this Policy. Please do not install or use the Services if you do not agree to this Policy.\n\n\n\n1.4\n\n\n\nChanges to our Policy. We reserve the right to modify this Policy. Any changes we may make to our Policy in the future will be posted on this page, and where appropriate, notified to you by email or when you next start the mobile application or log onto one of the Services. Your continued use of the Services will deem your acceptance of the changes to this Policy.\n\n\n\n2. INFORMATION WE COLLECT FROM YOU\n\n\n\n\n\n2.1\n\n\n\nInformation you give us. This is information you give us about you by filing in forms on the app site and the Services Site (together Our Sites) or by corresponding with us (for example, by phone, email or chat or otherwise). It includes information you provide when you register to use our site, subscribe to our Services, enter a competition, promotion or survey, participate in discussion boards or other social media functions and when you report a problem with our Services or an app. We will keep a record of that correspondence. The information you give us may include your name, address, e-mail address and phone number, age, username, password and other registration information, financial and credit card information, personal description and photograph.\n\n\n\n2.2\n\n\n\nInformation we collect about you. Each time you visit one of our Sites or use one of our apps we will automatically collect the following information:\n\n\n\n(a) technical information, including the Internet protocol (IP) address used to connect your computer to the Internet, your login information, browser type and version, time zone setting, browser plug-in types and versions, operating system and platform,;\n\n\n\n(b) information about your visit, including the full Uniform Resource Locators (URL), clickstream to, through and from our site (including date and time), products you viewed or searched for page response times, download errors, length of visits to certain pages, page interaction information (such as scrolling, clicks, and mouse-overs), methods used to browse away from the page, and any phone number used to call our customer service number.\n\n\n\n(c) details of your use of any of our apps or your visits to any of Our Sites including, but not limited to traffic data, weblogs and other communication data, whether this is required for our own billing purposes or otherwise and the resources that you access (Log Information)\n\n\n\n2.3\n\n\n\nLocation Information. In respect of mobile applications. We also use GPS technology to determine your current location. Some of our location- enabled Services require your personal data for the feature to work. If you wish to use the particular gesture, you will be asked to consent to your data being used for this purpose.\n\n\n\n2.4\n\n\n\nInformation we receive from other sources. This is information we receive about you if you use any of the other websites we operate or the other services we provide. We are working closely with third parties (including, for example, business partners, sub-contractors in technical, payment and delivery services, advertising networks, analytics providers, search information providers, credit reference agencies). We will notify you when we receive information about you from them and the purposes for which we intend to use that information.\n\n\n\n3. HOW DO WE USE YOUR DATA?\n\n\n\n\n\n3.1\n\n\n\nWe use information held about you in the following ways:\n\n\n\n(a) Information you give to us. We will use this information:\n\n\n\nI. to carry out our obligations arising from any contracts entered into between you and us and to provide you with the information, products and services that you request from us;\n\n\n\nII. to provide you with information about other goods and services we offer that are similar to those that you have already purchased or enquired about;\n\n\n\nIII. to provide you, or permit selected third parties to provide you, with information about goods or services we feel may interest you. If you are an existing customer, we will only contact you by electronic means (e-mail or SMS) with information about goods and services similar to those which were the subject of a previous sale or negotiations of a sale to you. If you are a new customer, and where we permit selected third parties to use your data, we (or they) will contact you by electronic means only if you have consented to this. If you do not want us to use your data in this way, or to pass your details on to third parties for marketing purposes, please tick the relevant box situated on the form on which we collect your data;\n\n\n\nIV. to notify you about changes to our service;\n\n\n\nV. to ensure that content from our site is presented in the most effective manner for you and for your computer.\n\n\n\n(b) Information we collect about you. We will use this information:\n\n\n\nI. to administer our site and for internal operations, including troubleshooting, data analysis, testing, research, statistical and survey purposes;\n\n\n\nII. to improve our site to ensure that content is presented in the most effective manner for you and for your computer;\n\n\n\nIII. to allow you to participate in interactive features of our service, when you choose to do so;\n\n\n\nIV. as part of our efforts to keep our site safe and secure;\n\n\n\nV. to make suggestions and recommendations to you and other users of our site about goods or services that may interest you or them.\n\n\n\n Information we receive from other sources. We will combine this information with information you give to us and information we collect about you. We will use this information and the combined information for the purposes set out above (depending on the types of information we receive).\n\n\n\n4. COOKIES\n\n\n\n\n\n4.1\n\n\n\nWhy we use Cookies and analytics. The Services may use cookies and analytics services provided by us or third parties on our behalf to distinguish you from other uses of the Services or app. This helps us to provide you with a good experience when you use the app or browse any of the Services and also allows us to improve the Services.\n\n\n\n4.2\n\n\n\nAnalytics. Website analytics refers to a set of tools used to collect and analyse usage statistics, enabling us to better understand on how people use the Services. We may also use third parties, in order to develop and analyse use of the Services.\n\n\n\n5 DISCLOSURE AND TRANSFER OF PERSONAL DATA\n\n\n\n\n\n5.2\n\n\n\nDisclosure. You agree that we have the right to share your personal information with:\n\n\n\n(a) Any member of our group, which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 of the UK Companies Act 2006.\n\n\n\n(b) Selected third parties including but not limited to:\n\n\n\ni. business partners, suppliers and sub-contractors for the performance of any contract we enter into with them or you;\n\n\n\nii. analytics and search engine providers that assist us in the improvement and optimisation of our site;\n\n\n\niii. credit reference agencies for the purpose of assessing your credit score where this is a condition of us entering into a contract with you.\n\n\n\n5.2\n\n\n\nThird Parties. Personal data may be disclosed to third parties including third parties located outside the European Union or the European Economic Area in accordance with application legislation and this Policy. We may use third parties to collect and process personal data on our behalf and in accordance with the instructions given by us. We accept no liability for acts and omissions of these third parties, save for as provided by mandatory law.\n\n\n\n6. DATA PROTECTION\n\n\n\n\n\n6.1\n\n\n\nData Protection. All personal data is stored securely in accordance with the principles of the Data Protection Act 1998. You may choose to disclose data about yourself in the course of contributing user generated content to the Services. Any data that you disclose in any of these forums, chats, blogs, or the like will become public information, and there is no expectation of privacy or confidentiality with respect to that data.\n\n\n\n6.2\n\n\n\nData Retention. We will retain any collected data for the period necessary to fulfil the purposes outlined in this Policy unless a longer retention period is required or permitted by law. Thereafter we will delete all abovementioned data in our possession within a reasonable timeframe. We do not verify the correctness of personal data.\n\n\n\n6.3\n\n\n\nAccess to Information. The Data Protection Act 1998 gives you the right to access information held about you. Your rights of access can be exercised in accordance with that Act. Any access request will be subject to a fee of 10 to meet our costs in providing you with details of the information we hold about you.\n\n\n\n6.4\n\n\n\nWhere we Store your Personal Data. The data that we collect from you will be transferred to, and stored at, a destination outside the European Economic Area (EEA). It will also be processed by staff operating outside the EEA who work for us or for one of our suppliers. This includes staff engaged in, among other things, the fulfilment of your order, the processing of your payment details and the provision of support services. By submitting your personal data, you agree to this transfer, storing or processing. We will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this privacy policy.\n\nWhere we have given you (or where you have chosen) a password which enables you to access certain parts of our site, you are responsible for keeping this password confidential. We ask you not to share a password with anyone.\n\nUnfortunately, the transmission of information via the internet is not completely secure. Although we will do our best to protect your personal data, we cannot guarantee the security of your data transmitted to our site; any transmission is at your own risk. Once we have received your information, we will use strict procedures and security features to try to prevent unauthorised access.\n\n\n\n7. YOUR RIGHTS\n\n\n\n\n\n7.1\n\n\n\nYou have the right to ask us not to process your personal data for marketing purposes. We will usually inform you (before collecting your data) if we intend to use your data for such purposes or if we intend to disclose your information to any third party for such purposes. You can exercise your right to prevent such processing by checking certain boxes on the forms we use to collect your data. You can also exercise the right at any time by contacting us at our address.\n\nOur site may, from time to time, contain links to and from the websites of our partner networks, advertisers and affiliates. If you follow a link to any of these websites, please note that these websites have their own privacy policies and that we do not accept any responsibility or liability for these policies. Please check these policies before you submit any personal data to these websites.\n\n\n\n8. Safeguards\n\n\n\n\n\n8.1\n\n\n\nWe follow generally accepted industry standards and maintains reasonable safeguards to attempt to ensure the security, integrity and privacy of the information in our possession.\n\n\n\n9 JURISDICTION\n\n\n\n\n\n9.1\n\n\n\nWhich laws apply to this contract and where you may bring legal proceedings. In the event of any dispute between You and us concerning these Terms, are governed by laws of England and Wales and if You wish to bring legal proceedings You must do so within the England and Wales\n\n\n\n10 CONTACT\n\n\n\n\n\n10.1\n\nIf you have any questions, comments and requests regarding this Policy please contact us by telephoning our customer service team at 01926 350147 or by writing to us at Althorpe Enterprise Hub, Althorpe Street, Leamington Spa, CV31 2GB.\n\n 2014- 2020Viewpoint Games Ltd. All Rights Reserved.\n\nprivacy policy\n\nterms of business", "Developer Terms of Service": "CONTACT\n\nMore...\n\nTerms and conditions of business\n\n1.THESE TERMS\n\n\n\n\n\n1.1\n\nWhat these Terms cover. These are the Terms and conditions of use, the Privacy Policy and Cookie Policy (available at www.viewpointgames.co.uk/terms) and all supplemental Terms, as amended from time to time (the Terms) govern your use of any online or mobile product, apps, website or service which we supply to you( You/Your), whether these are goods, services or digital content (Services).\n\n\n\n1.2\n\nWhy you should read them. Please read these Terms carefully before you access or install any of the Services. These Terms tell you who we are, how we will provide products to you, how you and we may change or end the contract, what to do if there is a problem and other important information. By accessing or installing any of the Services You accept and agree to be bound by these licence Terms. If you do not agree to these Terms then do not access or use the Services.\n\n\n\n1.3\n\nYou must be 18 to accept these terms. These Terms for a legally binding contract between You and us. You must be over 18 years of age (or have reached the age of majority if that is not 18 years of age where you reside) to accept these terms or that you have reviewed these Terms with your parent or guardian and he or she accepts these Terms on your behalf and takes full responsibility for your compliance with them.\n\n1.4\n\nPlease keep a copy of these Terms for further reference. These Terms may change for legal, regulatory or security reasons or any other reason by giving You notice by email or via updates or posting on our website www.viewpointgames.co.uk or by asking You to re-confirm Your acceptance of the Terms. Your continued use of our app (s), website or any other aspect of the Services will be deemed Your acceptance of the amended Terms.\n\n\n\n2.INFORMATION ABOUT US AND HOW TO CONTACT US\n\n\n\n\n\n2.1Who we are. We are Viewpoint Games Limited a limited company registered in England and Wales. Our company registration number is 09141996 and our registered office is at Althorpe Enterprise Hub, Althorpe Street, Leamington Spa, Warwickshire, CV31 2GB. Our registered VAT number is GB225875779.\n\n\n\n2.2How to contact us. You can contact us by telephoning our customer service team at 01926 350147 or by writing to us at Althorpe Enterprise Hub, Althorpe Street, Leamington Spa, Warwickshire, CV31 2GB.\n\n\n\n2.3How we may contact you. If we have to contact you we will do so by telephone or by writing to you at the email address or postal address you provided to us.\n\n\n\n2.4Writing includes emails. When we use the words writing or written in these Terms, this includes emails.\n\n\n\n\n\n3.YOUR LEGAL OBLIGATIONSAND TERM\n\n\n\n\n\n3.1Term Period. These Terms apply to Your use of the Services at all times, and shall also govern Your use of the Services from the date that you first download or purchase the Services and shall continue until You delete the Services or either You cancel Your account or we terminate this licence.\n\n\n\n3.2You confirm that:\n\n\n\nall information and details provided by You are true, accurate and up to date. The rights granted under these Terms are personal to You and You must not make the Services available to anyone else;\n\nYou will comply with the Code of Conduct relating to Your use of the Services and/or Gaming Items as set out in Section 5 and 6 below, and You will comply with any other restrictions set out elsewhere in these Terms;\n\nYou agree to compensate us where we pay damages or incur any other loss or expenses (including any legal fees in relation to such claim or damages) following any claim made by a third party in respect of any matter in relation to or arising from Your use of the Services and/or our services including any breach of these Terms or Your violation of any law or the rights of a third party.\n\nIf we take legal action against You for non-payment or any other breach of these Terms and a court makes an award in our favour, You will be responsible for all costs allowable by the courts.\n\n\n\n4. YOUR ACCOUNT/USE OF THE SERVICES\n\n\n\n4.1 Untrue information. If any information You provide in connection with the account (Your Account) created to use certain Services is untrue, inaccurate, out-of-date or incomplete then we reserve the right to refuse Your current and future use of the app and/or Gaming Items and in such event the licence granted to You under these Terms will be suspended and/or terminated.\n\n4.2 Identity of Your Account. We do not have the means to check the identities of people using the Services, including our apps and we will not be liable where Your Account is used by someone else. You agree to notify the platform operator (e.g. Apple/Amazon/Google) immediately ifa you become aware of any unauthorised use of Your Account.\n\n4.3Removal of Content. We reserve the right to remove any content or Gaming Items from any of the Services at our sole discretion.\n\n5. CODE OF CONDUCT AND YOUR USE OF THEAPP\n\n\n\n5.1 You agree that in using the Services or any part thereof You will not:\n\n(a) use the Services for any purpose other than for Your personal use;\n\n(b) reproduce, distribute, publicly display or perform, translate, modify, adapt, create derivate works from, deconstruct, reverse engineer, decompile or disassemble, in any manner the Services or any portion thereof;\n\n(c) access or attempt to access the accounts of other users or to penetrate or attempt to penetrate the Services security measures;\n\n(d) partake in any behaviour that We deem inappropriate and disruptive, or against the tone and nature of the Services (where user-generated content or an online community exists);\n\n(e) harass, threaten, embarrass, spam or do anything else to another person that is unwanted, such as repeatedly sending unwanted messages or making personal attacks or statements about race, sexual orientation or religion (where user-generated content or an online community exists); organise or participate in any activity or group that is harmful, abusive, offensive, obscene, threatening, bullying, vulgar, sexually explicit, defamatory, invasive of personal privacy or encourages conduct that would violate a law or in a reasonable persons view be objectionable and/or inappropriate (where user-generated content or an online community exists);\n\n(f) use abusive, offensive, or defamatory screen names and/or personas, whether created through Services or through Third Party Services connected to Services such as but not limited to Game Center, Google, Facebook or Twitter;\n\n(g) impersonate any other person, or indicate falsely that You are an employee or a representative of our or any of our partners or affiliates;\n\n(h) promote, encourage or take part in any activity involving hacking, cracking, phishing, taking advantage of exploits or cheats and/or distribution of counterfeit software and/or counterfeit or legitimate Gaming Items;\n\n(i) upload any files that contain a virus, trojan, worm, spyware, time bombs, corrupted data or other computer programs that may damage, interfere with or disrupt the Services or any Gaming Items;\n\n(j) improperly use any support or complaint buttons or make false or bogus reports to us; and\n\n5.2 Chat rooms and/or forums. Where the Services functionality permits it, post or communicate any persons real world personal information using the Services or any chat rooms or forums. You will obey all local laws, regulations and rules that apply to Your activities when You use the Services.\n\n5.3 Right to access online activity. We reserve the right to access, monitor and/or record any online activity within the Services and You give us Your express consent to access and record Your activities.\n\n5.4 Breach of rules of conduct. Any breach or potential breach of any of the above rules of conduct shall be determined by us at our sole discretion.\n\n5.5 No Liability. Subject to section 3 We have no liability for any loss or damage caused by Your or any third partys violation of the rules of conduct set out in this section 5.\n\n6. USER GENERATED CONTENT (UGC)\n\n\n\n6.1 Information Communicated. All remarks, suggestions, ideas, graphics, or other information communicated, posted or uploaded by You to the Services shall forever be our property. We shall have exclusive ownership of all present and future existing rights to the UGC of every kind and nature, everywhere.\n\n\n\n6.2 Use of UGC. We shall be entitled to use Your UGC for any purpose whatsoever, without compensation to You or any other person submitting the UGC.\n\n6.3Your responsibility of UGC. You acknowledge that You are responsible for whatever material You submit, and You have full responsibility for the UGC, including its legality, reliability, appropriateness, originality, and copyright. You agree that we shall not under any circumstances be liable for any UGC.\n\n\n\n6.4 Third Party Risks We, or third parties engaged by Us, may monitor and/or moderate UGC but we do not guarantee the accuracy, quality, or integrity of any UGC posted via the app, website or any part of the Services. By using the app and/or our website and/or any other part of the Services, You acknowledge and accept that You may be exposed to material You find offensive or objectionable.\n\n6.5 Rights Reserved. We reserve the right to remove and permanently delete any UGC from the app and/or our website and/or any other part of the Services with or without notice.\n\n7. GAMING ITEMS\n\n\n\n7.1 Payments. All payments made through the Services are made in advance and are non-refundable, to the extent permitted by law.\n\n\n\n7.3 Refunds or Compensation. You acknowledge that we are not required to provide a refund for any reason, and that you will not receive money or tother compensation for unused Gaming Items if we stop the use and access to the Services or app and if your account is closed (whether closure was voluntary or involuntary).\n\n\n\n7.2 Purchases. When purchasing Gaming Items, Your order will represent an offer to purchase the relevant product(s) which shall be accepted by Us (or our third party operators) when the Gaming Items are made available in Your Account for You to use in the App or any other Services or take payment for the Gaming Item, whichever comes first.\n\n7.3 Licence. By purchasing or otherwise acquiring Gaming Items You obtain a non-exclusive, non-transferable limited licence to access such Gaming Items that We expressly make available as part of the Services, and you agree that You have no rights of ownership over such Gaming Items.\n\n7.4 Use of Service. The provision of Gaming Items for use in the app or any other Services is a service provided by Us or authorised third parties, that commences immediately upon acceptance of Your purchase. By ordering Gaming Items You agree to and accept the applicable payment terms of the platform operator.\n\n7.5 No monetary Value for Gaming Items. The Gaming Items have no monetary value and do not constitute currency or property of any type. Coins and Gold may only be redeemed for other Gaming Items within the app or other Services as applicable. Gaming Items cannot be sold or transferred, and cannot be exchanged for cash or for any other goods and services, except for other Gaming Items provided for within the appropriate app or other Services. You are not entitled to a refund for any unused Gaming Items.\n\n\n\n8 OUR RESPONSIBILITY AND LIMITS ON LIABILITY\n\n\n\n8.1We are responsible to you for foreseeable loss and damage caused by us. If we fail to comply with these Terms, we are responsible for loss or damage you suffer that is a foreseeable result of our breaking these Terms or our failing to use reasonable care and skill, but we are not responsible for any loss or damage that is not foreseeable. Loss or damage is foreseeable if either it is obvious that it will happen or if, at the time you accepted these Terms, both we and you knew it might happen.\n\n\n\n8.2 We do not exclude or limit in any way our liability to you where it would be unlawful to do so. This includes liability for death or personal injury caused by our negligence or the negligence of our employees, agents or subcontractors or for fraud or fraudulent misrepresentation.\n\n\n\n8.3 When we are liable for damage to your property. If defective digital content that we have supplied damages a device or digital content belonging to you, we will either repair the damage or pay you compensation. However, we will not be liable for damage that you could have avoided by following our advice to apply an update offered to you free of charge or for damage that was caused by you failing to correctly follow installation instructions or to have in place the minimum system requirements advised by us.\n\n\n\n8.4 We are not liable for business losses. The app and Services are for domestic and private use. If you use the app and Services for any commercial, business or resale purpose we will have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity.\n\n\n\n8.5 Limitations to the App and the Services. The app and the Services are provided for general information and entertainment purposes only. They do not offer advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of information obtained from the app or the Service. Although we make reasonable efforts to update the information provided by the app and the Service, we make no representations, warranties or guarantees, whether express or implied, that such information is accurate, complete or up to date.\n\n\n\n8.6 Please back-up content and data used with the app. We recommend that you back up any content and data used in connection with the app, to protect yourself in case of problems with the app or the Service.\n\n\n\n\n\n8.7 Check that the app and the Services are suitable for you. The app and the Services have not been developed to meet your individual requirements. Please check that the facilities and functions of the app and the Services (as described on the appstore site and in the documentation) meet your requirements.\n\n\n\n8.8 We are not responsible for events outside our control. If our provision of the Services or support for the app or the Services is delayed by an event outside our reasonable control including but not limited to fire, flood, storm, riot, civil disturbance, strikes or other industrial action, war, nuclear accident, terrorist activity and acts of God then we will contact you as soon as possible to let you know and we will take steps to minimise the effect of the delay. Provided we do this we will not be liable for delays caused by the event but if there is a risk of substantial delay you may contact us to end your contract with us and receive a refund for any Services you have paid for but not received. You acknowledge that there is no right to cancel once you have installed the app or other Services as appropriate.\n\n\n\n8.9 We do not make any representation or give any guarantee (whether express or implied) in respect of the Services. This includes, without limitation, any advice given to You (on a personal or general basis). Nothing in this Section 4 shall restrict Your statutory rights (including Your rights to receive a reasonable standard of service).\n\n\n\n8.10 Our liability. Our liability in tort, contract, negligence, non-fraudulent pre-contractual or other representations, or otherwise arising out of or in connection with these Terms and/ or in connection with the Services shall be limited in aggregate to the sum paid by You to us in the one year period prior to any claim issued by You.\n\n\n\n\n\n9.OUR RIGHTS TO MAKE CHANGES\n\n\n\n\n\n9.1Minor changes to the products. We may change the product:\n\n\n\n(a)to reflect changes in relevant laws and regulatory requirements; and\n\n\n\n\n\n(b)to implement minor technical adjustments and improvements, for example to address a security threat. These changes will not affect your use of the product.\n\n\n\n\n\n9.2Updates to digital content. From time to time we may automatically update or require you to update digital content and change the Services to improve performance, enhance functionality, or address security issues. . You agree that we may automatically download and install updates, upgrades and additional features that we deem beneficial to You and/or reasonably necessary. If You choose not to install such updates You may not be able to continue using the Services. These Terms shall apply to any updates and/or additional features that are not distributed with a separate licence or other agreement.\n\n\n\n\n\n10.DATA PROTECTION AND YOUR PRIVACY\n\n\n\n\n\n10.1Privacy Policy. We only use any personal data we collect through your use of the app or the Services in the ways set out in our Privacy Policy, which is set out at www.viewpointgames.co.uk/privacy. Please be aware that internet transmissions are never completely private or secure and that any message or information you send using the app or any Service may be read or intercepted by others, even if there is a special notice that a particular transmission is encrypted.\n\n\n\n10.2Data Protection. We are registered as a data controller for the purposes of the Data Protection Act 1998. If You have any concerns about how we use Your personal data please contact support@viewpointgames.co.uk\n\n11.INTELLECTUAL PROPERTY RIGHTS\n\n\n\n11.1\n\nYou acknowledge that all intellectual property rights in the Services, all content appearing within the Services throughout the world belong to us or our affiliates, subsidiaries, licensors or suppliers and the Services are licensed (not sold) to you. You have no intellectual property rights in, or to app, the documentation or the Services other than the right to use them in accordance with these Terms. By content, we mean the software, video, audio, music, text, characters, communications, images, sounds and all material and information included within the App and any related services.\n\n11.2\n\nAny use by You of any of Our intellectual property other than as permitted under these Terms may only be undertaken with our prior express written authorisation.\n\n\n\n12.OUR RIGHTS TO END THE CONTRACT\n\n\n\n\n\n12.1We may end the contract if you break it. We may suspend, restrict or terminate your access to the app, website and/or any other part of the Services at any time by contacting you and consequently suspend or terminate the licence granted to Your under these Terms if:\n\n\n\nYou breach or have broken any of the restrictions or provisions in these Terms;\n\n\n\nFor reasons of a system failure, maintenance or repair or due to events beyond our reasonable control in accordance with section 4.8; and or\n\n\n\nWe decide to withdraw the app, website or any other part of the Services from the market for any reason in our sole discretion.\n\n\n\n\n\n12.2Ending your rights. We may end your rights to use the app and services at any time by contacting you in writing by email or within the app, website or other part of the Services as appropriate. If you do not consent to receiving notices electronically You must stop using the app, website and the Services.\n\nIf we end your rights to use the app and Services:\n\nYou must stop all activities authorised by these Terms, including your use of the app and any Services.\n\nYou must delete or remove the app from all devices in your possession and immediately destroy all copies of the app which you have and confirm to us that you have done this.\n\nWe may remotely access your devices and remove the app from them and cease providing you with access to the Services.\n\n12.3 Termination. Upon termination the rights and the licence granted herein will terminate and you must cease all use of the website, app and/or Services.\n\n\n\n13.IF THERE IS A PROBLEM WITH THE PRODUCT\n\n\n\n13.1How to tell us about problems. If you have any questions or complaints about the product, please contact us. You can telephone our customer service team or write to us at the postal address as set out on our website www.viewpointgames.co.uk.\n\n\n\n\n\n14OTHER IMPORTANT TERMS\n\n\n\n\n\n14.1Which laws apply to this contract and where you may bring legal proceedings. In the event of any dispute between You and us concerning these Terms, are governed by laws of England and Wales and if You wish to bring legal proceedings You must do so within the England and Wales.\n\n\n\n14.2 Alternative dispute resolution. Alternative dispute resolution is a process where an independent body considers the facts of a dispute and seeks to resolve it, without you having to go to court. If you are not happy with how we have handled any complaint, you may want to contact the alternative dispute resolution provider we use. In addition, please note that disputes may be submitted for online resolution to the European Commission Online Dispute Resolution platform.\n\n 2014- 2020Viewpoint Games Ltd. All Rights Reserved.\n\nprivacy policy\n\nterms of business", "Space Required": "937.8 MB"}



["5 stars\n12%\n4 stars\n12%\n3 stars\n15%\n2 stars\n18%\n1 star\n43%", "zsoccer_05Jun 21 at 9:41 AM\nWaste of money\n\nNot worth the money, should be free. The video they provide is so misleading. The graphics arent even close to the video. Anyway, this game is so hard to steer. It is so easy to crash. This game got really boring and gave me a headache when I crashed because you spin around in circles. DO NOT WASTE YOUR MONEY ON THIS GAME!!\n\nHelpful | 79", "ChuckWalkerJul 25 at 5:26 AM\nTotal nausea sickness, WHY?\n\nI thought the reason Oculus verifies so many games before they went up for sale was to remove cheap, crap games... But also it was stated a long time ago to also prevent games from selling that caused bad nausea.... this game is 100% nauseous to my head and stomach. I played games before that some small part might make me not feel good, but its only for some small thing and I cant remember a time thats happened in almost a year and play on my rift, quest and Go(and yes on the go this game is just as nauseous too). The game play seems cool and with multiplayer I think it could be a great game (for a short time) going in circles on a short track isnt all that , but has much potential, but what ever is wrong making apparently most all of us sick needs to be fixed immediately.\n\nHelpful | 2", "graham-scanlan6 days ago\nDont waste your money\n\nDespite having multi player, Ive never been matched to play with anyone, the game itself is totally unchallenging, I bought it on my go, then got it free on the quest, however I still deleted it, not worth the drive space it takes up\n\nHelpful | 1", "PfaffPfamilyApr 1 at 12:08 PM\nEh\n\nI was excited for this game because it looked like Mario cart but in vr. I was very disappointed to find that this game was so boring and the motion from the racing made me sick. This is basically a bad ripoff of Mario cart. I would not recommend this game, and I am looking into how to get my money back.\n\nHelpful | 75", "george.leitzeJun 13 at 9:24 AM\nNot Mario Kart - not even close\n\nRacing is pretty lame and this is the only game I have tried that gives me motion sickness. Not recommended.\n\nHelpful | 7", "XJarrusXMay 27 at 5:41 PM\nRefund\n\nI dont know if you can, or how to refund games, but if you could, or I knew, I would be getting 15 dollars back, and a terrible game out of my library.\n\nHelpful | 5", "Master_NubsApr 10 at 8:33 PM\nSickness\n\nThis games tracking is horrible, you have to extend your hands all the way out for it to even pick up your movements the slightest. The turning is very touchy, and I have to say this was the worst game I have ever purchased , do not waste your money on this game.\n\nHelpful | 17", "MrBeanOilJul 28 at 6:33 PM\nFun\n\nThis is a fun simple racing game\n\nHelpful | 0", "AdmirstFeb 22 at 8:08 AM\nDecent, but could use some creativity.\n\nIts all flat land and basic music. Its like Mario Kart but bland. They did add some details like in some courses there is flying helicopters and stuff like that. Online multiplayer doesnt seem to work for when I start to go into a lobby NO ONE shows up. Is it because its broken or no ones plays? I dont know. But I like to play the game a lot and has some cool ideas of maps, but could use retouches instead of flat land. Also, I recommend this as NOT your first game like me, as it made me less interested in VR at the time due to how boring it gets after a while.\n\nHelpful | 30", "luxwolf35YTJun 28 at 9:06 AM\nI tried it and it wasn't what I thought\n\nI tried it and it wasn't what I thought but I couldn't get a refund\n\nHelpful | 1", "lonaldJun 10 at 2:31 PM\n\nThe game is not very well thought out and the handling is horrible\n\nHelpful | 2", "WetapplesJun 5 at 8:31 AM\n\nThis game is not good at all by far the worst game\n\nHelpful | 3", "itabrassbonanzaApr 12 at 9:59 PM\nIts 15$ you get what you payed for\n\nSaying this game is good is an overstatement but not complete garbage either it has a good concept but the execution was off the only thing holding it back is the controls however for 15$ I was not expecting something great.\n\nHelpful | 2", "mattjohnholmesJun 20 at 2:47 AM\nWeak\n\nNot Mario Kart is it\n\nHelpful | 1", "sgnationMay 10 at 11:56 AM\nDiziness\n\nWish it was better calibrated. Makes you dizzy and nauseous.\n\nHelpful | 3", "jeanie.huntingApr 10 at 10:00 AM\nCant play\n\nAbsolutely cannot play this game. It makes all of us motion sick. Wish\nWe wouldn't have wasted our money on it.\n\nHelpful | 7", "PacoLUXApr 19 at 10:25 AM\nOnline does not work. High discomfort.\n\nTried this for about 5 minutes. Has really high discomfort for me. Never connected.\n\nHelpful | 5", "Roxtar73Dec 5 at 10:54 PM\nFeels like racing snails\n\nI got this game really wanting to like it. I really tried to but ultimately its just not very fun. The game feels sluggish and theres no sense of speed. In all honesty unless you are getting this to entertain a child under the age of 16 Id recommend spending the extra five dollars for Death Lap which is a much better looking and feeling game in the same genre.\n\nIf the devs wish to compete with Death Lap they need to reinvent this game. Give it the sense of speed it needs. Perhaps blur effect and wind rushing sounds might be all thats needed idk.\nMake matchmaking easier for online play.\nThe game engine seems very solid and there doesnt seem to be many bugs in the game and I really want to like it.\nThank you.\n\nHelpful | 34", "2LLROD34Apr 11 at 10:17 PM\nvery disappointed\n\nvery disappointed\n\nHelpful | 3", "IcabodikaJan 29 at 11:39 AM\nFor some, not comfortable\n\nLove the idea of Mario kart racing with mates but agree with many reviews, it does feel a little slow. But the biggest turn off is the wall collision spin. It had even our hard corest players with headaches after a few races.\n\nHelpful | 3", "david.charette.752Feb 17 at 1:21 PM\nNice little vr kart racer.\n\nThere's nobody online last I checked, but a nice feature is all the courses are unlocked from the start although somewhat similar. As the community grows there might be some people online. Played this back in the day on a galaxy s6 with Samsung Gear VR. Looks much better now.\n\nHelpful | 1", "mr.bubba1970Apr 22 at 6:48 PM\nVr kart\n\nGreat game\n\nHelpful | 2", "JellyfishManiacMar 13 at 8:03 PM\nInteresting.\n\nGot me dizzy so watch ur surrounding. Even more fun in a chair!\n\nHelpful | 1", "messbrianJan 25 at 11:40 AM\nMess\n\nIts ok but the controls arent easy but with continued use, it gets easier. The courses Ive played are very flat, Id like to see hula or even jumps. It does seem like a Mario cart but the courses are flat.\n\nHelpful | 1", "SovereignSinnerNov 29 at 8:37 PM\nMARIO Kart-ish\n\nReally fun but there are some major issues holding it back from being great. One of which is the spin outs if you hit a wall. Take a page from Mario Kart and reset immediately rather than making you have to back up and drive your kart back on the track.\nAlso, the motion controls to drive like a steering wheel are broke AF. Tried to get it to work several times before I gave up.\n\nHelpful | 8", "ibillliamFeb 5 at 11:55 AM\nPoor, waste of money\n\nWish I could get a refund. Had so much potential but fell flat of a solid experience for me\n\nHelpful | 4", "winkie1Dec 27 at 9:23 AM\nFun but....\n\nThis could really be a decent race game but it makes me ill to play. I have several other movement games but this is the worse and I don't get motion sickness very easily! I don't know what the devs can do, but surely there is something. So if you are prone to motion sickness, I can't recommend this game.\n\nHelpful | 1", "ryman647Dec 30 at 9:31 PM\nNot really as bad as people say it is\n\nLike, don't get me wrong, it's like if a shovelware Wii game got a VR game, but it's like, a good shovelware Wii game. All in all, I don't think it deserves a 2.5. (maybe at least a 3.5)\n\nHelpful | 2", "troymeFeb 4 at 4:42 AM\nI use the joystick and its fun...\n\nI use the joystick and its fun but its missing something, like environmental obstacles on new maps, like bees flying, ice sheets or mud puddles: when you drive trough it you either get mud temporarily blinded or you blind who ever is close to you in the rear, pits, and jumping ability, to jump over some of those obstacles, you know, a true Mario go cart knock off without getting sued. This is a fun game and Im looking forward to some up dates. Also when scrolling through map select; there should be map images and details available instead of playing Russian roulette with maps, also day and night maps, as well as weather change should be available, fog, rain snow, wind and even a random tornado or two some where. The game need updates and yall should start with some of these. Another thing, there need to be hills humps and jumps on most of these maps or on new maps, and not on only one or two maps if you do decide to add or rebuild the maps, I say dont remove maps just add new maps or add on to old ones, no need to reinvent the wheel just add rims and spreewells to them. No need to focus on graphics, just gameplay, and level detail like rocks in the road, and hills the game is too linear, And the online only sucks because no one is playing it, I get that, so focus on the maps and MPCs because most people will be playing offline.\n\nHelpful | 1", "glenlewis09Oct 26 at 6:53 PM\nLittle entertainment value\n\nIt was like they tried to make a Mario kart type game. But missed the mark, there is little to do but drive in circles and the simulation of the game is off. When you bomb karts your karts tops rather than rebounding. The system loses track of steering wheel and you end up with your hand contorted just to drive straight. Needs a quick reset if they cannot properly monitor your hands position.\n\nAfter maybe 10-20 min the game is so repetitive it isn't fun an8.\n\nHelpful | 14", "Brickshooter985Dec 30 at 9:46 AM\nCrap\n\nIf youre looking for some crap to buy, then youve come to the right place... I give this one a big ole NOPE\n\nHelpful | 2", "BLZDPraetorianNov 29 at 9:21 PM\nYou know what....\n\nGot this on sale. And i got to say. The manual steering is a bit messy. But you can switch to joystick control and boom! The game has a decent bit of tracks. And some cool moves to cast and battle with. I just got done with an online game and had a blast! Its deff worth the few bucks. And just dont expect a full game. Its more of a show off game, for first timers. And a way to experience vr racing before the big games come out. Death lap looks like it will be a bit stronger in that section. But this is not a terrible game. Id suggest checking it out if your funds allow it. Im having fun =)\n\nHelpful | 3", "mjdarr523Dec 6 at 4:48 PM\nGarbage\n\nTry and figure out multi player. Its impossible. Steering with gestures doesnt work either. I will be getting a refund.\n\nHelpful | 3", "obi2kenobiOct 4 at 4:06 AM\nNeeds work\n\nThis was one of my favorite titles back on GearVR, believe it or not. It played just fine on my gamepad.\n\nAnd that is the only way to play it on quest too. Change steering to analog stick if you want to play, the motion steering is awful.\n\nThe lobby is also confusing to me. You dont have any arms, but your avatar is holding this tablet and i couldnt figure out how to navigate it.\n\nAlso had an issue where i kept getting \"headset out of range.\" Had to play standing up so my head was in the right spot, wouldnt let me play sitting down which is ironic since you're always seated in a kart.\n\nId love to love this game. I love kart games and used to enjoy this too. But it really needs work. This feels like alpha version.\n\nHelpful | 10", "gatherlightNov 29 at 8:42 PM\nSickness\n\nAlmost threw up after 5 minutes. If you get car sick, you will probably not like this\n\nHelpful | 5", "Crazy_SaneOct 14 at 6:58 AM\nBasically Mario Kart VR\n\nAs stated, it's like MK, but with less variety. The track layouts are a little basic, but there are quite a few of them. If you're prone to motion sickness, this probably isn't for you. But if you want a fun racing game, this is it. In fact, it's your only option. But don't buy a game like this and then complain about motion sickness.\n\nTo the dev/s: maybe you could add an option for extra panels on the kart to reduce motion sickness, like in Ultrawings. Or maybe make the helmet visible. Motion sickness seems to be the most common complaint.\n\nHelpful | 7", "yosinycNov 10 at 10:03 AM\nDizzy!\n\nRound and round in dizziness! Quite Boring and sickening!\n\nHelpful | 3", "RookePeteOct 26 at 9:01 AM\nStay away\n\nThis is a rip-off. Made to be like MarioCart, but nothing is working as planned. Dont waste your money\n\nHelpful | 3", "lestheredSep 19, 2019 at 5:17 AM\nErratic controld\n\nThis is, by a long way, the worst game I bought since receiving my Quest a few months ago. Control system is neither intuitive, accurate or comfortable. Waste of money\n\nHelpful | 5", "Echo_RomeoDec 8 at 7:12 AM\nClunky\n\nFeels like a beta version of a real kart game. If you bump into anyone you come to a complete stop. Weapons are wonky and useless. Youre better off watching a YouTube racing video then trying to play this game.\n\nHelpful | 2", "0600ZuluMay 23, 2019 at 11:10 AM\nDo not buy for multiplayer\n\nThe game is essentially a cheap VR version of Mario Kart. Some cool tracks and of course VR makes it immersive, but don't get this if you were planning on playing with your friends. The online multiplayer is matchmaking only, you can't host custom games. The only good controls are the standard trigger/stick - motion controls are no good.\n\nHelpful | 220", "anthonshOct 7 at 9:36 PM\nBad\n\nNo elevation changes, steering with touch controllers works but isn't good enough.\n\nHelpful | 1", "guenter.baumann1711Sep 19, 2019 at 1:04 AM\nSimply not good\n\nThe steering in this racing game is the worst I ever found in such a game.\nNot worth trying it!\n\nHelpful | 7", "snlecherAug 19, 2019 at 9:10 AM\n\nWasted my money on this one. For me I can not even get close to being able to play this game, unless I want to be sick! Hopefully they will make it playable!\n\nHelpful | 4", "DoctaShaggyJul 7, 2019 at 9:17 AM\nPurchased it three times?!\n\nI actually like this game. Quest is the 3rd platform I have purchased it on. The tracking is horrible though so you do need to switch to using the joystick and play it like Mario Kart. It is not easy to get a multiplayer game going. It kicks you out of the multiplayer screen after only waiting a minute to find another player. Not cross platform with the PlayStation version, and I have purchased both the Go version and the Quest but can't play multiplayer with both headsets at the same time (I'm guessing because they are purchased on the same account, which in this case it really should be cross buy then). Fun game if you don't use the motion controls, don't get VR sickness easily, and don't mind always playing single player. Considering asking for refund though since I now have three copies but no one in the house can play with each other.\n\nHelpful | 9", "chrislloyd1992Aug 15, 2019 at 6:17 AM\n\n\nAny chance of a refund lol\n\nHelpful | 10", "DanCornwallAug 11, 2019 at 1:13 PM\nNo multi player working\n\nTried on many occasions to get on multiplayer without success, and yes there's no problem with my broad band, YouTube vr works fine. Would be cool to play with anyone let alone friends.\n\nHelpful | 2", "L0rdFlasheartAug 30, 2019 at 11:46 PM\nNo good\n\nTrack and game plack is bad.\n\nHelpful | 3", "BeanPoleFattySep 12, 2019 at 4:08 PM\nUse controllers\n\nAwesome game if u use the controller settings but multiplayer doesnt work?\n\nHelpful | 1", "john.michael.5895Aug 24, 2019 at 1:12 PM\nFantastic motion steering... But...\n\nWhy does my hand come off the steering wheel.?\nThis game can run fast but why do slow and boring in practise???\nWhy limit the laps??\n\nHelpful | 5", "LiviebugAug 14, 2019 at 1:29 PM\nMy daughter didnt want it\n\nShe said it was ok but would rather have something else\n\nHelpful | 2", "FlibbertigibbetyJun 9, 2019 at 5:58 PM\nFun little kart racer!\n\nJust picked up the game, and I'm surprised at how good it looks. Yes... the graphics are very simple, but it runs smoothly, the graphics are crisp, and it's fun/cartoony. The joystick controls are nice. Deadzone is too big, but it certainly works. Motion control steering works really well with one hand (left or right), but two hands seems to fight the wheel if you're not perfectly holding your position. One hand is recommended. Played 3 maps so far, and have had zero issues. Fun and light hearted little racer with some offensive/defensive weapons. My main issue is that you can't host games to play with specific people. The matchmaking only kinda sucks. But for $15, I feel you get an enjoyable and immersive racing experience.\n\nHelpful | 13", "Rocky2234Jul 23, 2019 at 12:19 PM\nMario Kart Quest\n\nI really enjoyed this game on the Oculus Go so decided to pick it up on the Quest as I felt like revisiting it and its definitely a step up in the visual and controls department over the Go version! Content wise its the exact same as the Go version and the multiplayer is pretty much empty at this point which is a shame as its a fun little kart racer with a lot of untapped potential! Its worth a purchase if you enjoy the likes of Mario Kart .\n\nHelpful | 1", "ShiningSoulJun 10, 2019 at 8:49 PM\nMario Cart VR clone\n\nThe reviews going from 5 to 1.5 *s plus the fact it took 2 days till it was playable had me start the return process but I'm glad I stopped it and played it.\n\nAre the motion controls terrible on quest? Yes.\nHowever, I changed the settings to thumbstick and I was taken back to my childhood playing Mario Cart 64. I love what the devs did here and I hope they continue to support it and hear the feedback and use it to improve.\n\nThat being said it would be nice if there were more maps and some fantasy ones to further bring that nostalgia of Mario Cart to life!\n\nGreat work I can't wait to see what comes next\n\nHelpful | 9", "chadttt2468May 29, 2019 at 10:19 AM\nQuest\n\nI cannot get the tutorial or any option other than sitting in lobby listening to music on my Quest. Dot turns green, and can be moved but nothing happens no matter where pointed or buttons pressed.\n\nHelpful | 14\nDeveloper ResponseJun 11, 2019 at 5:35 AM\n\nWe apologise for this issue however, updating the app should fix this issue now.", "fallenaeonMay 25, 2019 at 12:34 AM\nBugs\n\nI can not even play the game. I am stuck at the first room looking at a tablet that shows how to control the game but no matter what I do it wont go past this part. Tried reinstalling, same issue. Cant play!\n\nHelpful | 13\nDeveloper ResponseJun 11, 2019 at 5:35 AM\n\nWe apologise for this issue however, updating the app should fix this issue now.", "agitokazuOct 3 at 12:16 PM\nStill terrible\n\nStill terrible, Even with the upgrade between Go to Quest, perfect game for 3dof headsets though.\n\nStill not worth that price tag that you see on the quest storefront\n\nHelpful | 4", "ericologistJun 6, 2019 at 7:29 PM\nSo much potential lost...\n\nSub part controls, zero online presence. Just a very weak presentation and execution. Not worth any price honestly.\n\nHelpful | 16", "alfred.ortiz.3557Jun 2, 2019 at 11:59 PM\nStuck\n\nSame issue as the other people reviewing this game can't launch tutorial just staring at a wall listening to music\n\nHelpful | 10\nDeveloper ResponseJun 11, 2019 at 5:34 AM\n\nWe apologise for this issue however, updating the app should fix this issue now.", "tom.weaver.3114May 25, 2019 at 12:57 PM\nMade me feel sick\n\nNice idea but sadly the movement made me feel very queasy almost straight away.\n\nHelpful | 12", "trekeyusOct 3 at 4:41 PM\nDon't bother with this app.\n\nIt's a generic kart racer that's uninspired and just filler fluff.\n\nHelpful | 1", "dave.s.mcgJun 8, 2019 at 2:44 PM\nneeds more players and updates\n\nthe vr steering isn't good but, the sticks are. this needs more players for multiplayer\n\nHelpful | 5", "pyroth309May 27, 2019 at 7:17 PM\nIt's VR mario kart pretty much\n\nI had a blast playing this and it's basically VR Mario kart. I like the touch of aiming the weapons with your head so you can focus on driving with your hands. I did find driving with tracking isn't the greatest but using the stick is great.\n\nHelpful | 3"]