{"App Title": "VRChat", "App description": "VRChat lets you fully embody custom avatars, play social games, and connect with friends in new ways. \n\nVRChat hosts a massive global community of gamers, musicians, creators, artists, entertainers and more. \n\nYou can also build and share your own creations with the community.", "Purchase section": "FreeAdd to WishlistShareComfort: IntenseSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Multiplayer", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Art/Creativity, Exploration, Social", "Languages": "English", "Version": "2020.3.2p3-976-Release", "Developer": "VRChat Inc.", "Publisher": "VRChat Inc.", "Website": "https://vrchat.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "COMMUNITY\nDEVELOPER\nSOCIAL\nBLOG\nCAREERS\nSTORE\nHELP\nPRESS\nCONTACT\nLOGIN\nPRIVACY POLICY\nEffective Date: May 31, 2017\n\nThis Privacy Policy (Policy) describes the manner in which VRChat, Inc. (VRChat, we, or us) and our website at www.vrchat.com (our Site), as well as all related websites, networks, desktop or mobile clients and applications, and other services provided by us and on which a link to this Policy is displayed (collectively, together with the Site, our Service) collect, use, and disclose information about you. This Policy is incorporated into and is subject to the VRChat Terms of Use and End User License Agreement. By using the Service, you consent to the collection, use, and disclosure of your information as described in this Policy.\n\nInformation We Collect on the Service\n\nUser-provided Information:\n\nWhen you use the Service, we may collect or you may provide information about you and we may link this information with other information about you. You may provide us with information in various ways on the Service. For example, you provide us with information when you register for an account (we will collect your email address, birthday, and allow you to create a username and password), subscribe to our newsletters, use the Service, make a purchase on the Service, or send us customer service-related requests.\n\nCookies and Automatically Collected Information:\n\nWhen you use the Service, we may send one or more cookies  small text files containing a string of alphanumeric characters  to your device. We may use both session cookies and persistent cookies. A session cookie disappears after you close your browser. A persistent cookie remains after you close your browser and may be used by your browser on subsequent visits to the Service. Please review your web browser Help\" file to learn the proper way to modify your cookie settings. Please note that if you delete, or choose not to accept, cookies from the Service, you may not be able to utilize the features of the Service to their fullest potential. We may use third party cookies on our Service as well. For instance, we use Google Analytics to collect and process certain analytics data. To learn more about how Google Analytics uses your information and what choices you have, please visit www.google.com/policies/privacy/partners/. VRChat does not process or respond to web browsers do not track signals or other similar transmissions that indicate a request to disable online tracking of users who use our Service.\n\nWe may also automatically record certain information from your device by using various types of technology, including clear gifs\" or web beacons. This automatically collected information may include your IP address or other device address or ID, web browser and/or device type, the web pages or sites that you visit just before or just after you use the Service, the pages or other content you view or otherwise interact with on the Service, and the dates and times that you visit, access, or use the Service. We also may use these technologies to collect information regarding your interaction with email messages, such as whether you opened, clicked on, or forwarded a message. This information is gathered from all users, and may be connected with other information about you.\n\nInformation Disclosed While Using the Service:\n\nWhen using the Service, including participation in different rooms made available to users of the virtual-reality component of our Service, you may disclose to us and to other users of the Service information about you. This may occur when you engage in conversations, chats, or other user-to-user interactions. We may collect and use this information to the extent permitted by law.\n\nPayment Information:\n\nIf you choose to access or use parts of the Service that require payments or fees, we may require you to provide financial information to us for the purpose of processing those payments. We may provide your payment information to third party payment processors who process transactions on our behalf. We may also collect and retain information relating to the transactions you conduct.\n\nLocation Information:\n\nWe may use your IP address to obtain general information about the physical location from which you are connecting to the Internet.\n\nThird Party Web Beacons and Third Party Buttons:\n\nWe may display third-party content on the Service, including third-party advertising. Third-party content may use cookies, web beacons, or other mechanisms for obtaining data in connection with your viewing of the third party content on the Service. Additionally, we may implement third party buttons (such as Facebook like or share buttons) that may function as web beacons even when you do not interact with the button. Information collected through third-party web beacons and buttons is collected directly by these third parties, not by VRChat. Information collected by a third party in this manner is subject to that third partys own data collection, use, and disclosure policies. Please note that privacy choices you have made on VRChat will not carry over to third party sites or services (and vice-versa).\n\nInformation from Other Sources:\n\nWe may obtain information from third parties and sources other than the Service, such as our partners and advertisers.\n\nHow We Use the Information We Collect. We use information we collect on the Service (in both individual and aggregate format) in a variety of ways in providing the Service and operating our business, including the following\n\nWe use the information that we collect on the Service to operate, maintain, enhance and provide the Service, to provide services and information that you request, to respond to comments and questions and otherwise to provide support to users, and to process and deliver entries and rewards in connection with promotions that may be offered from time to time on the Service.\n\nWe use the information that we collect on the Service to understand and analyze the usage trends and preferences of our users, to improve the Service, and to develop new products, services, features, and functionality.\n\nWe may use your email address or other information we collect to contact you for administrative purposes such as customer service or to send communications, including required notices, marketing communications, or updates on promotions and events relating to products and services offered by us and by third parties.\n\nWe may use information to: (i) personalize our Service, such as remembering information about you so that you will not have to re-enter it during your visit or the next time you visit the Service; (ii) provide customized advertisements, content, and information; (iii) monitor and analyze the effectiveness of the Service and third-party marketing activities; (iv) monitor aggregate site usage metrics such as total number of visitors and pages viewed; (v) track your entries, submissions, and status in any promotions or other activities on the Service; and (vi) detect, prevent, and respond to fraud, intellectual property infringement, violations of our Terms of Use, violations of law, or other misuse of the Service.\n\nWhen We Disclose Information. Except as described in this Policy, we will not disclose information about you that we collect on the Service to third parties without your consent. We may disclose information to third parties if you consent to us doing so, as well as in the following circumstances\n\nWe work with third party service providers who provide website, application development, hosting, payment, maintenance, and other services for us. These third parties may have access to or process information about you as part of providing those services for us. We require our service providers to agree to maintain the confidentiality of such information.\n\nWe may disclose information about you if required to do so by law or in the good-faith belief that such action is necessary to comply with state and federal laws, in response to a court order, judicial or other government subpoena or warrant, or to otherwise cooperate with law enforcement or other governmental agencies.\n\nWe also reserve the right to disclose information about you that we believe, in good faith, is appropriate or necessary to (i) take precautions against liability, (ii) protect ourselves or others from fraudulent, abusive, or unlawful uses or activity, (iii) investigate and defend ourselves against any third-party claims or allegations, (iv) protect the security or integrity of the Service and any facilities or equipment used to make the Service available, or (v) protect our property or other legal rights (including, but not limited to, enforcement of our agreements), or the rights, property, or safety of others.\n\nInformation about our users may be disclosed and otherwise transferred to an acquirer, successor, or assignee as part of any merger, acquisition, debt financing, sale of assets, or similar transaction, or in the event of an insolvency, bankruptcy, or receivership in which information is transferred to one or more third parties as one of our business assets.\n\nWe may make certain aggregate or otherwise non-personal or de-identified information available to third parties for various purposes, including (i) compliance with various reporting obligations; (ii) for business or marketing purposes; or (iii) to assist such parties in understanding our users interests, habits, and usage patterns for certain programs, content, services, advertisements, promotions, and/or functionality available through the Service.\n\nYour Choices\n\nYou may, of course, decline to share certain information with us, in which case we may not be able to provide to you some of the features and functionality of the Service. You may update your profile information through the Service. If you wish to access, update, delete or amend any other personal information we hold about you, you may contact us at support@vrchat.com. Please note that while any changes you make will be reflected in active user databases within a reasonable period of time, we may retain all information you submit for backups, archiving, prevention of fraud and abuse, analytics, satisfaction of legal obligations, or where we otherwise reasonably believe that we have a legitimate reason to do so.\n\nIf you receive commercial email from us, you may unsubscribe at any time by following the instructions contained within the email. You may also opt out from receiving commercial email from us by sending your request to us by email at support@vrchat.com or by writing to us at the address given at the end of this policy. We may allow you to view and modify settings relating to the nature and frequency of promotional communications that you receive from us in user account functionality on the Service.\n\nPlease be aware that if you opt out of receiving commercial email from us or otherwise modify the nature or frequency of promotional communications you receive from us, it may take up to ten business days for us to process your request, and you may continue receiving promotional communications from us during that period. Additionally, even after you opt out from receiving commercial messages from us, you will continue to receive administrative messages from us regarding the Service.\n\nThird-Party Services\n\nThe Service may contain features or links to websites and services provided by third parties. Any information you provide on third-party sites or services is provided directly to the operators of such services and is subject to those operators policies, if any, governing privacy and security, even if accessed through the Service. We are not responsible for the content or privacy and security practices and policies of third-party sites or services to which links or access are provided through the Service. We encourage you to learn about third parties privacy and security policies before providing them with information.\n\nChildrens Privacy\n\nOur Site is a general audience site not directed to children under the age of 13, and we do not knowingly collect personal information from children under the age of 13 without obtaining parental consent. If you become aware that your child or any child under your care has provided us with information without your consent, please contact us at the contact information listed below and we will delete any such account or profile and associated information.\n\nData Security\n\nWe use certain physical, managerial, and technical safeguards that are designed to improve the integrity and security of information that we collect and maintain. Please be aware that no security measures are perfect or impenetrable. We cannot and do not guarantee that information about you will not be accessed, viewed, disclosed, altered, or destroyed by breach of any of our physical, technical, or managerial safeguards.\n\nInternational Visitors\n\nThe Service is hosted in the United States. If you choose to use the Service from the European Union or other regions of the world with laws governing data collection and use that may differ from U.S. law, then please note that you are transferring your personal information outside of those regions to the United States for storage and processing. Also, we may transfer your data from the United States to other countries or regions in connection with storage and processing of data, fulfilling your requests, and operating the Service. By providing any information, including personal information, on or to the Service, you consent to such transfer, storage, and processing.\n\nChanges and Updates to this Policy\n\nPlease revisit this page periodically to stay aware of any changes to this Policy, which we may update from time to time. If we modify this Policy, we will make it available through the Service, and indicate the effective date. In the event that the modifications materially alter your rights or obligations hereunder, we will make reasonable efforts to notify you of the change. For example, we may send a message to your email address, if we have one on file, or generate a pop-up or similar notification when you access the Service for the first time after such material changes are made. Your continued use of the Service after the revised Policy has become effective indicates that you have read, understood and agreed to the current version of this Policy.\n\nHow to Contact Us\n\nPlease contact us with any questions or comments about this Policy, information we have collected or otherwise obtained about you, our use and disclosure practices, or your consent choices by email at support@vrchat.com.\n\nCopyright  2019 VRChat Inc.\n\nTerms of Use / Privacy Policy", "Developer Terms of Service": "COMMUNITY\nDEVELOPER\nSOCIAL\nBLOG\nCAREERS\nSTORE\nHELP\nPRESS\nCONTACT\nLOGIN\nTERMS OF USE AND END USER LICENSE AGREEMENT\nLast Updated: June 7th, 2018\nTerms of Service\n\nWelcome, and thank you for your interest in VRChat Inc. (VRChat, we, or us) and our website at vrchat.com, along with our related websites, networks, desktop applications (Desktop Client), mobile applications (Mobile App), software developer kit (SDK), and other services provided by us (collectively, our Service). This VRChat Terms of Use and End User License Agreement (this EULA), is a legally binding contract between you and VRChat regarding your use of the Service.\n\nPLEASE READ THE FOLLOWING TERMS CAREFULLY. BY CLICKING I ACCEPT, OR BY USING THE SERVICE, YOU ACKNOWLEDGE THAT YOU HAVE READ, UNDERSTOOD, AND AGREE TO BE BOUND BY THIS EULA. If you are not eligible, or do not agree to this EULA, then you do not have our permission to use the Service.\n\nYou acknowledge and agree that, as provided in greater detail in this EULA:\n\nthe Desktop Client, Mobile App, and SDK are licensed, not sold to you, and you may use the Service only as set forth in this EULA;\nthe Service is provided as is without warranties of any kind and VRChats liability to you is limited;\ndisputes arising under this EULA will be resolved by binding arbitration, and by accepting this EULA, as described in greater detail in Section 24, you and VRChat are each waiving the right to a trial by jury or to participate in a class action;\n1. VRChat Service Overview.\n\nVRChat is a platform for experiencing, creating, and publishing social virtual reality experiences. Users can create, share, and interact with virtual worlds and avatars.\n\n2. Eligibility.\n\nYou must be at least 13 years of age to use the Service. By agreeing to this EULA, you represent and warrant to us that: (a) you are at least 13 years of age; (b) you have not previously been suspended or removed from the Service; and (c) your registration and your use of the Service complies with all applicable laws and regulations. If you are at least 13 but are under the age of 18, you may only use the Service with your parent's or guardian's consent and your parent or guardian must provide consent after having read this EULA. In such a case you represent and warrant and covenant that both you and your parent or guardian have read and consent to this EULA (including all the conditions, limitations, disclaimers, and waivers provided herein). You further acknowledge and agree that by using the Service you are accepting a benefit that you cannot return or disgorge and that we are relying on your representations regarding your ability to accept and perform this EULA, and you therefore waive any right you may have under applicable law to void, rescind, or otherwise avoid this EULA. If you are a parent or guardian consenting to this EULA on behalf of a child between the ages of 13 and 18, you additionally agree to guarantee and be fully responsible for that persons performance hereunder, including all financial obligations or liability he or she may incur, and all disclaimers and waivers of applicable legal protections provided herein, and you agree to take all actions (including executing such additional documents or agreements) necessary to effect and perfect the foregoing. In all other cases, you represent that you are 18 years or older and fully competent to enter into this EULA, and you hereby agree and acknowledge that you have read, understood, and agree to be bound by this EULA without modification. If you are using the Service on behalf of an entity, organization, or company, you represent and warrant that you have the authority to bind that organization to this EULA and you agree to be bound by this EULA on behalf of that organization.\n\n3. Accounts and Registration.\n\nTo access most features of the Service, you must register for an account. When you register for an account, you may be required to provide us with some information about yourself, such as your email address or other contact information. You agree that the information you provide to us is accurate and that you will keep it accurate and up-to-date at all times. When you register, you will be asked to provide a password. You are solely responsible for maintaining the confidentiality of your account and password, and you accept responsibility for all activities that occur under your account. If you have reason to believe that your account is no longer secure, then you must immediately notify us at support@vrchat.com.\n\n4. VRChat Software License.\n\nSubject to your complete and ongoing compliance with the terms and conditions in this EULA (including without limitation payment of any applicable fees and compliance with all license restrictions), VRChat grants you a limited, non-exclusive, non-transferable, non-sublicensable, revocable license to each copy of the Desktop Client or Mobile App (collectively, the VRChat Software) downloaded directly from VRChats website or from a legitimate marketplace (such as the Oculus, Steam, Samsung, or PlayStation store), solely in object code format, for your personal use for lawful purposes, on a single compatible mobile device you own or control, and to access and use the Service in accordance with this EULA. You may not reproduce, distribute, publicly display, or publicly perform the VRChat Software or any part of the Service. Unless, and solely to the extent that, such a restriction is impermissible under applicable law or applicable third party license, you may not: (a) decompile, reverse engineer, or otherwise access or attempt to access the source code for the VRChat Software, or make or attempt to make any modification to the VRChat Software; or (b) interfere with or circumvent any feature of the VRChat Software, including without limitation any security, or access control mechanism. You may not use the VRChat Software or the Service for any purpose other than a purpose for which the VRChat Software and the Service are expressly designed. The term VRChat Software, as used in this EULA, includes any update or modification to the VRChat Software made available to you by VRChat (unless provided with separate terms). If you are prohibited under applicable law from using the VRChat Software or the Service, you may not use them. You represent and covenant that you have complied and will continue to comply with the rights and obligations set forth in this Section 4 with regards to your use of any Service previously downloaded or accessed.\n\n5. VRChat SDK License.\n\nSubject to your complete and ongoing compliance with the terms and conditions in this EULA and any additional terms included with the SDK, VRChat grants you a limited, personal, worldwide, royalty-free, non-exclusive, nonsublicenseable, and nontransferable license to: (a) use a reasonable number of copies of any documentation and other materials (such as sample 3D models and artwork) provided as part of the SDK (collectively, SDK Materials) solely in connection with your development of avatars, virtual worlds, and other virtual items for use solely within the Service (Virtual Content); (b) reproduce, modify, and use any sample software provided to you in source code format as part of the SDK in either object code or source code formats solely in connection with your development and use of Virtual Content within the Service; and (c) reproduce and distribute any sample software provided to you in object code format as part of the SDK, including any plugins (SDK Object Code) in object code format solely in connection with your development and use of Virtual Content within the Service. You will not: (i) transfer, disclose, or distribute any portion of the SDK or SDK Materials or access to either to any third party, except as permitted by the license grant above; (ii) subject any portion of the SDK or SDK Materials to the terms of any open source or creative commons license; (iii) modify any of the SDK Object Code included with the SDK; or (iv) use the SDK or SDK Materials to develop code, software, or other materials for anything other than for use with the Service.\n\n6. Payment\n\nAccess to the Service, or to certain features of the Service, may require you to pay fees. Before you pay any fees, you will have an opportunity to review and accept the fees that you will be charged. All fees are in U.S. dollars and are non-refundable. If VRChat changes the fees for the Service, including by adding additional fees or charges, VRChat will provide you advance notice of those changes. If you do not accept the changes, VRChat may discontinue providing the Service to you. VRChat will charge the payment method you specify at the time of purchase. You authorize VRChat to charge all sums as described in this EULA, for the Service you select, to that payment method. If you pay any fees with a credit card, VRChat may seek pre-authorization of your credit card account prior to your purchase to verify that the credit card is valid and has the necessary funds or credit available to cover your purchase. If you use the Service to update or cancel any existing authorized payment, it may take up to 10 business days for the update or cancellation to take effect.\n\n7. User Content\n\n7.1. User Content Generally.\n\nCertain features of the Service may permit users to upload content to the Service, including software code, messages, photos, video, images, folders, data, text, and other types of works (User Content) and to publish User Content on the Service. You retain copyright and any other proprietary rights that you may hold in the User Content you post to the Service.\n\n7.2. Limited License Grant to VRChat.\n\nBy posting, publishing, or otherwise developing User Content in the Service, you grant VRChat a worldwide, non-exclusive, irrevocable, royalty-free, perpetual, fully paid right and license (with the right to sublicense) to host, store, transfer, display, perform, reproduce, modify for the purpose of formatting for display, and distribute your User Content, in whole or in part, in any media formats and through any media channels now known or hereafter developed. You agree that the license granted to VRChat under this Section 7.2 applies to any User Content you previously posted, published, or otherwise developed in the Service.\n\n7.3. Limited License Grant to Other Users.\n\nBy posting or sharing User Content with other users of the Service in a public portion of the Service, or by setting any of your User Content to public, you grant those users a non-exclusive license to access and use that User Content as permitted by this EULA and the functionality of the Service.\n\n7.4. User Content Representations and Warranties.\n\nYou are solely responsible for your User Content and the consequences of posting or publishing User Content. By posting or publishing User Content, you affirm, represent, and warrant that:\n\na. you are the creator and owner of the User Content or have the necessary licenses, rights, consents, and permissions to authorize VRChat and users of the Service to use and distribute your User Content as necessary to exercise the licenses granted by you in this section, in the manner contemplated by VRChat, the Service, and this EULA; and\n\nb. your User Content and the use of your User Content as contemplated by this EULA, does not and will not: (i) infringe, violate, or misappropriate any third-party right, including any copyright, trademark, patent, trade secret, moral right, privacy right, right of publicity, or any other intellectual property or proprietary right; (ii) slander, defame, libel, or invade the right of privacy, publicity or other property rights of any other person; or (iii) cause VRChat to violate any law or regulation.\n\n7.5. Deleting User Content.\n\na. Where permitted you may delete copies or instances of your User Content that you have uploaded to your account through the normal functionality of the Service. If you delete your User Content through use of that functionality, the licenses granted by you in this Section 7 to Your Content terminate as described in this Section 7.5 with respect to the particular copies or instances of your User Content that you have deleted.\n\nb. The termination of the licenses does not apply to any copies or instances of the same User Content that you have not specifically deleted from the Service, including, without limitation, those that may be displayed elsewhere or that may be stored by other users to whom you transferred copies.\n\nc. The licenses under this Section 7 that you granted to your User Content that you have deleted through the Service will survive termination solely to allow VRChat to: (i) retain server copies of particular instances of your User Content, including copies stored in connection with back-up, debugging, and testing procedures; and (ii) enable the exercise of the licenses granted in this Section 7 for any other copies or instances of the same User Content that you have not specifically deleted from the Service, including those that may be displayed elsewhere or that exist in other users account inventories.\n\n7.6. User Content Disclaimer.\n\nWe are under no obligation to edit or control User Content that you or other users post or publish, and will not be in any way responsible or liable for User Content. VRChat may, however, at any time and without prior notice, screen, remove, edit, or block any User Content that in our sole judgment violates this EULA or is otherwise objectionable. You understand that when using the Service you will be exposed to User Content from a variety of sources and acknowledge that User Content may be inaccurate, offensive, indecent, or objectionable. Most worlds available through VRChat are created by other users or third parties, and VRChat does not control or actively monitor the content or technical features of individual worlds. You understand that any world you enter is at your own risk. You agree to waive, and do waive, any legal or equitable right or remedy you have or may have against VRChat with respect to User Content. We expressly disclaim any and all liability in connection with User Content. If notified by a user or content owner that User Content allegedly does not conform to this EULA, we may investigate the allegation and determine in our sole discretion whether to remove the User Content, which we reserve the right to do at any time and without notice. For clarity, VRChat does not permit copyright-infringing activities on the Service.\n\n8. Digital Millennium Copyright Act\n\n8.1. DMCA Notification.\n\nWe comply with the provisions of the Digital Millennium Copyright Act applicable to Internet service providers (17 U.S.C. 512, as amended). If you have an intellectual property rights-related complaint about material posted on the Service, you may contact our Designated Agent at the following address:\n\nVRChat Inc.\nATTN: Legal Department (Copyright Notification)\n1062 Folsom St., Suite 200, San Francisco, CA, 94103 Email: copyright@vrchat.com\n\n\nAny notice alleging that materials hosted by or distributed through the Service infringe intellectual property rights must include the following information:\n\n- an electronic or physical signature of the person authorized to act on behalf of the owner of the copyright or other right being infringed;\n- a description of the copyright-protected work or other intellectual property right that you claim has been infringed;\n- a description of the material that you claim is infringing and where it is located on the Service;\n- your address, telephone number, and email address;\n- a statement by you that you have a good faith belief that the use of those materials on the Service is not authorized by the copyright owner, its agent, or the law; and\n- a statement by you that the above information in your notice is accurate and that, under penalty of perjury, you are the copyright or intellectual property owner or authorized to act on the copyright or intellectual property owners behalf.\n\n8.2. Repeat Infringers.\n\nVRChats policy is to remove any User Content from the Service that is posted by repeat infringers. VRChat considers a repeat infringer to be any user that has uploaded User Content or Feedback to or through the Service and for whom VRChat has received more than three takedown notices compliant with the provisions of 17 U.S.C.  512 with respect to such User Content or Feedback. VRChat has discretion, however, to terminate the account of any user after receipt of a single notification of claimed infringement or upon VRChats own determination.\n\n9. Prohibited Conduct. BY USING THE SERVICE YOU AGREE NOT TO:\nuse the Service for any illegal purpose or in violation of any local, state, national, or international law;\nviolate, or encourage others to violate, any right of a third party, including by infringing or misappropriating any third party intellectual property right;\nshare, publically post, copy, or distribute another users User Content without their permission;\npost, upload, or distribute any User Content or other content that is unlawful, defamatory, libelous, inaccurate, or that a reasonable person could deem to be objectionable, profane, indecent, pornographic, harassing, threatening, embarrassing, hateful, or otherwise inappropriate;\ninterfere with security-related features of the Service, including by: (a) disabling or circumventing features that prevent or limit use or copying of any content; or (b) reverse engineering or otherwise attempting to discover the source code of any portion of the Service, including the SDK Object Code, except to the extent that the activity is expressly permitted by applicable law;\nupload to the Service any software code, routine, or instructions that interfere with, or otherwise attempt to impair, the operation of the Service, any users enjoyment of the Service, or any users underlying code or hardware, including by: (a) uploading or otherwise disseminating any virus, adware, spyware, worm, or other malicious code; (b) making any unsolicited offer or advertisement to another user of the Service; (c) attempting to collect personal information about another user or third party without consent; or (d) interfering with or disrupting any network, equipment, or server connected to or used to provide the Service, or violating any regulation, policy, or procedure of any such network, equipment, or server;\nperform any fraudulent activity including impersonating any person or entity, claiming a false affiliation, accessing any other Service account without permission, or falsifying your age or date of birth;\nbypass any security or other features of the Service designed to control how the Service is used, harvest, or mine User Content from the Service, or otherwise access or use the Service in a manner inconsistent with individual human usage;\nuse any robot, spambot, spider, crawler, scraper, or other automated means or interface not provided by us to access the Service or to extract data;\ndecipher, reverse engineer, decompile, or disassemble the Service or the VRChat Software, or the software used to provide the Service or the VRChat Software, in whole or in part, or authorize, direct, or cause a third party to do so;\nuse, display, mirror, frame, or utilize framing techniques to enclose the Service or any content available through the Service (Content), or any portion or component of the Service, unless and solely to the extent VRChat provides the means for embedding any part of the Service or the Content;\naccess, tamper with, or use non-public areas of the Service, VRChats (and its hosting companys) computer systems and infrastructure, or the technical delivery systems of VRChats providers;\nuse the Service in any manner to harass, abuse, stalk, threaten, defame, or otherwise infringe or violate the rights of any other party;\nsell or otherwise transfer the access granted under this EULA or any Materials (as defined below) or any right or ability to view, access, or use any Material; or\nattempt to do any of the acts described in this Section 9, or assist or permit any person in engaging in any of the acts described in this Section 9.\n10. Termination of Use; Discontinuation and Modification of the Service.\n\nYou may terminate your account at any time by contacting customer service at support@vrchat.com. If you terminate your account, you remain obligated to pay all outstanding fees, if any, incurred prior to termination relating to your use of the Service. If you violate any provision of this EULA, your permission from us to use the Service will terminate automatically. In addition, VRChat may in its sole discretion terminate your user account on the Service or suspend or terminate your access to the Service at any time for any reason or no reason, with or without notice. We also reserve the right to modify or discontinue the Service at any time (including by limiting or discontinuing certain features of the Service), temporarily or permanently, without notice to you. We will have no liability whatsoever on account of any change to the Service or any suspension or termination of your access to or use of the Service.\n\n11. Third-Party Services and Linked Websites.\n\nVRChat may provide tools through the Service that enable you to export information, including User Content, to third party services, including through features that allow you to link your account on VRChat with an account on the third party service, such as Twitter or Facebook, or through our implementation of third party buttons (such as like or share buttons). By using one of these tools, you agree that we may transfer that information to the applicable third-party service. Third party services are not under our control, and we are not responsible for any third party services use of your exported information. The Service may also contain links to third-party websites. Linked websites are not under our control, and we are not responsible for their content.\n\n12. Consent to Use of Data.\n\nYou agree that VRChat may collect and use technical data and related information, including but not limited to UDID and other technical information about your device, system and VRChat Software, and peripherals, that is gathered periodically to facilitate the provision of software updates, product support and other services to you (if any) related to the Service, and to anonymously track and report your activity inside of the Service, including for analytics purposes. If you are located outside of the United States, you expressly consent to the transfer and processing of your data outside your home jurisdiction.\n\n13. IP Ownership, Reservation of Rights.\n\nThe Service, including the Desktop Client and SDK, is owned and operated by VRChat. The Desktop Client, SDK, content, visual interfaces, interactive features, information, graphics, design, compilation, computer code, products, services, and all other elements of the Service (the Materials), are protected by copyright, trade dress, patent, and trademark laws of the United States and other jurisdictions, international conventions, and all other relevant intellectual property and proprietary rights, and applicable laws. As between you and VRChat, all Materials, including all associated intellectual property rights, are the sole and exclusive property of VRChat, its subsidiaries or affiliated companies, or its third-party licensors. You may not to sell, license, distribute, copy, modify, publicly perform or display, transmit, publish, edit, adapt, create derivative works from, or use the Materials except as expressly authorized under this EULA. VRChat reserves all rights not expressly granted in this EULA. You do not acquire any right, title, or interest to the Materials, whether by implication, estoppel, or otherwise, except for the limited rights set forth in this EULA.\n\n14. Third Party Software.\n\nThe software you download comprises a package of components, including certain third party software (Third Party Software) provided under separate license terms (the Third Party Terms). Your use of the Third Party Software in conjunction with the VRChat Software or the SDK in a manner consistent with this EULA is permitted, however, you may have broader rights under the applicable Third Party Terms and nothing in this EULA is intended to impose further restrictions on your use of the Third Party Software. The Service may contain or be provided together with open source software. Each item of open source software is subject to its own applicable license terms, which can be found at attribution and/or in the Services documentation or the applicable help, notices, about or source files. Copyrights to the open source software are held by the respective copyright holders indicated therein.\n\n15. Additional Terms.\n\nYour use of the Service is subject to all additional terms, policies, rules, or guidelines applicable to the Service or certain features of the Service that we may post on or link to from the Service (the Additional Terms), such as additional license agreements for any downloadable Materials, SDK Materials, or rules that apply to particular features or content on the Service, subject to the section of this EULA titled Modification of this EULA. All Additional Terms are incorporated by this reference into, and made a part of, this EULA.\n\n16. Modification of this EULA.\n\nWe reserve the right, at our discretion, to change this EULA on a going-forward basis at any time. Please check this EULA periodically for changes. If a change to this EULA materially modifies your rights or obligations, you will be required to accept the modified EULA in order to continue to use the Service. This EULA will be identified by the most recent date of revision and will be effective immediately upon being made available through vrchat.com or otherwise through the Service, except: (a) if any such modification materially alters your rights under this EULA, we will attempt to notify you directly through a message sent to the email address you have provided to VRChat, if any, or through a pop-up window or other notification when you access or use the Service; (b) such materially modified EULA will be effective upon the earlier of your use of the Service with actual knowledge of the changes or thirty days after the changes are made available to you; and (c) no modifications to this EULA will apply to any dispute between you and VRChat that arose prior to the date of such modification. Your use of the Service after modifications to this EULA become effective constitutes your binding acceptance of such changes. If you are dissatisfied with the terms of this EULA or any modifications to this EULA, then you agree that your sole and exclusive remedy is to discontinue any use of the Service.\n\n17. Feedback.\n\nIf you provide VRChat with any comments, bug reports, feedback, or modifications proposed or suggested by you for the Service (Feedback), such Feedback is provided on a non-confidential basis (notwithstanding any notice to the contrary you may include in any accompanying communication), and VRChat will have the right to use such Feedback at its discretion, including, but not limited to the incorporation of such suggested changes into the Service. You hereby grant VRChat a perpetual, irrevocable, nonexclusive license under all rights necessary to so incorporate and use your Feedback for any purpose.\n\n18. Indemnity.\n\nYou are responsible for your use of the Service, and you will defend and indemnify VRChat and its officers, directors, employees, consultants, affiliates, subsidiaries, and agents (together, the VRChat Entities) from and against every claim, liability, damage, loss, and expense, including reasonable attorneys fees and costs, arising out of or in any way connected with: (a) your access to, use of, or alleged use of, the Service; (b) your violation of any portion of this EULA, any representation, warranty, or agreement referenced in this EULA, or any applicable law or regulation; (c) your violation of any third-party right, including any intellectual property right or publicity, confidentiality, other property, or privacy right; or (d) any dispute or issue between you and any third party. We reserve the right, at our own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you (without limiting your indemnification obligations with respect to that matter), and in that case, you agree to cooperate with our defense of that claim.\n\n19. Disclaimers; No Warranties\n\nTHE DESKTOP CLIENT, SDK, AND SERVICE AND ALL MATERIALS AND CONTENT AVAILABLE THROUGH THE SERVICE ARE PROVIDED AS IS AND ON AN AS AVAILABLE BASIS, WITHOUT WARRANTY OR CONDITION OF ANY KIND, EITHER EXPRESS OR IMPLIED. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE VRCHAT ENTITIES DISCLAIM ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, RELATING TO THE SERVICE AND ALL MATERIALS AND CONTENT AVAILABLE THROUGH THE SERVICE, INCLUDING: (A) ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, QUIET ENJOYMENT, OR NON-INFRINGEMENT; AND (B) ANY WARRANTY ARISING OUT OF COURSE OF DEALING, USAGE, OR TRADE. THE VRCHAT ENTITIES DO NOT WARRANT THAT THE SERVICE OR ANY PORTION OF THE SERVICE, OR ANY MATERIALS OR CONTENT OFFERED THROUGH THE SERVICE, WILL BE UNINTERRUPTED, SECURE, OR FREE OF ERRORS, VIRUSES, OR OTHER HARMFUL COMPONENTS, AND DO NOT WARRANT THAT ANY OF THOSE ISSUES WILL BE CORRECTED. VRCHAT EXPRESSLY DISCLAIMS ANY WARRANTIES OF ANY KIND WITH RESPECT TO THE ACCURACY OR FUNCTIONALITY OF LOCATION BASED SERVICES, AND WITH RESPECT TO THE ACCURACY, VALIDITY, OR COMPLETENESS OF ANY INFORMATION OR FEATURES AVAILABLE THROUGH THE SERVICE, OR THE QUALITY OR CONSISTENCY OF THE SERVICE. VRCHAT FURTHER DISCLAIMS ANY WARRANTY OR LIABILITY RELATED TO YOUR CARRIERS NETWORK OR SERVICE.\n\nNO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM THE SERVICE OR ANY MATERIALS OR CONTENT AVAILABLE THROUGH THE SERVICE WILL CREATE ANY WARRANTY REGARDING ANY OF THE VRCHAT ENTITIES OR THE SERVICE THAT IS NOT EXPRESSLY STATED IN THIS EULA. YOU ASSUME ALL RISK FOR ANY DAMAGE THAT MAY RESULT FROM YOUR USE OF OR ACCESS TO THE SERVICE, YOUR DEALING WITH ANY OTHER USER, AND ANY MATERIALS OR CONTENT AVAILABLE THROUGH THE SERVICE. YOU UNDERSTAND AND AGREE THAT YOU USE THE SERVICE, AND USE, ACCESS, DOWNLOAD, OR OTHERWISE OBTAIN MATERIALS OR CONTENT THROUGH THE SERVICE AND ANY ASSOCIATED SITES OR SERVICES, AT YOUR OWN DISCRETION AND RISK, AND THAT YOU ARE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM OR MOBILE DEVICE USED IN CONNECTION WITH THE SERVICE), OR THE LOSS OF DATA THAT RESULTS FROM THE USE OF THE SERVICE OR THE DOWNLOAD OR USE OF THAT MATERIAL OR CONTENT.\n\nSOME JURISDICTIONS MAY PROHIBIT A DISCLAIMER OF WARRANTIES AND YOU MAY HAVE OTHER RIGHTS THAT VARY FROM JURISDICTION TO JURISDICTION.\n\n20. Limitation of Liability\n\nIN NO EVENT WILL THE VRCHAT ENTITIES BE LIABLE TO YOU FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES (INCLUDING DAMAGES FOR LOSS OF PROFITS, GOODWILL, OR ANY OTHER INTANGIBLE LOSS) ARISING OUT OF OR RELATING TO YOUR ACCESS TO OR USE OF, OR YOUR INABILITY TO ACCESS OR USE, THE SERVICE OR ANY MATERIALS OR CONTENT ON THE SERVICE, WHETHER BASED ON WARRANTY, CONTRACT, TORT (INCLUDING NEGLIGENCE), STATUTE, OR ANY OTHER LEGAL THEORY, AND WHETHER OR NOT ANY VRCHAT ENTITY HAS BEEN INFORMED OF THE POSSIBILITY OF DAMAGE.\n\nEXCEPT AS PROVIDED IN SECTION 24.4(iii), THE AGGREGATE LIABILITY OF THE VRCHAT ENTITIES TO YOU FOR ALL CLAIMS ARISING OUT OF OR RELATING TO THE USE OF OR ANY INABILITY TO USE ANY PORTION OF THE SERVICE OR OTHERWISE UNDER THIS EULA, WHETHER IN CONTRACT, TORT, OR OTHERWISE, IS LIMITED TO THE GREATER OF: (A) THE AMOUNT YOU HAVE PAID TO VRCHAT FOR ACCESS TO AND USE OF THE SERVICE IN THE 12 MONTHS PRIOR TO THE EVENT(S) OR CIRCUMSTANCES GIVING RISE TO CLAIM; OR (B) $100.\n\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES. ACCORDINGLY, THE ABOVE LIMITATION MAY NOT APPLY TO YOU.\n\nEACH PROVISION OF THIS EULA THAT PROVIDES FOR A LIMITATION OF LIABILITY, DISCLAIMER OF WARRANTIES, OR EXCLUSION OF DAMAGES IS INTENDED TO AND DOES ALLOCATE THE RISKS BETWEEN THE PARTIES UNDER THIS EULA. THIS ALLOCATION IS AN ESSENTIAL ELEMENT OF THE BASIS OF THE BARGAIN BETWEEN THE PARTIES. EACH OF THESE PROVISIONS IS SEVERABLE AND INDEPENDENT OF ALL OTHER PROVISIONS OF THIS EULA. THE LIMITATIONS IN THIS SECTION 20 WILL APPLY EVEN IF ANY LIMITED REMEDY FAILS OF ITS ESSENTIAL PURPOSE.\n\n21. Third Party Disputes.\n\nVRCHAT IS NOT AFFILIATED WITH ANY CARRIER, SERVICE PROVIDER, OR ADVERTISER, AND ANY DISPUTE YOU HAVE WITH ANY CARRIER, SERVICE PROVIDER, ADVERTISER, OR OTHER THIRD PARTY, INCLUDING WITHOUT LIMITATION ANY OTHER USER OF ANY SERVICE, IS DIRECTLY BETWEEN YOU AND SUCH THIRD PARTY, AND YOU IRREVOCABLY RELEASE VRCHAT (AND OUR OFFICERS, DIRECTORS, AGENTS, SUBSIDIARIES, JOINT VENTURES AND EMPLOYEES) FROM CLAIMS, DEMANDS AND DAMAGES (ACTUAL AND CONSEQUENTIAL) OF EVERY KIND AND NATURE, KNOWN AND UNKNOWN, ARISING OUT OF OR IN ANY WAY CONNECTED WITH SUCH DISPUTES. IF YOU ARE A CALIFORNIA RESIDENT, YOU WAIVE CALIFORNIA CIVIL CODE 1542, WHICH SAYS: A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM MUST HAVE MATERIALLY AFFECTED HIS SETTLEMENT WITH THE DEBTOR.\n\n22. Governing Law.\n\nThis EULA is governed by the laws of the State of California without regard to conflict of law principles. If a lawsuit or court proceeding is permitted under this EULA, then you and VRChat agree to submit to the personal and exclusive jurisdiction of the state courts and federal courts located within San Francisco County, California for the purpose of litigating any dispute. We operate the Service from our offices in California, and we make no representation that Materials included in the Service are appropriate or available for use in other locations.\n\n23. General.\n\nThis EULA is the entire and exclusive understanding and agreement between you and VRChat regarding your use of the Service. Except as expressly permitted above, this EULA may be amended only by a written agreement signed by authorized representatives of all parties to this EULA. You may not assign or transfer this EULA or your rights under this EULA, in whole or in part, by operation of law or otherwise, without our prior written consent. We may assign this EULA at any time without notice or consent. The failure to require performance of any provision will not affect our right to require performance at any other time after that, nor will a waiver by us of any breach or default of this EULA, or any provision of this EULA, be a waiver of any subsequent breach or default or a waiver of the provision itself. Use of section headers in this EULA is for convenience only and will have no impact on the interpretation of any provision. If any part of this EULA is held to be invalid or unenforceable, the unenforceable part will be given effect to the greatest extent possible, and the remaining parts will remain in full force and effect. Upon termination of this EULA, Sections 2, and 4 through 25, and any other accompanying agreements, will survive.\n\n24. Dispute Resolution and Arbitration\n\n24.1. Generally.\n\nIn the interest of resolving disputes between you and VRChat in the most expedient and cost effective manner, you and VRChat agree that every dispute arising in connection with this EULA will be resolved by binding arbitration. Arbitration is less formal than a lawsuit in court. Arbitration uses a neutral arbitrator instead of a judge or jury, may allow for more limited discovery than in court, and can be subject to very limited review by courts. Arbitrators can award the same damages and relief that a court can award. This agreement to arbitrate disputes includes all claims arising out of or relating to any aspect of this EULA, whether based in contract, tort, statute, fraud, misrepresentation, or any other legal theory, and regardless of whether a claim arises during or after the termination of this EULA. YOU UNDERSTAND AND AGREE THAT, BY ENTERING INTO THIS EULA, YOU AND VRCHAT ARE EACH WAIVING THE RIGHT TO A TRIAL BY JURY OR TO PARTICIPATE IN A CLASS ACTION.\n\n24.2. Exceptions.\n\nDespite the provisions of Section 24.1, nothing in this EULA will be deemed to waive, preclude, or otherwise limit the right of either party to: (a) bring an individual action in small claims court; (b) pursue an enforcement action through the applicable federal, state, or local agency if that action is available; (c) seek injunctive relief in a court of law; or (d) to file suit in a court of law to address an intellectual property infringement claim.\n\n24.3. Arbitrator.\n\nAny arbitration between you and VRChat will: (a) be settled under the Federal Arbitration Act; (b) be governed by the Commercial Dispute Resolution Procedures and the Supplementary Procedures for Consumer Related Disputes (collectively, AAA Rules) of the American Arbitration Association (AAA), as modified by this EULA; (c) be administered by the AAA; and (d) if an arbitration hearing is held, take place at a mutually-agreed location in San Francisco County, California. The AAA Rules and filing forms are available online at www.adr.org, by calling the AAA at 1-800-778-7879, or by contacting VRChat.\n\n24.4. Notice; Process.\n\nA party who intends to seek arbitration must first send a written notice of the dispute to the other party by certified U.S. Mail or by Federal Express (signature required) or, only if such other party has not provided a current physical address, then by electronic mail (Notice). VRChats address for Notice is: VRChat Inc., 1062 Folsom St., Suite 200, San Francisco, CA 94103. The Notice must: (a) describe the nature and basis of the claim or dispute; and (b) set forth the specific relief sought (Demand). The parties will make good faith efforts to resolve the claim directly, but if the parties do not reach an agreement to do so within 30 days after the Notice is received, you or VRChat may commence an arbitration proceeding. During the arbitration, the amount of any settlement offer made by you or VRChat must not be disclosed to the arbitrator until after the arbitrator makes a final decision and award, if any. If the dispute is finally resolved through arbitration in your favor, VRChat will pay you the highest of: (i) the amount awarded by the arbitrator, if any; (ii) the last written settlement amount offered by VRChat in settlement of the dispute prior to the arbitrators award; or (iii) $1,000.\n\n24.5. Decision.\n\nRegardless of the manner in which the arbitration is conducted, the arbitrator must issue a reasoned written decision sufficient to explain the essential findings and conclusions on which the decision and award, if any, are based. The arbitrator may make rulings and resolve disputes as to the payment and reimbursement of fees or expenses at any time during the proceeding and upon request from either party made within 14 days of the arbitrators ruling on the merits.\n\n24.6. No Class Actions.\n\nYOU AND VRCHAT AGREE THAT EACH MAY BRING CLAIMS AGAINST THE OTHER ONLY IN YOUR OR ITS INDIVIDUAL CAPACITY AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS OR REPRESENTATIVE PROCEEDING. Furthermore, unless both you and VRChat agree otherwise, the arbitrator may not consolidate more than one persons claims, and may not otherwise preside over any form of a representative or class proceeding.\n\n24.7. Modifications to this Arbitration Provision.\n\nIf VRChat makes any future change to this arbitration provision, other than a change to VRChats address for Notice, you may reject the change by sending us written notice within 30 days of the change to VRChats address for Notice, in which case your account with VRChat will be immediately terminated and this arbitration provision, as in effect immediately prior to the changes you rejected will survive.\n\n24.8. Enforceability.\n\nIf Section 24.6 is found to be unenforceable or if the entirety of this Section 24 is found to be unenforceable, then the entirety of this Section 24 will be null and void and, in that case, the parties agree that the exclusive jurisdiction and venue described in Section 22 will govern any action arising out of or related to this EULA.\n\n25. Consent to Electronic Communications.\n\nBy using the Service, you consent to receiving certain electronic communications from us. You agree that any notices, agreements, disclosures, or other communications that we send to you electronically will satisfy any legal communication requirements, including that those communications be in writing.\n\n26. Contact Information.\n\nThe Desktop Client, Mobile App, SDK, and the Service are offered by VRChat Inc., located at 1062 Folsom St., Suite 200, San Francisco, CA, 94103. You may contact us by sending correspondence to that address or by emailing us at support@vrchat.com.\n\nCopyright  2019 VRChat Inc.\n\nTerms of Use / Privacy Policy", "Space Required": "627.7 MB"}



["5 stars\n47%\n4 stars\n16%\n3 stars\n14%\n2 stars\n7%\n1 star\n17%", "Unit8Jul 10 at 12:31 AM\nProblems\n\nI gave it a high rating but the only problem is that I can't play anymore everytime I load into the game it flashes as if it is trying to give me a headache and I don't know how to fix it either it has also been five months since it has worked properly and even back then it had some problems I doubt this will get any attention from anyone but if it does witch I doubt it would be very nice to play again.\n\nHelpful | 427", "fripsJul 21 at 8:34 PM\nParticles\n\nThe game is marvelous, however enjoyment of said game has gone down ever since particles became pictures for the Oculus Quest. I think I speak for all Oculus Quest players when I say that our enjoyment in this game has decreased ever since particles were made into square pictures for the Oculus Quest as stated earlier.\n\nHelpful | 34", "MrCanada18 days ago\nFantastic fun, made numerous friends\n\nNow first things first, Vrchat is less of a game and much more of a social platform. Sure you can play certain games once inside but it's main strength is the conversations with friends or newly acquainted people.\n\nSince starting about a month from now, I've made a group of friends who I'd say are closer friends to me then my real friends. It's allowed me to communicate and make friends when beforehand I thought doing so would be impossible for me.\n\nNow I LOVE Vrchat, and I'd recommend it anyone who likes meeting new people. However we do need to talk about the negatives.\nStarting off:\n\n-Performance issues: VRchat gives users the ability to create their own avatars to better express themselves, however this does lead to avatars that tend to lag the quests hardware and push it to its limits. You're lucky to push past 20 fps at any given time.\n\n-Bugs and crashes: Due to the aforementioned performance issues, you get bugs like \"Black Squares\" which occur often. The fix for this is to simply press your power button once, wait for the beep, then press the button again.\nCrashes occur often, and when they do they can range from simply sending you back to your menu to completely crashing your system and forcing you to hold your power button until a reset occurs.\n\n-Toxic people: This is not a big issue but I figure it's something worth mentioning, I've RARELY met people like this, but when you do it can completely ruin your mood or even your day. When these people show up they're usually quite aggressive and tend to get on your nerves especially if you're of a younger age (12 and under)\n\nNow VRchat has implemented a system to help with this and EVERYONE who plays should get acquainted with these two things. If a player is harassing you or others, simply open your menu, point your laser at them, and click until their profile pops up. Once it does, you have two options. You can either mute them, which simply stops your ability to hear them, or you can block them. If you mute a person, and they begin getting in your face or \"physically\" annoying you, blocking them is ALWAYS an option.\n\nWhen you block a person, they can no longer speak to you, see you, or select your profile. You can still unblock them by going to the social tab, however you can't hear or see them until you do so. DON'T BE AFRAID TO BLOCK AND OR MUTE THOSE WHO ARE ANNOYING OR HARRESING YOU, it's very important you enjoy your time in VRchat, and you don't want your experience to be ruined by toxic people.\n\nBe aware, this also applies to you. Don't get in other users faces, don't say things you wouldn't like said to you, and try to have respect for everyone around you and you wont have to worry about other users muting or blocking you.\n\nVRchat is a fantastic place to make friends and play a few games from time to time, and hay, it's free so what could possibly go wrong in trying it out? Users like myself are usually in the Quest hub world helping newbies out, so if you're struggling, don't be afraid to ask others for assistance. Have fun :)\n\nHelpful | 12", "Moonlight_HyenaJun 1 at 9:14 AM\nGood but updates bad\n\nAbsolutely love the game made tons of friends on it and met my boyfriend on it and weve even met outside the game. Only problem is the updates everytime they update they take things away first they took away flying for quest avatars and sounds for quest avatars which I personally paid for a custom flying and sound avatar. And now they ruined particles I have a avatar that uses particles I paid for as well and now its just square pictures at the particles. They need to bring back flying and sound avatars for quest and need to fix particles. I love Vrchat but they need to seriously step up their game for us quest users. They fixed crashing but ruined the fun of having flying and sound avatars along with particles if people dont like the sound on avatars they can turn off avatar sounds in settings along with if they dont like someones particles they can hide the avatar. Vrchat please fix and bring back flying and sound avatars Ive paid over $100 worth of avatars only for you to take away what I paid for. There are others that have paid for avatars too. FIX IT AND GIVE IT BACK!\n\nHelpful | 819", "VrylxJun 21 at 12:31 PM\nGreat game + how to fix glitch\n\nVRChat is a great game. Especially if you want to interact with someone who lives far away. However the game does glitch out often if you play it a lot. One of the most common glitches Ive noticed is black squares or patches appearing on screen and sometimes flashing. Luckily there is an easy fix. Simply tap your power button, and then tap it again. Thats it, youre done. You dont even have to leave the game or reset your oculus. Just tap the power, let it go full black for a second, then tap it again to turn back on, and boom youve basically just reset your display. Easy right?\n\nNow, heads up to new players. If youre just starting out, you MUST go to your settings and turn on comfort turning so you dont get sick or feel disoriented. Honestly not sure why its not turned on by default. Also be prepared to run into weird stuff. People are weird. If youre a parent, wondering for your kid, I would say dont let them play unless theyre at least 13. Besides, the oculus is designed to only be played by 13+ anyway.\n\nHelpful | 123", "TorebinJul 15 at 11:06 PM\nGood game but...\n\nIts a good game, but isnt really fair to people on quest, we dont get NEARLY as much stuff as people on PC, and yes, we could use oculus link, but not all of us have really good PCs, please let everyone use everything, thank you\n\nHelpful | 39", "Not_AzraelJun 1 at 6:23 AM\nWas perfect but not anymore\n\nVrchat was and always will be one of my favourite games. I loved it until they added an update which made the game very laggy. And made my game crash this problem is a problem with every quest player in general. Also some of my favourite avatars have been removed for some reason. Sometimes it doesnt load me into the map and just makes me watch the loading bit over and over again. But even with this update, it is still 100% worth getting and also its free so why not? If the devs see this PLEASE fix this problem.\n\nHelpful | 155", "Ryan_JerseyJul 25 at 9:14 PM\nLove the Game, but recently....\n\nI got the quest so I can play this game, and I love it, I try to do 4 hours every session. But yesterday I had issues with logging in; I turned on and off my headset and everything was fine.\nToday (about 30 minutes ago) I sit in loading for 20 minutes, restart my headset, try it again, didnt work. I turned off my headset twice, didnt work, uninstalled it and reinstalled it, didnt work.\nI even changed my WiFi connection to my better one and it still didnt work. Im happy I still have it on Pc, but Im irritated that I spent so much time trying to work with it and it didnt work.\nNormally a 4-5 star game, but its getting a low 3 until that issue with even getting on can be fixed.\n\nHelpful | 15", "Sushi105925 days ago\nGreat game, very fun- but lag\n\nThis was the first game I got on my quest because I wanted to meet people and see my other friends with quests, and it is very fun, and it is pretty easy to keep\nyourself safe. The only thing Im not a fan of is how lagged everything is, and really only for quest users. If the VR Chat devs See this, PLEASE update the lag problem for quest users. I still love the game, its just lagged.\n\nHelpful | 5", "Djmason64Jun 7 at 11:08 AM\nNot bad but very limited\n\nThe limitations on the quest makes it hard to interact with pc users as we cannot go to their worlds which are better in just about every aspect. Basically on quest we only can see Id say maybe 40% of what the game has to offer because of the limitations. Overall still very fun and playable but mainly only with other quest users.\n\nHelpful | 66", "xXTheGodzillaGamerXx20 days ago\nFun game, recommend Rec Room\n\nThis game is great, but theres not that many activities and fun things to do. A lot of it is socializing where you dont know the type of people youre meeting with. I would recommend the game Rec Room, it has a community of either micless or mostly nice people. It also lets you play tons of games including horror, sports, pvp, parkour, adventure, and essentially any kind of game, because its very easy to make games in rec room, and thus many great games have been made. Not to mention Rec Room is free, just like Vrchat. The only downside is the character editing, where you have to be a human but can change your clothes and hair, etc. But thats mostly for fairness in games, especially shooter pvp, or parkour, or hide and seek, where different sizes could change your ability to win games.\n\nHelpful | 5", "Crispy_BaconVR10 days ago\nPretty good game+ how to fix flashing\n\nSo overall I think its pretty good for the oculus quest and the graphics arent that bad also one thing I dont like that u are limited to avatars.\nHow to fix flashing U must have your microphone on or else it wont work SO TURN IT ON And u can mute yourself.\n\nHelpful | 3", "TH3L3WD0NE25 days ago\nto the new comer and to the complainers\n\nThis is honestly by far way superior than rec room, and there is tons of worlds and games to play, there are tons of awsome fun people to meet and cool avatars to choose from.... this next part however is for the dumb complainers, first of all chill out on making the devs give out more, they do not control if a world or avatar gets imported for quest users or not it all depends on the person who made it in the first place. second of all the devs try there hardest to make the game compatible and stable for quest, just because you got a standalone vr headset does not mean you have PC VR headset built in to the thing, the cpu is a phone proccessor for crying out loud! Thirdly if you see particles as black jpgs its because it helps the game run stable and keeps the FPS up, fourthly if you're wondering why quest users cant join a pc only world, it's because the shaders on that world can not be implimented as a mobile shader hense if you were to look at the shader your view would be laggy as crap and you would be at 1 FPS, so if you have a problem with a world not allowing Quest users, bring that up to the person who made that world not the VRCteam.\n\nThank you :3\n\nHelpful | 10", "thiccieJun 9 at 3:11 AM\nPlease fix your game\n\nIts probably the best social vr game out there. But vrchat isnt vrchat on the quest... on the quest its so strict compared to pc and pc vr, #1 you cant even view half of the avatars, #2 its so hard to get good avatars on the quest its boring, #3 you barely give us any worlds at all. when i hop on i see the same stuff over and over. I would rate 5 stars if it any of the stuff i said was fixed.\n\nHelpful | 77", "MikeyCyrus231Jul 11 at 10:57 PM\nGood game but one problem\n\nThis is a great game and I respect that but there is a problem. I try to find a world that has the correct title, form, and author but doesnt appear. Like WDKS Horror Experience. I cant find it anywhere in the search bar.\n:/\nI typed in the author of this game but unfortunately only has one game, and the world that I wanted to join, is not there.\n\nI cannot tell if this is a glitch, or just a malfunction that this game is not letting me use :(\n\nHelpful | 8", "RepoReconJul 18 at 10:08 AM\nWhich PC is best for VR Chat?\n\nI have questions. I am a Best Buy dude, its convenient so there is my justification. Anyway... if any of you reading this would recommend an adequate PC (preferably laptop) which supports SDK, and which can be obtained from Best Buy website... which one would you get that had minimum standards for supporting a better VR Chat experience? I want to build my own world, and also maximize other social interaction in VR. Thanks.\n\nHelpful | 5", "alvin.stroynyJul 26 at 4:35 PM\nLove this game so much\n\nLove this game\n\nHelpful | 26", "Neowise6 days ago\nSolid\n\nIm glad I waited to review. Most of these low ratings are because of the update in April, this made the game very laggy often causing crashes almost every 20 minutes. However, recently, with all these updates, I have been finding my game no longer lags out. There is still lots of room for improvement, but the problems the game had back in April/May appear to mostly if not completely gone.\n\nHelpful | 0", "Articus23921 days ago\nUsed to be perfect\n\nThis game was great when I first got my quest 8 months ago but now it's just been riddled with bad updates and a lot of my avatars that used to work are in available with no way to see them or the reason why they were removed. I really hope the devs bring back VRchat back to its prime but untill then I won't be playing.\n\nHelpful | 11", "VanceTheWeeb19 days ago\nMY FAVORITE GAME\n\nThis game is awesome, pretty good graphics, easy to play, chill, meet awesome friends, No problems except for the occasional bugs that they usually fix, thousands of avatars and worlds, many things can be changed within the settings. Only bad part is when you get British 9 year olds screaming at you\n\nHelpful | 5", "LaurenArtKidJun 13 at 1:10 PM\nMostly Fun\n\nThe game itself is a really fun, interesting way on making new friends and chatting to others. Although there are a couple rude people around its mainly filled with friendly peeps! :0 Ive made several friends with my time on Vr chat and cant wait to make more!\n\nAlthough the recent update has made it bug out way more often than it should its slowly getting better and Im sure soon it will be fine! :)\n\nHelpful | 19", "TSB_sebsebJul 11 at 9:18 AM\nLoved the game\n\nI loved the game but it has turn to the worst game in my collection because of the devs limiting us l. for anyone wanting just to make friends and have fun Id suggest either get a pc to run vr chat or get echo vr which youll have hours of fun in the lobbies and even more fun in the arena game mode the main part of the game.\n\n(Note to the devs I love yall really I do but please u turned the game to almost being like the pc version to a whole new game and I like that but is us quest users just wanna be the same as the big guys on pc thanks.)\n\nHelpful | 9", "lucy_vrJul 8 at 10:08 AM\n\nAmazing way to socialize during lock down. Amazing skins and avatars along with skin worlds. My confidence levels have grown so much since I have installed this game. It does lag my vr in some chat rooms though. I would recommend to stay away from taco Bell World as it seems to lag me and my other friends the most.\n\nHelpful | 6", "Adam68adsA day ago\nGood but one problem\n\nIt's a amazing game exept if u have a quest, on the quest the lobbys skins and overall gameplay isnt as good at the pc version because more people play rift and pc. You can still have a laugh with friends on quest but if ur into socialising and laughing with loads of people do a pc version\n\nHelpful | 0", "eringa.sJun 14 at 4:12 AM\nVrchat isnt working\n\nHey, I recently got the oculus quest and was looking forward to playing vrchat, until I got onto it and the screen would just flicker and lag. I did research and its because my graphics are high but I dont know how to change it. I mean maybe when you first get it, the graphics should automatically be like, on the normal amount.\n\nHelpful | 47", "Generique5 days ago\nSaddened to see the downfall of VRChat.\n\nVRChat has been one of my favorite VR games for a good while. I loved it so much that I ended up buying an Oculus Quest specifically for VRC.\n\nAt first I really enjoyed it! Sure it was annoying having to deal with low graphics (Compared to its PC counterpart.) and not being able to see most avatars, but that was a price I was willing to pay.\n\nEventually I stopped playing (Primarily due to how migraine-inducing the Quest can be.), and I took a break. However, I recently decided to pick it up and play. VRChat has gotten so laggy that I can't even log in without it crashing my headset. Trust me, I've tried everything out there, but at this point VRChat is just unplayable. I've waited months for this game to be more Quest-accessable and I suppose that waiting was not worth it.\n\nThis game used to be incredibly fun, now it's a burning dumpster fire.\n\nTLDR; 2/5, would not recommend due to the fact it doesn't even load.\n\nHelpful | 3", "hiramlennoxJul 26 at 4:28 AM\nAmazing best game ever\n\nThee reasons why I like vrchat is because of how nice the people are, because they are not specific avatars that you can constantly wear like altspacevr, the avatars are fire and sick, there is a hard way to get banned because I got banned from altspacevr cause I liked burgers and pizzas (permenantly banned)\n\nHelpful | 4", "AmazingSupDawgJul 27 at 6:27 PM\nFrustrating\n\nIve downloaded this game and had it for a few months and every time I try to even start the game. It flashes between black and the game. This has been an issue every time Ive tried this game and I cant even get out of this cycle until I restart my entire headset and play something else.\n\nHelpful | 17", "EpicLucas0722 days ago\nQuarter good The rest Horrible\n\nI find it sort off rubish that people with oculus quest get less things and vrchat is the biggest example please please make all worlds available for oculus quest and avatars oculus quest\n\nAnd there are several avatar that I want the most\nColossal titan\nMy hero academia\nUgandan knuckles\nAnd more\nSo please give us the same thing pc players have\n\nHelpful | 12", "flukefancy8 days ago\nShould have done my research\n\nOne of the main reasons I wanted to get into VR in the first place was because of VR chat. It's a really cool app and it has a lot of potential, but I'm really bummed out. I paid the extra money because I thought Quest would be the top of the line, but the Quest version of VR chat is so limited that it's hard to call it the same game. Reminds me of the shareware days.\nI know I shouldn't complain over a free game, but if I had known quest VR chat was incomplete, I would have at least considered a different model headset.\n\nHelpful | 1", "TheredraptorJul 19 at 5:13 AM\nLag after you play for a while\n\nWhenever I play vrchat for around 1 hour or 1 and a half it starts to have very bad lag. I am on quest and I dont know if any one else is having this problem with vrchat. Other than that 4/5 stars\n\nHelpful | 5", "MiningMine09 days ago\nOkay, not for kids\n\nThe game is good but I only use it as a place to chill with friends I know but still REC Room does that too. I'd only use it if you're an adult or teenager above 15. At least make sure you're voice has given me through puberty. They don't take lightly to kids who will mostly be trying to revive Uganda Knuckles (Great Meme BTW). Overall don't install this if you're an introvert.\n\nHelpful | 0", "Icywolf100Jul 7 at 2:00 PM\nIt keeps crashing alot\n\nThe game is fun but it keeps crashing and oculus quest people cant go where pc people can go and theres no good horror games on vrchat like theres only crappie ones please put better and more horror games on vrchat and please fix the Crashing.\n\nHelpful | 5", "EnderMob200817 days ago\nAmazing every thing you would ever need\n\nIs amazing I rate 5 I dont get why so many people dont date this 5 its amazing I can just talk about the most random stuff and have fun in the mini games and chill out in other places. I know it might not be as good as the PC version but this is all ran WITHOUT a PC like\ncrazy right?!?!\n\nHelpful | 2", "GuyHero9 hours ago\nNeeds the yu gi oh world\n\nFor the quest version theres not really many worlds. Was hoping the yu gi oh world was available but its not sadly. Hopefully this game updates alot for the quest version and many maps get added\n\nHelpful | 0", "ChrisNeedsBred13 days ago\nWas excusable, but now unplayable\n\n8-11-2020: So I came back after a couple months to see if any problems had been fixed and oh dear lord is it worse, they've completely gotten rid of particles and have made them squares instead, however the crashes seem to be reduced quite a bit...only for them to be replaced by infinite loading screens...oh so many infinite loading screens. Literally the first world I tried to join after getting on it reached 38% and just halted, i canceled and tried again only for it to get to 57% that time...then once again it worked fine. These are small worlds btw, only about 16-30 MB. My review hasnt changed for this game and has probably only gotten worse, but I've changed it to 2 stars cause it's free and its cross play...even though that doent really mean much since you cant go to any PC worlds and any PC players in Quest compatible worlds block you and only see you as a nuisance.\n------------------------------------------\n4-12-2020: I love VRchat and I've been playing it for a couple months now, and when I first downloaded it, I would have given it 3-4 stars due to the fact that it IS incomplete and you cant have as much fun as PC players, it was buggy and I had common issues. So I dont know what happened, but I cannot play this game anymore. I use my safety settings on certain avatars and try to prevent my game from acting up, but wow, its straight up unplayable now. Its come to every time I try to load into a world, I either get booted out at the loading screen, or booted out when I load in. OR, my game will just black screen and I'll have to restart it, and in the worst cases it CRASHES MY QUEST. I dont know if I'm just unlucky but it feels like I'm playing a Beta of an early access in early access. And I know VRchat is in early access but the PC version is far far superior than the version on quest. You will spend at least 30-45 minutes trying to actually play before you just give up and play another game or you actually get to play for just a few minutes before being booted or crashing.\n\nHelpful | 3", "thattyuuki7 days ago\nAlways on, very fun\n\nI dont seem to have a problem with it. I play with my crush all the time, its fun i dont have problem, (edit, 2 months have passed and now i cant even play! Everytime i get on I immediately crash. This is totally absurd im deleting and reinstalling it now but if this doesnt work then pls fix game asap i play with my now boyfriend all the time)\n\nHelpful | 0", "x_blitzzz4 days ago\nVery good but...\n\nSo every one and a while my game will glitch my ENTIRE oculus where back and white squares flash everywhere on the screen and gives my headaches. Other than that its amazing.\n\nHelpful | 1", "BubbaTronioJul 22 at 5:23 PM\nPlease add more stuff\n\nDont get me wrong its still a really fun game and I recommend everyone to play it but I just want more access to maps avatars it would be so awesome if we had stuff like people with pcs do even if we dont have a pc and a oculus link\n\nHelpful | 2", "brent.ritenour.16May 10 at 9:51 AM\nI love this game\n\nDuring this pandemic everyone is stuck at home you might not know what Im talking about depending on when you read this but everything during this is antisocial but with vrchat it is a great way to cheer you up and get to be social again but there is a map in this game where you can play the Atari actually play it you can play pac man or a street fighters rip off or flappy bird and other games I showed this to my parents and they loved the nostalgia they also wondered why I was a squirtal like the Pokmon with abs lol but so cant give it 5 stars becouse when you play on quest there is cross platform and the quest cant handle some avatars so half the time people are just floating robots with a picture of there avatar it the middle of them this makes me feel left out when people are laughing at a funny avatar I cant see I give this game 4 stars\n\nHelpful | 32", "zacksta97Jun 11 at 1:14 AM\nMy favourite pass time\n\nI love nothing more than putting my oculus quest on and playing VRChat with loads of new people and millions of fun avatars. Meeting so many down to earth and hilarious people on a daily basis is what I love most. Just being able to chill out and have a proper laugh with strangers is a feeling you dont get often these days. But VRchat has made it a thing once again.\nRecommended to anyone and everyone \n\nHelpful | 19", "SableTheSmol10 days ago\nLiterally Unplayable\n\nThis game is so broken, you can't even play it on some headsets. I have an Oculus Quest, and was so exited to play this game because I had seen a ton of Youtube videos on it. I finally get my *$400* headset, to then download it, not be able to sign in with my Oculus account, make a VrChat account, can't sign in, change password, successfully sign in, have the game crash, uninstall and re install it, then not be able to sign into my account or change the password. Please fix this, me and many other people with Quests want to play this game super badly, but can't because of all these problems.\n\nHelpful | 2", "brenden.mcgrawhobbs14 days ago\nSucks that you can't see every model...\n\nIt's not any fault of the developers but some people design their character models in such a way that quest users cannot see them because of high poly counts. As much as I'd love to see the developers add some sort of model downscaller I know that wont likely happen due to that also being just as difficult to calculate as just displaying the high poly model. Would be nice still to have more control! Low frame rates don't both me\n\nHelpful | 1", "XBootyPlundererXApr 16 at 12:26 PM\nGreat but needs improvments\n\nOverall I love vrchat, it's very similiar to ready player one even though the two aren't related. On quest it isn't very graphically impressive but understandly due to the quests power, however some avatars are pretty impressive. I do prefer vrchat to recroom anyday but there is problem that needs to be adressed which is the crashing, it's still pretty common. Aside from that though soms improvments I'd like to see but not need are:\n.more avatar availabilty within the gpu's potential ofc\n.hand tracking implemented\n.more custom emotes\n.built in voice changer\n\nHelpful | 321", "Durpo24 days ago\nI LOVE THIS GAME\n\nseriously this game is so good, it should be a 10 star rating, but please, fix the game, i get black pixels randomly and it messes with my head. developers, please fix your darn game. The game is amazing dont get me wrong but it just needs patches.\n\nHelpful | 1", "KukriTstJun 29 at 8:51 PM\nSlow and Limited, yet fun (Quest)\n\nIt's a good game to just talk to people and relax on, but you can't see alot of people's models and it would lag quite a bit. I couldn't put up with it so I stopped playing it, but if these things don't bother you, then you should have a swell time.(also alot of weird peeps on here or at least my experience)\n\nHelpful | 5", "WirelessEagle06Jul 8 at 10:15 PM\nMy Rant (Bugs,Limits, and a lot of rage)\n\nDear VRChat developers,\n\nReally? This was what I waited for a years worth (longer actually)? I just got my headset like two days ago, and the game is not worth my $600. Theres barely anything! I got to say, from a BIG FAN of VR, this was the one place that seemed spectacular, yet its terrible and I cant even meet up with the TRUE people. My mic is not even working, neither is anyones, and black cubes are there. Heres some advice, actually make the game like weve all hoped for, if not, the fans, me, and everyone you wanted to help, would just be bored and unsatisfied. (Even Rec Room is more interesting than this! Fix the game, and make sure you give the FULL experience, and yes, I know youre reading this, so listen up! Help the fans, or youll just be dealing with a lot of rants ) P.S: too late\n\nHelpful | 12", "akuma212Jun 24 at 12:28 PM\nWhats its really about\n\nFor being called vr chat its pretty trash for the vr it lags way to much and for some reason my head set continues to disconnect from the Internet so I always freeze and have to leave the game u cant see pc players and cant play in most of the best severs because ur not a pc player its really bad and I really had fun at first but it has just become repetitive and annoying.\n\nHelpful | 5", "TheKindaVRNerdJul 8 at 7:04 PM\nNot the best game\n\nI think rec room is better. I used to think Rec room was just a kitty version of this game, but its way better. This game just doesnt have much to offer. You get bored after socializing forever in my opinion, because its really the only thing you can do on quest.\n\nMost of the games are for pc vr. When Im on pc, this game has bunches of activities, and its fun and I play it all day endlessly, thats what I thought Id be doing here. But the reason I played the pc version so much, was because of the games, and its just not ready for the quest. The games can be made for quest, but I think majority only make games for PC because its simply just easier than having to port it over to the quest, and we cant blame them. Theyre not professional programmers and developers, they shouldnt be obligated to make controls for every VR headset in the market, and thats the quests ports most fatal mistake, if there was a way to make it automatically program each control for each Vr controller, than this game would have much more to offer on the quest, but it just doesnt.\n\nHelpful | 3", "MrPoothtick24 days ago\nLacking\n\nThis is an alright port, but the incompatibility of a lot of avatars with the PC version and the \"perf blocking\" of avatars is highly annoying. I only play this game if friends are wanting to play it.\n\nHelpful | 2", "DillSG2009Jul 30 at 1:41 PM\n\nI love this game! But when I downloaded it and logged in with my oculus account. When I got in it showed me a tutorial. When I opened the menu system menu was not there so I was stuck with third person walking AND I didn't see my avatar when I changed it. It said it was set to that avatar that I imported to my PC but when I looked at myself I just looked like a robot with no arms.\n\nHelpful | 0", "CorkCylinder737Jul 26 at 3:16 PM\nGreat game but...\n\nThis game is good for socializing but the ESRB rating should change due to the fact of most avatars that are mostly for adults. Its great and all but the rating should change. I have Nothing against this app. Its great.\n\nHelpful | 0", "Rieducky6 days ago\nTons of bugs and limited stuff\n\nEver since December, Ive had this game downloaded and I always played it. But I dont really feel like playing it anymore because it says that Ive run out of storage when I still have 33GB of storage free, and I also dont like the fact that you can only favourite 16 avatars. I always feel like the limit should be higher, like 200 favourited avatars at the max. Because one being blueASIS some people have cloning on and are wearing avatars that people that make them give the avatars to the person that 1. You cant get them because They have not made a avatar game so you cant get them or 2. They have a avatar world but they will never put it in the world. And the sad part is is that i have to unfavourite one of my favourite avatars that you cant get because its the same from line 4 and the avatars that i have are really rare. So please fix the storage problem and please raise the limit of favourite avatars to 200. Then It will decrease the chance of me quitting.\n\nHelpful | 0", "George021720 days ago\nGreat game overall\n\nIve met so many awesome people on this game, and I still keep in contact with some of them. I know theres people complaining about the lack of content for Quest, but its not as powerful as the people who use high-end PCs. The game wouldnt function. Personally, those things dont bother me that much, which is why I believe this game to be the best game I own on my Quest. Keep up the great work!\n\nHelpful | 0", "MJR9608Jul 29 at 2:55 PM\nPlease fix black screen glitch!\n\nOk, I got this game today and was happy until I got onto the starting world and it all fell apart. When I load into the world the screen turns black for a second, the back to the normal screen. It repeats every time. I tried everything, restarting my headset, turning it on and off, it just never worked. Please fix this!\n\nHelpful | 1", "wolfpup236621 days ago\nWow just wow\n\nI have wanting to play this game since I saw zlybrad play it and so VRChat was the first game I got when I got my oculus and boi have I had a blast I have met some really nice people but if you are debating on if you should get this game just watch lolathon he is a YouTuber that plays VRChat just go watch him after you get this game\n\nHelpful | 1", "rRodent-pyjamasVR20 days ago\nVR chat is an amazing social game\n\nThis is such a good game for people starting out on VR and VR veterans, there are so many user created worlds to chose from, thousands of characters to become.\nOne of the best multilayer games on VR if you ask me\n\nHelpful | 2", "Gamertag_VR19 days ago\nUNFORGETTABLE VR EXPERIENCE\n\nFIND VRCHAT VIDEOS BY SEARCHING VR CHAT & GAMERTAG VR\n\nMy first time in VRChat is, as stated, pretty unforgettable. You can be almost anyone, visit incredible worlds & games made by incredibly talented people such Ridge Racer, Doom, Mirrors Edge and Undertale (all on channel). I even attended my first VR concert hosted by Jean-Michel Jarre called Alone Together also on the channel. You will meet a vast amount of amazing, funny, angry, trolling, amusing people but most of all its a bit of life changer plus Its free too! Download it right now and go in with an open mind.\n\nUnfortunately the custom avatars on quest are limited currently but I really hope that changes.\n\nHelpful | 1", "IWroteThisNameJul 2 at 12:46 AM\nMine wont even let me play\n\nSo I bought an oculus quest a week ago, and it arrived today, I got vrchat and tried to play it, but everytime i would get into a world, it would lag and flicker off and on and i cant move or do much and my frames sucked, i know it's not my internet, I just hope I can play it soon, I really do like the game, and I will rate it 5 stars cause it is fun\n\nHelpful | 5", "BDC200912 days ago\nI ran into a problem\n\nSo VRChat is a pretty cool game. I tried it out on PC and loved it. But theres one problem. Every time I go into the world, my screen flashes black, then normal. I tried resetting my view and then restarting my Oculus Quest, but sadly it didnt work. Are there any fixes to this?\n\nHelpful | 1", "GroundBananasJul 21 at 9:20 PM\nNot the best\n\nI enjoy playing this game sometimes when im bored and feel like talking to some people. but the problem is that the game usually lags out or i cant really hear people. then most of the time the game will just crash and my oculus will take a couple minutes to be okay again. but by that time i wont really wanna play anymore because it might just do it again. other than that sometimes its fun 20% of the time. i dont recommend getting an oculus quest just for vr chat. if you really want to have the best experience i recommend getting a rift.\n\nHelpful | 1", "XNLightningJun 4 at 3:26 AM\nIf you don't like swareing then pass\n\nI like da game it fun you get to meet people you'd never probably meet in real life it worth a play cuz cuz well God give it a go it's freeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee so ye why are u still reading less reading more playing \n\nHelpful | 11", "seedydylan21 days ago\nI love it\n\nI didnt have the game until I saw a YouTube playing it so I thaught I would give it a try (best thing I have ever done) get the game you wont regret it\n\nHelpful | 3", "rudymartin10May 17 at 3:02 AM\nI like this game now\n\nSee the problem was I played this game but it had a lot of bugs and glitches but the game has got some updates in the game doesnt crash anymore which is really good so I use this game on a day-to-day basis I think people should change their review \n\n\n\nUpdate I went onto VR chat nothing worked the whole screen was black I could hear nobody my oculus quest was not working right everything was going to crap please developers if you can see this do something about your game please\n\nHelpful | 20", "javiwear8 days ago\nForgettable\n\nThis game is seen very much seen in YouTube, with youtubers like Heyimbee, Drumsy, Lolathon, Sethimus, and many more, but the reality is the game is honestly not that good. Im gonna say it VR chat was very disappointing for me cause I was so eager to play it and when I finally did it wasnt worth it. Not to mention if you are a quest user the experience got cut in half, most avatars and maps are unavailable to quest players, and guess what those unavailable maps and avatars are the ones people use. All honesty Id say I rather stick to Rec Room since that game has a much better and more fun experience.\n\nHelpful | 0", "EthanGamerXBJul 12 at 3:22 PM\nBreaks everything\n\nthe game is good but most of the time my game crashes and breaks my quest. It causes a lot of bugs inside my vr headset and breaks some of my other games too. Sometimes, i have to shut down my vr headset and restart it and it is so annoying. Vrchat is not worth it, if you get it, good luck with your broken\nquest.\n\nHelpful | 6", "playfullpandaMay 31 at 10:54 PM\nHEY! LOOK HERE FOR BLACK SCREEN!\n\nSorri for 1 star\n\nso some people are getting black pixels on there screen and they wont come off..\n\nBUT I NOW HOW TO FIX\n\nIf you are experiencing black pixels in the middle of your two eye screen things\nIt looks like how the decals on stuff destort in the back of your sight..ACCEPT ITS ALL BLACK PIXELS\n\nIf your having THIS problom here then here's how to fix it ( because i didn't )\n\nTap your headsets power button\nIn game as the problems occurring wait a few minutes or more and this seems to fix the problem!\n\nIf the black pixels are still there then id suggest retrying for longer or shorter period\n\nOr restarting your system itself / logging in and out of VRC\n\nPut this here so u could see it\nI need to put an attention grabbing thing here\n. \n|\\\n/ \\\n \n\n \n  /\n )\n\n\nHelpful | 42", "sugoicinJul 2 at 12:00 AM\nLimited access to quest users >:(\n\nQuest users can not access any pc avatars, dynamic bones, good avatars, etc. It is very frustrating when youre the old avatar with no dynamic bones, the hairs are stiff, you can not see any pc avatars, can only access quest compatible worlds, quest users also can not take selfies in the settings (the phone camera that you can move around) you can only screen shot which will save to your folder where you have to use a usb to transfer it to your device/phone.\n\nI think its a very very fun game on htc, oculus rift vr and pc, but quest users are limited, you cant do anything fun, nothing will load, cant use good avatars, cant access fun games, etc.. People will also bully you if youre on quest, it is also very laggy and eventually crash.\n\nI wish they could make the avatars work and load (dynamic bones, jiggles; like on pc avatars) because quest are the almost the same price as the oculus rift, its the same price because it can be used wireless. It is for people who cant afford a pc, therefore I recommend to you all with quests to not play it, just because its limited and you cant interact with pc players (htc vive, oculus rift users, some pc users) because their avatars have a lot of graphics and polygons so their avatars are robots and quest users can do nothing about it.\n\nYou can only play by yourself, which is sad...because you cant interact with other players properly, I hope they make an update, I dont want to buy a pc just for it to be fair to interact with others.. You can do better vrchat..\n\n\n(P.S. If your on Oculus quest and in vrchat but it keeps blinking and flashing (unplayable) go to vrchat settings in the oculus home and turn the microphone option on)\n\nHelpful | 8", "CRiver54618 days ago\nThe updates\n\nI just wanna say QUIET RUINING THE GAME YALL MAKE THE GAME SUCK GIVE US BACK EVERYTHING THIS IS ALL WE HAVE LEFT IN THIS shi*#y 2020 year YOUR MAKING ARE GAME CRAPPY SO STOP IT YALL ARE STARTING TO GET SOME REAL BAD COMMETS FOR THE GAME\n\n~CRiver546\n\nHelpful | 4", "tOxIcTr0operVRJul 29 at 9:58 PM\nIt glitches when u log in and the tac\n\nWhen I setup my account and started to p;ay the tutorial or click on the terms and conditions it glitches out and a box and a black outline pops up or I cant load the terms and conditions and one of the reasons I bought the headset is because there was a lot of communication and during the outbreak thats all I wanted to so please fix this and get to me as quick as you can we are all waiting and thank you\n\nHelpful | 1", "Kurokitsune9710 days ago\nBest app ever!!!!!\n\nVrchat reminds me of ready player one and sword art online mixed. Without vrchat, I wouldnt have met awesome people who had been there with me. Thank you vrchat for making it the best!\n\nHelpful | 1", "Donkeychainz123Jun 20 at 3:33 AM\nHorny game be like\n\n\n\nHelpful | 21", "ryanscullin8 days ago\nKind of broken\n\nI hope it can reach a more playable state on Quest but the frame-rate is often hovering in the 50s which is bound to make people sick. Hitches in the connection also lead to major jerky movement which definitely also contributes to discomfort. I havent found a room where things were both smooth and glitch free.\n\nHelpful | 0", "CurlyStacheMay 5 at 12:22 PM\nI dont even load into the game\n\nFIX THIS Please I was able to play the game once before I tried to get in a world but it would load but it would take years now when I try it just freezes my oculus and I cant even go to the home page FOR THE LOVE OF GOD FIX THIS and I deleted it but it just says uninstalling stuck like that for the past 3 weeks PPL PLEASE CLICK FIND THIS HELPFUL SO THE CREATORS AND DEVS SEE THIS\n\nHelpful | 274", "Carl_Wheazer420Jul 21 at 6:20 PM\nIts a good game but not for me\n\nThe game is fun but I have a bit social anxiety so I find it hard to talk to random people. If you want to meet new people I highly recommend this game its an original vr game and some of the experiences you can get with some people is so funny 10/10\n\nHelpful | 2", "wingsoffire812 days ago\n\nEvery time I try to start it wont go past the loading screen it just goes black and kicks me out of the game I havent played it so Ill give it three for now\n\nHelpful | 3", "PinkPlumPieJun 10 at 9:54 AM\nWhy is this so unplayable on Quest\n\nIm sorry but the Quest version needs a LOT of TLC. The main problem is it literally lags so bad that you cant do mostly anything (I KNOW its not my internet because my connection is great). Not to mention that you are limited of things to do in the first place and unable to see PC avatars. Please fix this.\n\nHelpful | 13", "BlueMoonRain13 days ago\nProblems\n\nPlease, just make horror games on it for quest. And make all skins seeable!\n\nHelpful | 0", "Narrarator24 days ago\n\nIt says that I have a unknown error every single time I try to login\n\nHelpful | 3", "Bronze-TigerJul 18 at 4:50 AM\nWiFi issues, can't sign in, black void\n\nThis is the first game I have gotten on the Oculus quest and I was so excited when I signed in . It loud for a little bit and when it told me that it take me to the tutorial I reached for the ok and then. IT froze my controllers froze when I looked around there was an empty void and all I could see was the viewing box where I could see my frozen controllers and the loading screen the VR chat music was still playing though. I pressed the home button and it took me to the home page the music was still playing and I pressed quit tried again and it happened again?. So I deleted it and reinstalled it ran the app signed in to see if it would work NO it didn't work to this day I still can't play every time I see that there's an update I get excited just to see that the glitch still happens. More detail I sign in using vr chat.\n\nPS I've read the other one to two star reviews to see that you people don't really like responding. Sorry for the long review and I hope you get this read this and fix this thank you.\n\nUpdate: awhile back I was able to play it it was working perfectly fine...for three days. while playing with my new friend my Oculus died. And I charged it got back on vr chat but it was glitching so I said to myself ok just a bug. So I uninstalled VRchat and now I'm back to square one no game can't sign in Frozen in a void.\n\nUpdate:Ok new news I recently took my oculus to my friends house and hook it to THERE WiFi and told my friends the whole story when out of knowhere they said \"no it's working\" so I saw yep sure enough VRchat was working I hung out with my friends went home so happy and hooked my oculus(quest) to MY WiFi and boom no sign in black void and a screen.\n\nMay be my FINAL update: I'm mad I thought to myself is it my WiFi so I turned on my phones hotspot and guess what I signed in and I could actually play the game ON MY PHONES HOTSPOT so I'm finally done with this port I had a 4 star review now downgraded because I CANT PLAY WITHOUT MY PHONES HOTSPOT or without my friends WiFi. but I'm leaving a 3 star cause I somehow i still have hope.\n\nIf anyone has any news please help my WiFi is spectrum 5/2 g thank you please click/tap/push found this helpfull so the devs see this they probably won't but it'll help\n\nHelpful | 2", "Iniquitxterria21 days ago\n:/\n\nAll I want to do is play VR chat. But it takes ages to load and keeps glitching I waited to get into the world for 10 minutes, then when I finally got in it just kept going black then normal then black. Ive tried everything i cant to make it stop but it wont work. Also it takes loads of clicks for me to even quit the game. It gives me a headache.\n\nHelpful | 2", "FamousFalconJun 12 at 12:14 PM\nCant load into the world\n\nI loved this game but after they did this last update my oculus quests screen blinks black very rapidly and I cant move or do anything in the world. It would be great if they could do an update for quest users so that they can do the same stuff as PC players. It also makes me switch between avatars, I dont know how to fix any of these issues. I have searched the internet for anything that will and it work but I really dont know anymore. This game was once awesome but now that you cant even get into a game just ruins the experience.\n\nHelpful | 12", "QuizzicJul 27 at 4:48 PM\nDecent but has a few bugs ...\n\nI use this game a lot and its amazing but there is decent amounts of crashes bugs and glitches I experience one every 2 hours\n\nHelpful | 1", "LILROC8111 days ago\nHavent even played it yet\n\nLet me get it straight every time it starts up it crashes help me Im on quest to I just got it\n\nHelpful | 4", "CarterPattApr 5 at 6:50 PM\nGreat! Until now...\n\nThis game was definitely one of my favorite ways to socialize online and talk to friends! I had a couple occasional crashes but not many. Now, the new update decided to come into action. This made a lot of problems! I cannot join worlds, I cant change my avatars, or even show other peoples avatars without it crashing! Absolutely unbelievable how fast the game just plummeted. Its now unplayable so if youre a developer reading this, please tell the team to get it together and fix it.\n\nHelpful | 225", "smelly_dudJul 21 at 1:25 AM\nSomeone tell me\n\nWhy when I am about to create an account it says unauthorized something can someone plz tell me I have Been trying to figure it out for hours or when I go to verify my birthday i put in the right thing but says unauthorized again like wtf\n\nHelpful | 1", "Cairo.exeJul 19 at 9:23 PM\nGreat game, however...\n\nSolid game. I wish that the oculus supported PC skins. I feel left out when someone is trying to show me their skin and I cant see it. All in all solid game.\n\nHelpful | 1", "unripenedskull2 days ago\nGLITCHY\n\nI first log in. I do all the things to go into the game. Go into my world. And the screen start going black and going back to normal so repetitivly that it is unplayable. I would say i would give it 4 stars but i dont know what i would rate it because i cant play.\n\nHelpful | 1", "FrillianJun 24 at 8:47 PM\nMess\n\nEvery update just limits the quest further and further, i want to know when the quest can have little to no limits, if it did this would be a 5 star game for me but right now its too limited\n\nHelpful | 4", "XN24Jul 13 at 1:16 AM\nGreat social platform\n\nIt's a nice play to chill and talk to people gives people who aren't the best at physical social interaction a chance to make friends. Although I do believe there should be a limit or at least age restriction on VRchat with all the perverts on the game.\n\nHelpful | 1", "Kime_VRJul 22 at 12:49 AM\nWe have nothing\n\nIts sad that on quest we are not equal as the pc players + now we have nothing , no particules , no audio , no shader , just why ? I love vrchat but right now its like a empty vrchat with only basic avatars and nothing more...\n\nHelpful | 1", "thatonegamerOwOMay 16 at 12:12 AM\nAmazing game, but.\n\nI got my headset for Christmas. I watch a lot of vrchat videos and usually die of laughter. I was expecting everything as a PC user not a quest, and I got really sad, not being able to see that, because that's what I was expecting because I'll go to like \"the black cat\" or something, and all I'll see is robots with images. And another thing I wish for the robots is that they were the height of the avatar, and I'll make it much easier instead of just looking up when they might be really short And it can be really awkward.\n\nHelpful | 9", "justcallmezeb10 days ago\nGood game\n\nIt's has some problems but if you find the right group of people then it's a really fun app you can spend all your freetime on\n\nHelpful | 1", "Cashews_VR6 days ago\nHelps with Social Anxiety\n\ni never really spoke to people but once you start talking it gets really fun and you make a lot of friends!\n\nHelpful | 1", "bloop.oop21 days ago\nWorks great when i play the pc version\n\nwhen i play the pc vrchat its fine, sadly just on the quest whenever i open the app it flashes normal then black-repeat. if they ever fix this, and maybe try to add a feature to be able to see pc avatars it would be 5stars!!\n\nHelpful | 1", "steezy_dreezy11 days ago\nUnplayable\n\nI cant play Vrchat my more every time I log back into my account its keeps flashing black and once I get into the game I cant exit and I have to turn on my oculus. Please fix this its been annoying me\n\nHelpful | 1", "BannanaaMar 20 at 9:57 AM\nVrChat is ight\n\nFor a social platform, vrc is an amazing place to meet people all around the world. The only thing that sucks is that Quest users have a lot of limitations compared to PC gamers of course, you can't see other people's avatars on PC and you can't go on any PC world's, if Quest can get some of the good stuff that PC has then vrc would be a 10/10 experience.\n\nHelpful | 66", "ThatHuskyLunarJul 11 at 8:06 PM\nGlitchy But Amazing!\n\nI love this game so much, its one of my favorites on VR currently. But its so glitchy. I cant see characters usually and it takes super long for them to load in. Please fix this!!\n\nHelpful | 0", "Goldenlegend62Jul 29 at 8:51 AM\nDefinitely worth a download\n\nFor years iv always watched people on youtube play this game and always wanted to try it and now getting to experience it my self it doesnt disappoint its a great way to meet new people\n\nHelpful | 1", "plachta9221 days ago\nthe game in quest is limited\n\nQuest player have no choice uploading a avatar and the avatar from pc player can not be showd. please add update.\n\nHelpful | 0", "AGE048Jul 3 at 6:15 PM\nMaps/ganes\n\nThe game is beauty good, but some of the map that only shows few subject, and sometime it wont let teleport, also some games that are not available for oculus quest player to play, it just let go back to the spawn\n\nHelpful | 0", "NikeBoy21346 days ago\nALMOST BROKE MY OCULUS QUEST\n\nMine did it but not saying that yours wont\n\nHelpful | 0", "DeathReaper8Jun 27 at 3:46 PM\nPls more\n\nI love this game but I am getting board of the lack of updates and when we get them there down grading the game making it boring and not fun I would love to see :pc avatars,less restriction,and phisic so here is my review\n\nHelpful | 1", "dragonstarbcc18 days ago\nHmm...\n\nI have fun interacting with my friends in vr chat but dont use it otherwise\n\nHelpful | 0", "Saledhands00717 days ago\nI dont understand how to Log in\n\nWhen I try to log in after making an account it doesnt allow me to log in please fix this\n\nHelpful | 1", "Nazuna_Hiwatashi0022 days ago\nLaggy\n\nThe game is really laggy and broken when theres a lot of people in one room it would lag and the game could close by itself\n\nHelpful | 1", "Stylez850Jul 8 at 1:26 PM\nTheres a glitch, or bug\n\nWhen I load in the game just starts blinking. Can anybody help?\n\nHelpful | 3", "Brittato_Apr 7 at 7:13 AM\nPointless...\n\nSince the recent update, this game has now been rendered unplayable. Me, as well as many other oculus quest users currently experiencing this constant issue of crashing and freezing of headsets is definitely something the devs should be looking into. It was tolerable once upon a time, with the occasional crashing. But now, I can barely find the time to start it up again because I know what to expect moments after trying to allow myself to enjoy it. Very disappointing as this game was the sole reason I invested money into purchasing a quest. So I hope to see better improvements in the near future. For the time being, this a big thumbs down for me. \n\nHelpful | 108", "MOLDYCHEESEPIC1Jul 24 at 4:30 PM\nAccount system broken\n\nWhen I make a new account and set everything up it either says failed recapita or does nothing at all when i clicked create account and when I actually make a account and I try to sign in it says username or password incorrect when i have everything typed in right its very annoying\n\nHelpful | 1", "dillanio20 days ago\nIt good\n\nI like da game it good\n\nHelpful | 1", "Will_wrwr55Jun 6 at 1:17 PM\nFun but not the same\n\nThis game is great and I love it but there are some major setbacks. This includes the pc vs quest avatars which I understand, but what I dont understand is why there are so few games and the same content over and over. I dont get why the games for pc can be down graded but when I got bored of the normal ones thats when I and many other stopped playing for good. In conclusion, if you want to keep your game alive and player base existing than add more pc games and help make this the closest possible to the pc version.\n\nHelpful | 2", "LaughingmayJul 15 at 2:39 PM\nNeed help\n\nI like the game but every time I get on it, it just flickers and I cant move which sucks because Im only allowed in one spot that I cant move from there\n\nHelpful | 0", "Kyson55Jul 12 at 9:44 PM\nFLICKERING GLITCH devs pls fix\n\nIve tried everything from restarting the game and my headset. But I login then it flickers and lags making the game unplayable.\n\nPlease I just want friends...\n\nFind this helpful so the devs see this.\n\nHelpful | 4", "BraggestDwarf8Jun 27 at 2:47 PM\nGood but just can't function well\n\nI recently bought a quest and looked forward to playing vrchat and it was good aside from the horrible lag and multiple crashes and just limitations of playing it on the quest. I hope there is a fix for this and would play it more when fixed thanks for your time gave a good day.\n\nHelpful | 1", "damien.boehm14Jul 25 at 7:49 AM\nReview\n\nAmazing made lots of friends very interesting people and conversations how ever very laggy\n\nHelpful | 0", "Akumu-cheeMay 12 at 10:14 PM\nIts pretty great\n\nLoading up VR-Chat for the first time was a blast, and I played all the way until my quest died. Its a great social game, and I encourage everyone to at least try it\n\nBut it can still be improved.\n\nOne big issue for me is the lack of video player, which is the best part of vr-chat for some people, and with The oculus quests built in browser, its strange to not see this implemented.\n\nStill, its pretty fun and Ill definitely keep on playing for months to come\n\nHelpful | 3", "JustLiveALifeMay 2 at 12:34 PM\nBest community out there!\n\nThe app is pretty well made. Good game and all but what really makes it is the COMMUNITY. 90% of the community are chill people that just want to get on and fool around, crack jokes and generally be idiots. However, it on the other hand is a GREAT place for people to talk about issues in their life and counsel others. It helps with things like social anxiety and can form INCREDIBLE relationships! Overall, easily the best game on my quest!\n\nHelpful | 13", "JerzyNay21 days ago\nWill not stop blinking\n\nI just got the VR Quest 3 days ago. I can not play because it will not stop blinking. I have to shut my VR down because it hurts my eyes so bad from the blinking. It will not load.\n\nHelpful | 1", "Mr_LonerJun 9 at 10:43 PM\nImpossible to play\n\nSo I would give this a 5 star but the game has become basically unplayable. When I load in the game it just keeps loading then back to normal constantly. And now I cant play it I made so much friends on vrchat and since we have quarantine I cant do anything. And vrchat was like hanging with people in real life and now we cant play it. \n\nHelpful | 7", "Indigo-04Apr 20 at 5:06 PM\nAmazing game just needs some work.\n\nIn my opinion VR chat is one of the best VR games ever made. But the oculus quest version has some problems. The 50 mb world download limit is a massive problem, if they upped this it would allow for many more VR world on quest. The newest update has made it crash a lot more then it already did.\n\nHelpful | 8", "hellothere69Jun 19 at 10:34 PM\nSo much fun but\n\nI love this game like really love but I have a quest I have a lot of skins I want in the game like siren head etc but I dont no how to make skins so ya if these Avatar will be in the game would have so much fun\n\nHelpful | 3", "eggkidd21 days ago\nMenu lags\n\nThe menu makes everything lag and sometimes crash\n\nHelpful | 1", "asa.kay.399May 28 at 3:29 PM\nWhy did you do this game devs\n\nI love vrchat is a whole it's a nice game it's solidified with nice community and really cool avatars. That's when this update started to ruin it for me. It all started with a flying shaggy this is not a joke it was fun for quest players to experience something that mostly only PC players could experience. but the game devs took it from us faster than we had it we were only able to use that skin for about a day before it was fixed. Quest audio from avatars was completely removed. Now we miss something they took out textures completely, yeah sure the game runs a little bit smoother but I wasn't having as many issues when I unblock the perf on literally all of the people in a server. I'm having an issue with this because now one I want to actually show off something cool about my avatar to my friends I just get a huge black pixelated blob or some huge white pixelated blob. Fix your game I used to love it now I'm actually putting it in my lowest category of unused. this game goes right below PokerStars and I barely even play that game\n\nHelpful | 7", "v.kaylaJul 9 at 3:09 PM\ngreat game but it's very laggy\n\nit's a fun way to make new friends and experience things but it often makes the quest crash it lag really bad\n\nHelpful | 1", "RyzguyzMay 4 at 6:43 PM\nUnexpected Glitch.\n\nI was about to get on the game, then it didnt load at all. Then uninstalled it to see if it worked. Then it kept looping and lopping. I restarted my system powered it off. But nothing worked. If vrchat can help me with this it would be appreciated.\n\nHelpful | 10", "JhoooonJul 7 at 12:28 PM\nIts not even fun on quest\n\nThe game is in a sad state right now. Your limited when it comes to the avatars you can use and the worlds you can join. The game doesnt even run well but and I get a constant headache whenever I play. This is the only VR game this ever does to me.\n\n\nThe game does work as intended but the barriers between pc and quest content is limiting the overall experience.\n\nHelpful | 0", "killer1demon15 days ago\nGood game but\n\nIts amazing but my game keeps freezing on the loading screen\n\nHelpful | 1", "pikisgamingJul 22 at 6:45 PM\nFix this glitch!\n\nAfter the logging in the screen becomes flat and if I press the home button and go back, everything goes black. I tried waiting for 10 minutes and nothing happened! Please fix this glitch!\n\nHelpful | 1", "InfernoDragon666May 21 at 8:22 AM\nCant Reinstall\n\nI love VRChat, love the people, the maps, and the game itself. The only reason this is 4 stars is because it wont reinstall back. I had a glitch in the hub to where my screen will just go black and back to normal. On and off. So I deleted it. And tried to reinstall but it wont work! Help!!\n\nHelpful | 2", "QuanWickApr 1 at 9:19 PM\nSolid but not Solid.\n\nVrchat is a very fun game with multiple custom worlds and different people with different avatars. However, the majority of people who do play vrchat are pc players and that is what just takes a small bit of the fun away same with the lag and black screen crash. It would be 10x better if I can talk to real avatars since this is what this game is mostly about but instead Im mostly talking to robots. Sometimes the frame rate would just drop like crazy or my game would just crash out of the blue. At this point even players can make you crash your game by using a high poly avatar on purpose. Happened to me once so far though. If you can fix these problems this game would definitely be 5 stars and I would prolly be on it daily.\n\nHelpful | 16", "BellaBlueCatJun 9 at 6:34 PM\nWas 5 stars\n\nSince the update a month or so ago my daughter hasn't been able to play and she loved this app the most its the reason we got the headset, wish y'all would get this fixed! Until then, our rating is down to 1 star.\n\nHelpful | 8", "epicskibee16 days ago\nThis game keeps crashing my headset\n\nRead the title\n\nHelpful | 3", "Baby_g_lowlife23 days ago\nYeee\n\nIts great but I dont have friends\n\nHelpful | 2", "P1kachuu8914 days ago\nI cant even launch :/\n\nKeeps saying terms of service error, there doesnt seem to be any fixes anywhere, help!\n\nHelpful | 2", "bee923wild18 hours ago\nHello\n\nI need help to fix vrchat the screen keeps flashing when I join a world and I dont have a pc how do I fix pls help\n\nHelpful | 0", "Cyborg7567Jun 14 at 2:58 PM\nPLEASE FIX CRASHES\n\nI love this game! It's a great place to hang with people and meet friends. There only thing is IT CRASHES CONSTANTLY. And not just closing the app, it crashes there entire Quest headset! Please optimize this game for Quest better! It crashes after 30 minutes of light use, 10 minutes of heavy use!\n\nHelpful | 3", "Mystic_SlothMay 25 at 1:56 PM\nFun but limited\n\nThis is a great place to hang out with people chill and find new friends. This game provides places to talk and hang out and also places to explore and play some games at the same time. On the downside this game is very limited as to what you can do on the oculus quest compared to PC and other VR headsets. I find myself in a lot of lobbies with peoples avatars I cannot view because they are not quest users and this really ruins the immersion and experience of the game overall. Besides avatars one of the other downfalls is that Ive had this game crash on me couple of times and I cant join rooms that I am supposed to be able to. Other than that this game is a great place to hang out and chill with friends and make new ones and is definitely a must to try out considering the game is free.\n\nHelpful | 2", "Fergie80118 days ago\nTerrible lag\n\nThe quest version is full of bugs. I can play a game without it lagging like Im on a landline\n\nHelpful | 2", "CJCool1997Jun 26 at 10:22 AM\nA Great game but\n\nWhen I play it the game always flickers on and off How do I fix this problem\n\nHelpful | 6", "JamesQ34Apr 30 at 3:51 PM\nIts playable...\n\nVrchat is a great game. It of course has its bugs, but it still is awesome. UNTIL the recent update. Now, most of the time, when I try to use an avatar, or join a world, the game will either take me back to my home world, crash the app, or completely require a hard restart. It could be the avatars/worlds im using, but it still crashes VERY often.\n\nHelpful | 6", "OmegaGamerEX1May 4 at 10:59 AM\nI cannot play at all.\n\nI love this app, 5 stars. But it just crashed today and now it's completely unplayable. After it logs me in, the log in screen disappears and I'm stuck in the blue room. I really hope you fix this, because I really want to see some of my friends again.\n\nHelpful | 29", "A_Baby_KidJul 29 at 8:36 PM\nGood but has some bugs\n\nVr chat is really good but recently it wont let me log into the game so until it is fixed im going to give it a low 4\n\nHelpful | 0", "BlooSupreme009Jun 23 at 7:54 PM\nIts alright but sucks for quest\n\nIm sorta tired of being bullied for not being able to see PC content if you can fix this in the future and have it so that we can access that content as well were basically only getting to see 40% of what this game is capable of.\n\nHelpful | 0", "jordan.pham.7547031Jul 12 at 6:54 PM\nToo laggy even with good internet\n\nOk so first off too laggy second of all bad graphics third of all this reveiw is for nothing so dont get in my way and just make it better\n\nHelpful | 2", "NinjaElite007May 5 at 1:02 PM\nStarting to become unplayable...\n\nI cant join the game now without suffering from crackling audio, high-latency, and constant crashing as it cant even handle 5 or more people without the audio glitching and my framerate going to slow it eventually crashed. I know you (Oculus) mentioned that you fixed it but it is still going on for other people too. Before I never had this problem as it was fixed a while back. But somehow its come back again. But I hope this problem can be addressed and fixed soon\n\nHelpful | 13", "TheRamblingBanditMay 26 at 4:25 PM\nIt's good but not great\n\nHello,VR chat has been a great thing for me to play,but every time I play it it will crash 2-4 times cause someone makes a skin able to break the entire map to the point where I couldn't even turn off my headset today and had to let the battery die just to start it again\n\nHelpful | 2", "jeffreylopez153Jul 21 at 11:44 AM\nIts good but..\n\nWhen I play my game keep lagging and sometimes it freeze then have to restart my oculus quest but still a good game\n\nHelpful | 1", "Kazmi110117 days ago\nHorrible for motion sickness\n\nCouldnt even get out of the lobby without getting motion sick\n\nHelpful | 0", "J9shJul 2 at 11:21 PM\nNot Bad But It Got Laggy\n\nI Wish I Wasn't So Laggy But its a Good Game I Stream This Game Some Times heres my Facebook you should check it out https://www.facebook.com/joshy.vr.737\n\nHelpful | 0", "aquatic_roosterJun 26 at 6:43 PM\n\nCould not even play once it started it was very laggy and I could not move hear or see so I couldn't do anything. The reason im rating it three stars instead of one is because I've seen game play and it looks fun but I cant play.\n\nHelpful | 0", "AlitafireballMaker12 days ago\nIt keeps crashing please help\n\nJust got the Oculus and downloaded this game and it does not even start - anyone please help\n\nHelpful | 3", "Froggy_Lad8 days ago\nAmazing game\n\nExcept for the fact Im unable to play it :(\n\nHelpful | 0", "honey_jinsangJun 26 at 2:00 AM\nIt's great but quest need features!\n\nQuest gameplay is not fantastic. No avatars. You can't even see them. It's super laggy as well. Please fix!\n\nHelpful | 2", "ToadhouseMay 2 at 5:16 AM\nHorrible port of a good game\n\nSo this is one of the worst ports Ive ever seen for a VR game\nIts literally unplayable because every second after loading into a world the screen goes black then it flickers back to the game then flicker back to black.\nQuestion did the creators of the game beta test it before releasing it on oculus quest cause it doesnt feel like they did\nAll and all this is a extremely disappointing port of a popular VR game\n\nHelpful | 15", "ESG154814 days ago\nBrush\n\nBrush is best\n\nHelpful | 0", "NezukoChannJun 3 at 11:35 PM\nAmazing game\n\nI love VRchat so much just some people are.. unkind I havent played this game in so long cause of the Community. I dont even talk to the people I use to play with on it but since covid I think I Might get on again\n\n\nHelpful | 1", "Crow320Jul 26 at 11:42 PM\nDespite\n\nThis is out of despite to all who oppose vr chat because this be great.\n\nHelpful | 0", "Shadow-ReaperJun 8 at 11:14 PM\nCrashing less, but worse.\n\nQuest is crashing less, but now every time I crash, I HARDCORE CRASH! The screen freezes, the last sentence someone told me repeats itself, I have to hold the power button for about 15 seconds so it restarts. It's annoying, but I can handle it. I'm mostly concerned about Quest particles. It's like they almost completely removed them. Particles just don't work anymore. All we get are grey and white blocks where beautiful particles used to be. The 2 Quest avatar shaders for particles in Unity don't even work anymore. PLEASE GIVE US BACK OUR PARTICLES!\n\nHelpful | 2", "hookiesdaddyJun 29 at 4:14 PM\nA great game on anything but quest\n\nThe experience is ruined when you are in a lobby of PC VR users and cant see their avatars or visit their worlds. A VR CHAT DIVIDED CAN NOT STAND.\n\nHelpful | 3", "TonydethjrApr 6 at 8:26 PM\nFun game, but..\n\nOk lets be honest, vrchat is a good enough socializing gaming, but all the crashes. I swear, if I got a quarter for every crash, Jeff Bezos would feel threatened, also the collision detection. Yeah its terrible, it ruins the immersion. Other than that, great socializing game!\n\nHelpful | 13", "Itzcheapluck24 days ago\nDoes not work at all\n\nIve tried logging in multiple times and each time it never worked I even reinstalled. I always get a black screen after a couple minutes then nothing. It is pretty good on pcvr but not on quest.\n\nHelpful | 1", "AzzydreemzJul 29 at 11:04 AM\n\nI cant play it the screen just flashes, if anyone know how to fix that pls tell me\n\nHelpful | 3", "BrennanVMay 21 at 7:54 PM\nWhy cant I see 4/5 of the players\n\nThe whole point of vrchat is everyone gets to where their own play skin that represents them and shows what they feel or what they want to be. Why did you remove that from the quest players? I cant see what skin my friend picked because he thought it represented him and he loved that skin but all I see is a robot with a square of picture to represent the skin. I see someones skin every once and a while but very rarely.\n\nHelpful | 5", "KadoMado64May 16 at 2:14 PM\nbroken\n\nI got the game and was just signing up for it and after it said it was going to take me to the tutorial. it froze my quest and the only way to bring up the oculus menu was to spam the button. It showed a frame of my experience and when I moved my head, it was just black. Please fix this.\n\noh I forgot I can't play with oculus link either because my computer does not meet requirements for the rift. it melts my view. please fix it on the quest.\n\nHelpful | 5", "Pheonix55Jun 13 at 9:17 PM\nGreat game\n\nGreat game, but crashes too much, and you cant see all avatar skins.\n\nHelpful | 2", "tjzgamerJul 29 at 9:50 AM\nBelt buckle banana truffle\n\nI just really like this game\n\nHelpful | 1", "FatSheamusFeb 11 at 4:36 PM\nSlightly incomplete but fun!\n\nFirstly, this app has reminded me just how socially awkward I truly am. That aside, I will say that it is a very fun and unique experience to be able to walk around as very as different characters and just Talk listen, or observe. My only real gripe with it, is the lack of variety for Quest users versus PC users. So many environments and avatars that are simply unavailable, and I'm frequently made very aware of just how many there are.\nI would love to see more compatibility with the PC environments and avatars in the future. Even if it just means being able to Actually see the other people's avatars. Where as currently, anybody who has a custom avatar that is PC compatible Only, All you can see is a bland robot Standing in front of you. Let's see those software updates people!\n\nHelpful | 240", "thevrkid1228Jul 23 at 2:57 PM\nGreat game\n\nFun to play with my friends\nAnd make YouTube videos\n\nHelpful | 0", "WonderTrashy11416 days ago\nMediocre\n\nGame is pretty good. community is weird\n\nHelpful | 1", "junminliu18 days ago\nHurts my eyes\n\nThe screen keeps turning black which makes it very difficult to see and makes it very uncomfortable\n\nHelpful | 6", "IM_DRW01FJul 21 at 2:55 PM\nVRCHAT\n\nThis game is amazing, I couldnt stop playing it\n\nHelpful | 1", "Sh4de51May 12 at 9:53 PM\nHELP\n\nI used an avatar that was so big it wouldnt let me click menu options to change the avatar or even log out so I forced closed the app only to find out that i am stuck as that avatar upon loading back up tried uninstalling the game from my quest and now it just says uninstalling and has been like that for about 4 days now anybody know how to fix this problem?\n\nHelpful | 3", "RealMattFromWiiJul 10 at 11:41 PM\nBruhbruh\n\nBruhbruhbruhbruh\n\nHelpful | 2", "PaulaBen10Jun 18 at 3:20 AM\nI cant join anyone\n\nI was playing crchat streaming until i joined my friend everyone disappaer fix this plz right now plz:(\n\nHelpful | 1", "Fnafgamer2May 27 at 7:20 PM\nNot enough space to favorite more skins\n\nI been playing for a little and I love it its better then just being quarantined all day but there's just one problem you can only favorite 16 avatars am sure it might not be a problem for others but for me I have a lot of avatars i like and I don't think people should be allowed just to favorite 16 avatar i think if they boosted the number of how many skins yiu can favorite i think that would be a great feature\n\nHelpful | 1", "LookinSharp9898Apr 26 at 12:03 PM\nIts okay\n\nDont get me wrong, its a great social game and Ive had a great time with my friends. But until the update.... My game at random time would turn black or even crash. Great game but please fix this!!! Also add more avatars\n\nHelpful | 6", "TinyPug06Jul 30 at 2:13 PM\nWork??\n\nHow do you even start this up? I want to get on a world but nothing happens. How do I do this\n\nHelpful | 1", "supersnaiperJul 23 at 9:10 AM\nNot good\n\nIt's bad. Like reallly bad. I can't see any of the other characters avatars and the rendering distance is also bad. I really hope it gets fixed\n\nHelpful | 1", "commandercat1024 days ago\nToo much flashing\n\nWhen I booted it up there was just flashing everywhere I could not get past the tutorial at all\nDoes anyone know why that happens\nI just got my headset\n\nHelpful | 4", "sketpicJul 20 at 6:05 PM\nBad\n\nNearly unplayable with the lag and it is ridiculous that we cant have it see pc avatars and the page and voice problems are unbearable\n\nHelpful | 0", "TheTerraBlade42Apr 26 at 9:15 AM\nIts ok\n\nIm making this short. The social aspect, custom avatars, variety of rooms, its great. But actually playing is hard. My quest constantly boots me out and black screens. Its fun when it works.\n\nHelpful | 7", "NoobOfEveryGameMay 20 at 11:28 AM\nIts very laggy to enjoy\n\nVrChat is a very good game but it wasnt made for the quest, the devs made a few updates to make it playable on the quest. Around a few months ago the game was nice to play, it barely crashed and it ran pretty decent, but know it is a guarantee that your game will crash. My favorite world (Courtroom) is hard to play on the quest, its very laggy and unstable for the quest. Please Devs, fix your game.\n\nHelpful | 3", "XxDin0Nugg3tMcG33xXJun 16 at 2:56 AM\nSpider racism\n\nI play as a spider and people keep voting to kick me one guy said i have a huge hairy spider a55 plz halp :'(\n\nHelpful | 3", "TheSpoon7784Feb 26 at 7:47 AM\nGreat... but limited\n\nThis is probably my most played game on the Quest, and my favorite multiplayer social environment on it, but the Quest port is far from perfect. It does have bugs, can be prone to frame rate issues, and is limited in terms of seeing avatars/worlds. This does not bother me though, and I still get truly memorable experiences in it, but this can definitely be a turn-off/disappointment for some people.\n\nPros: Most of what makes VRChat unique on PCVR is also what makes it great on the Quest. Considering the app is free, there's no reason not to at least try it out.\n\nCons: The game is pretty well optimized for the Oculus Quest, but it still isn't perfect at times. As well, not being to see most PC avatars, or even have the option to, is unfortunate. Most lobbies you join there will be at least one 'PC robot' around. That being said, it doesn't ruin the experience completely.\n\nSome of the performance issues I encounter are likely because I enable seeing all high-poly avatars, and disable all safety settings, but I assume at least some of these issues translate to other people.\n\nWill likely update this review in the future, but this is my current opinion on the app. Hope it helps.\n\nHelpful | 24", "Waffles21Jun 28 at 11:12 PM\n\nUm I cant hear anything like anything but I know the people are talking cus of the little icons and I have the mic on and the safety settings allow everyone to talk and Ive tried to turn up my volume but still I cant hear anything\n\nHelpful | 0", "CreativeGirlDAApr 29 at 10:16 PM\nUnplayable, Unfunctional\n\nOne of the reasons to get a Quest for me was to try out VR-CHAT on it. I was excited to play it since my Quest just arrived today. Logging into the VR-CHAT was functional, although it went downhill after the process. The games screen itself started to blink or flash rapidly, I couldnt even barely move my avatar, go anywhere, or barely even take a step inside a game without my screen going bonkers! Hopefully this gets fixed in the future.\n\nHelpful | 11", "Dignified_Zephyr2 days ago\nUnplayable.\n\nJust. Terrible. Literally unplayable, downloaded the game 3 months ago and cant even start it. Its obv that the devs just abandoned it.\n\nHelpful | 0", "nuggetDryJul 27 at 3:33 PM\nWhy not to download VR chat\n\nThis is game is 30 frames the whole time, and the community is just a bunch of little kids and some band kids.\n\nHelpful | 0", "WeirdONIUApr 8 at 8:14 PM\nUnfortunately trash...\n\nFirst off I got this game awhile ago, the game originally for me was at a 3 star level, due to crashing and lower quality but originally all that stuff was somewhat excusable due to there being a possibility of it improving. But now it is quite obvious the creators for this game do not care for it especially towards the Quest users, after this recent update it is quite clear how its looking to go in a negative direction, the previously stated crashes I experience pre-update are now 10x as worse crashing every few minutes, maps I was originally able to go on I can no longer hop into as that they will immediately crash. To the devs of this game you have easily ran the game into the ground for the Quest it appears you show no care for the users of this platform and will continue to downgrade it with your updates until there is nothing left it is quite a shame this couldve been very revolutionary. Finally as an alternative I recommend Rec Room, until (if ever) the major flaws of this game are dealt with.\n\nHelpful | 19", "Nexus_of_hell2000Apr 7 at 9:48 PM\nTHIS WAS GOOD UNTIL THE UPDATE RUINED IT\n\nI can barely play five minutes without the game lagging me out. I cant go to certain places I frequented often, certain worlds dont work gow they used to, cant play games for more than a few seconds without being lagged out, and sometimes even opening my menu is enough to lag the game put and stop completely. Not to mention how the hub was changed. And the home worlds! The markers are gone. Everything that made vrchat amazing, is pretty much gone. And that saddens me because it's the only way me and my friends can connect during the corona virus. The update ruined it all. This needs fixed\n\nHelpful | 18", "laith1987Jul 5 at 8:08 PM\nI cant play anymore!\n\nI used to love this game. It was one of my favorites,until it just stopped working. Now every time i go to play it it crashes my entire quest, WHY? PLEASE FIX THIS ISSUE.\n\nHelpful | 1", "Nate1253May 9 at 1:59 PM\nNot even playable on Quest\n\nI was excited when I first got the quest to try out VRChat due to all the fun(ny) videos surrounding the game.. only to my dismay I cant even get passed the loading screen, only to have it freeze and never be playable whatsoever. Even after the updates as of late I cannot play it.\n\nOh well, will have to wait patiently I suppose.\n\nHelpful | 5", "MirandaP05Jun 5 at 10:47 PM\nGlitch\n\nEvery time that I go in to the game, it glitches and it starts Turing on and off like a light switch. It sometimes goes fast but sometimes goes slow. This is happening on both me and my cousins VR. Would you care to help or explain this glitch.\n\nHelpful | 2", "TheCuCuChickenJul 16 at 2:14 PM\nIm hooked on this game\n\nSuper fun games inside and worlds to explore its endless\n\nHelpful | 1", "LOWZILLA77May 24 at 7:56 PM\nUnplayable\n\nI love VRchat. It is the only place were I can talk to my friends right now. But after the most recent few updates, my game has become very glitchy. Whenever I get into the game, a black glitching box pops up in front of my face and makes it unplayable for me. PLEASE FIX THIS. I want to actually play and enjoy this game and time with my friends.\n\nHelpful | 2", "MuffledLeader9May 14 at 12:56 PM\nBroken menu and bad lag\n\nI like vrchat but the recent update broke the game. Not only does it lag so bad in worlds but the menu only shows the default server that gets selected when you join a world and the friends section of the social menu is broken and does not show any friends online or offline. I know updates are slow but I don't understand why an update would cause this to happen. Pc seems to be unaffected as I see streamers and desktop users don't have this issue at all. I hope it gets fixed soon.\n\nHelpful | 0", "Poke_boy1234Jun 2 at 10:30 AM\ni absolutely love it\n\nvrchat is an amazing game where you can explore and mess around i just wish it could have hand tracking cuz then it would make it even better\n\nHelpful | 0", "ASHTON1440May 11 at 7:35 PM\nWont work\n\nThe game starts and it loads, right after that it switches from the oculus loading screen to the game every 1 second. You cant do anything. Not even move, and when I deleted it it never stopped uninstalling. It is still uninstalling and I tried to delete 3 days ago! Fix this please\n\nHelpful | 4", "cre7Jun 29 at 6:50 AM\nAlways Glitches\n\nI heard about this game so much which got me exited to play it using my oculus quest,\nBut when I first logged it was glitchy it turns dark then take me into the game then turns dark again and get repeating.\n\nHelpful | 1", "donut_manJun 18 at 7:47 PM\nCrashes alot\n\nIt's such a fun game and I love it but it crashes alot\n\nHelpful | 1", "DjSquishy3DMay 27 at 4:13 AM\nWhy Do all the Quest worlds suck?\n\nWhen I first saw that my quest could get vrchat, I was so happy and I thought that I could have so much fun like the people who make vrchat videos. Turns out, you cant even go into the same world as other people can. I dont know why you cant, but you cant. And it sucks. So if you see this, please change it and fix it.\n\nHelpful | 2", "TimberAndHobbesJun 6 at 6:42 PM\nOculus needs custom shaders\n\nI did a 3 star rating because I feel like oculus needs custom shaders because I dont like seeing gray robots just floating like please just allow custom shaders on oculus\n\nHelpful | 1", "spiderboy061Jun 18 at 12:16 AM\nGood vr game\n\nGood to meet peoole but needs sounds on avatars again\n\nHelpful | 0", "Helgan_SoulApr 23 at 8:00 PM\nWhat's with the update?\n\nI've been trying to log on for the past week with no success, I keep crashing every time I try joining a world or my friends. This recent update has been having negative effects on quest users. A little feedback would be nice...\n\nHelpful | 13", "tomcat97thewolfJun 28 at 1:47 AM\nI wish I could search avatars\n\nThe games good and all but I really would like search avatars.\n\nHelpful | 0", "9qMay 11 at 12:07 AM\nIssues\n\nI bought the Oculus Quest just to play Vr Chat in VR and i have had alot of issues\nWhen the menu or my hands to just a little close to my face it disappears, also if the Quest loses tracking the valume stops working, but that might be a issue with the quest itself, but atleast try to fix the disappearing menu and hands\n\nHelpful | 0", "ZespuhMay 11 at 3:15 AM\nAvatars and Worlds\n\nI love VR chat and being able to talk and meet new people and chill but the only downfall is there is WAY to many avatars and maps blocked for performance Ive been in so many PC world's with Quest and seen PC avatars I shouldn't and I don't get any lag or performance issues.\n\nI will go into rooms with all Robot Avatars and it makes it feel so dead.\n\nHelpful | 1", "BlazingColorsMay 10 at 9:23 PM\nFavorite Button\n\nOn the quest I sadly can't remove characters from my favorite list because they were PC avatars and I've tried downloading VR chat on my computer and trying their but when I sign in its like I'm on a whole new profile. I don't know what to do about it since I haven't found a way to get past this.\n\nHelpful | 0", "hootsytootsyApr 21 at 3:00 PM\nLiterally cant play the game\n\nLike the title it its literally unplayable the app is just stuck in this endless loop of uninstalling I cant redownload it or start it from the store its been going on for whole month now and Ive tried everything to stop the loop but just doesnt stop I dont know if its my quest or its the game thats it\n\nHelpful | 7", "CarsonDoTheSwagJul 6 at 7:21 AM\nGood but updates ruined it\n\nIt was a good game, but yall started adding updates and it way to laggy to even play, just buy a link and play the pc version\n\nHelpful | 1", "WhimsiiApr 28 at 4:08 AM\nFix your fing game already\n\nIf your a user on the oculus quest dont bother getting this game unless you like crashing every time you open the game I have always loved\nVR Chat and bought a quest so I could play VRChat anytime anywhere and I was very disappointed in the game so if you have pc vr stick to using that for vr chat as I will be sticking to my index and please for the love of god figure out a way to stop crashing like its so annoying!\n\nHelpful | 5", "crimson_braveheartJun 27 at 1:33 PM\nextremely limited\n\nive used the pc version before but the oculus is so limited in what you can do and am slowly regretting even getting it please fix and upgrade so i can enjoy it better\n\nHelpful | 0", "jaiden.ferrando.522 days ago\n\nIt wont let me create a account\n\nHelpful | 0", "TentamirApr 8 at 1:04 PM\nTolerable, until now\n\nWhen I first got this game it was pretty fun, and great for socializing during the quarantine, the game crashed and blackscreen very rarely. But ever since this past update I cant play 15 minutes without crashing or blackscreening and thats not an exaggeration I can only play for 20 minutes if Im lucky, Can the developers please help with the problems we have to deal with on quest\n\nHelpful | 13", "Omni_BlastJun 6 at 2:21 PM\nProblem\n\nFor some reason when I start to play VR Chat the game keeps going black and I cant do anything.\n\nHelpful | 2", "dingoflingMay 21 at 9:10 PM\nGreat horror game /unplayable [5/22]\n\nI walked into a room and a screaming child was just going nuts. Scared the hell out of me , having a high fever and night time antiallergy for the fever made this the scariest thing I have ever experienced in VR. Watching a small bug screaming with the voice of a kid yelling st someone. I went to bed after cause I take of pm antiallergy. So im sure that made it more scary and why my dreams were haunted with the screaming out of nowhere and Link laughing next to me did not help. Great port. Don't play when you have a fever. .\n\nUpdate 5/22: is unplayable all of a sudden.\n\nHelpful | 2", "OnePercenter_ProductApr 11 at 6:29 AM\nReinstall\n\nI deleted the app but when I deleted vrchat it just says uninstalling now and forever apparently and I also cannot get it back because in the oculus store it says purchased but I cant install it nor delete it but this is more of a problem not a review I do love the app but it had problems with crashing a lot more than before and I think its because of the recent update that made it so that quest users can see more details in avatars so it would not be as dull for the oculus quest players but it crashes the game a lot for me and thats why I deleted it then tried to reinstall it but I hope this problem gets fixed soon\n\nHelpful | 5", "Zom_Bot5000May 13 at 12:33 PM\nNot loading properly\n\nEach time I log on to vrchat it lags a lot. Everything keep going black then I can see things constantly. I have uninstalled it and reinstalled it multiple times and it keeps doing the same thing. Can anyone help?\n\nHelpful | 2", "HailVictorioMay 15 at 7:53 PM\nCan't load in\n\nIt doesn't work for me. It's lets me get to where I can sign in, but after that out freezes on a blue screen indefinitely, the controls freeze, and the only way out is to turn off the headset. I hope this gets fixed soon\n\nHelpful | 5", "Hexx_runnerMay 28 at 7:50 PM\nFair game\n\nI love vrchat so much but recently I haven't been able to join or even see friends that are online in the game. I hope that a update will come soon to fix the crashing problems as well\n\nHelpful | 1", "loueythelampJul 4 at 9:42 AM\nUnplayable\n\nI love this game but now with all the bad updates I dont like it. AND it wont even let me into the game anymore!\n\nHelpful | 1", "PsychogamerMay 21 at 6:54 PM\nLatest update stinks.\n\nI just got the update a few minutes ago and as i played there where a few moments it would freeze but then it just majorly froze and CRASHED MY ENTIRE OCULUS QUEST TO WHERE I HAD TO COMPLETLY REFRESH IT BY HOLDING THE GOD DANG POWER BUTTON TO RESET THE WHOLE THING!\n\nHelpful | 2", "3FelipeJun 8 at 3:41 AM\nLagy and buggy\n\nI love VRChat BUT it just a very low framerate on most worlds and its chrashing all the time if These things Would be fixed Then i would give 5 Stars\n\nHelpful | 1", "dean.badger.353 days ago\n\nOn my oculus quest wont ever allow me to actually create an account\n\nHelpful | 0", "Yariel23Jul 3 at 2:17 PM\nGlitch\n\nPlease fix the flashing black screen it makes me hate the game\n\nHelpful | 1", "ReviewingHen06Jul 7 at 7:40 PM\nFlashing black square and very laggy\n\nThe loading works fine but I keep getting a flashing black square and I can barely move just got the game and ive tried what people have said to do but it doesnt work please fix this issue.\n\nHelpful | 1", "i_nkJun 23 at 6:06 PM\nLags a lot and almost broke my oculus\n\nI was playing one day and then my oculus started to overreact. My oculus could not turn off and I had to wait till it died. Now my oculus is not playable.\n\nHelpful | 0", "CoolbluefireVRMar 31 at 9:40 AM\nAwesome but needs more work\n\nLove the game but like every 30 mins it blacks out and I wish they made the pc avatars able to see on oculus\n\nHelpful | 14", "KaiOsGamingJun 30 at 7:54 AM\nWont allow me into game\n\nThis might be the problem, but Im 9 and I want to play vr chat, but it doesnt allow, me in\n\nHelpful | 0", "METGamingGuyFeb 26 at 3:24 AM\nQuest needs to see pc avaters\n\nYes, the game is great, and yes, I do enjoy it. But after spending time with fellow new people (aka noobs), I needed to hang out in worlds that are not made by be chat, like the world The Black Cat. Unfortunately, when I enter the world, most people are robots with screens and none of what they are saying makes sense! This is apparently because right now quest doesnt try to render pc avatars, which is EXTREMELY DUMB. Quest it the newest vr set out right now! It should be able to load pc avatars! It just doesnt make sense. Fix this please.\n\nHelpful | 24", "Capt_Quint620Apr 28 at 11:28 PM\nSeems mostly fixed\n\nUpdated review: game works mostly fine on my quest now. It crashed, seemingly from too much lag, but I have been able to play for a good amount of time.\n\nHelpful | 3", "FlarethegamerJun 4 at 1:10 PM\nAmazing game\n\nThis game help me be social with people and I get to make people laugh and they get to make me laugh. And other kids like me get to play it to and I get to meet them and have fun\n\nHelpful | 1", "minercraftmmMar 20 at 1:19 AM\nAbsolutely brilliant but a couple things\n\nNeed doing hello I am very happy with vr chat for the quest it works very well you. Go on adventures to find avatars that are for quest but heres the problem once In a while it will lag and really glitch like a Black screen you have to quit and go back in. Other times it kicks you. Out of games and it won't let you back in so you again have to exit the game the quest just isn't powerful enough to play it I think\n\nSo I'm gonna rate this a 4 for game play but not a 5 because of bad software\n\nHelpful | 4", "NicemasterpigJul 7 at 5:54 PM\n\nIts cool\n\nHelpful | 1", "NoobMaster2020May 1 at 1:04 AM\n:/\n\nIt was fun at first until the crashing started, now it is just unplayable. I dont think I have played VR chat for more than 10 minutes without it crashing EVER it crashes it black screens and makes me restart my quest all the time, if this where fixed. It would be 4 star\n\nHelpful | 4", "oculus349May 28 at 9:47 AM\nI cant go to the world\n\nI pause the game then resume the the loading screen pops up I load into a game and it loads into my hub it is really annoying please fix it and its glitches\n\nHelpful | 0", "JazzyOsorioFeb 28 at 2:58 AM\nWhat's going on?\n\nI love the game. I play it so often but recently it's been acting up. I can't load into worlds. My screen will go black and stay like that until I restart the app. But then it doesn't log me in at all.\nI've uninstalled it and reinstalled it but it just won't work correctly! A few of my friends are having the same issues.\nPlease fix this!\n\nHelpful | 41", "magnumninjaJun 26 at 9:29 PM\nThe worst way to play VRChat\n\nBarely any characters barely any worlds and runs like dog doo and crashes every 5 minutes. Far better to just stream it with virtual desktop off pc.\n\nHelpful | 1", "Firedragon70Jun 24 at 1:49 AM\nNeeds to be fixed\n\nVr chat is a good game but the particles are broken. Please fix\n\nHelpful | 1", "waviiix2cApr 27 at 2:42 AM\nGood with problems\n\nDont get me wrong VR chat is a amazing game but it has too many flaws. The game in the past two days has crashed and logged me out over 80 times.I love the game but its not worth playing if I have to keep re opening the game 70 million times. It needs an insane update That will help fix the problem with the black screen and other Major glitches otherwise its unplayable\n\nHelpful | 3", "actuallyafishApr 8 at 12:07 AM\nAbout the recent update...\n\nBefore this update, I could spend maybe an hour in a lobby, maybe more, before either getting kicked out of the world I was in, or my entire screen goes black. Now, I can't even spend two minutes without the entire game crashing.\n\nHelpful | 14", "Dankar82Jun 6 at 4:05 AM\nWhy??\n\nWhy did u choose not to show every avatar in Oculus quest?? Well it is good but plz make so u show every avatar and world's in Oculus quest plz!!\n\nHelpful | 0", "YamiJaceJun 22 at 9:14 PM\n.\n\nThis game is rather\none of the best experiences Ive had\n\nHelpful | 1", "BagelsAreDopeJun 14 at 9:09 AM\nIts horrible\n\nEverytime I open vr chat it's just crashes and I have to restart my whole oculus quest, I've never played vrchat but I really want to. Fix your game!\n\nHelpful | 3", "jaxjax11Jul 4 at 8:49 PM\nWould buy\n\nVery weird but fun\n\nHelpful | 0", "DMondo11Jul 11 at 6:10 PM\nGame Does Not Work\n\nId start up the application and everything is fine until im in the actual world itself. The entire world just flashes and freezes and I cant really do much or play anything.\n\nHelpful | 1", "Angel_Dust16Apr 11 at 12:08 AM\nVery fun, but very limited...\n\nI went into VRchat expecting to put on my favorite skin ive seen online: A xenomorph. But there are literally only about 25-30 skins at most. why cant we have PC-Grade skins?!\n\nHelpful | 3", "logan.witt.355Apr 13 at 3:21 PM\nIt was great, but not now\n\nWhen I first downloaded it it did not crash, but know it crashes a lot and I cannot play with my friends anymore, whenever Im just talking it crashes and then I have to quit vr chat and join them again, but it crashes again.\n\nHelpful | 3", "AFreakingCookieJun 11 at 5:51 PM\nPeople are negative a rude for no reason\n\nKept on having people make fun of me for having \"oculus quest compatible skins\". Thought I would meet some nice people on here, but guess we're running out of those kinds of people these days.\n\nHelpful | 1", "krakenJackMay 1 at 3:42 PM\nPLEASE HELP?? GAME BREAKING GLITCH!!\n\nKind of a funny story but.. I'm stuck in my Oculus quest account as an, inch tall \"Ant\" avatar. Can't click/ activate/ interact or bring up menu's of any kind. Also can't change avatar. I would just make another VRchat account but iv already logged in alot of in game hours. And it would really suck that I'd have to loose progress and friends because of a glitch. Is there anyway you could change my avatar to default? As I'm fairly certain that it's the avatar that is causing this issue.. Please help????!!!!\n\nI love vrchat. Some great times with the app! But if I can't get this sorted I doubt that I'll be bothering with it again.\n\nHelpful | 2", "Springboi23Apr 17 at 4:01 AM\nWhy?\n\nIll still give it a good enough rating cause I love VRChat, and Ive learned some techniques to prevent (or at least stall) crashing, but dang it, VRChat, fix your game\n\nHelpful | 4", "OutPizzaTheHutJun 25 at 10:29 AM\nWow\n\nFun online game with alot of skins to find.\n\nHelpful | 0", "Diegoelvis22Jun 23 at 10:19 PM\nIt doesnt work\n\nWhen I play the game it shows me the game, shows me a black loading screen and then the screen quickly changes between the two.\n\nHelpful | 2", "Izzy9pJun 8 at 4:36 PM\nSome creativity for the world's, but.\n\nIt's cool I guess, if you're between the ages of 9 and 15\n\nHelpful | 0", "cutebunny5Jun 18 at 7:49 PM\nME LOVE VRCHAT\n\nVrchat is so much fun except for the lags but still fun!\n\nHelpful | 0", "NotWolfxXApr 30 at 3:17 PM\nThis game has more room for improvement\n\nVr chat is one of my fav games but I still think there is a little room of improvement for it I think you should add.\n1:Hair movement. I know what youre thinking but its really hard for me to add hair movement and because Im on the oculus quest but Im really looking forward for you to add it.\n\n2:Voice changers. I dont want voice a changer in the game but for anyone reading this they might want voice changer so the person reading this is looking forward for you to add a voice changer.\n\nThats my review but I am giving this game a five star even though there isnt any of the stuff in my recommendations but I gave this game a five star because its so much fun!!!! But also waiting for the recommendations.\n\nthank you.\n\nHelpful | 1", "danbw05Mar 27 at 4:02 PM\nReally fun! (When i can play)\n\nI really enjoyed this game for about a day or so. Alot of the interactions i had with people were great. I didnt even really mind the optimization. But what makes this inexcusable is that it will continually kick me out of the servers. It wont even inform me why i get booted out. It gets so bad so fast i can't stay in a server for more than 5 minutes. And finally won't even let me join any servers. Everytime i started a conversation i would get bumped back to my home. Except i couldn't even MY OWN HOME and it would take me to the default one which is the only map i can consistently get to. This atrocious in the context game please for the love of god fix this.\n\nHelpful | 9", "Rayzel1Jul 3 at 9:43 AM\nUnplayable\n\nThis game was great until I couldnt get it to run.\n\nHelpful | 0", "Sketch61762May 25 at 9:34 PM\nWeak\n\nThis game is only good for console systems unless it can be streamed onto the quest. The game barely runs when there is any interaction with more than 3 people.\n\nHelpful | 0", "sliks4Apr 29 at 7:58 AM\ncant play anymore\n\nAnytime I play and join a server that has say 15 out of 26 people, I would teleport to that server but then go to a server were it would be just me and no one else would join, I dont know what happened but I would say dont get it but since its free you can see if it happens to you.\n\nHelpful | 2", "ArcticWolf1405Apr 5 at 5:36 PM\nNew update sux but great game\n\nPlz make a better update for the quest users plz? Its just makes it easier for the quest users to crash. Restarting anything doesnt even help\n\nHelpful | 8", "coleman.mcnulty.7Jun 1 at 12:19 PM\nI need some help\n\nSo I got my quest yesterday and I not no how to change it from teleporting to walking, if someone knows please show me.\n\nHelpful | 0", "Echo_VR_Apr 16 at 7:51 AM\nGreat game\n\nAmazing! -1 star due to it crashing... but if you can get through that it is a hilarious game.\n\nHelpful | 4", "heree.xdJul 9 at 6:10 PM\n\nIts also laggy for me and every 2 seconds the screen turns black please fix this\n\nHelpful | 2", "AymanjanApr 10 at 9:45 PM\nBuggy\n\nThe game would sometimes crash and mess up my quests xyz, and the game doesnt even let you see pc avatar.\n\nUpdate: Ive been playing this game since I got my quest on launch day, and it still has major problems to this day. The game crashes every 10 minutes, thanks developers, you messed up the render distance which makes me sick. Not to also mention, but I dont think youre actually reading complaints. You need to focus more on the people who cant afford Pc gaming and have to resort to quest because theyre poor. If you expect a larger playerbase you need to focus on major problems. Rec Room is a great alternative and you dont have to see ugly robots shoved in your face in every single world. For now, this is where I get off.\n\nHelpful | 4", "OkayMysticMay 16 at 6:38 PM\nGreat Game, Bad Port\n\nI loved playing VrChat on my PC without VR so when I got my quest naturally I got VrChat, I was excited to finally play in VR but this excitement was quickly ruined when my FPS was hitting a consent 5-20 frames. VrChat on PCVR 5/5 but on the quest it's a solid 0/5, guess I gotta upgrade my PC.\n\nHelpful | 1", "robbienolApr 25 at 6:40 AM\nFull of young kids\n\nNot impressed to many young immature kids spoil it . There needs to be an adult only environment for games etc and is strictly adult only.\n\nHelpful | 5", "Salsaslayer05Apr 28 at 3:49 PM\nIts ok..\n\nCan be fun at times but the game tends to lag. Also I am not able to sees some pc players avatars. I dont know if its just me or if its a bug. Overall fun game and great way to socialize with friends but with game breaking lag.\n\nHelpful | 1", "ilovemullyApr 29 at 10:30 AM\nloved it\n\ni met many friends while playing and its also really fun to storm people while everyone in your group is the same skin now quarantine is a thing and i can still talk to all my friends and make new ones\n\nHelpful | 2", "Wolf1eMay 3 at 9:56 PM\nGreat\n\nI love this game but it would be Good if u could u your thumb sticks to walk instead of teleporting and make it so we can see any avatar other then that great!\n\nHelpful | 1", "Kiss_My_Ace25 days ago\nGood game, but...\n\nIve been playing this on my sisters Oculus Quest and have had no issues. However, I just got my own today and attempted to play, only for it not to work. When I login with my Oculus account, the game tries to show me a tutorial video, which results in a black screen. When I exit the game and relaunch it, it attempts to log me in, but leaves me in an empty loading screen for a minute, makes an error sound, and tries to log me in again, but the same thing happens. I have tried to uninstall and reinstall the game multiple times, but have gotten the same results. Until this no longer becomes an issue for me, Im afraid my rating will have to remain at one star.\n\nHelpful | 2", "Diamond91May 23 at 9:56 AM\nIts unplayable\n\nI dont really know what happened but I cant play anymore it just crashes or lags so hard that I have to leave\n\nHelpful | 6", "Neardistress224Jun 1 at 11:59 AM\n\nHey thats pretty good\n\nHelpful | 3", "itsurboijh15May 16 at 3:44 PM\nDecent\n\nOn oculus its a whole diffrent ball game. Its good but it had a lot of problems. Sometimes the whole lobby can be defaults and their skins wont load in. And the games are way to laggy.hope they work on it after all its new give it a try half of the game is ok\n\nHelpful | 0", "KARMA-Apr 20 at 10:42 AM\nCrashing when i spawn in the game\n\nI've start playing the game 3 month ago and it was cool, really cool i could play with 10 people before the game start to be a little bit laggy and then crash because someone used some particules, it was ok and understandable for a quest port...\nBut now...\nI have many friends on the game and because of the quarantine i need to see them more than ever.\nBut the game is crashing when I'm appearing on the spawning map and when I'm able to spawn and go in my friends list to invite them my friend are making me crash or they'r crashing when they are appearing\nDon't try to uninstall the game and re install it\nYou'll just reset all your settings and downloaded maps\nNone of any map Will fix the problem of \"crashing when spawning\" the vrchat home is the Best for spawning without really crashing and I'm crashing 8 time on 10 so imagine others map...\n\nSo recap\nThe game was a lot better before even if it was ugly (the game havent really changes actually)\nBecause i could at least talk and have fun with many people\nNow im getting angry against the game and my headset at the worst moment ever\nHope to see some changement really really Quick\nBecause we all need that amazing when not crashing game in these hard times\nThank you.\n\nHelpful | 2", "lilo_malayaMay 31 at 8:16 PM\nProblems for Oculus Quest\n\nI was loading into the lobby. When I got into it. The screen keep blinking black and the lobby scenery. Also the hand movements are very glitchy.\n\nHelpful | 2", "BigBoiBiggApr 13 at 8:58 PM\nBad port\n\nThis is a bad port of a silly/enjoyable chat platform. The framerate chugs constantly, which is extremely disorienting in VR, and the app crashes half the time when I try to visit a room. It is very obvious that the Quest experience isnt a priority for the dev team. You would probably be far better off streaming the game from a pc via virtual desktop.\n\nHelpful | 5", "TB7024May 25 at 6:08 PM\nBarely playable made me sick.\n\nNeeds optimization for the quest. Most of the movement was laggy and I felt nauseous which is sad because I bought the quest mostly for this experience. I will be getting a vr capable pc and using oculus link and hoping for a better experience.\n\nHelpful | 0", "AshTheGoldCowJul 15 at 1:06 PM\nDevelopers please fix this\n\nI was so excited to play this game on my new oculus quest but when I tried to use it, it wouldn't even load the game please fix this developers.\n\nHelpful | 1", "f1shb0wlMay 5 at 3:26 AM\nIt was fun but i made a mistake\n\nSo I had fun with the game but I uninstalled it and I can't get it back so in the future please fix this bug.\n\nHelpful | 2", "WolfcraftgamingMay 28 at 7:28 PM\nThe thing is that....\n\nBe chat doesnt work it just show blackness on oculus quest\n\nHelpful | 3", "dinoboy1160Apr 1 at 10:39 PM\nIts OK but\n\nIts OK but theres always crashing and all this other stuff thats been going on for as long as I been on VR chat\n\nHelpful | 8", "stanky274Jun 30 at 9:38 AM\nTrash\n\nWas good until the 8 year olds came\n\nHelpful | 1", "lucaslifeJul 17 at 12:22 PM\nGets uncomfortable really fast\n\nI really like the concept of expressing yourselv and talking with others across the world. But.\n\n-the controls and the menu of vr chat are confusing\n\n-It is super laggy and sometimes it loads to slow when i turn around\n\n-glitches happen often(flying through the whole map,...)\n\n-sometimes players go crazy with their avatars(there should be limitations like size)\n\n-most avatars of pc users you cant see as a quest player\n\nHelpful | 0", "MortlerMay 21 at 11:44 PM\nGood game\n\nIt's a good game to play with friends.\n(not a game for kids tho)\n\nHelpful | 2", "llulenDec 13 at 10:25 PM\nGreat game, really helps me out\n\nI have a really bad case with social anxiety. I hate crowds, I think everyone is looking at me, I barely like conversing with others. I am always better at talking through text messages or some other way of communication. Although it is similar to real life, big crowds in some places and what not, it actually helps me with my anxiety issue. I've made friends way faster than when I try to make friends in real life. Thank you, VRChat.\n\nAlthough... there are the downsides of Quest VRC. Mostly the one thing being about Quest users not being able to see PC avatars. It doesn't really affect anything in the game, but for some it can get really annoying when you're playing a game like Murder 2 or 3 and you can't seem to get a PC player's hitbox right. As they can be really small and you would never know unless you asked or heard about it.\n\nI don't really have anything against the Trust Leveling System. It's annoying, sure. But gives me a reason to play more if I ever want to get Trusted or Known.\n\nAnyway, I should wrap this up. Great game, I play this hours on end. Even fall asleep while in it- Thank you for making such a game available for us Quest users.\n\nHelpful | 222", "xxae8Apr 18 at 8:09 AM\nWas good before update\n\nThis game was amazing before this update came and they have just released a new one and it has done nothing in-fact i think it has made it worse. Be for the update this was a great socializing app that was lots of fun to chill out with your friend and spend free time in. However after the update it has become really glitchy and it kicks you out of the game and maps very often. If you want to join a map it turns the screen black and redirects you to the beginning map every time. And if you do get into a map it kicks you out of the whole game after about 2 minutes of being in it. I think it was a great game and i loved it but you need to fix this. It seems that everyone else is having the same problem. Thanks.\n\nHelpful | 2", "Pinheadlarry22Apr 28 at 11:24 PM\nFix your game\n\nHonestly just a make it a 1 GB game already crashes way too many times when I go to the loading screen it crashes its a shame considering it used to be one of my favorite social games and while you are at it can you please let us see pc avatars I dont care how much space it takes I just want a full VRchat experience.\n\nHelpful | 2", "Ashton12006May 11 at 10:16 AM\nGood game just avatars need work on ques\n\nSimple i hardly speak to really characters just robots. Look some avatars are pc ONLY meaning you cant see and or use them others are \"perv blocked\" so you legit have to click on some ones profile then hit show avatar why is this a thing i even have safety settings on none.\n\nHelpful | 0", "ianfxMay 6 at 5:29 PM\nNever Works\n\nNot once have I been able to get this game working. Ive tried on a weekly basis to get this game working and each time it crashes either at the main screen or once Im spawned into the world.\n\nIts a bummer because Id really like to try it out.\n\nHelpful | 2", "JMG_NYCMay 8 at 9:30 AM\nVrchat is botted now\n\nVrchat is a good game but its getting botted. Every game I join in vrchat is botted\n\nHelpful | 0", "grimfoxy90May 2 at 7:38 PM\n\nThe one thing I wanted to do is try and make an avatar but i dont know how or if it doesnt support it but that's why it's a 4 star\n\nHelpful | 1", "mechwarrior1Feb 16 at 3:31 AM\nFun social VR experience\n\nI enioy VR Chat and I think the idea is really cool. Not really the game's fault but the community seems to be very toxic here when compared to like AltSpace VR. I love the avatars because it really adds a personal layer where you can become literally anything you want. I would like to see slightly better social interactions between the people but again not the games fault. One last thing for the developers!!! Please fix some of the lacking features for the Quest. There is no reason why I can't see a video player in a room. Several other Quest games and apps easily accomplish this.\n\nHelpful | 6", "CasinoesMay 7 at 1:44 AM\nLiterally Awful For Quest\n\nI really wish you could actually see most avatars. And use most avatars.\nThis game is really one of the worst for Oculus Quest to me, You can barely use anything\nNor can you really see anything.\nVR Chat seems really fun though,\nIt would be for me if I could actually get a regular Oculus.\n\nHelpful | 0", "Magic8Ball1089Mar 31 at 12:41 AM\nI love this game!\n\nThere was this time where I was in a city map and 4 scooby doos surrounded me with ak47 in there hands telling me to hand over the Scooby snacks. and there are just so many stories I could tell about vr chat but thats for later.\n\nHelpful | 4", "Panzer44May 30 at 10:21 AM\nShow pc avatars\n\nI find it interesting but it would be nice to see pc avatars loaded aswell\n\nHelpful | 0", "jake1203nFeb 7 at 10:32 PM\nThis game is only rated T for teens?!\n\nThis is a great social game for people to play. You can visit friends in the VR world without needing to be close to each other. I would totally recommend this game to people with social anxiety to help with it. But, the only bad part about this is the avatars. Some of the female avatars are RIDICULOUS. Let's just say that there is a lot of nudity involved. That's not okay as around 30% of people I run into while playing this game are 10 years old or below. So far, VR chat seems to be doing nothing about this problem. So if that's the case, I think this game should be rated M for mature because of nudity. Also a quick bonus is that you cant see avatars for pc. So that's sucks.\n\nHelpful | 8", "SchwerzliMay 15 at 9:40 AM\nLove it\n\nIt killed my irl life though\n\nHelpful | 3", "ExtraSaucesMay 27 at 1:47 PM\nBest social platform on vr\n\nMeet some of the coolest people on this and is my opinion the best free game on quests. A must have game.\n\nHelpful | 0", "Emonkey058Jun 5 at 8:00 PM\n\nDont play any more I always crash:(\n\nHelpful | 2", "steveaccckMay 18 at 3:23 PM\nmemes\n\nnothing else needs to be said\n\nHelpful | 3", "bobob15Jan 22 at 7:55 PM\nThank you dev\n\nThis game really helps me out, in real life I have this disorder called ADHD and it stops you from focusing, I get really shy and when I talk to people on this app I dont feel shy because I can express myself in anyway. This game is awesome.\n\nI also love how you can be anyone you want and talk to people and make them laugh, I feel so good when someone says something nice to me on it and people arent really that mean. Thanks Devs!!!!!\n\nHelpful | 44", "killianjudyMay 12 at 6:32 PM\nVR chat kids\n\nThere should be a VR chat kids edition\n\nHelpful | 0", "ZACKATTACKS007Jun 5 at 2:14 PM\nWow\n\nIts a very good game just needs some tweaking\n\nHelpful | 0", "YoungBuc24May 14 at 4:29 PM\nRee kid\n\nRee kid\n\nHelpful | 4", "bootstrapparadoxFeb 25 at 10:26 AM\nProblems, problems, problems\n\nI would give vrchat for the quest more stars but there are some major issues to fix.\n1) certain world's crash the app.\n2) I've lost count on how many world's fail to load and send you back to your home world. This not just community world's but main world's to.\n3) server issues\n4) some world's cause graphical glitches when turning or the world's fail to Rez at all leaving you in a dark void.\n5) one all two maps where you fall through the maps.\n6) world's over 50 mb file size appearing in the world maps. The quest version fails to load any world maps over 50 mb file size.\n7) there hasn't been an update since last year. An update with bug fixes could fix the issues I've mentioned.\n\nI would give more stars if the vrchat Devs worked with the avatar and world creators to fix the glitches and bugs in the quest version.\n\nHelpful | 16", "JJACRedwingMay 27 at 5:23 PM\nHi\n\nWont let me log in\n\nHelpful | 3", "dogethorApr 30 at 2:20 PM\nCant play\n\nI tried to create a account and it wouldnt let me even though I had everything checked and filled out please listen to me and fix this because I really want to play this game and I want other people to be able to play to\n\nHelpful | 4", "Samattack2012Apr 2 at 9:30 PM\nVrchat\n\nWhy does it keep blinking\n\nHelpful | 8", "sandbarApr 10 at 1:20 PM\nRuined by update\n\nThis is a great app but it has been getting worse over time. The latest update in early April for Quest makes it unusable. Very sad because it is a great app. Hopefully theyll undo this soon. I cant roll back the version.\n\nHelpful | 4", "DeepMellowJun 2 at 6:47 AM\nBunch of rude spoiled kids\n\nIf you want to engage in something with a bunch of little kids who think the F word is cool than this is for you. Played it for about 15 minutes and I felt like I was babysitting. Not worth it even for free.\n\nHelpful | 1", "SKELEEFeb 13 at 3:51 AM\nThe game is great\n\nIm just gonna be open with you and say this is one of the best things you can get on a VR. Its super fun and you meet some really funny people (dont let kids who arent mature play as they kinda ruin the fun sometimes). Im on Quest and I know a lot of people want to see peoples avatars and stuff, but you know well get there, maybe, probably. I just keep playing even if I cant see avatars and its still fun all the same. There are some glitches where peoples avatars will disappear and you have to show them again but Im sure thats fixable. Overall, its great for a free game.\n\nHelpful | 5", "TrashBuffoonMay 21 at 7:53 PM\nGreat game\n\nVery great game but with some issues like crashing and freezing but other than that a great game\n\nHelpful | 1", "Lightwing_Mar 17 at 11:06 PM\nabsolutely love\n\nI literally bought my quest to be able to play this game. I absolutely love it! its fun to meet all kinds of people. there's always someone to talk to no matter the time of day, and when you're wanting to be alone there's absolutely beautiful, stunning, worlds you can just sit and relax in. fun games to play too, things you can interact with, you can throw stuff you can draw you can even practice your archery. every time you start up the game its a brand new adventure. one you get to decide, and one you get to change or shut off when you want to. the game grows more every day, its only gonna get better from here.\n\nHelpful | 3", "SubQueApr 7 at 2:18 PM\nUpdate messed it up\n\nEver since these two updates came out everything was downgraded like performance. I would even crash in the home lobby! Or by looking at a mirror!\n\nHelpful | 9", "tanner.vegetaApr 23 at 5:49 AM\nNo hand-tracking in there!\n\nI am so disappointed, I want to use Hand-tracking in there, because I am deaf and using American sign languagr (ASL). Hope you will add hand-tracking!\n\nHelpful | 6", "Twisted-and-BentApr 3 at 11:43 PM\nI cant change my avatar back\n\nSo I was trying some skins and I kicked on a giant megazord and now I cant change my character\n\nHelpful | 3", "Derpmaster2May 6 at 2:19 PM\nMovement\n\nPlease give people the ability to walk in a first person point of view instead of teleporting a certain distance\n\nHelpful | 1", "D4rkriv3rJun 27 at 2:27 AM\n\nPc Version is 100% better than this trash!!\n\nHelpful | 1", "Dr.CookiekillerMar 12 at 10:47 PM\nVery enjoyable but!\n\nUnfortunately it sucks that I can't see all avatars due to the fact that I am a quest users, other than that it's so fun. I love the wacky situations you get into; I hope the link will improve my experience.\n\nHelpful | 8", "Paxton090Apr 23 at 5:48 PM\nThis is a great game but I got some bugs\n\nThis is the reason I play vr games but there some bugs\n\nOne bug is randomly I go from 5ft tall to 7ft\n\nHelpful | 3", "Will5757Apr 29 at 2:41 AM\nDisappointed\n\nWhen I go on to be chat the game crashes but makes the screen flicker constantly on the quest .\n\nHelpful | 5", "cruzchristopher68Apr 21 at 6:16 PM\nSOMEONE PLEASE FIX THIS GAME\n\nUsed to be functional. Now it constantly either crashes or blacks out.\n\nFIX IT NOW!!!!\n\nHelpful | 7", "QuiggzRApr 23 at 4:47 PM\nUpdated and it started!\n\nTurns out I needed to update my oculus more than twice! Five stars until I see something really wrong. Good luck developing!\n\nHelpful | 3", "sjaakie2007May 5 at 12:44 AM\nIts not werking for me\n\nI have the quest an i have vr chat nut Some how i cant play beceaus its Stays at the loading screen\n\nHelpful | 4", "MitchernyJul 29 at 2:50 PM\nAwful, good for nothing.\n\nNot much to say. It should not be on Quest. I went to a couple of locations with \"simple graphics\" and the lag was HORRIBLE. Then it stopped responding altogether when I tried to go back home, then it said my Quest \"did not have enough memory\". I was under the impression that a VR world would not show up, if it performed badly on Quest. I guess I was wrong. The avatars may be worth checking out, it's kind of fun, but for the rest the game is awful. Don't bother. Rec Room is the only thing worth a shot.\n\nHelpful | 0", "Arizonakhalifa15Apr 28 at 4:00 PM\nGood, but faulty\n\nIm slightly disappointed as I tried to load on to a map but the three loading dots kept on coming up and disrupting my game, I need help.\n\nHelpful | 1", "Kix-12 days ago\nDoesnt work\n\nI cant open the game with my Quest Alone, but I can run it perfectly with my PC so good game (so far)\n\nHelpful | 0", "AidenaiterVRMay 22 at 1:14 PM\nWhat can I say\n\nThis game I can assure you will give you weird dreams. Also stay away from the mirrors. Never the less...5 stars\n\nHelpful | 0", "J0E_JUGGERN4UTMay 26 at 12:32 PM\ncaught a bug on a player model\n\nCan't see my menu so I can't do anything can't leave my home world can't switch characters can't join ppl nothing\n\nHelpful | 0", "ethan.gangl.16May 28 at 4:33 AM\nBad\n\nIt keeps on flickering when I join\n\nHelpful | 3", "Domfreak12 days ago\nI cant get in\n\nDude i cant get into the game if I would click on its closing instandly I only bought the vr thing for my favourite game its like scamm\n\nHelpful | 2", "Always_speoMay 21 at 11:36 AM\nTHE BEST\n\nthis game has infinite replay value it is so fun every time\n\nHelpful | 1", "FenjiApr 21 at 6:46 AM\nCrashes before I can even play\n\nfirst time i downloaded this game on quest, got 12 separate crashes just trying to accept the terms. created a vrchat account, accepted the terms there. got past the terms, now my game crashes getting into the tutorial. i can't skip the tutorial. so i get nothing but crashes so bad i have to hard reset my quest.\n\nHelpful | 1", "mscroggyMay 7 at 3:26 PM\nI love vrchat\n\nI love vrchat\n\nHelpful | 0", "kira.lineroMay 14 at 4:13 PM\n\nI'm having trouble with moving my character. What do I do?\n\nHelpful | 0", "KillerApache76May 14 at 12:15 AM\nI love it\n\nIm speechless\n\nHelpful | 2", "tylerbrevellJul 9 at 8:29 AM\nIt is great game\n\nThe game is cool because during COVID19 we can party and everyone is nice so that's another cool thing so this is the end of my interview so hope like the game when you play. If anybody in your house wants to watch you and your on oclus just download the app called oclus and sign in to your account that is on your oclus and you would have to go to the side\n\nHelpful | 0", "gladders1000qMay 3 at 9:06 AM\nGladders\n\nTrible. Iv downloaded it but it just flashes i can not use it at all. Very annoying\n\nHelpful | 4", "NeonSFMProductApr 6 at 9:46 PM\nLags and crashes too much\n\nThis game... Ohhh this game. Every time Im at the hub or trying to go somewhere, it crashes or It lets me in then takes me back immediately. Please fix this with quest.\n\nHelpful | 5", "tunableplayer88Apr 11 at 5:48 PM\nBRoKeN\n\nSince last update things have been laggy and worlds have crashed constantly and changing avatars raises the chance of a crash and most worlds you join crash and in certain areas it crashes\n\nHelpful | 3", "The_Cactus_ManApr 23 at 5:17 AM\nThere's nobody there!\n\nThere's something weird about the Quest version. There's nobody there. Seems to be some sort of disconnect between the Quest version and the PC version...\n\nHelpful | 3", "mrb.jmbMay 11 at 11:23 AM\nIf you give a moose a muffin\n\nIT GOES EEEEeEeEeEeEEe BANANANA\n\nHelpful | 2", "walnut156Mar 18 at 3:31 PM\nWorks fine but at a cost\n\nThe game works great on the quest but due to the fact that the quest is obviously weaker spec wise than a normal pc headset you will not be able to load every are or every player avatar. Regardless it's still fun to just mes around and hang out\n\nHelpful | 1", "WaveEffectFeb 18 at 1:35 AM\nIts the store brand version of VRChat\n\nIts VRChat, no doubts there. Its the whole game, just with some restrictions. You cant see the majority of avatars due to them being PC players and the Quest apparently wasnt able to handle them so theyre disabled. Some worlds do not load properly and youre plopped down on some basic map geometry/model devoid of any textures or skins. Others will work completely fine. There are definitely Quest supported worlds and avatars, labeled as Cross-Platform respectively. While that works for some, the problem is that a large majority of the player base can be difficult to access due to the restrictions.\n\nSo thats about it. As long as your okay with using Cross-Platform worlds and avatars, youll get the experience of VRChat. Oh, and the microphone actually works on this version unlike playing over Oculus Link.\n\nLooking at you, Oculus...\n\nHelpful | 4", "melyssaoncrack7 days ago\nYesss\n\nI love this gameeeeee!!!!! Its so funny I played until I couldnt stand \n\nHelpful | 0", "Lynkx826Jun 4 at 7:18 PM\nFroze my occulas with a virus\n\nHas virus/ bug with Racist Hate speech on repeat had to do factory reboot\n\nHelpful | 1", "MikacZApr 26 at 11:41 PM\nPlease fix this issue\n\nIve tried to launch my oculus quest stand alone, I logged into VRChat then as soon as I got into the world my screen flashes black every second.\n\nHelpful | 2", "UltimateRRC123May 3 at 7:44 PM\nGood Game\n\nIts a good game\n\nHelpful | 3", "ARIHUMIMay 25 at 10:38 PM\nbest game ever\n\nwonderful I love this game\n\nHelpful | 0", "peter1014Apr 23 at 12:27 PM\nreally does not work on quest\n\nif this is not supported why does this even exist? I have deleted the app a long ago. this is not for quest\n\nHelpful | 4", "Perry888Apr 4 at 12:47 PM\nThe new update for the game is bad\n\nFor quest users it kicks u out almost every time u get in. If u could and this it would be great.\n\nHelpful | 10", "PretzelsandpizzaMar 15 at 10:33 PM\nPeople are mean.\n\nIn vrchat which is an amazing game some people are just nasty and rude to younger players. I feel like this issue should not be in the game. Anyway, this game is great!\n\nHelpful | 2", "InkiiedFeb 10 at 2:34 PM\nS**t but beautiful\n\nSo the thing is Vrchat need more updates especially in the category ,,performance\".\nYou can play and play but the game just crashes or gives you a black screen and with the questaversion it just kicks you out of the room you were in.\nThat is s**t so pls just update vrchat on the quest especially in performance!!!!!\nThe black screen, crashes ,kickings that is destroying the fun\n\nHelpful | 5", "HydraLDNApr 1 at 11:12 AM\nI mean its free but not good at all\n\nTheres so much to do in this but also way too much you cant do. I mean yeah I wasnt expecting to be blown away but it was very much a disappointment. They turn safety settings on in this game which ruins it because your unable to play certain games and see peoples avatars if they are too advanced, however you can turn these off but sometimes I still cant see peoples avatars and have to manually unblock them. Ive found that if your in a game with more than 10 people or so you will crash or get sent back to your VRchat home... now that disappoints me, I cant tell you how many times I would be having a nice conversation with someone to then be greeted by a loading screen mid convo and be on my own back in my VRchat home. This game needs serious improvement for it to be fun at all. DEVS STOP WORRYING ABOUT GRAPHICS AND MORE GAMEPLAY.\n\nHelpful | 3", "kieran.swinney.77Apr 2 at 10:36 AM\nAmazing\n\nVrchat is an amazing place to meet new people and to find people with similar interests, there are a bunch of amazing worlds with very cool things, and the avatars you can find are endless\n\nHelpful | 2", "loneridersteveApr 22 at 2:16 PM\nVR Chat\n\nChildrens play areas...\nNeeds an adult area please... separate from the children. I dont talk to anyone there because its all kids.\nProbably needs deleting!\n\nHelpful | 2", "Peter5312Apr 8 at 6:13 AM\nPlease Fix This\n\nThis game is awesome but after the latest update I cant do anything without the game crashing or just not loading a thing.\n\nHelpful | 5", "FryGuyFlyJun 6 at 5:23 PM\nTurkey\n\nYes\n\nHelpful | 1", "TylerK0217May 20 at 11:43 AM\nGame freeze on screen\n\nEvery time I be big or any big avatar make me crash it just bad and pointless fix this\n\nHelpful | 1", "TylerK0217May 20 at 11:43 AM\nGame freeze on screen\n\nEvery time I be big or any big avatar make me crash it just bad and pointless fix this\n\nHelpful | 1", "NR-GronkMay 21 at 11:38 AM\nGood\n\nFunny\n\nHelpful | 1", "yguyeji622May 1 at 9:35 PM\nJust stop\n\nThe dang thing wont uninstall I only played this once and was sorely disappointed in what was their and just could start it after the new update\n\nHelpful | 2", "WoqcizJul 9 at 9:10 AM\nVery laggy\n\nI think that when I got the oculus vrchat it would be clean and I know its early access but still YOUR OCULUS YOU\nCAN DO ANYTHING!!!\n\nHelpful | 0", "PandaPlayzGamezMar 23 at 8:56 PM\nUncomplete for Quest Users\n\nAlot, and I mean ALOT of rooms that other headsets use are lnt available for Quest Users. Maybe be less strict with them.\n\nExample: Avatar, Popular, Game, and alot of other maps are gone for Quest Users compared to every other device that is able to use VRChat.\n\nHelpful | 3", "CoolBeansBobaMar 23 at 6:41 PM\n\nThis is the best game really I play it every day nonstop. One reason is that they dont know what you look like people can't judge you for your look so I give it five stars\n\nHelpful | 3", "BeattrapvrMay 8 at 12:50 PM\nWont let me into the game\n\nWhenever I gets into a world the screen just keeps on flashing its really annoying and hurts my head.\n\nEdit : The game is stuck uninstalling its been doing that for days.\n\nHelpful | 1", "JaxKidderJun 26 at 12:58 PM\nBad\n\nPeople say bad words\n\nHelpful | 1", "TheNaked_GamerJan 9 at 12:38 PM\nGreat game. Hear my words\n\nThis game is actually pretty fun and even more fun with your friends. I do wish you could see pc avatars and travel to pc worlds but all in al its still fun.\nThere will be some problems when you do play though. Sometimes your game will freeze, you can get what some players called black screen where your screen goes black but you can still hear. If you are planning on getting this game get it, you will have fun but be careful with the problems.\n\nHelpful | 9", "silbernagel.gavinJul 19 at 4:23 PM\nGood\n\nIt is a good game it does get a little laggy but it is a fun time killer\n\nHelpful | 0", "spyychoApr 8 at 12:11 PM\nFix this\n\nEverytime i try to play vrchat i constantly crash. I join a world and it kicks me out immediately. This needs to be fixed\n\nHelpful | 4", "YT-El_king_duck13 days ago\n3 bars, cant log in\n\nI have 3 bars, and I cant even log in. (Still 5 stars\n\nHelpful | 0", "milkbandetJul 15 at 10:25 PM\nI cant make an account\n\nI did all the things I needed to do but it keeps saying theres an error message\n\nHelpful | 0", "toastywafflesMay 6 at 1:15 PM\nIt wont uninstall\n\nI dont know why this is happening but when I tried to uninstall it got stuck. I cant play it and I can not redownload it please help. :(\n\nHelpful | 1", "PooptootApr 15 at 8:26 PM\nUnplayable\n\nI just got my Oculus quest today being excited that I can finally go in vr chats. Starting it up, it instantly was crashing but tolerable. The second I got to the tutorial, it kept flashing on and off with no way to get back to the home screen or to quit out of the game. After restarting the oculus and assuming it was just a bad start, I hit play on the fame again just for it to spaze out again(and having to restart to make it stop)\n\nHelpful | 3", "Fergus67Apr 4 at 3:14 PM\nJust wont start on a brand new quest\n\nWhenever I try to load it, there is what looks like a slow strobe effect! Dark, then a flash of a room then dark again on repeat.\n\nIt simply wont work so impossible to rate other than a 1 star.\n\nHelpful | 8", "TantrumousMay 2 at 11:48 AM\nWtf\n\nFroze our oculus couldn't get it to power off or go to the library.\n\nHelpful | 2", "AurcticMay 15 at 8:16 PM\ndoesn't work\n\njust crashes\n\nHelpful | 2", "Warfighter74Apr 2 at 5:13 PM\n\nWhy would you have to delete every skin for the new update thats not cool\n\nHelpful | 8", "Noobthe4th24 days ago\nI log in vrchat I takes me right back ou\n\nIt keeps on going in then going STRAIGHT back out what I mean is I go in vrchat it takes me right back out pls fix this...\n\nHelpful | 1", "aotgalaxy25Apr 2 at 2:56 PM\nStuck\n\nIts great game and all but Im stuck as a big character in home world how do you get out?\n\nHelpful | 1", "mimi.belaid1May 2 at 10:14 AM\nAges\n\nAbit disappointed , I wanted to socialise with people around the world and every room have been to so far its just kids !!\nWhat the heck !!\n\nHelpful | 1", "PentaSquaresFeb 4 at 8:54 PM\nGreat but...\n\nLove the game. I play on PC too, but this is missing tons of stuff.\nMost of the popular games are inaccessible, and the ones that are, are mostly filled with PC gamers. The fact that you can't see them and they can't see you is depressing. I can't give people compliments and stuff. You don't know anyone's height. Everyone looks the same.\nYou can't become the avatar of someone else apparently. In sitting mode, you can't crouch. From what I've seen, about 95% of players are on PC.\nOverall it's really great and I highly recommend it.\n\nMy name is PentaSquares btw, so if you see me, then... I guess that means you saw me?\n\n\n\n\n\nSworshanayger\nGyet tu ze chauppuh\n\nAight imma head out now\n\nHelpful | 2", "slpmonkey15 days ago\nOh yeah\n\nThis is the best game, super funny\n\nHelpful | 1", "The_big_perchMay 21 at 2:14 AM\nBoring\n\nTheres nothing to do\n\nHelpful | 0", "Emily55555Apr 6 at 5:48 AM\nPlease fix this game.\n\nThis game is unplayable. It crashes constantly... Please fix.\n\nHelpful | 5", "CARTOONY_BOIFeb 27 at 2:39 PM\n\nPretty good, wish we could be able to see pc avatars, so we could get the full experience, unless Oculas Link works though\n\nHelpful | 3", "dominic_awsomeheadJan 28 at 10:16 AM\nIts a great game. So..... 5 huge stars!\n\nI think this game is great because of it has actual players and they can actually talk to you. And I think its also great because of you can also play on the PC I think. And people are nice some rude but ok. So this is my review it is a great game that almost everybody could join.\n\nHelpful | 9", "evanbutler23Apr 8 at 12:11 AM\nUseless\n\nUseless app now crashes non stop\n\nHelpful | 6", "MasterChiefMossJan 23 at 3:22 AM\nI played it for a week it's good\n\nHaven't played for that long compared to other people I have the Oculus Quest there is only one problem with it just that the PC has tens and tens of thousands more games in games you thought you could play turns out there PC exclusive and it really just gets boring when you're waiting for a game or map to drop for Oculus Quest but that's my only problem with it I would say it would be good try and the community is very friendly\n\nHelpful | 2", "Justawildtoby_Apr 17 at 4:09 AM\nGreat Game but crashes too much\n\nOverall amazing but the new update crashes WAY TOO OFTEN\n\nHelpful | 1", "MaplepotatoApr 19 at 7:42 AM\nComical at first, but got bad real quick\n\nWhen I first got in it was great with all the things I could be, but then it kept kicking me out of the game for no reason, and the games dont work 1/10 wouldnt recommend\n\nHelpful | 1", "frederic.landriaultApr 15 at 6:24 PM\nWhat happened\n\nI loved VRchat. But for a few day now it just. Keeping to crash after 10-15 minutes of gaming?? What happend. I know i have a Quest but seriously now it feeling me cheap.\n\nHelpful | 0", "jacob.caudle.50Mar 9 at 4:21 AM\nFUN!!\n\nI love this game so much! I do so many fun stuff on here explore so many places! I can change my avatar to something cool and I can make friends on here! Its fantastic!\n\nHelpful | 3", "SwitchOnQuestTTMar 24 at 1:48 PM\nNot happy!\n\nI love the videos of vrchat a TON. But I have one huge concern. I want to link my oculus account to vrchat. I also cannot log in even when I have the username and password correct.\n\nHelpful | 1", "NDKruegerApr 14 at 8:19 PM\nThe update sucks\n\nThe game was playable and quest was limited and was irritating do to that factor but recent update is unplayable. I cannot play a full 5 minutes without crashing, please fix\n\nHelpful | 1", "Freaker013Apr 27 at 2:09 AM\nCrashes on the Quest. Everytime!!!\n\nAvitars are cool.....isn't really much else to do. EVERY single time I get on.....it just crashes....everytime.\n\nHelpful | 1", "SwagStar59May 11 at 11:18 AM\n\nBad\n\nHelpful | 1", "LightningBoi29631Mar 11 at 8:32 PM\nI. LOVE. THIS. GAME!\n\nThis is one of my favorite vr games Ive ever played. There is a way to see PC avatars, the games are awesome, Ive laughed my head off, and got to play as some of my favorite characters!\n\nHelpful | 2", "luke.sage.stevensApr 21 at 10:15 PM\nEpic\n\nEpic\n\nHelpful | 2", "Blake_WMay 11 at 6:19 AM\nLiterally cannot play the game\n\nThe full pc game isnt there and its kinda boring\n\nHelpful | 0", "CrystalDestroyer13May 23 at 3:54 PM\n\n\nCant fcking play this bull$hit\n\nHelpful | 1", "Barney_2.0Mar 3 at 5:02 PM\nGreat\n\nThis game is absolutely amazing. I played it for the first 15 min and decided it was maybe my favorite game. The people playing are hilarious to.\n\nHelpful | 4", "GamerbotXYTMay 16 at 3:09 AM\nSuck\n\nI thought this app sucks and would rather throw my oculus than play jt\n\nHelpful | 0", "Awesome1347Mar 23 at 5:40 PM\nNot finished but a amazing game overall\n\nI play practically every day I can socialize with people and show people cool avatars and play games in different worlds\n\nHelpful | 2", "RilxeMar 29 at 2:45 PM\nReee help\n\nI cant make an account on the website for VRChat\n\nHelpful | 1", "Nicky_TMMar 12 at 2:44 AM\nVRchat is awesome,but quest restrictions\n\nI love VRchat, but there are sooooo many restrictions. Its like were being discriminated.\nWe want the maps and avatars pc users have, or at least see them or the maps.\n\nHelpful | 2", "richardlingramJul 16 at 3:04 PM\nWow\n\nSo for me the screen kept blinking to being a black screen to being frozen to being black screen.\n\nHelpful | 1", "King_Of_EgyptMar 27 at 2:50 PM\nGreat app\n\nI'm in love with this app\nThank you for making this easy\nThis is a great job really great\nI appreciate that and also very happy to use this great app for free\nGuys, you are amazing\n\nHelpful | 1", "StrayceApr 18 at 7:42 AM\nAs unstable as it is fun.\n\nIts very fun.\n\nHelpful | 1", "SeymoreHineyFeb 16 at 1:14 PM\nWorse for quest than other platforms\n\nIn VR chat the mic will glitch and not work half of the times u get on to play, the majority of nice and open worlds you see people who have rift on YouTube play are not available to us on quest, for us other than a couple of really small social rooms and a murder mystery game we have very little to do in this game.\n\nHelpful | 3", "CrazyfuguFeb 10 at 3:02 PM\nNice idea\n\nHow about an app for android to create worlds. The ability to add your own stuff/pictures in your home. Alerts to when your friends come online and ability to chat from mobile to vr.\n\nHelpful | 2", "ViciousFoxJun 6 at 4:44 AM\nReport\n\nI have no idea how to get other avatars such as siren head and most of the avatars in the trailer thing but fun if you know how to get siren head please reply to this\n\nHelpful | 0", "MrUnboxerManYTMay 28 at 11:21 PM\nGarage\n\nIts garage so many poople kurse and yuo guuys shuuld ad a fillter foor muture languge.\n\nHelpful | 0", "errorsans123Jun 7 at 12:06 PM\nWouldnt let me create an account\n\nIt wouldnt let me create an account\n\nHelpful | 1", "killertigerjrMar 12 at 1:01 AM\nIts okay\n\nI wonder when is the physic for the avatars and when we will be able to see pc avatars\n\nHelpful | 2", "kingofcardgamesMar 21 at 1:00 PM\nIts WAS great...\n\nI accidentally used a very large avatar and now I cant change it or go on worlds.\nI cant play it anymore.\n\nHelpful | 1", "FoxificationJan 18 at 8:43 AM\nSuch Fun, Much Random.\n\nDon't think of it as just a chat app, there's so much more in there.\n\nSure you might come across some meh people, but at least here you can just eject them from your virtual life :D.\n\nFirst time playing I found myself embodying a can of tomato soup whilst singing Bohemian Rhapsody with a toilet roll, Master Chief and a generic anime girl in a basketball court.\n\nThen we played some silly games.\n\nFun times.\n\nHelpful | 5", "Mark_05okFeb 26 at 7:42 AM\nAwesome game\n\nI only have a few hours of experience in vrchat but I have met lots of cool people on it, lots of weird people too , but thats what makes this game stand out.\n\nHelpful | 1", "TrickiMar 7 at 8:13 AM\nVery fun\n\nI could play for hours but I think they need more servers and definitely a push to talk button for the quest.\n\nHelpful | 1", "Driver019Apr 13 at 1:40 PM\nWhy is crashing\n\nThe updates ruined the game\n\nHelpful | 2", "TravisU09May 4 at 6:15 PM\n\n\n\nHelpful | 2", "Spadies1Apr 6 at 1:29 PM\nVr chat\n\nMy oculus quest won't run Vr chat it worked and now it does not I got it brand new and it flashes black screen\n\nHelpful | 3", "CyberFernMar 19 at 8:42 PM\nNever ending mean people.\n\nReally great social experience but mean people flood the experience. Some Random mean idiot asked me for my age, I never responded. Use Rec Room instead of this game. Please update the rules and more friendly moderators. Rec Room has more advantages than VRChat. So Rec Room is more better. Really Garbage Developer that doesnt care about toxic people.\n\nHelpful | 1", "PrestoScott87Mar 16 at 2:33 PM\n\nWould be better to see and use pc avatars\n\nHelpful | 3", "t.octo.mApr 18 at 6:28 PM\nWont install\n\nI got vrchat and uninstalled it but it wont uninstall or install\n\nHelpful | 0", "flyingwolf345Jan 26 at 7:30 PM\nPretty good\n\nIt's better than I thought but the quest should add all the pc skins to quest but it's ok if it's too hard it's still a good social experience\n\nHelpful | 4", "JakeconerNov 24 at 8:50 AM\nRough on the Quest\n\nThis game is technically compatible with Quest and Rift, but it doesnt play well on Quest. Graphics are set to there lowest setting. Now thats fine, but many worlds and skins are not compatible. If a Rift user is using a skin that not compatible, it will load the default skin. The few worlds that our compatible are just basic chat rooms. There are almost no game worlds and the few game worlds compatible for Quest are very buggy. It not that terrible, but it is rough for Quest users.\n\nHelpful | 36", "Aly-SenpaiJun 25 at 4:05 PM\nBest experience in years\n\nIve been playing VRchat for almost 3 years on pc, and being able to see it now in my own eyes is only gonna make it better. And I have my friends to thank for that!\n\nHelpful | 1", "TehelmoApr 15 at 4:07 PM\nWhat\n\nI got this game on vr it seemed like a lot of people liked it and when I got on it instantly went into a state like it was in the middle of crashing but it wouldnt\n\nHelpful | 0", "VontexSoulJun 25 at 7:27 PM\nReally good game\n\nLove everything about it the anime boobs the cool avatars and I just got my quest I dont know why everyone else has problems with it yall must have done somthing wrong\n\nHelpful | 1", "oMiaPiaDec 25 at 3:02 PM\nNot that bad as it seems\n\nVRchat worked perfectly for me, the only issue was not being able to see PC user's avatars and only seeing the default robots. Which sucks, it really does. I downloaded this game to meet new friends, have a good laugh, and see the creativity put into the avatars that were made from watching many Youtubers play VRchat, but sadly I didn't get to experience that. I hope that the developers are able to fix this issue, I know that the Quest isn't able to render these avatars due to the polygon limit, but again, this game was just introduced to Quest, so I'm sure this will be resolved soon. But overall, I enjoyed the game, I just hope that the issue gets fixed. It's worth the download. We just have to cross our fingers and hope for the best.\n\nHelpful | 6", "Gh0st1ySamura1May 23 at 1:13 PM\nHi\n\nNever played it\n\nHelpful | 1", "zDarkNe0Jan 30 at 7:53 AM\nVRCHAT\n\nThis was the most fun and entertaining game the community of VRchat was just great and making new friends was way more easy than on a Xbox or PS. And the best part is you can create your own character and world.\n\nP.S. developers of VRCHAT you need to find a way to let quest see and use PC skins otherwise keep up the great work.\n\nHelpful | 4", "Peiji.xoApr 23 at 1:20 AM\n\nCrashes a lot on the quest\n\nHelpful | 1", "DylanH94Oct 13 at 6:17 AM\nAmazing but a few things\n\nI honestly loved being in VRChat alot, getting to see worlds other people made and such. My only issue is that whenever I go to a world, I can not see anyones avatars unless I tell the game to allow it, along with the seemingly limited world list. I understand that not everything can be ported over as some worlds would put a lot of strain on the Quest but I always felt like there was so much more than what I am seeing that didnt seem like it was taxing to the equipment\n\nHelpful | 86", "VRMasterguyJul 2 at 1:40 PM\nTo much ya no girls boys \n\nTo much like....... DONT PLAY THIS IF UR UNDER 14 YEARS OLD\n\nHelpful | 0", "IcyopkJun 28 at 4:09 PM\nToo laggy\n\nSadly very laggy even for a quest game!\n\nHelpful | 0", "marct3176Apr 16 at 1:25 PM\nCant even load it\n\nIt goes to loading screen and just crashes.\n\nHelpful | 1", "PikuchaJan 2 at 1:19 PM\nIt has its ups and downs\n\nI am so glad I was capable of being who I want to be in front of people who doesn't judge me. I can't be like that in public, or else I'll get judged or just make myself look like a fool. But VRChat is where I'm allowed to be free! However, I do wish to see PC avatars and other worlds, such as the original Great Pug, that Quest users are unable to explore. Quest users wish to have the same experience as all VRChat users do. And if that's why it says \"Early Access\" on our menus, then I do hope for the full experience as a Quest player. Other than that, I thank you for such a gift, giving me the chance to socialize with new, random players and becoming friends with them.\n\nHelpful | 3", "somberlinkJul 1 at 2:22 PM\nso so\n\ni mean it works but the shaders need to be enabled, but not bad at all over wifi. i am gonna try it with my hotspot next.\n\nHelpful | 0", "sylbeeMay 22 at 11:47 PM\nCute\n\nIt's cool to see me walking in front of myself. I've never seen that before! I had fun in this game but I wish there were more people!\n\nHelpful | 0", "BowserkiddJul 4 at 7:21 PM\n\nReally great game fun skins\n\nHelpful | 0", "shamanlordJan 10 at 4:09 PM\nMk\n\nThis is a really good game just the ppl in it and not seeing pc avatars one of my friends were being harassed and had a panic attack because of an avatar she didnt know what to do so can you make it where ppl can be notified if the avatar is creepy scary or whatever please add this in\n\nHelpful | 1", "SilentHills_PT_Mar 13 at 1:47 PM\nIt helped me forget about her\n\nBetter than RecRoom\n\nHelpful | 2", "dingofoxvrfoxJan 23 at 10:16 PM\nBroken unfair discrimination in app\n\nVrchat was ok for the most part until the holidays where there racist staff locked worlds that where holiday themed worlds to pc vr headsets only discriminating against quest owners and they still refuse to fix the app so you can see everyones avatar what a pile of garbage. Please fix this crap\n\nHelpful | 5", "madderekMar 8 at 1:07 PM\nThis game is rlly fun\n\nI love it so much i cant stop playing it.im trying look for some scary skins but its alright.\n\nHelpful | 1", "caseonquestJun 25 at 2:38 PM\nWack\n\nAlto of peds on here that want me because Im a 9yo girl but besides that rly good\n\nHelpful | 1", "SterbenDIEJan 2 at 1:17 PM\nA great way to chat with people but...\n\nI love VrChat but the game doesnt run well in the quest. The game crashes alot and if you're lucky to get a black screen which gives you enough time to tell people to friend you to join back the lobby. Since the game is cross-platform you are able to join PC players depending if the world support quest. Most PC players have avatars that quest players cant see because VrChat had put a limit on how many polygons can the quest see on a avatar. I wouldn't recommend VrChat to kids since there's adult content but most parents aren't aware of it. I would recommend playing VrChat in PC with Oculus link to experience the game better but overall it's not bad on the quest.\n\nHelpful | 1", "11Shiley11Feb 8 at 8:50 AM\nHelps find love\n\nI was playing this for a couple months and eventually a girl not a trap confessed there love to me, this really helps me from killing myself, friends help you to\n\nHelpful | 2", "psychwrldDec 18 at 1:59 PM\nPlease help\n\nI could only give it one star because truly I haven't been able to have any experiences with the game. When ever I go to load in vrchat on my Quest it starts loading then it says make sure your device has a working internet connection and restart vrchat, even though my everything else that requires an internet connection works totally fine. Keep in mind my internet connection is very fast, and very consistent. I have tried many fixes including uninstalling and reinstalling, turning off and on my wifi, reconnecting my bluetooth connection from my phone, and nothing has seemed to work. Please help me because I have waited to play vrchat for so long and it sucks because I just bought my quest.\n\nHelpful | 12", "emmabunnyDec 28 at 5:09 AM\nGreat place to chat and hang out\n\nOk so I've been using vrchat for over a year now, and all I can say is, it isnt a kids game.\nThe amount stuff you see in game is mostly 18+\nBut it is a great place to hang out and chat to your friends from the other side of the world\n\nHelpful | 7", "CraftyGuitarJun 30 at 11:06 AM\nGood\n\nToothbrush\n\nHelpful | 0", "zackspider1204Jun 25 at 12:27 PM\nGreat ... but\n\nVrchat is a great game but it Should have hand tracking\n\nHelpful | 0", "GrindOnLimeMay 16 at 12:12 PM\nGreat game ruined\n\nI got a quest for the sole purpose of VR chat. Its an amazing game and brilliant for socializing especially through these tough times. But holy moly is this just a big pile of aids. I can barely load any worlds, it freezes every other world load. The audio crackles, latency goes crazy and glitching all over the place anytime I can hear another soul breathe in the same world as me... this games all\nAbout socializing and as soon as you socialize the game lags and majority of the time freezes the game and sometimes the whole quest itself.\nIve resolved my Boredom by sniffing glue.\nPlease sort this.\n\nHelpful | 0", "iFyberDec 29 at 10:08 AM\nGreat! One issue...\n\nI love VRchat, and having it on the Quest is amazing. I can play with friends where ever its safe and wherever theres internet connection. I can play at home or at a friends house! My one issue with this game is the avatars. Theres certain times where you have to manually activate peoples avatars to show, and since the game is cross platformed, you cant see any PC skins. I know its to prevent straining the Oculus Quest since its basically running off specs from a smartphone, however I feel like there could be some way of making this work so everyone could see each others avatars. A lot of my friends on VRchat only play on PC, since they dont have a VR headset, and now I cant see their avatars unless I play on PC. If theres anyway to let us Quest users finally interact properly with PC users, thatd be awesome!\n\nHelpful | 1", "UltraMasonJan 4 at 6:26 AM\nBrilliant with a few bugs\n\nVrchat is a great game-helping me quite alot with dealing with social anxiety. The community is very friendly and i find myself playing games like murder mystery 2 or 3 for hours. Would be 5 stars if the loading screens were not as laggy as they are. Overall great game\n\nHelpful | 1", "XRobertEXEJun 26 at 6:43 AM\nHOW DO I USE IT\n\nHOW DO I USE IT?\n\nHelpful | 0", "CycomeFeb 15 at 5:13 AM\nKinda\n\nI guess its fun, but I cant see peoples avatars and the menu map and avatar picker is too sensitive it wont let me choose.\n\nHelpful | 1", "scottrocket3Jan 17 at 10:21 PM\nGiant Red Avatar Sucks!!!\n\nSo I am playing this fantastic game/chat which I would love to give 5 stars to but I can't and here is why >>>> Please GET RID of the GIANT RED ROBOT Avatar I am also trapped in this huge pointless Avatar like others who complain about it. GIANT RED ROBOT Avatar DOESN\"T LET ME CHANGE NO MATTER WHAT BUTTON I PUSH to a smaller easier to use more socialize Avatar with my Oculus Quest to any other Avatar my screen name is scottrocket3. Major Bug Major Glitch ? Get Rid of it please it ruining this VRchat I would report it but so far I have no way to do that either. Big RED Robot Avatar is more like a virus then an Avatar please Help erase it off my account. To the developer this avatar I am talking about crippled my VR Chat account as I am new to VR Chat as I was learning VR Chat features. If you can fix this problem I will give this game 5 stars.\n\nHelpful | 3", "PortGrYTJun 18 at 7:04 AM\nSo I played it and it's great\n\nIt was A blast I met so many people I had a good time\n\nHelpful | 0", "ectolingJan 23 at 10:44 AM\nIncredible fun!\n\nThis game is very fun to play,with strangers or friends, but I cannot see pc skins and u get into world's that are full of em , but it's a good experience overall \n\nHelpful | 1", "Sidx21Dec 30 at 12:23 PM\nCreepy environment\n\nThe game gets three stars because when they are used the mechanics work well, but being on the quest there is really only one or two actual games. And most of the community is made up of perverts, furries, kids and the occasional drunk.\n\nHelpful | 3", "yeet_maleetFeb 10 at 6:26 PM\n\nI love this game the only problem is you need a computer for some avatars and worlds\n\nHelpful | 0", "KorvuDec 15 at 10:30 AM\nA solid port with some notable caveats\n\nVRChat's been out on the PC for a while, and considering the Quest port is essentially running entirely off of a modified version of android and it's still cross-system with PC players, it's overall pretty impressive that the game works without too many compromises. The biggest issue stems from those compromises.\nIf you've played VRChat on PC, you might have noticed that worlds and avatars in the file browser have \"PC\" and \"Quest\" indicators on them. Only avatars with the Quest indicator on them will load up properly when you're playing, they're essentially less detailed models that are designed to render better on lower-end hardware. If you encounter a PC player using a non-Quest compatible avatar, they will instead appear as a brown robot. You can still interact and talk with those players like anyone else, but they'll stay as the robot unless they happen to change to a Quest-compatible model.\nThe VRChat Devs have been trying to encourage players to re-do their models to make them Quest-compatible, but most people haven't bothered. What this means for you is that most public areas will often be full of brown placeholder robots. This isn't a deal-breaker since you can still chat with them, but it's still a big disappointment since the avatars are a big part of the game.\n\nHelpful | 4", "Trotamundos_2Feb 18 at 8:40 AM\nPC verison is better\n\nYou can bet you will not see about 75% of the avatars\n\nHelpful | 1", "PopularGamesJan 17 at 9:00 PM\nAmazing\n\nThis game is amazing. I have met new people and have became friends with new people. The only complaint I have is the lack of Quest avatars. But overall one of the best games I have ever played.\n\nHelpful | 3", "PrideHunterFeb 20 at 8:52 PM\nPc avatar not seen able\n\nThat one problem that never solve the avatar pls make it seen able\n\nHelpful | 4", "RevokedOathJun 23 at 10:10 PM\n\nOn PC vr chat is great but on the quest it either doesn't load properly or it crashes.\n\nHelpful | 0", "tyetyethegreatDec 25 at 10:25 PM\nNeed to add more\n\nThe game is great I been having a lot of fun but I can see people if I enable it but I want to make my avatar or clone from pc like that takes a lot from the game so I get bored but still good game but if you read this please try to add more avatars or let us make one or try to clone from others all Im asking\n\nHelpful | 2", "SPARR0WWDec 27 at 12:01 AM\nIts alright, but it is free.\n\nIve played this game a bit and it was alright I really got bothered by the fact that I couldnt see peoples avatars. If the devs could hopefully in the near future fix that then this game would be a solid 5 stars for me, but other than that and the spikes of lag then its pretty good and addicting.\n\nHelpful | 0", "christle.leeJun 27 at 11:25 PM\nIt keeps on blinking\n\nI signed up and logged in but the screen keeps on blinking\n\nHelpful | 1", "buzzin247Feb 13 at 9:46 AM\nGreat but\n\nKeeps lagging and crashing please fix\n\nHelp\n\nHelpful | 3", "grey_manJun 22 at 5:38 PM\nUgh\n\nVideo didnt have any Uganda knuckles\n\n\nPS: srry\n\nHelpful | 1", "Kyler6255Jan 16 at 10:56 AM\nGreat game but not very quest friendly\n\nI love this game and Ive made a lot of friends on here but if a pc/other version platform doesnt have a quest friendly avatar, you can see them. This is the same thing for worlds.\n\nHelpful | 0", "buddyboy10Nov 7 at 6:54 PM\nFix PC avatars and worlds\n\nSome users cannot see other PC users unless its quest supported and us quest users get bullied about thatI wish vr chat was less toxic And some world we cannot join because it is not quest supported I think the game should try and load PC avatars\n\nHelpful | 30", "CosmicOasisFeb 17 at 3:49 AM\nVery addictive\n\nThe game is very addictive and every time you play something new happens\n\nHelpful | 2", "xXHeyItzKiaraXx-Jan 25 at 11:47 AM\nExperience\n\nEverything in Vrchat is absolutely wonderful, but on the Oculus most of everybody looks like a robot. I can't even draw.\n\nHelpful | 2", "kodaman04Jan 18 at 3:10 PM\nI have question\n\nGreat stuff but I have this problem where other people are not like characters they are just like robots? With a picture of there character on the front is it possible to change this?\n\nHelpful | 1", "S_Rated_GhoulFeb 27 at 11:57 PM\nGreat game, few issues...\n\nI have made loads of friends on this game and we go to different worlds to mess around but a lot of the time the game crashes and sends me to my home world, can this be fixed please? I don't mind if it helps to have a graphics setting to lower the quality.\n\nHelpful | 1", "ButtEater69Feb 15 at 1:37 PM\nEvery world I go in Is full of pcplayers\n\nEvery world has pc players that I cant see and like 1 quest player update this game so we can see every avatar I dont know why this option is not available in game to begin with fix this game\n\nHelpful | 1", "GreeneboizVRFeb 1 at 10:03 AM\nIts a good and fun game\n\nYou can be whatever you want in the world but some of the setting are a bit confusing\n\nHelpful | 0", "cyclone018Jan 19 at 5:02 PM\nVRCHAT...\n\nI love the game and its good for what its worth. PC players: absolutely no problem whatsoever. Quest players: a semi-decent experience. The integrity of the game is there but you barely see any avatars (even some of the quest ones!) And the game constantly crashes itself. The stability to the vrchat servers are a bit choppy from time to time (probably just me). Sometimes, I cannot even get into the game and sometimes makes people nauseous to the framerates (about 30-60 fps) anyway, the game is there, its just a semi decent experience.\n\nHelpful | 2", "Cloudyyyy01Feb 12 at 8:20 PM\nVrchat wont load??\n\nIt worked at first and then the next time i played it the screen would just flash on and off and it would never load in\nso i redownloaded it and it worked for a little bit then the game crashed :(\n\nHelpful | 1", "itzphantomzzzMay 14 at 10:54 AM\nAmazing game!!\n\nI like the different customizations that you can do and how many different worlds there are to choose from. There is plenty to do in this game that you might have never heard of. Amazing!!\n\nHelpful | 0", "PhaloDec 12 at 6:17 AM\nIts great for people to enjoy on Quest\n\nEven though people are complaining about not being able to see PC content, VRChat on the Quest is still very good for people on the go. I have still been able to get a lot of friendships with PC users while I am on the Quest, and have a great time. I understand it is pretty wired going into a room with a bunch of PC players, because you cannot see them, but I was still able to have a great time socializing with them.\n\nHelpful | 2", "JustNormanJan 15 at 12:14 PM\ngreat game but needs improvement\n\nplease fix this issue when i load up its like my camera on ever character is like 10 inches from my face so i cant really see my hands also could you add a camera to the game for quest\n\nHelpful | 2", "EpicMonkey.JPGDec 26 at 5:48 PM\nLoved, but missing something\n\nWhile I know that because of the system's removal of wires, it has less space for huge graphical content to appear, I'm deeply saddened that not all characters can appear. I, personally, fully understand world changes, but the characters are a big part of the game. If all characters could appear, I would rate it a perfect 5. Even if they had to go LOWER for the characters, I would love the game more. It's good, but isnt its best.\n\nHelpful | 1", "jtk_10invrJan 23 at 5:14 PM\nLove\n\nI love this game so much \n\nHelpful | 4", "kenichikung36Jan 16 at 3:29 PM\n\nWhy? I cannot see another avatar and some map I see everything is white in the map.\n\nI want to see another avatar please.\n\nHelpful | 0", "ricky.ratty.3Feb 16 at 8:39 PM\nFriends disappearing\n\nMost of my friends old and new just disappeared an hour ago. Fix your game please. A social game should at least have a functional friends list.\n\nHelpful | 0", "Mark-BlissJan 26 at 8:40 AM\nNot that great\n\nVR chat has some really great graphics but what I found is I have ventured around is its filled with little kids who are cussing terribly bad and chasing other little kids around harassing them it just wasnt something an adult could enjoy\n\nHelpful | 2", "msLittleNuriaDec 13 at 10:16 AM\nA little issue from me I am having..\n\nThis game is pretty great and New games are being uploaded But i am having a small issue me and TuskLawyer576 cant friend each Other and sometimes he enda up getting blocked even tho i didnt press on the block button but yeah thats all but please try to fix this bug\n\nHelpful | 0", "tgeorge01Mar 16 at 9:11 PM\nGood\n\nNice app\n\nHelpful | 0", "NoobmanGamingFeb 17 at 3:54 PM\nthe game is good\n\nThe game is good but you need to add pc things\n\nHelpful | 0", "Reaper9201Jan 5 at 5:50 PM\nIts fun but has problems\n\nMy biggest problem seems to be it crashes to easily. I just got an oculus quest and this app is the only one that repeatedly crashes for me\n\nHelpful | 2", "grumberDec 5 at 6:13 AM\nTrash\n\nThere are barely 2% of VR players. Everything is buggy and you can't see avatars on quest. Nothing to do here. Also beware of bot farmers who can ddos and drop your network so you'll have to call your internet provider to fix hosting. Literally do not recommend to anyone.\n\nHelpful | 13", "Damienmc2Apr 15 at 9:02 AM\nGreat but...\n\nI love this game I got it yesterday I thought it was very good but it just crashes a lot might not for everybody but still a good game\n\nHelpful | 0", "DatmanzJan 22 at 3:27 PM\n5 stars\n\nIts really cool to be able to go to worlds with your friends and just hang out.\n\nHelpful | 2", "Valhalla_95Jan 19 at 6:48 PM\nVr chat\n\nIt's so awesome to get to communicate with so many people and have a heck of a good time\n\nHelpful | 2", "MatthewNerd2017Feb 1 at 7:37 AM\na great game!!\n\nthis game is really fun it takes a little while to get use to the controls but it's still fun!!\n\nHelpful | 1", "StatSk8r4Jan 14 at 6:19 AM\nBest game ever and funny avatar!!\n\nThis game is the best because the virtual world of the game and funny because of the avatars in the game to!\n\nHelpful | 2", "cmbeers10Jan 2 at 5:50 PM\nBig problem\n\nThe experience in vrchat on the quest is great its every thing I hoped it was except not being able to see PC avatars to use PC avatars\n\nHelpful | 5", "ExozackDec 28 at 3:13 AM\n\nI have the game I made a account but It wont work I click it nothing happens I logged on and done what it said and it wont work I did the I'm not a robot\n\nHelpful | 0", "gumdwopsDec 24 at 8:46 PM\nBad graphics\n\nOk so I recently got a VR headset and I decided to try it out with VR chat, but for some reason everything looks a bit grainy/staticy and its hard to see. Ive tried adjusting my headset and nothing worked, I use Oculus quest.\n\nHelpful | 1", "FredmoreDec 27 at 7:36 PM\nI love it but\n\nCould you maybe add an option to change your voice cause theres a lot of people like me or at least a good handful that would rather not use our real voices so if you could make a setting to make a voice higher pitches or deeper that would be epic god thanks!\n\nHelpful | 7", "tinybutdeadlyJan 18 at 7:15 PM\nBest place to make friends and laugh\n\nIts the best game I ever played! The only complaint is its sorta laggy.\n\nHelpful | 2", "DJEmergencyNov 21 at 11:46 AM\nVRChat and Quest are not meant to be...\n\nUPDATE: Its now in a great state! Works almost perfect on the Quest!! This is truly a compliment by the developers! 4stars!!\n\n\nVRChat is suppose to be a fun experience for anyone to enjoy social activities with other people, but I find it to be unpleasant to my eyes and senses. People that get VR sickness should stay away until they fix the problems it has! The times it would freeze randomly it would make me want to vomit all over myself.. The Windows version claims it can run on a GTX 970, but I beg to differ that you would need at least a 1080 Ti or higher for it to run near 60fps during crowded places. On the Quest if youre in a world with more than 3 people be prepared that the frames drop significantly and your eyes will bug out seeing other peoples avatars jitter. There are comfort options that you can choose from which would be useful to people like myself but its pretty much useless, because of its performance.. When this app was first available on the Quest it had a comfort rating to be comfortable. I guess with all the jittering Oculus had to change it to intense due to others complaining about the problems. I completely understand that some avatars and worlds are not accessible on the Quest, because it doesnt have the horse power behind it to run them. Those that complain about it doesnt understand how hardware works so they tried the best they could to bring the experience here. The thing is though.. It still has a lot of problems for it to work smoothly.. VRChat is an unoptimized mess for Windows and its even worse on the Quest. When the developers released this product on PC they shouldve put in limitations for how many polys and particles custom avatars and worlds can use. This is why it has its issues today. On PC there are users with different specs. Some have very powerful and expensive parts while others are on a budget. So when they try to cram the game into a device like the Quest people wont be pleased by the outcome.. Anyway... let me get back to the Quest.. Ive had maybe 3 hours of messing around with this since the Quest was released and sure every update it gets better, but not by enough. Today was a great example for how unstable this app can be.. I played it for 30 minutes and it crashed on me 3 times! Why is it that AltSpaceVR was pushed by Oculus to be more optimized (Even though it runs so much better than VRChat) while this gets released with the issues it has?! It clearly makes no sense to me... for how unoptimized this game is.. they really need to start from scratch and rewrite it from the ground up.. Anyway.. Oculus if you can read this.. Please get on top of these developers and push them to make the experience better.\n\nHelpful | 7", "idontkn0wNov 30 at 12:22 AM\nIt's good but its not perfect\n\nIt's great except for the fact almost all avatars and servers are unavailable for quest so you can't see those avatars and you can't use those servers but still it's pretty good for arguing because the people on vrchat are absolutely toxic towards quest users\n\nHelpful | 2", "fabotheafroMay 21 at 12:01 PM\n\nI LOVE vrchat :D\n\nHelpful | 0", "cheese1234567Dec 26 at 4:13 AM\nIts pretty good\n\nThis is a game I wanted for a while I finally got the chance on cristmas day the only downside is that I signed in with oculus and I cant access custom avatars in other words this game is a must buy\n\nHelpful | 1", "KirigayaMarcDec 22 at 10:26 PM\nReally Great Game\n\nReally cool and amazing for free but could use a lot of improvements but I'm glad it's here than not being here at all\n\nHelpful | 4", "AmericanGooseNov 4 at 7:58 AM\nPoor Game on the Quest\n\nSure, on VR Chat Oculus Quest you can still have the full online interaction experience. But still more than 80% of users are playing VR Chat on their PCs. Therefore, any external skins, worlds, or even in some cases, players will not appear. I would love to see an improvement on the Oculus Quest version of this game with cross platforming with the full on experience. I used to play this game on my computer on the Rift when this game first came out on steam. I loved it with all my heart! It was a great way to make friends, play with your friends, and even my siblings who live in different states. One day my rift stopped working. For a couple of months, I decided I would want to sell my PC to once again play this fantastic game with my siblings. But when I was excited to reunite with my brothers, I realized that I would be entirely disappointed. Both of my brothers were the default avatars, and I also couldnt join most of their worlds.\n\nSo VR Chat, if you could improve performance on the Oculus Quest, that would be great. Thank you for reading this, and Quest users, please consider my experiences.\n\nHelpful | 16", "12inthehellcatJan 5 at 1:02 PM\nGreat game, cross compatibility problems\n\nI love VRChat, and after playing on PC forever, I got it on the Quest. I am extremely disappointed with the amount of unloaded PC avatars and hope that there will be more ports soon, everyone looks like a test dummy for Quest users (depends on avatar).\n\nHelpful | 2", "IMRAJSAN02Dec 25 at 12:22 PM\n\nI really love this app. But I think that the quest players should be able to see any avatars and use any avatars. The quest players are missing out\n\nHelpful | 3", "FishRatJan 12 at 8:21 AM\nHelp\n\nI've seen great things about this but I can't create account it keeps not doing anything when I press create account even after I put my information in. If anybody knows how to fix this please help\n\nHelpful | 0", "EniclythJan 16 at 6:36 PM\nNeeds an Update\n\nLet us See Pc avatars but hide the particles we hate how we only see robots\n\nHelpful | 1", "kingofmath12May 8 at 5:36 PM\nCant even play\n\nWhalen ever I try to create an account it says unknown error occurs I do not recommend it \n\nHelpful | 0", "world-o-hurtDec 16 at 2:26 PM\n\nSo I love the worlds in game but I dont now how to make it so I walk with my character I see it walking in front of me need help\n\nHelpful | 0", "MineYourBeesWaxJan 13 at 3:37 PM\nGreat game but\n\nI cant search and it wont let me enter any worlds and just takes me to the tiny floating hub area\n\nHelpful | 1", "Mrlizard06Dec 27 at 10:15 PM\nWhen next up date\n\nI cant see pc Avatars that is a big broblam cuz my friends play pc and they use pc avatars and for me there are robots. Sorry for bad spelling Im dyslexic\n\nHelpful | 2", "TwelveGag3Dec 25 at 9:23 PM\nPedo\n\nA 31 YEAR OLD GROWN MAN WAS A CHILD RAPPIST ON THIS GAME\n\nHelpful | 10", "Nightshade518Dec 28 at 11:29 AM\nPerfect game\n\nHey its the best fun I ever had and I made some of my bestest friends on this so this game is absolutely amazing thank you for making this game\n\nHelpful | 3", "ImgoinginsaneDec 18 at 8:42 AM\nPlease fix this bug\n\nI just started on the quest and all the people in vr chat well most people on vr chat have the default skin but with the picture on there chest what skin they put on its only people with other quest or vr headset I can see with a skin but could you please fix this thank you for your time.\n\nHelpful | 4", "HalfShadow000Jan 10 at 4:45 PM\nHow do you get a camera\n\nIm on oculus and I noticed there is a camera but why dont I have it?btw besides that its great!\n\nHelpful | 1", "FalcoLombardiTMNov 6 at 9:49 PM\nNeeds fixes, but an otherwise good game!\n\nI never really liked playing VRChat until I got the quest. For a couple of weeks now, I've been playing this for 1-2 hours on average. I've noticed a couple of problems with this game so far.\n Randomly disconnecting from servers happens, even in private ones\n Microphone pops from time to time\n Camera can \"dehinge,\" and cause you to redraw the guardian field, but not after a stomach-turning few seconds of being in an awkward spinning kind of motion\n Friend's servers don't update on the social menu, leading to a guessing game if you two were in a different server than what server they're supposedly \"currently\" in.\nOther than these flaws, this game can be almost perfect when these are fixed. I'd definitely enjoy this game more with them fixed.\n\nHelpful | 2", "MasonexeNov 25 at 4:47 PM\nActions\n\nI actually love this game so much, I own the quest and so I dont have full body tracking, So sadly I cant lay down in game, some of my friends use pc so they can, and so sometimes it kinda looks awkward at times.\n\nHelpful | 0", "Devin427May 16 at 12:33 PM\nLogin\n\nYour month category is off\n\nHelpful | 0", "OinkOinkPiggyGoJan 19 at 6:59 AM\nWont let me create an account\n\nIt wont let me create an account. I click create account but when Im done and click the done button it does nothing.???\n\nHelpful | 0", "sIkekidimaduckDec 24 at 1:19 PM\nYour mom\n\nYour mom Your mom Your mom Your mom Your mom Your mom Your mom Your mom Your mom Your mom Your mom Your mom\n\nHelpful | 11", "DrainedGalaxyApr 17 at 6:28 PM\nSad\n\nOnce I try to load into the starting world it just shows the loading dots then the background flashes black... I don't understand unless I'm doing something wrong\n\nHelpful | 0", "A-yzNov 30 at 10:59 PM\nPc avatars\n\nUnable to see the PC Avatars takes away a lot of the fun\n\nHelpful | 5", "ItonjawzJan 9 at 2:15 AM\n\nBest way to make new friends online very funny and social definitely downloaded it\n\nHelpful | 0", "jamussJan 5 at 7:37 AM\nGreat game to socialize\n\nI have met many friends and created great memories while playing VR chat. I highly recommend it\n\nHelpful | 0", "xXPillowyXxFeb 14 at 5:41 PM\nOh my God wow\n\ngood\n\nHelpful | 1", "Verified_LoserOct 5 at 11:55 AM\nBare bones experience\n\nVR Chat seemed like it would be a fun game to play for hours on end, meet new people, worlds, ex. But YouTubers make this game seem like youll have a blast, unless you use a Quest. I dont know if its my internet or the developers but this game SUCKS! Why? There is nothing! To! Do! Lets start off with the worlds. 1. Most dont work; some wont even attempt to load 2. If by some miracle a world does load youll notice your next problem, and thats how empty the worlds are, every world I join I suspect to them to be filled with people who have interesting personalities and characters models, but no. None! Of that is in any of the worlds, unless you are in a popular world 6/10 times they will be completely empty. And now to the next complaint; Online. 1. You cant see anyone, what I mean by this is you cant see anyones player model (which is a joke since in their promotional video they show all the fun and weird characters you can see across platforms, but thats a straight up lie) instead what youll see is the grey default robot avatar with yellow tape around it saying error, in every single world I go I see nothing but the error robot, so all the cool and interesting characters I could see, are all replaced with this boring error message. So all in all the developers just didnt even bother to make VR chat a good game to play on the Quest. I wanted to experience all the fun those YouTubers show on their lets plays but on Quest its just nonexistent. Yes I know this game is free, but you have to make it somewhat enjoyable! Not just give us a bare bones experience with nothing to do! And I doubt developers even care about this port so I know none of them will read it because why would they fix this game when they can just work on better updates for the rift and pc? All in all dont get this game, because just like Fallout 76 this game is a glitchy, forgettable, experience, the developers dont wanna improve.\n\nHelpful | 29", "Llama10Mar 11 at 1:25 PM\nTrash\n\nPeople bully you if your a deafult and its weird\n\nHelpful | 1", "TylinaJan 8 at 8:18 AM\nPerfect\n\nIts great to meet great friends and hang out with friends.\n\nHelpful | 1", "ItsAWeabooKannaDec 26 at 9:55 AM\nI Love It\n\nI Have Played This On Pc Before, I Have A Problem Though. I Log In And I Am Stuck Glitching Between Two Worlds IT WONT STOP\n\nHelpful | 1", "memehub.comDec 29 at 12:56 AM\nYes\n\nYes\n\nHelpful | 2", "TheTwoWibblesJan 23 at 6:11 AM\nDont really no\n\nThe game is dead if you got it just delete it\n\nHelpful | 0", "virtualytDec 5 at 12:07 PM\nWish you could have pc things aswell\n\nIts good but the whole quest and pc thing sucks\n\nHelpful | 3", "wolfieboy11Jan 2 at 5:58 PM\nHelp\n\nMy oculus well not install it\n\nHelpful | 1", "cardflipperDec 26 at 8:27 PM\n\nI love this game a lot also this may sound weird but its a like a second home to me lol\n\nHelpful | 2", "NaxxremisNov 24 at 3:49 PM\nTurd\n\nThe Quest version is boring becuse it can't even load anyone's avatars so everyone is the same default grey robot.. What's the point\n\nHelpful | 7", "victor_maiseyDec 26 at 12:44 AM\nDude\n\nThis game was s so sick, I made like 6 friends, and I met them in real life!! Good game!\n\nHelpful | 2", "bbwells08Apr 10 at 3:04 PM\nCrash\n\nFor some reason I cant play,every time I get in the game it keep crashing. Im very upset because Im sure its a great game.\n\nHelpful | 1", "anonimopcSep 13, 2019 at 8:43 PM\nQuest problem\n\nI would like them to show all the avatars, that certain avatars are not seen to have greatly ruined my experience, since in certain games like murder when not seeing the size of the avatars many times you cannot kill them with the knife or the gun, I would like that will fix that, also about not being able to enter some worlds because he is not admitted to quest\n\nHelpful | 20", "LukeBlockwalkerJan 6 at 7:17 PM\nAwesome\n\nMet one of my best friends on here!\n\nHelpful | 0", "brittany.cain.Nov 23 at 11:49 AM\n\n\nI thought that i was going to be able to see all the characters but when you on Quest you can only see a little bit of characters\n\nHelpful | 2", "Blue_eyez1217Jan 4 at 10:38 AM\nTerrible\n\nVr chat is terrible on the quest you lag way to often and freeze rec room is so much better fix your game\n\nHelpful | 3", "alex_glz97Dec 7 at 11:58 PM\nToo many annoying hackers\n\nThere seems to be no way to report cheaters or hackers\n\nHelpful | 2", "TootleboiDec 25 at 8:46 AM\n\nIt takes hella long to download\n\nHelpful | 1", "LakaChanDec 17 at 9:52 AM\n\nI wouldn't recommend this for quest because for me it's really annoying to not be able to see PC content especially the avatars. But otherwise it's probably great\n\nHelpful | 2", "agentgameing89Dec 27 at 7:48 PM\n\nAmazing game.... I really recommend!!!!\n\nHelpful | 0", "bean423Dec 27 at 1:07 PM\nCant get it to work\n\nIt keeps on saying that i cant connect and to check I have a internet connection then restart the game\n\nHelpful | 0", "Also_Cactus_manJul 24, 2019 at 4:21 PM\nNo PC avatars\n\nI've had this game for a while and I don't like it so much because quest users are not able to see PC avatars. This is a total downgrade and I know it would be possible to see these avatars that make the game even better. So please oculus, let us have fun playing the game by letting us see the PC avatars.\n\nHelpful | 146", "agustincurbelo04Dec 3 at 6:26 AM\nIts actually fun\n\nI was new to VR and i saw this game out for free, i played it and it was actually fun people are funny in it and i had a good laugh\n\nHelpful | 2", "gameboy1020Jan 10 at 3:40 PM\nYes\n\nYes\n\nHelpful | 1", "Taronjr90Jan 2 at 6:24 PM\nWhy\n\nWhy it wont work for me I have kept trying it still dose t work\n\nHelpful | 0", "Vr_-_Ready.Jan 2 at 2:22 AM\nFun to chill/explore\n\nYou can meet people from all walks of life and have some fun. Just a little limited with skins.\nAbout half of skins you can see in the quest/pc portals.\n\nHelpful | 0", "zxshadowDec 12 at 12:15 PM\nYooooooooooooooooooooooooooooooooooooooo\n\nLove it yoooooooooooooooooooooooooooooooooooooooooooooooooooooooooo\n\nHelpful | 1", "ChrisbbaconboiDec 30 at 9:43 PM\n\nThis game broke my oculus quest and I cant get it to work\n\nHelpful | 1", "wyattduppongDec 8 at 7:11 PM\nCreepy\n\nThe people...\nThey're...\nThey're scary\nHavnt played yet\n\nHelpful | 1", "SoggyCowNov 18 at 4:10 PM\nExcellent experiences!\n\nThere are always MANY people to talk to. Great community, wonderful trolls, haters, and pervs. Awesome !\n\nHelpful | 8", "nickrick2099Nov 30 at 6:15 PM\nUpdate\n\nI like the character selection and I love the multiplayer platform but I wish I could see PC players avatars\n\nHelpful | 1", "toastdeSep 19, 2019 at 7:22 PM\nWhats Going On?\n\nSo I love, love, and love this game, is so fun to meet new people and just to play around in general and yes I do understand that most avatars cant be seen and yes I understand that thats for a reason and its still a very fun experience but I have found this bug? Or something? So I booted up the game and I noticed that instead of just the casual old picture of the unreadable avatar or perf blocked everyone was an Error, just a yellow robot that says error and I have seen it before but everyone was just an error and I know for a fact that I could at least be able to see some but I went into 3 worlds and it was all the same thing, the only avatar I saw was a banana avatar that was a public avatar that I could normally see,\n\nHelpful | 3", "CerberusWarDog5Dec 14 at 5:37 PM\nGood\n\nGood game. crashes a lot\n\nHelpful | 1", "stayfrosty754Dec 6 at 5:42 PM\n\nPlease fix it\nBecause I cant see anything only I see is robots fix it\n\nHelpful | 2", "ValaventDec 29 at 6:10 AM\nBoring\n\nRobot n robot\n\nHelpful | 1", "gabriel280391Nov 11 at 5:39 AM\nAmazing app\n\nI was sceptical about it but in the end i fall in love with it, still need some updates to make it perfect but this is just a beta.\nThanks to creators for such a amazing app.\n\nHelpful | 1", "BabyYoda69Dec 25 at 5:29 AM\nMemes\n\nBest memes on here baby yoga Kermit and funny YouTube creators like mully and joshdubs\n\nHelpful | 1", "logbuzzYTDec 25 at 1:30 AM\nCan't login with oculus\n\nWell this is a shame....\n\nHelpful | 0", "doinyamom989Nov 29 at 7:46 AM\nWhat the heck?!\n\nEVERY SINGLE TIME WITHOUT FAIL WHEN IM THE MURDERER SOME STUPID GARBAGE HAPPENS, I either get killed INSTANTLY when I dont even raise any suspicion , I FALL OFF THE MAP, OR THE HOST RESETS THE GAME!!! I HATE THIS GARBAGE OVERRATED GAME\n\nHelpful | 1", "provinguserNov 23 at 12:24 PM\nProblem\n\nMy hands keep getting stuck on my bony when I put the out\n\nHelpful | 1", "RuffAsToastSep 11, 2019 at 6:02 PM\nFun interactions and people but lacking\n\nI've met some cool people however most of them look the same, robots with their avatar picture displayed on their chests, I'm not sure if the ability to see other peoples custom avatars will ever become available but if not then that is a huge shame. I have also crashed a few times. If I can become a WoW dwarf then this game will be a 5. But I somehow think the quest version will always be lacking in features, I hope I'm wrong.\n\nHelpful | 3", "Clumsy24Sep 22, 2019 at 2:57 PM\nWeird softlocks\n\nThe game is great... when it decides to work. When I logged in today, I noticed it gave me a blank screen when it finished loading into a world. It soft locked my game. I uninstalled and reinstalled it and it worked again for a few hours. I tried logging back on just now and after it finished loading In my account, the background of the logging in screen stayed, softlocking my game again. This needs to be fixed. I will put a fifth star when the game has less softlocks.\n\nHelpful | 0", "BlackCobra170Sep 30 at 9:21 PM\nDisappointed\n\nSo this game barely works with the oculus quest, quite disappointed. 90% of other people you play with you cannot see, didnt think it would be that hard to make customs skins and such work with the quest but the game clearly shows there was laziness from the developers.\n\nHelpful | 10", "HotHead2006Oct 12 at 7:26 AM\nLove it but\n\nI was waiting for vrchat to be announced and when it was l bought it straight away, its good and l love it but the only problem is that l can't speak (my mic is on and l put mic on in the vrchat settings) my friend said he can only hear me when his with me in a party\n\n\n\n\nHelp?\n\nHelpful | 1", "CoolMedic13266Aug 22, 2019 at 1:41 PM\nTrailer\n\nThis is about the trailer for vr chat on the quest Im leaving three stars because the gameplay but the trailer is misleading it shows lots of stuff that is exclusive to the PC version of VR chat making people think oh wow it's just like the PC version but in reality a lot of it isnt even able to be seen a a pc players Avatar turns into a robot but of course that's not.shown because you have to make sure people download you're game even if its because they expect it to be a lot different then it is which is why I wrote this review so I can say dont show stuff in the trailer that isn't available in game\n\nHelpful | 7", "JoFace5645Oct 1 at 1:10 PM\nGood but here's my issues\n\nThe game is fantastic and I love being able to go and meet new and crazy people, but the skins and stuff not loading can ruin certain things for me and I can assume it there players. Hope they find a remedy for these issues soon\n\nHelpful | 2", "noor.sakaji.1Dec 10 at 7:58 PM\nAdd me\n\nAnyone wanna add me\n\nHelpful | 1", "adyan2015Nov 30 at 3:29 PM\nAdyan\n\nYes its good\n\nHelpful | 1", "HeyMillsyAug 27, 2019 at 8:26 PM\nthe heartbreak\n\nI bought a quest thinking that I could not only hook it up to my pc and free roam but also play VRChat and have fun with all my friends on the game! I got into it and the first things I noticed were the facts I couldnt see any of the pc avatars or join my friends because I was a quest player so quickly I tried to connect my quest to my pc and figured out that doesnt work either. So I wasted my money on a quest when the one thing I wanted to play was VRChat and make videos and stuff this is a truly big upset.. and a lot of people not just me would buy this VR thinking VRChat is the same.. oh yeah not to mention the worlds to load everything in either.. so pleaseeeeee Oculus fix this or make the quest some how compatible to VRSteam!\n\nHelpful | 15", "psully4114Nov 22 at 5:06 AM\n2 words. Login loop.\n\nPlease fix.\n\nHelpful | 8", "DeadBabyTurtleOct 1 at 5:20 AM\nA couple of minor changes\n\nAbsolutely awesome, to me this is the best of the social apps! It seems like there's a big push by many Avatar makers to try and support Quest users, unfortunately many PC users still use PC only avatars. But that's not an issue.\n\nA few things that I would like to see are:\n1.Error Robots (PC only avatars) hands don't move from their sides. Surely hand movements could be tracked to make discussion easier with PC users\n2. Error Robots (PC only Avatars) should scale to the size their Avatar actually is. It's harder to interact with others when they appear at an incorrect height from what they are.\n3. Some sort of explinantion or simplification of settings. (it took me some time to work out how to turn off personal bubble, shield, and change performance to Poor so I can see more avatars)\n\nHelpful | 0", "PineNeedlesSep 25, 2019 at 5:48 AM\nA truly beutiful experience\n\nVrchat is by far my favorite game, its such a simple idea yet truly wonderful. Being able to see your body and arms adds a whole new layer to the immersion and sometimes i thing my in game arms are my real arms and it makes you feel like you're really there. I think the 3d aspect is really well made, everything has a lot of depth and you really feel like youre in these places, not to mention the huge amount of avatars ALTHOUGH it does suck a lot that quest users can't see most of the avatars because i think if you can't see the avatars you can't really interact well with the other person, but of course i understand that the quest just isn't cut out for that. I love how easy and accesible the worlds are and how it takes only a couple of seconds to load in. vrchat is the perfect social vr experience and allows you to really feel like you're standing, talking and interacting with other people, also may i say that becoming your favorite Movie/cartoon etc. Character is truly such an amazing experience, for example for me seeing a character, that i only know from 2d movies and tv shows stand in front of me and interact with me is was truly one of the best experiences ive had in vr, and also most of my other most memorable moments happened in vrchat. I think it truly shows us the beauty of vr and im so glad i live in the time to play it.\n\nHelpful | 2", "TreeGamingProductionDec 24 at 12:53 PM\nIts finally there\n\nI love this and their is such a great community that makes me happy , I have had hard times but this sparks my heart!\n\nHelpful | 0", "HavinceOct 2 at 1:47 PM\nAdd pc avatars\n\nAs most say update so that you can see pc avatars. Even if the choice that you can't PICK them remains I'd be OK with that as long as you could see other people as them\n\nHelpful | 2", "MegaOofNov 23 at 8:11 PM\nCant get in\n\nLogin is completely broken did login 6 times and it says failed to login sad\n\nHelpful | 0", "SofiaQyvalarJul 16, 2019 at 2:59 AM\nA severely limited experience\n\nI was so eager to thrust myself into the amazing worlds that VRCHAT promises. And why not? It's free, after all!\n\nHowever, do keep in mind that the quest port is severely limited. And even understanding where those limits come from, I still think a few things could have been done better to get over those limits.\n\nObviously, the one we all know: PC avatars aren't visibile for quest users. While this is understadable, what I do not understand is why the generic \"floating robot\" that replaces them don't at least TRY to replicate the size, or at least position, of the pc user's actual avatar. Instead they all float at the same generic height, do the same generic moves. You can't even understand when they're interacting with you, their arms and boides are no way connected to your phisicality.\n\nLevels. It seems like a vast amount of worlds are just pc only. Undersandable, again, if it wasn't that most of the userbase prefers using those worlds. The result is that the quest optimized worlds are almost exclusively empty. It's very rare to encounter anyone.\n\nThe cross-compatible levels have some brutal limitations to make them available to quest users. Most props are just removed from the quest end, making for some very awkward interactions. Most props on quest in general are limted, in fact. In number, and in actual functionality. And video players are gone.\n\nThat's right. No video players. Forget doing karaoke, watching a movie together, search for memes, listen to music..\n\nI really cannot understand disabling such a basic social function. Especially considering it works on basically every other quest app.\n\nIn most places, I've met at least one pc user either belittling or outright harrassing quest users. It's easy to mute or block them, but it's indicative of how divided the userbase feels. On one side, quest users trying to find something to actually do (and each other), and on the other, pc users who don't want to compromise their High Fidelity for quest users.\n\nHelpful | 16", "DigitheadDec 22 at 11:33 AM\nAmazing\n\nPerfect in every way possible.\n\nHelpful | 0", "Ravioliboy15Sep 20, 2019 at 11:53 PM\nDont know how to verify my email\n\nWhen I go to my mail to verify my email and click the link it takes me to it but it says do you know this random map. What am I supposed to do there, can you please give feedback on how to do this\n\nHelpful | 0", "ThottyLaneAug 30, 2019 at 9:34 AM\nMost fun Ive had in VR\n\nThis app is great for getting together with IRL friends and making new ones. The custom games are a ton of fun and I find myself getting immersed in them for hours at a time. Only complaint is a lot of the player base is cross platform and use models not optimized for Quest. I dont know what the developers can do about this (if anything at all) so I dont put the blame on them. Just something that bothered me a little. Overall great app and absolutely recommend.\n\nHelpful | 1", "Raby2033Aug 13, 2019 at 2:53 PM\nUpdate are needed\n\nI enjoy the gameplay and interaction with other players. But however there are a few flaws with the game. Worlds that are made by pc developers are not accessible to oculus quest users and also pc users cant be seen by oculus quest users because there avatar and its effects will not load properly. And if that problem is fixed in the future, I would greatly appreciate it. This is to both the developers of oculus and vrchat. But also thank you for the experience you gave me. I hope you continue your work.\n\nHelpful | 6", "vibersDec 25 at 7:25 AM\nYes\n\nOne of the best games out there\n\nHelpful | 1", "Pickl3man99Nov 14 at 7:46 AM\n\nWont download\n\nHelpful | 1", "jeiko.romero.71Nov 30 at 8:21 AM\nGood game gg\n\nI really like the game or chat area\n\nHelpful | 0", "xdkomodoensisNov 9 at 5:07 PM\n\nLove it\n\nHelpful | 0", "laffycattSep 11, 2019 at 2:04 PM\n\nI was disappointed to find that with the quest I couldnt see other peoples costumes. The entire point of VR chat is how diverse it is in characters and worlds. Unfortunately with the quest you cannot see all those things or travel to all those places. You are limited. It really kind of sucks the fun out of it.\n\nHelpful | 7", "Acefighter17Sep 15, 2019 at 8:27 PM\nI like it but....\n\nI really enjoy it but I feel like people with the quest dont get to experience everything we see on YouTube:\n\nHelpful | 3", "Mr.chromosomeNov 1 at 7:37 AM\nNot true cross play\n\nYou can't see PC players avatars and most worlds don't work which is very disappointing\n\nHelpful | 2", "Zimtok5May 20, 2019 at 11:59 AM\nSolid port with some bugs\n\nCharacter models and general performance on Quest are pretty good. The social dimension is thrilling and the only thing holding it back is some main areas dont work well eg avatar pics not loading. Otherwise, a great way to bump into all sorts of crazy people; if thats your thang.\n\nHelpful | 175", "RalphGuyNov 17 at 4:48 PM\nVRchat\n\nWont let me play in vr\n\nHelpful | 0", "Purple_HeartVROct 16 at 5:48 AM\nVRChat needs more anime\n\nWe could rlly need a handfull of new anime avatars ngl\n\nHelpful | 6", "ThegreatzoinksSep 20, 2019 at 9:21 PM\nYou cant see or use pc avatars\n\nPlease oculus, this game will go from a 8 to like a 15 if pc avatars are accessible on quest.\n\nHelpful | 1", "dimplythekittyOct 26 at 7:51 AM\n\nIt's so much more then I wished for\n\nHelpful | 0", "TangashimaSep 18, 2019 at 3:50 AM\nCant get verified\n\nI tried logging in with my oculus account to start of with, but the terms and conditions didnt pop up so I couldnt agree to/ read them, so I tried making an account with vrchat, that got me through less than the oculus account, the verification email never sent and Ive been waiting for about 7-8 hours for it now, and its a shame because I really wanted to play this game\n\nHelpful | 1", "Co-CoNov 11 at 11:33 AM\nBest game ever\n\nJust get it ya wont regret it\n\nHelpful | 1", "RiftWireSep 4, 2019 at 10:23 AM\nNeeds update on Quests\n\nI think PC Users give the Quest Users a hard time. Becquse thry are not getting any wireless PC Oculus VR. I have a few issues that i dont like from ChatVR. Is that it is not anonymous whwn you block or mute somone. Everyone in that group will gang up and harrass you because of ignoring particular person. Mods dont do anything to help. I wish Oculus would update the Microphone on the Quest. It is very statically.\n\nHelpful | 6", "DoomSlayaDudeSep 14, 2019 at 6:40 PM\nNeeds a lot of work, not social enough.\n\nVRchat is called VRchat for a reason, it has to be social and not this grey robot garbage. If youre going to ruin everyones experience separate the pc players from quest. If this were to happen it would benefit both sides in not dragging down pc players with making optimized skins aswell as helping quest players find a few more pals.\n\nHelpful | 3", "Liamkm2004Aug 9, 2019 at 11:43 AM\nOne of the best social games\n\nVr chat is easily on my top 5 vr experiences and does not fail to deliver on the quest compared to any other vr headset. Love the time spent in the game.\nOn a side note: After installing the game I saw that my mic was not working, once I left my friends party and relaunched the application, it seemed to be working fine but wished that the game recognized that I had left the party and automatically turned my mic on.\n\nHelpful | 0", "Legosi-Aug 31, 2019 at 10:48 PM\nIt's ok\n\nThe games it self is amazing just like the people in it, but just like everyone elses review the PC characters really put a damper on the experience (and thats an understatement) and I also see why they are robots but at least make the height promotional to their actual height. Just please try and fix the characters thing if you do you'll have a pretty solid game.\n\nHelpful | 7", "BazooGamingSep 24, 2019 at 5:17 AM\nAlmost no visible avatars\n\nMost of the avatars are just plain ugly robots. This completely ruins the whole experience for me. If everyone looks exactly the same there's just no fun.\n\nHelpful | 3", "PublicDragoniteJul 29, 2019 at 10:50 PM\nNeeds Option for PC Models\n\nI understand the quest isn't nearly as powerful as a PC. However, I would very much like at least an option to try and load PC models. If I crash so be it, I took the risk. As it stands though the game is basically unplayable on quest because it's hard to interact with 90% of the player base.\n\nHelpful | 3", "Braxton0071Sep 27, 2019 at 6:26 PM\nLove the interactivity\n\nYou meet and greet so many ppl from all around the world! One friend met their wife due to this game existing! It's amazing even with the bugs that comes with it.\n\nHelpful | 0", "AffluentPizzaSep 8, 2019 at 9:03 AM\nFlaws\n\nOkay so Vr chat is an amazing experience and you can meet great people on there but when it got porter to quest I was pumped playing vr chat plus being wireless I waoited every day for this game then it was released I downloaded it and was sad to see most of the effects gone then I saw that there was only a few skins the when I got on everyone was a robot and thats not the worst. barely anyone is on everyone bullys quest people its a horrible experience and I get that its free but come on you made this amazing game then gave 2% of it to the quest\n\nHelpful | 2", "PlatMan17Jun 7, 2019 at 3:33 PM\nA new age for VR chat\n\nHaving been to dozens of different social worlds in VR chat on the Quest, I think it's safe to say that Quest owners will find social spaces that are different from the apocalyptically chaotic meme graveyards that YouTube montages of VR chat painted it to be. Several worlds have unique (clunky) mechanics like hide-n-seek, archery, racing and falling to your death, many with some amusingly trippy and surreal aesthetic, in fact, so far the worlds the Quest port and impressively create are easily the craziest part of the game itself. The communities I have butted in on were equally as fun to spend my time with, as so far most players dont play meme songs on full blast, but rather maintain great often memorable conversations almost consistently (mainly the new people with the Quest launch and Vive players) . However, due to VR chats unpredictable nature and numerous Respawn related problems that will hit players visiting worlds populated by PC players, not everyone will get as much out of it as others, but it's free price definitely makes worth a few glances, it is likely changing for the better community wise after all.\n\nHelpful | 416", "KATANAKAOct 21 at 6:41 PM\n\nAmazinggg!!!!!\n\nHelpful | 0", "phillipxsalasJul 28, 2019 at 3:51 PM\nGreat, with some issues\n\nI love this app or game or whatever, its free so I cant be too mean about it. Its fun to use especially when Im downloading other apps and games or just waiting in general. Its a great time killer and you can sometimes easily get lost in the fun of socializing with other players. It runs perfectly fine and looks perfectly fine as well, but here are the issues:\nFor one, its a bit laggy, but its understandable since it probably needs more optimizing. I get my hands stuck in one place sometimes and I have to close the app and re-open it to fix that, sucks.\nAnd one big issue is that every time I enter a room, everyone is muted, Im not entirely sure why or how to fix it, but I have to click on each profile and UNMUTE then which is such a hassle. So hopefully that gets fixed, otherwise, there are no other sound issues. Others hav reported static but I have not.\nIts fun! Its honestly really fun I made a lot of friends and had so many laughs and I would put 4.8 stars out of 5 if I could only because of those issues.\n\nHelpful | 1", "TheFireBall5115Oct 3 at 3:40 PM\nQueued\n\nMy game is queued and it wont unque so Im realy mad some one plz help me\n\nHelpful | 0", "Xdgaming101Oct 20 at 5:00 PM\n\nPretty cool\n\nHelpful | 0", "4qxMay 22, 2019 at 6:31 PM\nThis needs an upgrade soon.\n\nIt's great and all. But... PC Models...\n\nTaking away the models of those who have pc just erases all the excitement in the game. And custom models for quest users too. Barely any.\n\nBut, an update should do the trick. There are many bugs.\n\nThe game is bland without PC Models. Models are what makes the game whole.\nModels.\n\nHelpful | 32", "PanManChan20Aug 25, 2019 at 10:33 AM\nHelp needed\n\nIve been playing this and it crashes after a little while. Is anyone else having this problem?\n\nHelpful | 1", "catfishcharlie1Aug 23, 2019 at 1:03 PM\nHow you move\n\nI dont like the way you move in this game. I love the game but the movement can be more smooth cause it takes way more to move right now the people at be chat should let you move the way in dead and buried 2 that way is so much better.\n\nHelpful | 0", "Scotty813Sep 23, 2019 at 5:18 PM\n\nThe menu should not close when toggling the mute button. Please fix :)\n\nHelpful | 0", "christopherscheibJun 5, 2019 at 1:27 AM\nVR Chat on Quest\n\nI didn't expect that the quest would be so looked down on in the VR chat community. I cant even see half of the avatars, and all of the really good worlds are unavailable. There has to be a better way to optimize performance than just seeing robots everywhere.\n\nHelpful | 13", "GAMER360DTBSep 2, 2019 at 8:29 AM\nFIX THE AVATARS\n\nSeriously this disappoints me to the point a doubt getting a quest fix it please\n\nHelpful | 1", "HurandisJul 5, 2019 at 4:29 PM\nTherapeutic\n\nSo I work from home and rarely ever get out of the house. I wouldnt really say I have many friends outside of my partner, if any. VRChat has opened up a world where I can be social and make friends as though theyre standing right in front of me and thats so priceless. I cant show my appreciation for this app enough. It has helped me overcome my social anxiety by leaps and bounds. When I first started playing I didnt use my mic as I was too socially anxious to feel comfortable doing so, but the past few days Ive kept the mic on and have talked to everyone I possibly can; and I feel great! Its helped boost my confidence and charisma when interacting with people. I love VRChat.\n\nHelpful | 11", "RadiantLobsterJul 4, 2019 at 3:40 PM\nAwesome!!\n\nI got this the day I got my quest and I absolutely love it! I played with my friend but we had to be in a party to talk which was weird, and it says the comfort level is intense, I dont really think so but when you are in walking mode instead of teleport your balance gets all weird and you almost get dizzy i guess but its and amazing game!\n\nHelpful | 0", "witty_username_hereAug 31, 2019 at 8:34 PM\nAmazing\n\nI have been playing a lot recently and have made many friends and have lagged at many things such as reactions and avatars\n\nHelpful | 0", "johnxreedJul 2, 2019 at 10:48 PM\nHow To fix the ERROR for beginners\n\nIf you have attempted to use the app using your oculus quest, but you get an ERROR after clicking on all the boxes. Note that you have to click on the YELLOW WORDS so that you can be taken to their webpage to create an account. After that, return to the vrchat app and this should allow you to login. Its worth it since we need more oculus quest users in there.\n\nHelpful | 0", "4QU4RIUSJun 12, 2019 at 3:59 PM\nOnly one concern!\n\nVRChat is an amazing game/social app that allows you to connect with friends and strangers alike. The worlds are brilliantly immersive, the controls are, for the most part, fluid and intuitive, and talking with others couldnt be easier. However, aside from the minor glitches here and there, theres a huge problem that the Quest version faces: PC avatars. While it is understandable that some graphical elements had to be cut from the game for performance on the Quest, avatars should not be one of them. Rather, at least give users a chance to see custom avatars, even if it means removing extra dynamic bones or disabling certain avatar features. The robots you see instead of peoples avatars dont even line up to where their body parts *would* be. I cant tell whether Im looking at someones face or left leg! So if you ever get to see this, devs, please change the quest version to be a bit more open to less (but still) compatible avatars. Then Id give this app 5/5.\n\nHelpful | 10", "ThebearsniperJun 20, 2019 at 3:59 PM\nOne common complaint\n\nI love Vrchat and I understand having to have limited worlds, but the grey robots really kill the fun for me. The lack of real avatars kills alot of the goofy fun you can have. When or if they change this is when I can truely enjoy the game.\n\nHelpful | 5", "Sleepless_inJul 19, 2019 at 5:18 AM\nvery limited game\n\nI want to enjoy Sinsa map and karaoke. Every map is limited, and PC users are always seen as robots. Its Soooooooo bad!!\n\nHelpful | 12", "DAX_QcAug 30, 2019 at 10:43 AM\nI love VRCHAT but this monstrousity NOT\n\nJust buy virtual desktop and use the original vrchat on pcvr with your quest. Forget this downgrade piece of trash.\n\nHelpful | 6", "CulumbineWasDopeAug 4, 2019 at 2:31 PM\nMy first experience\n\nCharacter looked crouched the whole from playing in a sofa, had no idea where to go, Stole a flying car, had no idea how to fly it, did some barrel rolls Into a mountain, and got harassed by 8 year olds. Loved it\n\nHelpful | 1", "dank.souls.027Sep 10, 2019 at 5:18 PM\nEpic\n\nA must play\n\nHelpful | 0", "Ben_The_YoungerMay 30, 2019 at 3:51 PM\nVery buggy, obviously. But not terrible\n\nI think some possible fixes could include:\n\nWhen a PC user selects their avatar, (if it is not a cross-platform compatible avatar) they should be promoted with an opportunity to also select their secondary avatar for Quest users. Almost all the users I encounter here are on PC and there's obviously no incentive to have them use a Quest-compatible avatar.\n\nAn additional gripe is that often (like 65% of the time) the game crashes during startup. Big bummer, really.\n\nIt's impressive that the devs have managed so well to make the thing work for Quest at launch, but obviously, improvements must be made.\n\nI intend to edit my rating based on the updates received by the app.\n\nHelpful | 5", "GrieverDMay 20, 2019 at 9:18 PM\nGreat App but not the same as PC\n\nIs great is free is VRchat! But not the same as PC Ver. you wont be able to see pc avatar that are no heavy or join worlds made for PC. But you can do pretty much the same as VRchat on PC need improvement but it works\n\nHelpful | 25", "silenttoad0345May 30, 2019 at 5:10 AM\nGreat game but one big flaw\n\nI know that the creators said that you wouldn't be able to play as computer costume avatars but I didn't know they meant they would be so limited.\n\nSome of my favorite characters I can't use because they are computer avatars! Please fix this thanks.\n\nHelpful | 7", "James_FoxMay 23, 2019 at 6:26 PM\nA Good Attempt\n\nVRchat on the Quest was something I had been looking forward to since purchasing my headset. I can confirm that the experience is fluid, easy to understand, and polished. I did experience some slight dizziness from waking with the thumb sticks, but it wasnt overwhelming. However, I was very unhappy to see that almost all of the skins I wanted to use and worlds I wanted to visit were not supported for Quest yet. It was very disappointing to see tons of people with PC exclusive avatars that would not show up at all on my end, and that made my time playing feel limited and restricted. The game that is here is perfectly functional, but the game needs better Quest support for worlds and avatars. Ill have to wait a while before I can say that the Quest port of VRchat will match the PC version.\n\nHelpful | 6", "arod1118Jun 16, 2019 at 6:37 PM\nVRCHAT is amazing!\n\nLoved this game on desktop, if your looking for a cool place to hangout with friends or even meet new ones and have a good laugh at some of the wacky things you see then grab this game. Favorite game for my quest only issue is seince we are using quest as quest users we are nerfed due to the limitations of the headset so the world is not fully built out yet...however time will fix this issue for worlds and avatars becoming available...I would upgrade to five stars if the devs made it possible to still see PC avatars instead of robots with pictures ...just have it give us a nerfed version of their avatars while we wont get to enjoy the avatar to the fullest at least we can see people with full body move their legs and enjoy interacting with somthing outside of a grey robot\n\nHelpful | 0", "ericbazingaJun 18, 2019 at 10:10 PM\nUnoptimized and mismanaged\n\nAvatar limits are super strict (discouraging creativity), worlds crash back to the home world fairly often and some are just unoptimized, the whole game is prone to crashing altogether, not nearly as much content available on Quest as PC, no in-game video player, etc.\n\nI want to enjoy VRchat, I truly do. But VRchat on Quest is awful.\n\nHelpful | 17", "Mango_MerchantJul 30, 2019 at 10:38 AM\nGood only one problem\n\nIts great with friends, but you cant look at a lot of avatars.\n\nHelpful | 0", "DrJamesWoodsMay 22, 2019 at 10:18 PM\nSome technical issues\n\nThe Quest version of the game runs well. It's a bummer not being able to see most avatars as people have yet to optimize ones that can be viewed by Quest player, but you still get the social aspect which I find to be the core of what vrchat is about. I'm hoping there will be a Quest compatible camera to come.\n\nThere are a couple of technical things that I've noticed so far. It doesn't feel like the game is running at 60 frames per second, especially when looking at the other players who seem to be moving below 30fps.. This could cause some discomfort.\n\nThere was a bit of an audio glitch at one point. I joined someone on my friend list. When I was there, I would get static coming through the speakers for some reason.\n\nHelpful | 6", "BattleMaster080706Jun 11, 2019 at 9:43 PM\nIts a very very very good game.... but.\n\nI wish that the PC skins would load on the Quest because the only people that Ive really been able to interact with fully are other quest users. VR Chat is just all about the skins thats why its so popular. You can be literally anything, except when youre on the quest.\n\nHelpful | 3", "Ghost_HatJul 23, 2019 at 4:43 PM\nVR adventure\n\nWow this game gives so many opportunities for the socialists, rp'rs, and creators, this little social game give so many you and hope, all I hope is quest users can see pc avatars soon\n\nHelpful | 2", "FeedMeMemesPlzJun 24, 2019 at 12:22 AM\nAmazing!\n\nI've had this for a little while now and have to say, VRC is AMAZING! New avatars and worlds are added by creators all the time and the people you meet are great! I just spent about five hours hanging out with someone I had just met! We had a blast and spent so long goofing around! Then someone else joined and our group became bigger and we had even more fun! VRC is the best thing I've ever played :)\n\nHelpful | 4", "S0ul01Jun 29, 2019 at 2:43 PM\nPotential but that's it\n\nIt has potential but it's so very far from perfect. Some models load very slowly, some not at all. Textures load in slowly and the frame rate can be choppy too. The social aspects are well done so with a bit of optimization and less crashes, this could be huge\n\nHelpful | 1", "swat1810Jul 23, 2019 at 9:05 AM\nAwesome\n\nTons of fun lots of stuff to do. Users can create there own worlds and avatars. Or just join others. Tons of games to play with friends. Great social platform as well.\n\nHelpful | 0", "LoneRunner907Jul 5, 2019 at 6:18 PM\nFor what it is its nice\n\nNot being able to see most of the worlds and avatars is a bummer and having to downgrade the graphics to work on the quest, but for what it is Im amazed how it can still run without a PC connected to it\n\nHelpful | 1", "Conich16Aug 17, 2019 at 6:43 PM\nSuper pooper cool\n\nSuper awesome\n\nHelpful | 2", "max.raschackSep 7, 2019 at 7:32 AM\nVR Chat gonna be perfect - - >\n\nWell I love VR Chat, it's the best and funniest way to dive in the virtual community. I know VR Chat from the PC Steam version and see it also in YouTube. It's fantastic how you can yoin billions of world and talk with other people's.\n\n\nBut, I wish I can see the costume PC Avaters, it's not available to see them instant with out do something. It will also be really awesome for all Quest User to have a easier way to costume you own Avater in Oculus\n\n\n(to write it short, you will make a great destiny of you make the VR CHAT version, like the PC version for us all)\n\nHelpful | 1", "rionoirbleAug 16, 2019 at 2:42 PM\nLooks and feels too amateur\n\nCharacter models dont load, everything looks hand drawn and rushed.. not the best social platform available by a long shot.\n\nHelpful | 0", "Crazy_SaneJun 2, 2019 at 3:43 AM\nGreat Social Experience\n\nIf you haven't experienced VRchat, you should. Be whoever, or whatever, you want. Explore countless worlds and meet all sorts of interesting people from around the globe. There's plenty of games to play and lots of people to play them with. My only criticism is that it feels like the Quest struggles a little, which is to be expected with such an intricate environment.\n\nHelpful | 0", "NightMonk3yJul 12, 2019 at 6:39 PM\nIts too messy\n\nNice attempt to make the oasis a reality but its too messy. You shouldnt give players the freedom to make there own modes or workds. It just looks to messy game modes should come from the devolopers themselves. And should be simple game modes like Planet Doom, or the beach, climb mount everest with batman. Things like that, players just take advantage and ruin it by making pointless rooms. Its an failed attempt of making the oasis but its not engaging or attractive enough.\n\nHelpful | 0", "CutoffOrc50Aug 16, 2019 at 2:22 PM\nI want more categories of the big ones\n\nBIGGEST THEN BIG\n\nHelpful | 1", "BackSpaceOcuulusAug 8, 2019 at 11:20 PM\nIt's okay?\n\nThe game is kinda boring and half the avatars don't work, just get rec room instead, its way better.\n\nHelpful | 1", "Capta1nHuxMay 23, 2019 at 2:59 PM\nIt's a simplified port\n\nMy VRChat experience so far has been quite enjoyable. There are a fair handful of world's to choose from straight from the hub and many minigames and fun activities to participate in. The lack of many PC world's completely eradicates the meme filled content that filled servers before. Its basically a peaceful VRChat\n\nHelpful | 1", "StripedSpoonJul 4, 2019 at 3:08 PM\n\nI think that it is an amazing experience but I wish that certain skins arent available to people with the quest and thus cam see or use them if they were to add those skins in a later update it would be perfect\n\nHelpful | 0", "xmawesome11Jun 16, 2019 at 11:27 AM\nReally fun\n\nThis is my absolute favorite VR game it is so much fun to socialize with others and play games with them Im not really a fan of not being able to see PC players custom avatar but its still a great game I would like to see updates in the future where you will be able to see these custom avatars\n\nHelpful | 0", "Brandon3pJul 19, 2019 at 11:55 PM\nWas working\n\nIm not sure why but before VR chat would work without any problems now it crashes on me . Its never done that. Very annoying when Im meet new people and joint lobbys\n\nHelpful | 2", "snazzyxpJun 20, 2019 at 5:10 PM\n\nI love this game sooo much. Although the people on there can be a little weird and toxic , I still love the game. I like how I can play with my friends who dont own a VR Headset and we can just hangout virtually! The possibilitys are endless in this game!\n\nHelpful | 0", "shiny6Jun 24, 2019 at 11:10 PM\nGood\n\nGood gg :3 but needs more avatars and worlds for both pc and quest. Other than that its really fun to mess around\n\nHelpful | 1", "A-HumanJun 26, 2019 at 9:55 PM\nLil glitchy\n\nThe game is good and I like it to say the least but it is a little laggy and glitchy but it is still good\n\nHelpful | 0", "FVCEGANGMay 27, 2019 at 11:55 AM\nToo separate from PC\n\nI'd imagine this will change over time, but it's not really fun when 90% of the people are floating PC robots. I'm also hoping Creator's make more dynamic models with funny animations over time\n\nHelpful | 5", "Snake0457Jun 22, 2019 at 2:01 PM\nToo Limited\n\nI was excited to finally get the chance to dive into VR Chat, but this port borders on pointless. 90% of the avatars are PC and wont load, the ones that do load incredibly slow, the interface is lacking, and I often load into servers that claim to be active, but are empty when I load in. Most of my time has been in empty worlds, or ones filled with placeholder PC avatars, which eliminates the entire point of playing in the first place. If they can get this closer to the PC version, it could be great.\n\nHelpful | 1", "supermiles99Jun 22, 2019 at 4:21 PM\n\nIts kind of stupid because when you try to press the create account button it doesnt work\n\nHelpful | 2\nDeveloper ResponseJul 5, 2019 at 12:55 PM\n\nHi, thank you for taking the time to let us know about your issue. We understand your frustration and would like to help. In order for us to properly assist please visit our Help Center at http://help.vrchat.com to start the troubleshooting process. Additionally we have our support team ready to assist as well. You can message them by pressing the \"Click Here for Help\" button at the bottom of the page.", "saiceJul 3, 2019 at 6:39 AM\nWont install\n\nIt says download queued and it is the only thing installing/updating. I installed a larger game that was installed without problem after I already tried installing VRchat. It wont let me cancel the install either\n\nHelpful | 2\nDeveloper ResponseJul 5, 2019 at 12:56 PM\n\nHi, thank you for taking the time to let us know about your issue. We understand your frustration and would like to help. In order for us to properly assist please visit our Help Center at http://help.vrchat.com to start the troubleshooting process. Additionally we have our support team ready to assist as well. You can message them by pressing the \"Click Here for Help\" button at the bottom of the page.", "SupersonicblueMay 22, 2019 at 12:13 AM\nIt's vrchat on the quest!!\n\nThis was the main reason next to rec room I wanted a quest, i love the game and really hope they fix the Karaoke issue where the song never loads and make more rooms compatible and avatars for ppl on pc because kinda sucks if they are on pc with most pc avatars u can't even see em they all look like robots but I assume they will patch most of it\n\nHelpful | 2", "dakota.pendergrass.5Jun 23, 2019 at 6:49 PM\nCan't see avatars\n\nYes my shield was set on none but I can not see any avatars using the quest I can see them while on my desktop tho with the vr quest all I can see is a grey floating robot representing other players hope this is fixed soon\n\nHelpful | 2", "MikkoISJul 7, 2019 at 6:49 AM\nNot for me\n\nThis app has the worst graphics I have seen on Oculus Quest. Straight from the 80's. Empty rooms, super low quality, there is nothing interesting or worth your time here. I tried to kill my avatar by drowning in water but even that was not possible.\n\nHelpful | 2", "vgregory6Jul 4, 2019 at 11:38 AM\nIts....weird....\n\nBut a cool experience.\n\nHelpful | 0", "magicbandzJun 29, 2019 at 10:34 PM\nReview for Oculus Quest\n\nReally want to get into VRC, but the Quest version just seems severely neutered. Want to have fun with our PCVR counterparts but instead we just feel like outsiders.\n\nHelpful | 4", "MaebbieMay 21, 2019 at 6:10 AM\nFinally you can become a cute Anime girl\n\nYour dream can become true as well. Check out the World UKiJiMA once you have loaded in, it is very optimized and a fun Hangout.\n\nHelpful | 6", "UltimateHakaiJul 15, 2019 at 7:37 PM\nCant wait\n\nGetting the quest soon already know its gonna be good\n\nHelpful | 1", "potatocyhJul 10, 2019 at 2:04 PM\nGo game\n\nNo enough players\n\nHelpful | 1", "SynthNekoMay 24, 2019 at 1:58 PM\nPretty decent\n\nIt's very close to the Rift experience. But sad that maps are limited to 50mb and avatars are also limited. Hopefully more will in future updates. But over all works great so far!\n\nHelpful | 1", "SyrusVWolfMay 25, 2019 at 6:13 PM\nDecent. but need some work\n\nI was hoping this would be more like the PC version this does not have the same amount of avatars,worlds and games as I thought it would but as for keeping its social interaction with players its a good place to start for online games\n\nHelpful | 0", "AustinYeetJun 16, 2019 at 9:39 PM\nI love it\n\nIts so great.You can interact with so many people and have so much fun.But I really wish that the oculus quest users could go to all of the worlds and see all of the avatars\n\nHelpful | 0", "MTilleyMay 25, 2019 at 3:43 AM\nA port I didn't think was possible\n\nI think it's a great title, it feels just like the pc version.\n\nI would say, I would like the option to restrict to quest users only so I can see everyone else's avatar (quest support only servers). Sorry if this option already exist and I didn't see it. Though I'm obviously glad the there is cross platform support by default.\n\nThere also seems to be performance issues if you pack a ton of people in one place.\n\nBut for the most part. It's a great port, that frankly, I didn't think was possible.\n\nHelpful | 1", "Shreader87Jun 15, 2019 at 11:44 AM\nBad For The Quest.\n\nVR Chat is something we all are ecited for but on the quest it terrible. You cant use all the skins and half the people are just robots because you cant see the skins they are using. and ita just laggy defiwntly dont waste time getting this\n\nHelpful | 3", "Boo726Jun 20, 2019 at 3:54 PM\nVR chat\n\nUsed the past 3 days love it on the social and avatars aswell BUT they need to fix it so quest users can see pc users avatars .\n\nHelpful | 2", "riverthought32Jun 25, 2019 at 5:05 AM\n\nWhenever I'm playing on vrchat the characters are grey and no one talks\n\nHelpful | 0", "CuppojoeJun 2, 2019 at 12:45 PM\nWish I Could Properly Review This App\n\nSadly, I can't get past the account creation stage. I've done everything right (more than once, in fact), but still haven't received the verification email that appears to be VITAL to getting started (yes, I checked my Spam). From other comments I've seen here and elsewhere, I'm guessing it's not worth wasting more time on, though. Lots of bugs and disappointments from what I'm seeing. Prove me wrong, VRChat.\n\nHelpful | 2\nDeveloper ResponseJul 5, 2019 at 12:54 PM\n\nHi, thank you for taking the time to let us know about your issue. We understand your frustration and would like to help. In order for us to properly assist please visit our Help Center at http://help.vrchat.com to start the troubleshooting process. Additionally we have our support team ready to assist as well. You can message them by pressing the \"Click Here for Help\" button at the bottom of the page.", "CorpusAbominoMay 20, 2019 at 10:46 AM\nAmazing what theyve achieved\n\nFantastic. Simply fantastic. Not being able to see all the avatars is a shame, but overall this is nothing short of amazing.\n\nHelpful | 7", "ZenburnJun 11, 2019 at 7:39 PM\nApp doesnt even start\n\nIt cant load terms of service so doesnt let me even play. Tried all day long several times, my connection is fine.\n\nWow, thats messed up! How amateurish can this even be? Cannot load a simple text file so I can check and try it?\n\nHelpful | 3\nDeveloper ResponseJul 5, 2019 at 12:54 PM\n\nHi, thank you for taking the time to let us know about your issue. We understand your frustration and would like to help. In order for us to properly assist please visit our Help Center at http://help.vrchat.com to start the troubleshooting process. Additionally we have our support team ready to assist as well. You can message them by pressing the \"Click Here for Help\" button at the bottom of the page.", "Peaceful_MindMay 29, 2019 at 5:52 AM\nNice but poor texture\n\nVery nice app I know it since before, but I am surprised by the poor quality texture which doesn't bring an immersive experience, thus I wonder what is the difference than using a phone app with the headset? it works better with PCVR as the shading and details are more lively\n\nHelpful | 3", "darwins.lastJun 1, 2019 at 7:57 AM\nFun to Hang\n\nNice interactions. Avatar selections are good from the third party rooms. Nice start for the Quest for the interactive social universe. Would like to see more and larger environments for Quest\n\nHelpful | 0", "GreyFoxMay 21, 2019 at 8:12 AM\nExcellent way to meet new people\n\nVR CHAT is so much fun, it gives you a new experience every time you play, as you are constantly interacting with new people.\n\nHelpful | 3", "FirefliesFromOwlCityJun 12, 2019 at 6:04 PM\nOk\n\nLots of empty rooms. Get the impression this is not optimized for quest. Fun to look around for awhile.\n\nHelpful | 0", "galvanizedgazelleJun 23, 2019 at 10:57 AM\nThey arent kidding with the rating\n\nPlaying this makes me feel super sick, even without smooth loco. The teleportation mechanic kind of removes you from your body which feels really weird and unpleasant.\n\nHelpful | 0", "Barryboi07Jul 3, 2019 at 2:04 PM\nGreat\n\nReally great fun love it\n\nHelpful | 0", "LemonZestMistJul 7, 2019 at 8:58 PM\nKyle\n\nYes\n\nHelpful | 2", "RagingWarrior14Jun 12, 2019 at 3:20 PM\nVR chat is Awesome\n\nVr chat is an awesome way to make friends online and a whole bunch of different things you can do in this game\n\nHelpful | 1", "SadfootMay 25, 2019 at 10:55 PM\nWe are Virtual\n\nThanks for the incredible immersion and absolute masterpieced galaxy of the virtual world. Your game has changed the lives of many. That we couldnt be more thankful for. <3s for you VRChat.\n\nHelpful | 2", "Helmy366Jun 30, 2019 at 3:02 AM\nDo you know da way\n\nDo you know da way?\n\nHelpful | 1", "johnson_christopherJun 14, 2019 at 6:53 AM\nNeeds more work\n\nIm glad vrchat is here but there is a lot of things missing that NEEDS TO BE BROUGHT INTO THE GAME, like, more avatars, more maps and stuff like that\n\nHelpful | 2", "buzzy1313May 29, 2019 at 2:38 PM\n\nWhy is the comfort level intense? Its atleast a moderate but not intense. I get motion sick really easy but this game only made me nausess once because the coffie shop elevator.\n\nHelpful | 0", "wonder_Jul 9, 2019 at 3:59 PM\n\nThere is no microphone options in the game\n\nHelpful | 1", "VardVRMay 20, 2019 at 9:07 PM\nAwesome\n\nVRChat on quest is the future\n\nHelpful | 5", "agitokazuJun 6, 2019 at 11:01 AM\nBrilliant\n\nAs more Avatars and World's get ported over, this social app gets better each day.\n\nHelpful | 2", "Tigy01May 26, 2019 at 8:50 PM\nVr chat\n\nFull of furries. Lots of fun. It's Vr chat do I need to say much more.\n\nHelpful | 2", "SicktrashMay 25, 2019 at 2:05 AM\nOk for social\n\nOk for chatting in. Not much else to do. Rec room has more features\n\nHelpful | 3", "Gam3rGrill16Aug 23, 2019 at 3:12 PM\nOculus Go\n\nIt sucks it's not on the Go. That's why I bought it. But I didn't know.\n\nHelpful | 0", "xXxLilRaccoonMay 24, 2019 at 11:30 PM\nLife is complete\n\nGame changer\n\nHelpful | 3", "Ethan_gallego1Jun 9, 2019 at 11:50 AM\nAmazing\n\nAs a first time playing vr I think its amazing\n\nHelpful | 0", "Oofmastre9000May 21, 2019 at 8:45 PM\nAmazing\n\nI honestly couldnt have expected a port this good to quest. The community is amazing, and I never run out of new things to do.\n\nHelpful | 1", "Aabis-of-ArabiaMay 25, 2019 at 8:19 PM\nAvatars not loading\n\nCreate Quest-only servers, maybe\n\nHelpful | 5", "lowghost2019Jun 1, 2019 at 3:15 PM\nOasis in the making\n\nIn this game I feel like Im free from the real world\n\nHelpful | 2", "alicia5Jun 9, 2019 at 12:27 PM\nFun\n\nIt fun do you no da way\n\nHelpful | 1", "Aftershock98May 25, 2019 at 8:34 AM\nCharacters\n\nHow do I make my own avatar?\n\nHelpful | 2", "spawn6000May 25, 2019 at 10:59 AM\nVrChat on Quest!\n\nAh sh*t here we go again...\n\nHelpful | 2", "Blacknight179Jun 25, 2019 at 5:45 PM\nGreat but needs MAJOR changes.\n\nSo, PC avatars cannot be used on the quest version. So lets see... about 95% of all avatars cannot work. And most worlds cannot work either. While I understand this game is free, it works for every other console, so why not this one? VRChat developers have not responded to a single quest reply, but have responded to rifts and rift ss. Do they not care, or are they working on it as we speak? Maybe we will see later.\n\nHelpful | 2", "krisvdvijverMay 22, 2019 at 11:09 PM\nLots of fun\n\nTalking, playing, discovering,.. love it.\n\nHelpful | 2", "ArinarMay 25, 2019 at 2:57 AM\n\nThe graphics are too low resolution\n\nHelpful | 2", "fin_worriorAug 30, 2019 at 4:53 PM\ni love vrchat\n\nthis game is so funny and cool and i like it because you could hang out with your friends\n\nHelpful | 0", "Tyudi444Jul 10, 2019 at 3:34 AM\nPerfection\n\nVR Chat is the most perfect game when adding socialising and VR together. Ive watched plenty of YT videos of VR chat involving trolls and pranks. But I wasnt able to experience it until I got the quest. Perfect game, 10/10.\n\nHelpful | 3", "Lolzi_DerpAug 24, 2019 at 8:36 PM\n\nI love this game so much that me and my friend max per our pants playing it (no joke actually per our self)\n\nHelpful | 0", "DrMorgusMay 21, 2019 at 6:39 PM\nThanks so much devs\n\nI can finally play VRC when I travel. Looks great for the platform.\n\nHelpful | 1", "DatBoiDaltsAug 28, 2019 at 2:31 PM\nHelp me please\n\nHow do I fguinish the vr guest set up bec I can't play unless I do :(\n\nHelpful | 0", "LANS0N1513_YTJul 10, 2019 at 5:34 PM\n\n\nThis is my favourite game ever I just wish you could see every skin on the oculus quest\n\nHelpful | 8", "m-a-dJul 26, 2019 at 3:10 AM\n\nyeah this game is fire 5 stars\n\nHelpful | 6", "gislane.valeriano.10Aug 21, 2019 at 6:46 AM\nbest game ever!\n\nthe best game in the world\n\nHelpful | 2", "chloelealAug 10, 2019 at 12:14 AM\n\nIt wont go to my librry\n\nHelpful | 0", "denilo.leandro.3Sep 4, 2019 at 1:09 PM\nc\n\ncf\n\nHelpful | 1", "Charlie_LainezMay 22, 2019 at 5:29 PM\nAmazing\n\nI'm really enjoying!!\n\nHelpful | 1", "bobthegoatmanJul 25, 2019 at 1:09 AM\nNot for kids\n\nSome people say messed up things in this game you chat in\n\nHelpful | 8", "dorkfish14Jun 27, 2019 at 8:00 AM\nFree is to much\n\nDo anyone think the Oculus quest sould Cheaper?\n\nHelpful | 9"]