{"App Title": "vSpatial", "App description": "vSpatial brings your workspace to the Quest\n\nSurround yourself with unlimited monitors and jump into focus mode. Access your favorite browser, professional working/ design tools, and music streaming apps in VR. vSpatial supports all Windows 10 apps and is already integrated into professional businesses today.\n\nPRODUCTIVITY (On virtual steroids)\nMulti-task by surrounding yourself with a ring of multiple apps and windows to see everything youre working on at once\nResize and isolate apps\nSafe and secure remote desktop\nBluetooth mouse and keyboard support\nTake a break with basketball\n\nCOLLABORATION (With your team)\nSeamlessly bring your team into your workspace with Collaboration Pro\nWork together by sharing multiple app screens\nLet your contacts join your space with avatars to share and draw on whatever screens/ apps you want\nCrystal clear spatial audio to distinguish teammates", "Purchase section": "FreeAdd to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Media Player, Productivity, Utility", "Languages": "English", "Version": "2020.3.0.1", "Developer": "vSpatial Inc.", "Publisher": "vSpatial", "Website": "https://www.vspatial.com/", "Release Date": "August 13, 2020", "Developer Privacy Policy": "DOWNLOADS\n \nPRICING\nvSpatial Privacy Policy\nvSpatial Privacy Policy\n\nUpdated: 08.12.2020\n\nIntroduction\n\nAt vSpatial (we, our, or us), we believe you should know what data we collect from you and how we use it. That is the purpose of this Privacy Policy. It explains what data we collect about you and why, what we do with the data, and how we handle that data. We also explain what choices you have with respect to the data.\n\nYou should read this policy in full, but there are a few key things that we hope you understand and take away from it:\n\nWhen you use our website, even if you are just browsing, or use vSpatial, we receive some personal information about you like the type of device you are using and your IP address.\nYou may sign up for a user account to use our Services (defined below) and provide additional information to us like your name, email address, company, and role within your company. We use this information to provide Services to you, to administer our systems, and enable additional features of the Services.\nWe do not market to or target persons in the European Union or EFTA States. The United States of America does not provide the same rights as those specified in the General Data Protection Regulation (GDPR).\nYou can contact us at contact@vspatial.com if you have questions about this Policy, or how we collect or process your Personal Data.\nApplicability of this Privacy Policy and Consent\n\nThis Privacy Policy applies to vSpatial applications (Software), the services we provide, our website, (together the website, Software, and services that support either is referred to as the Services), data we collect (explained below), and your interactions with us (e.g., customer service inquiries, email or other communication exchanges, etc.).\n\nThis Privacy Policy does not apply to third party services, including services offered by other companies that may be displayed to you during the use of our Services. Data collected and processed by third parties is subject to their own privacy policies. We encourage you to learn about the privacy practices of those third parties.\n\nA separate agreement governs delivery, access, and use of the Services (the Terms of Service).\n\nYou should read this Privacy Policy to make sure you understand what data we collect and how we collect and use your data. If you do not agree with our policies, please do not access, or use our website, or utilize our Services. By accessing or using our website, or utilizing our Services, you agree to this Privacy Policy.\n\nThis Privacy Policy may change from time to time and we post any updated privacy policies on our website. Please note that your continued use of this website or Services after any change means that you agree with, and consent to be bound by, the new policy.\n\nData We Collect and Receive\n\nIn Short: We collect personal information that you provide to us such as name, address, passwords (hashed) and security data.\n\nWhen you interact with our website, marketing, and use our applications, we collect data that alone, or in combination with other data, could be used to identify you (Personal Data). Some of the data we collect is stored in a manner that cannot be linked back to you (Non-Personal Data). We do not know your password, nor can it be retrieved.\n\nInformation You Disclose to Us\n\nOur Services allow you to sign up for an account. When you do, we may ask for Personal Data, including the following:\n\nName and Contact Data: your name, email address(es), contact information, your company, and role within the company. We will also ask you to create a display name.\nCredentials: passwords, password hints, and similar security information used for authentication and account access. We never store passwords in clear text form; therefore, we do not know your password, nor can it be retrieved.\n\nAll information that you provide to us must be true, complete, and accurate. You must notify us of any changes to such personal information.\n\nData that you provide to us may be collected through our partners and service providers, such as our web hosting services.\n\nInformation Automatically Collected\nIn Short: We automatically collect certain information such as your IP address and device characteristics when you connect to our Services.\n\nCertain data about the devices you use to connect to our Services, and your use of our Services are automatically logged in our system, including:\n\nLocation information. This is the IP address, geographic area, state, city where you use your computing devices and mobile devices when interacting with our website or using our Services.\nLog data. As with most websites and technology services delivered over the internet, our servers automatically collect data when you access or use our website or Services and record it in log files. This log data may include your IP address, browser type and settings, date and time of use, language data, and cookie data.\nServices User data. This is information about our Services, how you use them, and how others using them interact with you. We also assign unique identifiers to meetings and track these identifiers. We also track performance and error data, the Services version you use, a unique application number assigned to your installation, which applications you use while using our Services, and so forth. As noted below in How We Use your Data, the Services User data is intended to provide useful experiences and features to the User.\nWebsite data. This is information about our website and how you use it. We may also obtain data from our third-party partners and services providers to analyze how you use our website. For example, we will know how many users access a specific page on our website and which links they clicked on. We use this aggregated information to better understand and optimize our website.\nPlatform and device information. This is data from your computing or mobile device, such as the type of hardware and software you are using (for example, your CPU, graphic device(s), operating system, and so forth), and may include unique device identifiers for your devices. It also includes the platform (such as whether you are on Steam or Oculus Rift), version numbers, and other related data.\nCookies\n\nIn Short: We use cookies and similar technologies.\n\nvSpatial uses cookies and similar technologies in our websites that help us collect usage information. Our website may also include cookies and similar tracking devices of third parties, which may collect information about you across other websites and online services.\n\nThird Party Data\n\nIn Short: We receive information about you from our marketing partners, affiliates, and subsidiaries.\n\nvSpatial may receive data about website visitors, marketing campaigns, and other matters related to our business from affiliates and subsidiaries, our partners, or others that we use to make our own information and Services better or more useful. This data may be combined with other information we collect and might include aggregate level data, such as which IP addresses correspond to zip codes or countries. Or it might be more specific, such as how well an online marketing or email campaign performed.\n\nAdditional Information Provided to vSpatial\n\nIn Short: We receive information about you from other interactions with vSpatial.\n\nWe receive other information when submitted to our website or if you participate in a focus group, contest, activity, or event, apply for a job, request support, interact with our social media accounts or otherwise communicate with vSpatial.\n\nInformation Collected from Children\n\nIn Short: We do not knowingly collect information from children.\n\nvSpatial does not knowingly collect personal information from users under the age of 18. Our website and Services are directed to persons who are at least 18 years old. If we determine that we have collected personal information from people under the age of 18, we will take reasonable measures to remove that information from our systems. We encourage parents and legal guardians to monitor their childrens Internet usage to help enforce this Policy by instructing their children never to provide personal information through our website without their permission.\n\nNo Rights Under the GDPR\n\nIn Short: If you live in the European Union or EFTA States you understand and agree that your data will be transferred to, stored in, and accessed in the United States, which does not have the same rights as specified in the GDPR.\n\nWe do not market to or target persons in the European Union or EFTA States. If you are located in a geographic region outside the United States of America and choose to use our Services, you understand that your data will be transferred to, accessed in, and stored in, the United States of America and you give your explicit consent to vSpatial to transfer your data to the United States of America.\n\nHow We Use Your Data\n\nIn Short: We process your information for purposes based on legitimate business interests, in fulfillment of our Terms of Service with you, compliance with our legal obligations, customized user features and experiences, and services improvements.\n\nWe use, process, and store your data as necessary to provide services to you, in operating our website, and offering our Services, including:\n\nTo provide our Services to you.\nTo help us administer our Services, authenticate users for security purposes, provide personalized user features and access, conduct research, develop new features, and improve the features, algorithms, and usability of our Services. Services User data as described above is only used to enhance the user experience and provide features specific to the user. We do not share User Services Data.\nTo calculate aggregate statistics on the number of unique individuals and/or devices using our Services.\nTo send periodic emails. We may send you service, technical, and administrative emails. We may also contact you to inform you about changes in our Services, inform you of security and fraud events, and send you other Services-related information.\nTo improve our products and offerings. Using analytical platforms, we will map broader analytical trends and patterns, making sure our products align with what our customers need and improve marketing materials. Data used in this way is anonymized, it is not trackable back to the user.\nTo enhance product advertising campaigns of vSpatial.\nTo investigate and help prevent security issues, fraud, and abuse.\nAs required by applicable law, legal process, or regulation.\nHow We Share and Disclose Your Data\n\nIn Short: We will only share your information with your consent, to comply with laws, to protect your rights, or to fulfill business obligations.\n\nWe only disclose Personal Data to third parties when:\n\nWe use service providers who assist us in meeting business operation needs, including hosting and administering our website, and delivering and improving our products. We also use service providers for specific services and functions, including email communication, customer support services, and analytics.\nWe have your explicit consent to share your Personal Data (if required).\nUsing our Services to interact with others necessitates that certain information be disclosed to those you interact with, including your display name.\nWe believe it is necessary to investigate potential violations of our Terms of Service, or where we believe it is necessary to investigate, prevent, or take action regarding illegal activities, suspected fraud, or potential threats against persons, property, or the systems on which we operate our Services.\nWe determine that the access, preservation, or disclosure of your Personal Data is required by law, or to protect the rights, property, or personal safety of vSpatial or users of our Services, or to respond to lawful requests by public authorities, including national security or law enforcement requests.\nWe need to do so in connection with a merger, acquisition, bankruptcy, reorganization, sale of some or all of our assets or stock, public offering of securities, or steps in consideration of such activities (e.g., due diligence). In these cases, some or all of your Personal Data may be shared with or transferred to another entity, subject to this Privacy Policy.\n\nvSpatial does not share your Personal Data with third parties for the purpose of enabling them to deliver their advertisements to you. vSpatial does not sell, trade, or rent your Personal Data.\n\nData Storage, Transfer, Retention, and Deletion\n\nIn Short: We process your data in the United States, keep your data only as long as necessary, and safeguard your data using industry standard practices.\n\nData Storage and Transfers\n\nData submitted to vSpatial will be transferred to, processed, and stored in the United States of America. When you use the Services on your computing device, user content you save will be stored locally on that device and synced with our servers. If you post or transfer any information to or through our Services, you are agreeing to such information, including Personal Data and user content, being hosted, and accessed in the United States.\n\nDuration of Storage\n\nYou can remove your Personal Data from vSpatial at any time by contacting us at contact@vspatial.com. However, we may keep some of your Personal Data for as long as reasonably necessary, including fraud detection and prevention and to comply with our legal obligations including tax, legal reporting, and auditing obligations.\n\nSafeguards\n\nWhen you give us personal information, we take steps to make sure that it is treated securely.\n\nNon-sensitive details (your name, email address, etc.) are sent encrypted normally over the Internet, and this can never be guaranteed to be 100% secure. As a result, while we strive to protect your personal information, we cannot guarantee the security of any information you transmit to us, and you do so at your own risk. Once we receive your information, we make our best effort to ensure its security on our systems.\n\nWe use industry standard encryption to protect your data in transit. This is commonly referred to as transport layer security (TLS) or secure socket layer (SSL) technology.\n\nOnce we receive your data, we protect it on our servers using a combination of physical, technical, and logical security safeguards. The security of data stored on your computing devices is solely within your control and we recommend you take the appropriate steps to secure your computing devices that you use in connection with our website and Services.\n\nContacting Us\n\nIf you have any questions regarding this privacy policy, to request removal of your data, or to request removal of data collected from a minor under the age of 18, please contact us at contact@vspatial.com.\n\nThe Workspace of the Future\n\nProduct\n\nFeatures\n\nFAQ\n\nCompany\n\nAbout\n\nPress\n\nContact\n\nContact Us\n\nDiscord\n\n 2020 vSpatial, Inc. |Terms of Service|Privacy Policy", "Developer Terms of Service": "DOWNLOADS\n \nPRICING\nvSpatial Terms of Service\nvSpatial User Agreement\n\nUpdated: 08.10.2020\n\nYou agree to be bound by these Terms of Service (these Terms) of vSpatial, Inc., a Delaware corporation (vSpatial, we, us, and our), any time you access our website, our software (Software), and any of our other products or services located on our website or through the Software (together the website, Software, and services that support either is referred to as the Services). Your use of the Services is subject to acceptance of and compliance with these Terms. Use or using means to access, install, download, copy, or otherwise benefit from using the functionality of the Services. If you do not agree to these Terms, do not use the Services. Each time you use the Services, the current version of these Terms will apply. The current version of these Terms will always be available on the website.\n\nYour use of the Services is also subject to our Privacy Policy, available on our website and incorporated into these Terms by reference. In addition, you agree to abide by our rules, policies, and procedures which we may publish in conjunction with the Services from time to time. We reserve the right and without notice to change these Terms. If you have questions regarding these Terms, please contact us at contact@vspatial.com.\n\nTHIS IS A LEGALLY BINDING AGREEMENT. IF YOU DO NOT UNDERSTAND THIS AGREEMENT, OR DO NOT AGREE TO BE BOUND BY IT AND THE PRIVACY POLICY REFERENCED HEREIN, YOU MUST IMMEDIATELY LEAVE OUR WEBSITE AND YOU ARE NOT AUTHORIZED TO ACCESS OR USE ANY OF THE SERVICES. BY ACCESSING OR USING THE SERVICES, YOU CONFIRM THAT YOU ARE AT LEAST 18 YEARS OLD, THAT YOU ARE LEGALLY ABLE TO ENTER THIS AGREEMENT, AND THAT YOU HAVE READ, UNDERSTAND, AND AGREE TO BE BOUND BY THIS AGREEMENT.\n\nSoftware and Licenses\n\nWhen used in this Agreement, the following terms shall have the respective meanings indicated, such meanings to be applicable to both the singular and plural forms of the terms defined.\n\nSoftware\n\nSoftware means all of the contents of the downloads, files, disk(s), CD-ROM(s) or other media containing vSpatial software with which these Terms are applicable, including but not limited to (A) registration information, i.e. license key which is unique for Your registration name; (B) related explanatory written materials or files (Documentation); and (C) Software setup files including the vSpatial desktop and mobile applications and code samples (if any); and (D) any upgrades, modified versions, updates, additions, and copies of the Software, if any, provided to You by Us now or in the future (collectively, Updates).\n\nLicense\n\nvSpatial, as the licensor, grants You, as the licensee, a non-exclusive right to use the Software under these Terms. The Software is protected by copyright laws and international copyright treaties, as well as other intellectual property laws and treaties. vSpatial reserves all rights not expressly granted to You. vSpatial retains the ownership and copyright in and to the Software.\n\nAs part of this license, You agree that the Software may download and install Updates, and additional features from Us in order to improve, enhance, and further develop the Software.\n\nPermitted Uses and Restrictions\n\nSubject to Your compliance with these Terms, vSpatial grants You a non-exclusive, limited, revocable, non-transferable license to use the Software solely as follows:\n\nOne Single Use License allows You to activate and use a copy of the Software on multiple qualified platforms for which it is designated. The vSpatial services will prevent simultaneous use.\nUnauthorized copying of the Software is expressly forbidden.\nYou may not rent, lease, lend, or sell the Software to anyone.\nYou may not use the Software for any unlawful purpose and shall not misuse the Services in any manner, which vSpatial shall determine in its sole discretion.\nUse of the Services require that you sign up for an account. You agree to keep your username and password confidential and to not allow others to use your user account. You also agree not to use anothers user account.\nYou are solely responsible for all activity that occurs under your account. You agree to notify vSpatial of any unauthorized use of your account.\nExcept as and only to the extent permitted in this Terms and by applicable law, You may not copy, adapt, translate, decompile, reverse engineer, disassemble, modify, or create derivative works of the Software or advertise the Software in any form.\nWithout prejudice to any other rights, We may terminate this Terms if You fail to comply with the terms and conditions of this Terms or other documents, referred to herein. In such event, You must destroy all copies of the Software.\nContent and License Grant to vSpatial\n\nThe Services allow creation, transmission, and storage of content generated by You and the following terms apply.\n\nContent means all visual, written, or audible communications, files, data documents, videos, recordings, or any other material displayed, posted, uploaded, stored, exchanged, or transmitted on or through Your use of the Services. You retain ownership of any intellectual property rights that you hold in the Content. We will not monitor Content, except: (i) as needed to provide, support, or improve the Services; (ii) investigate potential or suspected fraud, abuse, misuse, or unlawful activities; (iii) where instructed or permitted by you; or (iv) as otherwise required by law or to exercise or protect our legal rights.\n\nYou are solely responsible for your Content and your use of the Services. We are not liable to you for any loss or damages arising from any Content. We do not endorse and have no control over the Content used in connection with the Services. We cannot guarantee the accuracy of any Content provided by you or by other users.\n\nGeneral Terms\nTermination\n\nThese Terms are eective until terminated. Your rights under this License will terminate by vSpatial automatically without notice if You fail to comply with any provisions of these Terms and or otherwise fail to pay the fees and charges, if any, payable to vSpatial and associated with Your use of the Services. Upon the termination, You shall cease all use and destroy, remove or delete all copies, full or partial, of the Software on Your computer or device and otherwise in Your possession or control.\n\nIndemnification\n\nYou agree to indemnify and hold harmless vSpatial, our affiliates and our and their officers, directors, licensors, partners, licensees, consultants, contractors, agents, attorneys, employees, and third party service providers (collectively, the Indemnitees) from any and all claims, liabilities, costs and expenses, including reasonable attorneys fees (collectively, Claim(s)), that actually or allegedly result from your information, use of the Services, or your breach of this Terms.\n\nWarranty Disclaimer\n\nYOU EXPRESSLY AGREE THAT THE SERVICES ARE AVAILABLE ON AN AS IS BASIS, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, AND THAT YOUR USE THEREOF IS AT YOUR OWN RISK. WITHOUT LIMITING THE GENERALITY OF THE FOREGOING, WE DISCLAIM TO THE MAXIMUM EXTENT PERMITTED BY LAW ANY AND ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY (I) WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, (II) WARRANTIES AGAINST INFRINGEMENT OF ANY THIRD PARTY INTELLECTUAL PROPERTY OR PROPRIETARY RIGHTS, (III) WARRANTIES RELATING TO DELAYS, INTERRUPTIONS, ERRORS, OR OMISSIONS IN THE SERVICES, OR ANY PART THEREOF, (IV) WARRANTIES RELATING TO THE TRANSMISSION OR DELIVERY OF THE SERVICES, (V) WARRANTIES RELATING TO THE ACCURACY OR CORRECTNESS OF DATA, AND ANY OTHER WARRANTIES OTHERWISE RELATING TO PERFORMANCE, NONPERFORMANCE, OR OTHER ACTS OR OMISSIONS BY US. FURTHER, AND WITHOUT LIMITING THE GENERALITY OF ANY OF THE FOREGOING, THERE IS NO WARRANTY THAT THE SERVICES WILL MEET YOUR NEEDS OR REQUIREMENTS OR THE NEEDS OR REQUIREMENTS OF ANY OTHER PERSON. IN ADDITION, YOU ACKNOWLEDGE AND AGREE THAT OUR WARRANTY DOES NOT COVER TELECOMMUNICATIONS OR INTERNET OUTAGES CAUSED BY THIRD PARTIES OR OTHERWISE OUTSIDE OF OUR CONTROL. THE SERVICES MAY BE LIMITED BY MANY FACTORS, INCLUDING INHERENT RISKS OF THE INTERNET.\n\nLimitation of Liability\n\nTO THE EXTENT NOT PROHIBITED BY APPLICABLE LAW, IN NO EVENT SHALL VSPATIAL BE LIABLE TO YOU OR A THIRD PARTY FOR PERSONAL INJURY, OR ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES WHATSOEVER. THIS INCLUDES, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, LOSS OF DATA OR INFORMATION, BUSINESS INTERRUPTION OR ANY OTHER COMMERCIAL DAMAGES OR LOSSES, ARISING OUT OF OR RELATED TO YOUR USE OR INABILITY TO USE THE SOFTWARE OR SERVICES OR ANY THIRD PARTY SOFTWARE OR APPLICATIONS IN CONJUNCTION WITH THE SOFTWARE HOWEVER CAUSED, REGARDLESS OF THE THEORY OF LIABILITY (CONTRACT, TORT OR OTHERWISE) AND EVEN IF VSPATIAL HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OF LIABILITY FOR PERSONAL INJURY, OR OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS LIMITATION MAY NOT APPLY TO YOU. REGARDLESS, IN NO EVENT SHALL VSPATIAL TOTAL LIABILITY TO YOU FOR ALL DAMAGES EXCEED THE AMOUNT OF FIFTY DOLLARS ($50.00). THE FOREGOING LIMITATIONS WILL APPLY EVEN IF THE ABOVE STATED REMEDY FAILS OF ITS ESSENTIAL PURPOSE.\n\nintellectual property\n\nThe Services are protected by copyrights, trademarks, patents, trade secrets, and other intellectual property and proprietary rights (collectively, Intellectual Property Rights), and any unauthorized use of the same violates these Terms and may violate applicable law. Except as expressly provided herein, we do not grant you any express or implied right to use the Services. In addition, you agree not to take any action that may infringe on our Intellectual Property Rights.\n\ngoverning law\n\nThese Terms will be governed by and construed in accordance with the laws of the State of Texas, excluding its conict of law principles. These Terms shall not be governed by the United Nations Convention on Contracts for the International Sale of Goods, the application of which is expressly excluded. If for any reason a court of competent jurisdiction finds any provision, or portion thereof, to be unenforceable, the remainder of this License shall continue in full force and effect. The federal or state courts located in Collin County, Texas, USA shall be the exclusive jurisdiction and venue for all legal proceedings. To the maximum extent permitted by law, You hereby consent to the jurisdiction and venue of such courts and waive any objections to such jurisdiction and venue.\n\ncomplete agreement and severability\n\nThese Terms constitute the entire agreement between You and vSpatial relating to the use of the Services and supersedes all prior or contemporaneous understandings regarding such subject matter. No amendment to or modification of these Terms will be binding, provided vSpatial reserves the right to make changes as specified herein. If any term or provision of these Terms is declared void or unenforceable in a particular situation, by any judicial or administrative authority, this declaration shall not affect the validity of enforceability of the remaining terms and provisions hereof or the validity or enforceability of the offending term or provision in any other situation.\n\nThe Workspace of the Future\n\nProduct\n\nFeatures\n\nFAQ\n\nCompany\n\nAbout\n\nPress\n\nContact\n\nContact Us\n\nDiscord\n\n 2020 vSpatial, Inc. |Terms of Service|Privacy Policy", "Space Required": "400.4 MB"}



["5 stars\n53%\n4 stars\n24%\n3 stars\n6%\n2 stars\n6%\n1 star\n12%", "Gilliosa10 days ago\nWow, this is great!\n\nI have tried many other remote desktop type applications on the Quest and I have always thought it was limiting to only show the desktop monitor in VR. I was hoping an app would come along that would allow for interaction with the individual windows, and here it is! Not just that, but this is the most responsive and reliable remote desktop software I have used to date!\n\nThere are a few enhancements I hope to see in future releases:\n\n1. Hand tracking. Rather than using the controller all the time, it would be nice to be able to use hands in VR. There would be a loss in functionality tied to controller buttons but it is far more intuitive to use hands when interacting with computer programs than it is the Oculus controllers.\n\n2. Additional carousels. Currently there is a predefined work carousel. It would be nice to see the ability to add additional work carousels.\n\n3. Multiple full screen windows. It would be nice to have two full screen windows opened at the same time. The ability to make a window full screen and reduce the clutter of the other windows is invaluable. But there are many times when you need to compare two screens side by side without other distractions.\n\n4. Right-click mouse function. Unless I'm missing something I am not able to figure out how to simulate a right-click on a mouse.\n\n5. Not something I expect these spatial to provide but I really hope someone develops a VR physical keyboard. Like the Oculus controllers which can be viewable within the VR, it would be nice to have a physical keyboard which you can see within VR but type on physically like any other keyboard. Let's face it, computers are not quite ready to go without a mouse and keyboard.\n\nHelpful | 16", "pantherhead11 days ago\nI expect it in the future\n\nWhen it comes to virtual desktop features, Virtual Desktop is more comfortable with less latency.\nThe ability to resize the view for each application is great.\nSwitching windows is also very comfortable.\nI haven't tried the collaboration, so I don't know.\nI expect it in the future.\n\nHelpful | 14\nDeveloper Response6 days ago\n\nHey Pantherhead, Thanks for checking it out and for the feedback! We will have an update coming soon to our Remote Desktop Utility that'll improve the performance for the remote screens (latency, frame rate, etc). This will also be followed up very soon after with the ability to connect to your PC from anywhere. Stay tuned for updates! Cheers, Daniel @ vSpatial Dev Team", "d1v1ne12 days ago\nInnovative and Sleek\n\nVery solid app! This is what the future of collaboration looks like. The interface is sleek and the integrations with various apps takes it to the next level. If you're looking for a unique solution to communicate and collaborate with your teams in a virtual space, look no further.\n\nHelpful | 22", "le0n092011 days ago\nFront Leaders in VR Immersion\n\nI tried them all Virtual Desktop. Google Immersion Same product different name. But vSpatial are taking technology and production to the next level. Total different environment from anything that you have witnessed so far. This is a really well thought out and tested product and I can't wait to see and use what other tools can and will be implemented in the future. vSpatial Inc have shown that they are dedicated solely to this product.\n\nAs a bidding Python programmer, I have access to every tool that I would normally use, including my 5 monitors that I use constantly; all all in front of me. Moving from screen to screen or application to application is simple and intuitive. No need to spend time trying to get the monitors in the right place or the right size. Wham bam thank you mam, its done. I can spend time doing my job.....brilliant\n\nWelcome to the future!\n\nHelpful | 13", "pouterz10 days ago\nIgnore the haters\n\nCant believe the hater are dragging the score down.\nI waited weeks for this app and it was so much better than expected. I love it and I can definitely see myself using this app for a long time. Would be cool to be in a coffee shop like immersed and chat to random people though\n\nHelpful | 9", "R_Steelman615 days ago\nGet work done in VR!\n\nThis is a great app for bringing your PC screen and apps into VR. Takes all your apps and converts them to discrete windows. Remember this is from a device with one physical screen and in VR i typically have 8. Helps organize your work efforts and surrounds you with your apps/windows so you can quickly get to what you need. Go into focus mode to concentrate on that one app or document and remove all the other distractions. I work in VR several hours a week using vSpatial and love it.\nTo have meetings with those on PC, they will need the free workstation app from www.vspatial.com to join you. Once they have it they can join you from the desktop while you are in VR.\nThe negative reviews i am seeing seem really petty. It doesn't support Linux or Mac so 2 stars? I have latency so 1 star? Look do some research. You need Windows, you need a good connection, you need a decent PC or laptop. I've worked several hours a week for months in vSpatial (as have others, check the Discord) and can testify IT WORKS! Its a different way of working and you have to dedicate yourself to adapting your workflow but once you do, you WILL be more efficient.\nCheck out my overview at VR 4 Work on YouTube https://www.youtube.com/channel/UCOPivLudusITkFvxUMzu3SA\n\nHelpful | 5", "Guidance77710 days ago\nTHE FUTURE OF REMOTE WORKING! A+++\n\nFor such a time as this, when people are working from home more than ever, this app comes in like a knight in shinning armor!\nBrilliantly made, its all business. Intuitive and organic, while giving the user FULL CONTROL of their workspace environment.\nThis WILL be a BENCHMARK and has set a NEW BAR.\n\nCongratulations Devs! Well done! :)\nI'm in Shock buy any score lower than 5 stars!\n\nSigned,\nJust a guy who loves VR and has been looking for a Virtual workspace solution for years!\n\nHelpful | 6", "spotthereality10 days ago\nReally well done application...\n\nThis is a different type of collaboration tool than a lot of what is on the market. Screen sharing with a colleague is better here than in any other VR or 2D application that I know of. Demo'ing software or giving a presentation is not only straightforward, but a more compelling experience in vSpatial than in other products. I believe knowledge retention for the \"audience\" is much higher as a result. Can't wait to see how vSpatial develops over time. - Rob Merrilees, Get Real XR\n\nHelpful | 4", "B0nn1e12 days ago\nFantastic for work and play\n\nThe ability to have all your apps surround you in VR is awesome. Constant development updates on their discord and helpful tech support when needed. Highly recommended to try it for the full experience\n\nHelpful | 10", "RayAllenTaylor9 days ago\nGrafics are bad and not intuitive\n\nI don't like it at all.\nAlready starting with the need of setting up an account and for that having to go out in back in to vr.\nThere is an account management coming with oculus, use it!\n\nThe grafics are really bad I think. The backdrop looks like nothing else then a plain mat picture.\n\nThe text is so blurry, I wouldn't like to \"work\" in there at all. I had a feeling of motion sickness just because if that, and I usually do not have that problem.\n\nThe app feels like beta, but already time spent for adding pro features .. for real??\nMost if it feels undone but you guys are spending time in pro features ?\n\nI wish you would have spent more time on the spatial (the one without the v) app... I like working in there, and I am hoping for updates every day (btw, so are my co workers )\n\nHelpful | 9", "ariel.abramov.469 days ago\nUseless for Mac no support\n\nI was happy to be the first tester hopping it would be a Mac support but there isnt ... so for me its useless since I hate windows computers , long time a Mac user .... plus Im using immersed Wich I love ... working great with my Mac , no latency issues like other said here ....\n\nHelpful | 15", "kyle.mammen10 days ago\nGreat for productivity!\n\nWhen compared to using a traditional monitor this app gives me a critical tool to focus on what Im working and to ignore the distractions of other programs and the environment. When stuck in an open office and I need to get something done, this helps me stay on task, while communicating to those around me that Im working on something important.\n\nThe ability to organize my windows into the carrousel and to go into focus mode on the most important window are the killer features for me. The collaborative elements are also impressive and show a ton of potential as more people adopt the app.\n\nHelpful | 3", "jisdaboss18 days ago\nGood app!\n\nI got this app the day it came out. Sometimes I even use it for fun to watch YouTube and shoot some baskets. If youre looking to work with your co workers that also have a vr headset, I would recommend this app as the best option for work and interaction for conferences.\n\nHelpful | 3", "BallyBoy2120111 days ago\nMy private cubicle with a view\n\nGreat for blocking distractions. Love having each application in it's own large screen. So far has worked very well. Looks like a great start to the future office. Now if I could get my employer to allow this on our system.\n\nHelpful | 5\nDeveloper Response6 days ago\n\nHey BallyBoy21201, Thanks for checking everything out so far and we're glad you're enjoying it. We'd be happy to chat logistics and future opportunities with your employer :D you can send us a message at daniel@vspatial.com to talk more about that. Cheers, Daniel @ vSpatial Dev Team", "mbustin6 hours ago\nVery Nice Program\n\nIve used Virtual Desktop (nice), Immersed (nice), Spatial (ok) and vSpatial. I have to say that Im most excited about vSpatial and its potential. Interface is very good and handles multiple screens better than other apps. Using a BT keyboard with touchscreen linked to a laptop works well, now all I need to do is become a better touch typist. Not completely ready for ideal work until the resolution on the headsets improves and the Quest screen door effect is improved on - but thats not vSpatials fault. Also until companys VPNs allow these clients, I cant yet do everything I would like. Hopefully, someday.\n\nHelpful | 0", "TrumboneXXL8 hours ago\nGood but needs more power\n\nI appreciate the chance to use my computer through this application but I wish more than 1-2 browser instances was a feature built into the app without having to connect my PC.\n\nHelpful | 0", "YEET1046511 days ago\nPerfect for anything\n\nJust about amazing for most projects, videos, and browsing! You can choose what tab to use, even play basket ball!\n\nHelpful | 3", "slipperedlobster11 days ago\nWhat about Linux?\n\nWhy support only Microsoft? Plenty of Linux users out here.\n\nHelpful | 10\nDeveloper Response5 days ago\n\nHey slipperedlobster, We have a major update to our remote desktop manager coming soon that'll help us with with streaming your PC over the internet (instead of just your local network) as well as improve fps & latency. This also is the right step forward for us to increase the devices we can remote to (MAC, Linux, etc). Mac should be coming later this year and then we'll focus on Linux soon after that. Hope that helps!", "100percentgaming10 days ago\nit's really good its just\n\nit could use arrow keys and a mouse so you can play games but other than that its fine\n\nHelpful | 1", "paco.scognamiglio10 days ago\nNo Mac support, no party....\n\nAs title...\n\nHelpful | 9", "ugavelab2 days ago\nDefinitely worth trying out\n\nThe foveated rendering settings are all wrong, and the built-in web browser is very slow and hard to use (why no click to drag?). The basketball throwing is quite unreliable (so many good games to use as examples of how to do this right). Latency is among the worst of these types of applications. But, despite its flaws, I love the general ideas being presented, which contrast really nicely against some of the other systems that are purely remote-desktop oriented. Immersed has shown that usable latency is quite possible, so this application should be able to get better.\n\nHelpful | 1", "AdherentPeak1811 days ago\nMy Dream Come True!!\n\nIts like being Tony Stark with all of his holographic computers surrounding yourself. Its So Awesome.\n\nHelpful | 3", "powshopow4 days ago\nNot really for working\n\nI can see the potential for collaboration, but the remote desktop function is not a very efficient way to work. The graphics are not sharp enough to read, the carousel is not ergonomic and not a lot of options to make it ergonomic. Using the physical keyboard and mouse is impossible when you're accessing the apps by itself instead of through desktop. It was frustrating to move the keypad around as well, grabbing it would sometimes overshoot and you'd end up vacuuming one of the workspace windows. Good thing it's free.\n\nHelpful | 0", "AbyssDJ5 days ago\nNice, but sluggish\n\nWhilst my desktop isn't the fastest pc around, I feel this definitely needs a fps and overall clarity increase. I like the idea so far though!\n\nHelpful | 1\nDeveloper Response5 days ago\n\nHey AbyssDJ, Glad you're liking it thus far, we have a major update to our remote desktop connection coming soon that should improve the fps and latency. You might try increasing the app ring size by holding and grabbing the arrows to the left of your center view to adjust the screen sizes. You can also hit the AAA button on the bottom of each screen to adjust the resolution. Hope that helps!", "rosebud09115 hours ago\nSadly not usable - Mac shop only\n\nI work at a Financial company that does not allow windows machines as they are too insecure. We are MAC only and sadly this leaves me out from playing. Please - I beg of you - support MAC.\n\nHelpful | 1"]