{"App Title": "Waltz of the Wizard: Extended Edition", "App description": "Experience creative and destructive magical powers in a fully interactive, constantly expanding fantasy reality where magic is real  NOW WITH HAND TRACKING!\n\nIf you have ever wanted to make things disappear with a snap of your finger, throw fireballs, or telekinesis, then this experience is for you. Now included among many other hand tracking features!\n\nVR already has some exceptionally well-received games, like Waltz of the Wizard -Rolling Stone Magazine\n\nWaltz of the Wizard has some of the most impressive uses of VR I've seen yet -Polygon\n\nSpent tonight playing catch with an animated wall statue. VR is giving me the childhood i never had! -Norman Chan, Tested\n\nCombine arcane ingredients into a boiling cauldron and cast creative and destructive spells in a fully interactive world, solve riddles, battle ancient guardians and discover the many details of a mysterious world designed to feel like a believable reality.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch, Hand Tracking", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Exploration, Simulation", "Languages": "English", "Version": "1.3.1", "Developer": "Aldin Dynamics", "Publisher": "Aldin Dynamics", "Website": "http://aldin.io/", "Release Date": "December 5, 2019", "Developer Privacy Policy": "Last Updated May 24, 2018.\n\nAldin Dynamics, ehf. and affiliated companies (Aldin, we, our, and us) is fully committed to protecting the privacy and safety of our customers. This Privacy Policy (Policy) explains our privacy practices regarding information that we collect in our software applications (Application(s)) and online services (Service(s)). For specific information about our mixed reality production tools, please see the Mixed Reality Experience Analysis section below.\n\nINFORMATION WE COLLECT\n\nWe do not currently collect any information or data when you use our Applications.\n\nIn the past we have collected usage data to improve our software (see Mixed Reality Experience Analysis below), for which we employ extensive measures to ensure that no personally identifiable data is stored. Previously collected data is used solely to improve our software, is stored only for as long as we need it for those purposes and is never sold or shared with third-parties.\n\nIn the future we may need to collect data again, in which case we will acquire user consent from within our Applications and provide an option to not participate.\n\nOTHER SITES & SERVICES\n\nOur Service and Applications may contain links to other sites or Applications. We have no control over, and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services.\n\nMIXED REALITY EXPERIENCE ANALYSIS\n\nWe take the design of our immersive worlds very seriously and to make them more advanced we created our own unique set of mixed reality software tools. Our tool suite for MR experience analysis, the Ghostline suite, processes usage data that helps us understand how users interact with our software so that we can build more advanced and believable worlds. The tools can identify MR design issues, performance problems and generally provide information that can help improve the user experience.\n\nOur tools are used in prototyping and production phases, but can also be used in live products after release to ensure that our software is functioning as intended. When we use the tools in live deployment it is Aldins Policy to only collect data that is necessary to help improve our VR software; such as improving interactions with virtual tools, improving timing of in-world events and generally ensuring that the software impacts users in the way we intended. Our software strictly limits the types and amounts of data being collected, and we do not store personally identifiable information. Information we process focuses on data relating to hardware and software setups, headset and controller output data and data from within the virtual world that is meant to help improve the user experience.\n\nINFORMATION SECURITY\n\nWhile we strive to employ protections for your information that are appropriate to its sensitivity, no transmission over the internet or online storage is 100% secure.\n\nCHILDREN\n\nIf you are under the age of 13, or otherwise under legal age in your country, you are not to permitted to use our products or provide information to us.\n\nCHANGES TO THIS POLICY\n\nAldin Dynamics, ehf. may change our Policy from time to time and we advise you to review this Policy periodically. If we make any changes to this Policy, we will change the \"Last Updated\" date above. These changes are effective immediately, after they are posted on this page. You agree that your continued use of our Sites, Applications or Services after such changes have been published to our Policy will constitute your acceptance of such revised Policy.\n\nCONTACT US\n\nIf you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us at support@aldindynamics.com.", "Developer Terms of Service": "These terms of use are contract between you and Aldin Dynamics, ehf. You must carefully read and agree to these terms before using the Product (as defined below) and/or any updates to the Product. You agree to this Agreement by using any aspect of the Product. If you do not agree you may not access or use the Product, in part or in whole.\n\nYour use of this Product is subject to this end user license agreement (the Agreement) and the terms as set forth in the latest version at any given time. For the purposes of this Agreement, all references to the Product include the Waltz of the Wizard application and copies thereof, its data files and related software, packaging and media materials, documentation, manuals and license agreements; including any updates of the main application and any related materials. By installing and/or opening the Product and using the Product or any of the related software and materials, you accept the terms of this Agreement with Aldin Dynamics, ehf. (Hereafter referred to as Licensor).\n\nThis end user license agreement may be updated from time to time and the latest version can be found on http://aldindynamics.com/product/wotw-eula.html. Use of this product, as defined below, constitutes an agreement to the latest terms. It is up to the end user to check this document to review the latest changes. Minors must make sure that parents and/or legal guardians read and accept this agreement and accompanying privacy policy on their behalf prior to the use of the Product. Children under the age of 13 (thirteen) are not permitted to use this Product, in part or in whole.\n\nCOMMERCIAL USE IS STRICTLY PROHIBITED WITHOUT EXPRESS PERMISSION OF LICENSOR.\n\nLicensing and Ownership of Intellectual Property\n\nSubject to this Agreement and its terms and conditions, Licensor hereby grants you a non-transferable, non-sublicensable, non-exclusive license to download, install and use one copy of the Product for personal non-commercial use in a private residences, specifically for gameplay purposes. By installing and using the Product you agree to the terms of your license which commences on the date that you install or use the Product and ends upon uninstalling the Product, or otherwise is terminated by the Licensor. Your license terminates immediately upon circumventing any terms under this Agreement.\n\nThe Product is licensed to you and you acknowledge that no title or ownership in the Product is being assigned or transferred, and that this Agreement should not be interpreted as a sale or transfer of any rights of the Product. All rights are reserved by Licensor and Licensors. Licensor retains all right and interest to the Product which includes, but is not limited to, all copyrights, trademarks, names, titles, visual effects, stories, dialog, artwork and all other intellectual property rights. The Product may not be reproduced, copied or distributed in any manner, in whole or in part, without prior written approval of Licensor. Any person or legal entity copying, reproducing or distributing any portion of the Product will be violating copyright laws and the terms of this Agreement and may be subject to criminal penalties.\n\nThe Product is intended for private, residential and non-commercial use only. You agree not to use this product outside of private residences and acknowledge that commercial use is strictly prohibited without express written permission from the Licensor.\n\nRestrictions\n\nYou may not circumvent or attempt to circumvent any content protection system or DRM management software or any other security technology that is associated with the Product. You may not attempt to edit, modify, translate, reproduce, reverse engineer, disassemble or create derivative works of the Product or any associated material, in-part or in whole. You may not decompile, re-sell or rent, copy, redistribute or otherwise duplicate the Product or associated materials. The Product may not be displayed, exhibited or shown in public or in public places, in whole or in part, without express written permission of Licensor.\n\nInformation Collection & Usage\n\nWe do not currently collect usage information or analytics data. We reserve the right to do so in future for the purposes of improving our Products, in which case we will explicitly gather user consent from within the Product and update this License and Privacy Policy to reflect such data collection. We do not store, sell or share any personally identifiable information nor collect such data without user consent.\n\nDisclaimers of Warranty & Liability Limitations\n\nThe Product is provided AS IS and is entirely without warranties of any kind. To the fullest extent permitted by law, Aldin, its affiliates, licensors, agents and service providers disclaim any warranties and conditions, express or implied, including but not limited to fitness for a specific purpose, completeness, security, compatibility, functionality quality and equivalent under the laws of any jurisdiction.\n\nLICENSOR, LICENSORS THIRD PARTY SERVICE PROVIDERS, NOR ANY PERSON OR ENTITY INVOLVED IN DEVELOPING, PRODUCING OR DISTRIBUTING ANY SERVICES OR CONTENT IN THE PRODUCT, NOR ANY OF THEIR DIRECTORS, EMPLOYEES OR AGENTS (COLLECTIVELY LICENSOR PARTIES) MAKE ANY WARRANTY WHATSOEVER REGARDING THE USE OF THE PRODUCT.\n\nIN NO EVENT WILL ANY LICENSOR OR LICENSOR PARTIES BE LIABLE FOR ANY DAMAGES OR PERSONAL INJURY RESULTING FROM POSSESSION, USE OR MALFUNCTION OF THE PRODUCT. THE LICENSOR AND LICENSOR PARTIES ARE NOT LIABLE FOR PROPERTY, ACCIDENTS, HARDWARE OR SOFTWARE FAILURES OR ERRORS. TO THE EXTENT PERMITTED BY LAW, LICENSOR AND LICENSOR PARTIES ARE NOT LIABLE FOR PERSONAL INJURIES OR DEATH RESULTING OR RELATING TO USE OF THE PRODUCT OR ANY OF ITS MATERIALS. YOU ACKNOWLEDGE THAT USING VIRTUAL REALITY HARDWARE AND SOFTWARE CAN HAVE EFFECTS ON HEALTH, INCLUDING BUT NOT LIMITED TO REPETITIVE MOTION INJURIES, EYE STRAIN, SKIN IRRITATION, HEADACHES, MIGRAINES, EAR ACHES, MOTION SICKNESS, EMOTIONAL STRESS AND RELATED EFFECTS. LICENSOR RECOMMENDS FOLLOWING EVERY HEALTH AND SAFETY PRECAUTION AS RECOMMENDED BY HARDWARE AND SOFTWARE PROVIDERS AND IS NOT LIABLE FOR ANY EFFECTS ON HEALTH RESULTING FROM USE OF VIRTUAL REALITY OR THE PRODUCT.\n\nYou also acknowledge and agree that Licensor Parties do not warrant or state that the Product will meet your requirements, meet the requirements of your hardware or perform without error or fault with your specific hardware. You acknowledge and agree that you follow the instructions and safety procedures as dictated by the end-user license agreement provided with your virtual reality hardware and related devices needed to run and use the Product.\n\nMiscellaneous\n\nThis Agreement constitutes the entire agreement between Licensor and you, governing your use of the Product, superseding any prior agreement. This agreement shall be governed by the laws of Iceland, without reference to conflict of laws principles. Any dispute arising in respect of this Agreement shall be subject to the jurisdiction of the District Court of Reykjavik, Iceland. This Agreement may be updated from time to time and the latest version can be found at the web address http://aldindynamics.com/products/wotw-eula.html. The latest version of this Agreement is associated to your version of the product and supersedes any previous Agreement or lack of Agreement for the use of the Product, as permitted by law. It is your responsibility to ensure that you, and any person that uses your copy of the Product, has read and agreed to the terms of this Agreement. If any part of this Agreement becomes invalid or unenforceable, that section shall be construed to reflect, as closely as possible, the original intention of the parties and remaining sections shall remain in full force and effect. Licensors failure to enforce any portion or provision in this Agreement will not constitute a waiver of such portions, or any other provision of the Agreement.", "Space Required": "464.6 MB"}



["5 stars\n66%\n4 stars\n20%\n3 stars\n7%\n2 stars\n3%\n1 star\n4%", "FatybatyJul 10 at 1:54 PM\nWow thanks for the fix you'll are awesom\n\nI had my right and ring finger amputated 4\nyears ago. My finger was stuck in a hook for an entire year prior to the amputation. In that time I had several corrective surgery's with no luck fixing it. One\ntherapeutic thing I have found in VR is being able to see my entire hand tricking my mind into feeling like my finger is there. It Phantomly feels there anyways so it's nice to see it in virtual reality. The issue I'm having with hand tracking is my missing finger is stuck in a hook again and I am unable to do some spells or pick things up in my hand. Brings back bad memories as well. If the ring finger could instead follow the movements of the pinkie and middle this would be much better. I understand this is new and experimental but hopeful that one day there is an update to help amputees play easier.\n\nHelpful | 306\nDeveloper Response16 days ago\n\nEdit: You are most welcome :) We hope you enjoy and thank you for bringing this to our attention! -Hrafn", "Marioboy1Jul 14 at 3:53 PM\nDid you ever hear the tragedy of....\n\nDarth plagueis then wise? I thought not....its not a story the Jedi would tell you. Its a Sith Legend. Darth Plagueis was a Darth lord so powerful and so wise he could use the force to influence the midi-chlorians to create...life. He had such a knowledge of the Dark side, he could even keep the ones he cared about...from dying...The dark side is a path to many abilities some people consider...unnatural. He became so powerful the only thing he was afraid of was losing Im his power. Which eventually of course...he did...unfortunately he taught his apprentice everything he knew...then his apprentice killed him in his sleep. Ironic, he could save others from death...but not himself.\n\nIs it possible to learn such power?\n\nNot from any other game...but this one\n\nHelpful | 138", "CyanScholar10 days ago\nA Magical Experience\n\nIve been a fan of fantasy ever since the second grade. Ive played everything from dungeons and dragons to elder scrolls 5 since then. You could call me some sort of fanatic of fantasy (or just a nerd). When I bought my Oculus quest just two months into my countrys quarantine this game was the first thing that caught my eye that I hadnt already known about prior to my purchasing the headset. I immediately feel in love with my surroundings the moment I landed in my tower. I absolutely loved that though the skull explained somethings, for majority of your time you have to figure out what to do. Having something like that in a story or a game makes the player feel more important, in control, and lets them decide what to do next. There are so many wondrous quests and hunts in your wizards tower alone that you could spend days on end having fun solving puzzles, casting spells, or even just being a bit destructive. I would recommend this wonderful game to anyone with adventure in their heart, and magic in their soul!\n\nHelpful | 7", "Mattplus096 days ago\nDone Buying Quest Software!\n\nI bought this to support the Dev and I have no regrets. I do regret trusting Oculus. I won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. Peace!\n\nHelpful | 4", "MusicalDrake401Jul 9 at 8:36 AM\nGame breaking glitch\n\nThis is my favorite game on the oculus. The hand tracking is great. There is tons of little secrets to discover. I loved all of the mini games. The spells are extremely fun. It is a really great game....\n\nBut there is one big problem\n\nThere is a game breaking glitch where black pixels are spread across the screen and completely ruin the gameplay. You can still see the wizard tower but big black pixels on the screen block most of your view. It goes away after a while and then comes back. Looking at it for even a minute will give you a headache so it makes the game unplayable.\n\nRestarting the game does not fix the problem.\n\nJust to be clear I know my quest is not broken because all my other games work fine.\n\nHelpful | 14\nDeveloper ResponseJul 9 at 9:26 AM\n\nHi thank you for playing Waltz! We are sorry to hear about this issue. Restarting the game should resolve the issue, but we are investigating this further and to our knowledge this is most likely due to an underlying engine glitch (which we have no control over). Please join our Discord if you want to discuss or provide us with more details on how the issue occurs for you (https://discord.gg/cxHB5zF)", "oscarfl1235 days ago\nHand tracking is an amazing experience\n\nIve recently been trying out the hand tracking as I completed this game and went back now and again but this is a whole new experience in how you do stuff in the game and even getting the infinity stones that you can put on your hand is cool and can make you go back to stuff you forgot.\n\nAll in all good game\n\nHelpful | 0", "joeytheboss21216 days ago\nHand tracking\n\nOk so I have had my quest for about a year now and they have recently came out with hand tracking. This is great if you want to move around the home screen with your hands but other than that there are no games without hands... until now! Holy crap this game is already good in itself but the hand tracking makes the VR experience that much better! Sure its hard to get used to the hand controls but once you do you wont want to use the controls ever again! This is one of the only games on the quest I have found with hand tracking and it is great! 10/10 totally worth the price\n\nHelpful | 0", "sage.bond.2000May 22 at 4:02 PM\nFive stars for Hand Tracking\n\nHand tracking is really fun. I love playing wizards of the waltz with hand tracking.  No it's not perfect. But it is one of the most immersive experiences you can get out there. Actually walking through a maze with your real hands change of things. I do think the tutorial need a bit more work. Like maybe telling you how to use each spell after you get it with hand tracking. I know the Dev have a video on how to do this on his discord I honestly just like to figure stuff out myself. Like the only problem I had with hand tracking I was just moving my hands around too fast. I know everyone's going to do that. And this game is really great without hand tracking. My best friend have played over 50 VR games and he told me this is his favorite. So I'm really happy to have it in my collection with hand tracking. Thanks for your effort.\nPS. How do I get googly eyes on my hands :p\n\nHelpful | 71\nDeveloper ResponseMay 22 at 4:36 PM\n\nThanks for playing and the kind words! To get the googly eyes, you hold your hands in the googly eye pose  (extended pinch pose to the side) for a few seconds :)", "lamahunter3 days ago\nYou're A Wizzard!\n\nFun game to show off the ability of oculus' new hand tracking will be great to see what else they add to this game as the developers are still supporting this game with free content updates. That's what makes this game perfect. They don't just stop as soon as its out the door.\n\nHelpful | 1", "LesterFreamon4 days ago\nGood game for kids. A few glitches.\n\nGame devs are responsive. Im having issues with a glitch at a point in the game. Im also having issues with hand tracking. Theyll most likely fix the issues in the next update.\n\nHaving said that, something tells me kids will love this game, 7-16 yr olds I think this is perfect for. Its an explore playroom of magic, spells, things to investigate, things to solve, minigames. I personally like puzzle games and escape room games, but somehow this game didnt connect with me. Personally, I think I need to know what Im working towards; a checklist of goals or something that nudged me onto the next thing. I noticed at times the virtual wizard room is much like my real life room; a bunch of stuff laying around and Im not in the mood to play with any of it.\n\nHelpful | 1\nDeveloper Response12 days ago\n\nHi, could you clarify the problem a bit? Hand-tracking is an option on Oculus Quest - you activate it simply by putting down your controllers. There are no progression blockers involved, hand-tracking is an optional addition to controller gameplay and offers additional features with unique finger interactions. You can reach us directly on Discord (https://discord.gg/cxHB5zF) or support@aldin.io", "Headhunter5215 days ago\nWaltz of the wizard a wonderful game\n\nI'll be honest, this was one of the first games I bought when I got my oculous quest. It really showed me the potential of the gear. This game is a wonderful break from the usual. I felt like a kid in a candy store free to explore the ship on my own. With that said, there isn't much assistance in progress. But you will figure it out because that is half the fun. I'd buy more of these games if they are available!\n\nHelpful | 0", "ZakMax12315 days ago\nAmazing Game!\n\nI absolutely love this game. I spend hours just messing around in this game, playing with hand tracking and torturing Skully (or I did, before I found the secret and snapped him out of existence!). Whats even more amazing is the fact that this game keeps getting better and better! First hand tracking, and now little updates with Easter eggs and new features such as Palpatine-like lighting? Incredible!\n\nHelpful | 0", "Rick_R-347Apr 16 at 7:00 AM\nBest it everything\n\nI can't find anything I can't interact with. Also, I'll be getting surgery soon all my body is getting less and less able to do the intense battling in some games, so as it is I'm starting to prefer exploration games even more,I've anyways loved them but i think all games should have SOME combat mechanic at least.\nAnd this does it. Everything. And once you've toyed with tossing enough fireballs and. Bolts,shot some targets,sliced some apples,there is an actual world dedicated to light combat. This game is perfect I almost every way imaginable. Imagine if the developers came out with a town. Then when the hardware upgrades a whole world. Real Potential with these guys.\n\nHelpful | 233", "iddlejackalope15 days ago\nFun But Has Glitches\n\nIt is very fun and entertaining especially the had tracked part but it is bugged and it isnt as fun I cant use the hand tracking because it only tracks my pinky finger and all the fingers bend\n\nI hope that the developers are aware of this bug I hope they can fix this\n\nHelpful | 1", "MemnochVRJun 24 at 2:15 AM\nBeautifully crazy\n\nThis was a beautiful crazy experience. In this game, designed with much love for details, there are many little secrets to discover. Not all of them are self-explanatory and you just have to try around. But that's also exactly the goal: have fun in your own crazy magician's tower attic, fool around with magic stuff and take trips trough macical rips to other places.\n\nHelpful | 5", "Mr.SanboA day ago\nOne of my favorite games period\n\nIts a wonderful vr game, especially for the quest, and the new hand tracking update is just icing on the cake. Beautiful work, and absolutely worth the low price.\n\nHelpful | 1", "Luckymase616May 17 at 12:35 PM\nHand tracking ideas?\n\nI love this game but Im writing this review to see what you guys are thinking about using hand tracking in your game. I already know Oculus isnt allowing hand tracking in any of their games, I would just love to know if you guys are thinking about using it in your game and how youre going to use it.\n\nHelpful | 29", "No3vA8 days ago\nGood god\n\nMy comentery:\nSo cool oh the skull talks neat the water reacts wait... there is hand tracking?!!!?! Cool cool neat awesome cool neat!\n\n10/10 game nothing else to say.\nGet it now.\n\nHelpful | 0", "RockteurMay 2 at 6:34 PM\nMy jaw was on the floor the entire time\n\nOne of the best VR showcases on the Quest. Last about 2-3 hours. A concrete foundation for a future game and I cant wait to try hand tracking. Would love more and tougher combat encounters, and a whole village to explore with AI characters that react to your magic.\n\nNote to Devs: You did a great job.\n\nHelpful | 40", "NeonXplorerJul 6 at 10:38 AM\nEpic game!! 1 issue though\n\nThe game is pretty epic. I can tell because you put alot of detail into developing this game. For example: how you can change the floor to your liking, how you can solve puzzles and riddles, how you could explore to your hearts content, etc.\n\nOnly thing i know is a bit cliche but whenever i throw an object at the armored knight and catch the item, a trophy doesnt appear and i dont get the Catch This! Achievement. Im not sure if its a bug or not, since i seem to have every achievement but the one I specified in the review.\n\nHelpful | 2", "balasarbiscuit17 hours ago\nIts fun\n\nOnly problem is that the hand tracking cuts out every now and again. When that happens I just go back to using controller. :)\n\nHelpful | 1", "Hayden_the_hippoJul 19 at 10:36 PM\nGreat but needs bug fixes\n\nI love this game but there are a few bugs for example when I put hand tracking on waltz of the wizard it will randomly switch to the remotes after a few minutes and a hidden item that I found wont stay on my desk every time I get on I have to get it again Im not sure if the creators want it like that or it just wont save that item but I love the game if these bugs or flaws got fixed it would be great\n\nHelpful | 0", "LightningBoi2963116 days ago\nThis game is amazing!\n\nThis game is so much fun! I love to use the puppet power to cause chaos, and the hand tracking is phenomenal. Its so sweet of you to add a feature for those with missing fingers. I definitely recommend!\n\nHelpful | 0", "DinoCakeJul 20 at 12:32 PM\nAmazing game!\n\nAbsolutely love this game.\nIt's pretty creepy, for me anyway, I am the scaredy type though.\nI like the different spells and all the other things you could do.\nI only missed two targets on the target game on my first try!\nI also like just throwing fire balls everywhere!\nGreat game!\n(Also I still kinda feel sorry for turning skull into a firework)\n\nHelpful | 1", "squidiouskJul 19 at 5:47 PM\nGreat game but...\n\nThis game is great! I have 2 complaints though. The first complaint is that its a bit too short. Me and my friend managed to get every spell in only a few hours while taking turns. It is only 10 dollars so Ill give it that but still, its extremely short. The next complaint is debatable. I dont know if this was just a thing for me or if other people have experienced this but its that the hand tracking is extremely bad. Its nearly impossible to walk and my hands disappear when I try to do almost anything. But pretty much everything besides that is great! Its fun and funny and it has great graphics. Though it didnt take long to get every spell it was extremely fun doing so. Great game all and all.\n\nHelpful | 0", "MickeyFL13Jul 21 at 3:42 AM\nHand tracking is sketchy at times\n\nThe game is cool as far as making the spells and the hand tracking allows you to feel like you are making magic. The skull kind of gets annoying after awhile though. For some reason my Quest seems to lose the handtracking on this game where the hands fade out and then back in. I uninstalled and reinstalled the app and it didnt help much. I also dont know the extent of the game. I am in the room where the spells are made but dont know where to go from there or how to leave the room. The reviews and the video preview show another part of this game, but I cannot for the life of me figure out how to get passed the room.\n\nHelpful | 0", "DogePlaysWowJul 19 at 12:07 AM\nima wizaard!\n\nthis experience is just great! a year ago i tried the free steam vesion and it was a blast! now when its here on the oculus quest i could try the full version and it was great. and thanks to the handtracking it has 5 stars for me. (im the one who wrote about having handtraking fingerguns and crossbows.)\n\nHelpful | 1", "xXAstroCatYTXxJul 17 at 5:09 PM\nGood Game, too short :(\n\nI liked this game, it was pretty good. I got it before hand tracking came out though so I had already played the entire thing. I really liked to experience hand tracking, without the hand tracking I would given 3 stars most likely. Its a pretty average game, although it does not have to long of playtime sadly, it doesnt really have much to do after about 30 minutes to an hour. If there was more to do I would probably give a 5 stars.\n\nHelpful | 1", "krabo74Jul 19 at 12:52 PM\nGood\n\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nGood\nAmazing game\n\nHelpful | 3", "Azazel08May 28 at 8:04 AM\nThis is the best hand tracking game\n\nThis is a great example of how hand tracking can be awesome. My whole family loves it. My 7 year old has a much easier time with the hand tracking in this game than Elixir or The Curious Tale of the Stolen Pets. I hope more devs include all the options for teleporting, walking, or physical movement that is included in this game. It is easy to learn and easy to repeat quickly.\n\nHelpful | 11", "BlooddrawnJul 14 at 9:46 PM\nAwesome\n\nIve heard great things about this game and the hand tracking is awesome.\nKeep up the great work. Cant wait to see what comes next and future updates.\n\nHelpful | 4", "mae.dsd.9Jul 14 at 1:08 AM\nincredible\n\nhi !\nthis game is absolutly amazing. though hand tracking need a bit of practice (for me only obviously my kids manage it perfectly) it's a great game.\nrealistic, fun and a bit scary (the cage trap just scared me ).\nit's my second hand tracking game, and this one is a real treat.\nwe are a French family, and our English is quite...poor to be honest...but we understood everything ! great point, especially for my kids \nthanks everyone ! it really worth it !\nmy son feels like he s the real Harry Potter now ! great job !\n\nHelpful | 1", "kylestorm7 days ago\nSpells\n\nI noticed there arent as many spells as the first version so if you could add more spells that would be amazing\n\nHelpful | 0", "Spacybirdz22 days ago\nGood but short.\n\nIt's a fun game but after a couple days or hours there is not much to do and on top of that if you use the hand tracking you can do more like example the hand puppets I hope this review was helpful\n\nHelpful | 1", "LookinSharp9898Jul 12 at 10:10 AM\nFunny Bug\n\nChanged my review because just encountered a hilarious bug! After I went to the Observers place, when they sent me back to the tower. The Observers level combined with the Tower level. The cage was around my desk, the siren head looking thing was twitching from in front my desk. And when I look outside it was the Observers level. Couldnt interact with anything from that level but the Tower I could. Im not because it was funny. But do please fix this. \n\nHelpful | 0", "PeakBreak911375Jul 25 at 4:05 PM\nIts good\n\nI like it but the hand tracking could be better and also it crashes after like 30 mins which is one bad thing, but overall pretty good they just need to fix the hand tracking and the crashing and then itll be a 5 star game for me\n\nHelpful | 0", "Nicholas5045Jul 11 at 4:58 AM\nOne of the coolest VR games Ive played!\n\nIf you like wizard games, experimental games, or games where you get to mess around for hours, then this is definitely the game for you! In this game you discover spells, potions, and other magical objects, all for the purpose of having fun in your wizard tower! This game was made to push the boundaries of VR, and it definitely succeeds. It even has complete hand tracking support! With hand tracking you can literally turn your hand into a hand puppet. Why? Cus why the heck not? Theres also a bunch of secrets to find, so always be curious! And this game is still being updated (it was literally updated 3 days ago as of writing). Should you buy this game? Heck yeah! 10/10 would yeet Skully out the window again.\n\nHelpful | 1", "roman0904Jul 27 at 10:08 AM\nIdeas\n\nI love waltz of the wizard it was the first game I played what would be really good for a update is to have the dark magic which the nights in the maze have and maybe a pvp aspect and maybe the the other box could have a bit of chating and maybe a little bit more spells\n\nI just finished the new Easter egg WEE NEED TO BRING BACK LARRY\n\nOk iam back and now I have really completed the Easter egg it would be nice if we had a way to not be scared in the maze because I am easily scared and being scared makes me night terrors\n\n\nAlso I cant go on discord because i dont have a pc but u invited me to join ur discord\n\nAlso I had that black pixel glitch its quit rate but it would be nice to not have it\n\nHelpful | 1", "VanceTheWeebJun 6 at 12:02 PM\nGreat game!!! A few annoying bugs\n\nThis game is so fun but there is one thing I wish that they added. Harder spells, I completed the spell making in like 20 mins. You should make it so there is no spell guide to tell you which ingredients you need. You should also make more spells with the addition of 2 more ingredients per group. Now to address the hand tracking. It was great work really well but my only problem was picking up stuff and when my hands got too close to each other they would disappear. And for some reason when I tried to pick up the liquid to put in my spell, my hands would always disappear, I was able to pick up everything else just fine. If I had to chose between hand tracking and controller. I would chose controller.\n\nHelpful | 5", "FF-Vanguard23 days ago\nMakes you feel like an awesome wizard!\n\nAbsolutely love this. This sort of experience was what I dreamed of as a child, so Im only even more excited to see how much further it goes. Love the hand tracking additions too!\n\nHelpful | 1", "derpysanta15 days ago\nLove the game, few problems though\n\nI always play this game, when family or friends are here it is the first game they play. I think it is worth the money. Just one thing, there are only 12 abilities. Would love if there was a lightning one, or a flying one, etc. another issue is that with the snapping thing, sometimes, it takes 7 or more tries to get it. But that may be just the hand tracking. Would also love it if instead of just grabbing it with my index finger and thumb, you actually make a fist around it. All in all, great game, just needs more abilities.\n\nUPDATE: Lightning! Lightning! I LOVE it! You can be Darth Sidius now! :) Thanks Devs! Another idea, maybe you can do something with the water in the pot, like make a ball in the air or something.\n\nHelpful | 0", "gridnodeJul 9 at 11:14 AM\nGreat game\n\nThis game is perfect for hand tracking and lets me live out my biggest fantasys of wielding magic when I was a kid. Hand tracking completes this game so perfectly and I can spend hours experimenting, battling, and solving all this game has to offer. But as a side note, the skull scared me so bad when it actually responded to me for the first time. 10 out of 10\n\nHelpful | 1", "Jcamacho5519Jul 16 at 10:49 PM\nIt brought tears to my eyes...\n\nIm a 41 year old male and I never thought I would feel this type of enjoyment from a video game. I thank you from the bottom of my heart for making me feel like a kid again...\n\nHelpful | 2", "Lukasthetru1Jul 14 at 10:03 AM\nHours of fun!\n\nHours of fun! But its a shame lots of the items are pointless but other then that its a great game. The hand tracking has been developed great in this game and the physics could be better.\n\nHelpful | 2", "meduzoMay 27 at 4:13 PM\nCompletely Magical Hand Tracking\n\nThis game was an OK experience without handtracking, it was nice to see how much stuff you could do with the potions, xylophone and spells.\n\nNow that handtracking has been added this has evolved from an OK game to an incredible experience, I felt the power with each one of the gestures I made to create spells, teleportation just works incredibly well and the experience pushes the boundaries of what can be done with handtracking by adding the oh so mighty snapping of the fingers, I FEEL LIKE THANOS WHEN I SNAP IN THIS GAME!\n\nGreat game altogether, made even greater with the handtracking integration!\n\nHelpful | 6", "theshorthipanic_yaniJul 7 at 6:38 AM\nBest hand tracking game ever!\n\nThis game is definitely worth 5 stars but the only problem I have with the game is aiming my spells. I cant aim well during the labyrinth so I literally have to snap all of the enemies away every time. Please add a small targeting system to the hands please! \n\nHelpful | 1", "mugglefamily365Jul 26 at 2:19 PM\nCant snap\n\nI love the game but after the new lighting update I cant snap things out of existence I never had trouble before so I cant figure out why please help\nBut besides this the game its great\n\nHelpful | 0", "fieroman1978May 8 at 8:19 PM\nWow\n\nIm blown away by the physics in this game. Also the graphics are awesome as well. Just little things like reflections..impressed. The air drawing spell is so trippy. Love it!. So many little things in this make it add up into a pretty impressive package. Looking forward to hand tracking update. Well done devs.\n\nHelpful | 12", "ignomolyJul 20 at 8:56 PM\nWow\n\nHad an amazing time playing and exploring the latest amazing features in this amazing game. This game delivers like no other.\n\nHelpful | 2", "tsl3161991Jul 13 at 10:32 PM\nHand tracking could be better.\n\nThe game is pretty good if you don't use the hand tracking. Whenever I try to use it, it keeps losing track of my hands. It happens every time I move my hands too close to my face, too far from my face, too close together, or too fast.\n\nHelpful | 0", "Garbagelady5 days ago\nGood\n\nGood but eventually you should add enemies\n\nHelpful | 0", "leila.taloreJul 7 at 1:57 PM\nTHE BEST\n\nThis is the best game on vr. It is sooooooooooooooooooooo immersive and interactive. The only thing is that hand tracking is a little werid sometimes when I move my hands they disappear.\n\nHelpful | 2", "TallDrakeMay 29 at 5:41 PM\n\n(played on Quest, with standard controllers rather than hand tracking)\n\nNice little escape room with some sandbox elements.\n\nContext lasts 2-3 hours:\n- long series of riddles\n- 'knightmare' style dungeons with traps and light combat\n- shooting gallery and sword block challenges\n- sandbox of 12 spells to play with, plus some interactive objects (e.g. musical instruments).\n\nIf you like escape rooms IRL, you should definately get this.\n\nMight also be good as a party game, with the other people watching a cast and 'helping.'\n\nHelpful | 4", "15doggoJul 10 at 2:32 PM\nOne of the best games in VR\n\nI recently tried the new hand tracking update and it was amazing, like the way you could just thanks snap things out of existence , and how you could shoot lighting out of your fingertips like emperor Palpitine it was extremely fun. 13/10\n\nHelpful | 0", "Mrpenguin212124 days ago\nVery enjoyable\n\nI love the whole atmosphere of the game it is just so fun to be a wizard and to use magic it makes my Harry Potter dreams come true\n\nHelpful | 1", "Broccoli_Ninja20 days ago\nWaltz of the Wizard\n\nGreat game but short, kind of disappointing that you don't get to do sword on sword combat but very fun\n\nHelpful | 0", "MrOoferJul 16 at 7:01 AM\nAmazing Game!!!\n\nThis game is an experience all questers should try, you can interact with any object in the game, mess around with different spells, and many other things you can do. Would buy again.\n\nHelpful | 1", "Gombocka00724 days ago\nAwesome\n\nThis game is so amazing with so much things to do. It's fun and entertaining. I would def recommend it\n\nHelpful | 1", "Nmonky2May 24 at 5:46 PM\nHand Tracking!!!!!\n\nI had already bought this game as one of my first games, and I loved it by itself... then... a new update! Hands were on the game picture, so I put down my controllers and started the game. So many fun ways to use your hands!! Loved the great ideas!!\n\nHelpful | 6", "Shreader87Apr 24 at 3:00 PM\nSo much to do!\n\nI love Harry Potter and fantasy things so this game got my interested. The game has many little puzzles to explore. Originally I downloaded this because I thought hand tracking was available but it wasn't just yet, but I have heard it's likely to show up. Even without hand tracking there are many things in this game to make you feel like a true wizard and the best part, such a great price!\n\nHelpful | 18", "Riley_611Jun 5 at 1:57 PM\nUnexpected!\n\nWhen I first saw this game I got it in a pack with Red Matter. I mostly got the pack for Red Matter and I had no idea what this game was. I disregarded it for a long time but I finally got around play it. I cant believe how fun this game is. I did everything that you can do in like 3-4 hours. There is just so much to do. You can almost interact with everything. The game is also kind of scary at parts but once you beat the different levels they are not scary at all. I definitely recommend this game, its a blast!\n\nHelpful | 2", "eoinokJun 3 at 6:30 AM\nWow\n\nVR is one of very few technologies that make you feel like the future has actually arrived. Hand tracking takes it to a new level. The way it's implemented here is just fantastic. It made me smile, it made me shake my head in disbelief. It's still an experimental thing, so don't expect it to be as reliable as using a controller but... if you're like me it will blow your mind.\n\nI already had the game so this was a free update. To get this much new functionality in a free update is pretty amazing. And I should add that these developers already had a great track record in this regard, with other substantial updates and additions in the past.\n\nI can't recommend this highly enough.\n\nHelpful | 2", "gameingwithrykJun 25 at 8:08 PM\nThis is a vary fun game\n\nI love the new hand tracking and the game play if you just started vr or want a good wizard experience this is for you it has great gamplay and features,puzzles,experience for all peaple there is fighting with swords and spells this is a game you should get\n\nHelpful | 1", "KasumoJul 30 at 12:34 PM\nHands down the best game\n\nToo fun. I love this. However, I wish there was an option to mute the skulls voice\n\nHelpful | 1", "cj19202May 31 at 2:25 PM\nHand tracking, and new spell idea\n\nI absolutely love the hand tracking because with the controllers it is like a hands on game play and hand tracking makes it way much more better, and this is a spell I've wanted in waltz of the wizards for a very long time and that is a lightning spell plus the hand tracling, just imagine shooting lightning from your fingers or hands that would be absolutely awesome.\n\nHelpful | 2", "LauraL00Jun 15 at 4:48 PM\nMagical!\n\nThis was my first Oculus purchase, just in time for the hand tracking update. I suffer from carpal tunnel so I keep coming back to this because I can play longer without using controllers, and to be honest its just more immersive using sparkly hands to conjure up magic dust that turns all the things in the tower into frogs . I did struggle a while because I hadnt played the game with the controllers, so I didnt know there was a crossbow which is pretty much necessary to complete some parts of the game. The hand tracking isnt 100% but its pretty amazing all the same. The world of the wizards is very interesting, and gradually takes shape the longer you play. I love this the best! Theres still some mystery about their universe, and I hope that more scavenger hunts, riddles, and jokes continue over time. Look closely at the book titles, too. Cheeky.\n\nMy only negative is that Ive done the action required for an achievement multiple times (when a long time went by and there was one empty trophy space I looked it up). Im thinking I may have to reset progress and start over, but I dunno. As a completionist, it bugs me, but I know Ill play through it again anyway.\n\nDevs, your imagination has given us a spin on wizards that feels familiar but also kind of new and mysterious. And a little scary, with some humor peppered in. Please keep adding more to the game. Id love to keep exploring and interacting with the universe youre creating.\n\nHelpful | 1", "WingsFan91Jul 11 at 6:53 PM\nBUY NOW!!!!\n\nBy far the best $10 I've ever spent! Awesome with or without hand tracking, fully immersive, totally entertaining, if you own the Quest, you MUST purchase this game!!!\n\nHelpful | 1", "TheRealTempest2May 29 at 9:14 PM\nWizards with hands!\n\nTried the hands update... Very cool but... So nice to be able to look at something and have it explode by snapping your fingers-or pick things up and drop them.... But then, picking things up needs a bit of a tweak. Try and pick up a wand from the cabinet and make it work... I tried for a while to do so and was not able to... It is a fantastic start and I look forward to how it can improve.... Oh, and I love the travelling!!! Finger out palm up with fingers curved then open the hand... Way cool! definitely worth upgrading to try it! Btw, anyone figure out the three items on the pedestal? I know to look through the one but???\n\nHelpful | 2", "sillydogeballJun 13 at 9:24 PM\nRad!\n\nThis is really fun! I love the ability to create all sorts of items to my own delightful surprise. Im still very much struggling with some of the gestures using hand tracking, but it may be user error as my 10-year old son managed to giggle his way through everything in half the time! What a fun app, thank you!\n\nHelpful | 1", "NerdyMarianneMay 2 at 4:20 PM\nAn adventure\n\nI really like this game a lot. Theres all kinds of riddles you can do and spells to learn. Theres fighting too!\n\nI dont suggest it for small children because as an adult on one of the adventures I nearly crapped my pants from an evil knight guy. I really enjoy this a lot. Kind of like a dark Harry Potter feel with and the skull who is your sidekick sounds like Batman a little but I like that A LOT!\n\nHelpful | 7", "OverdueTerror82Jul 9 at 2:43 PM\nGreat immersive game\n\nReally fun game to pass the time. Very interactive and immersive. The hand tracking works very well for everyone in my house except me, so I dont fault it for that.\n\nHelpful | 0", "kimbiecookieJun 19 at 11:37 PM\nGreat game for 1st VR experience\n\nGreat game and fun experience if you are new to VR. The potion making experience and spell casting is great fun for everyone. The other realms can be a little freaky but really fun! Over all great game! I played it on the Vive and now on the Occulus Quest.\n\nHelpful | 1", "JoeyReJun 15 at 2:57 PM\nLove it\n\nVery fun, my daughter says it allows her to use her imagination but challenges her at the same time. I enjoyed the challenge and figuring out the codes. I would of like to be able to move around more free with toggle sticks rather than warping from spot to spot, but I'll take it!!!\n\nHelpful | 0", "vrjack26Jul 19 at 5:27 PM\nWell worth the money\n\nTheres so much to do. Will want you coming back for more everyday. The hand tracking is absolutely amazing\n\nHelpful | 0", "MereihJun 10 at 3:08 PM\nGreat fun\n\nI loved touching and interacting with the objects in this game. I probably spent a couple of hours just touching things, picking up things, and playing with the magical spells on my hands. Using the spells on the skull and his reactions were so much fun. There are two reasons I didn't rate it as a five-star game. First I feel that since the gameplay is so new there needs to be more tutorial play. It was hard to master all the movements. And I had a terrible time reading the instructions in the beginning because I couldn't move that well. The second reason and probably the most important reason why I didn't continue with the game was the locomotion. I just couldn't master moving my character. Honestly, I hated the point and shoot locomotion. I tried all the alternative locomotion options but nothing really helped. I don't know if I would have gotten better with a more in-depth tutorial. I will go back and try it again at some point in the next few weeks because I believe that it has the bones to be a great game.\n\nHelpful | 0", "Twissy-87Jun 24 at 12:33 PM\nMindblowing!!\n\nLoved all the tricks and exploration that it has. The hand tracking needs a little fixing but for its price it's one of the best games there are.\n\nHelpful | 2", "HaLLuCyNo_JeNJun 8 at 12:31 PM\nStrange Voice.. is it part of the quest?\n\nHello, when you come closer to the stone pilar on the left of the knight, you can hear a dark voice saying..\"touch me...\" I don't understand the rest of what he is saying.... Is it part of a trial? I have only one trophy missing. Do we have to put something on the stone pilar to solve the riddle ?\nThank you... \n\nHelpful | 0", "GladsteinVRJun 10 at 10:27 PM\nMy son loves it!\n\nWe have been trying the hand tracking and not much out there yet but when I found this you can use your hands or remotes. So my son loves it. An is now mixing everything in our kitchen together because he wants to be a chemist now he says. Great game on quest. Thumbs up for sure.\n\nHelpful | 0", "GanjarobiJun 23 at 9:55 AM\nHand Tracking is PHENOMENAL !\n\nGreat game, works perfectly, no complaints! Great job developers, Id give 6 stars if possible !\n\nHelpful | 3", "Syun_Wukong14 days ago\nConstant crashing\n\nSo, I really enjoy this game on the Quest, but every time I try to go through the labyrinth, the game crashes. I've tried multiple times, to no avail.\n\nHelpful | 1\nDeveloper Response14 days ago\n\nHi and thank you for playing Waltz! We've not heard of this issue before, could you please describe the issue in detail (possibly record a video) and send us an email at support@aldin.io and we can look further into this issue :)", "Very_LegitnessJun 5 at 8:06 AM\nBest game on the Quest!\n\nI bought this game several months before hand tracking came out, and even then it was great. You can interact with nearly every thing. It's incredibly immersive, to the point where I'll occasionally try to rest my hands on the table, only for them to pass through.\n\nAs for bugs, there's barely any. Occasionally the game will freeze, but that's only if I mess around with puppeteer too much. Hand tracking is also a little buggy, but that's not the games fault. It's just hand tracking in general.\n\nWith hand tracking, this game is amazing. It really feels magical, and it's really fun. Using your hands for the spells feels brilliant. I remember using weightless to throw things at the knight from across the room, only to snap them mid air.\n\nAlso, snapping your fingers to blow stuff up is great. Any time skully reprimands me for putting something wrong in the pot, I just click my fingers, and boom! He's gone!\n\nAfter playing with hand tracking only for a short while, I don't think I could ever go back to playing with controllers. It's just amazing. I would give six stars if I could.\n\nHelpful | 0", "YoshiarcanumMay 6 at 7:42 PM\nIt's Good.\n\nI've always enjoying fantasy, especially wizards and magic so I was quick to get this and it is amazing. I haven't done everything yet because I'm having fun just playing around with the spells. Good job, devs. Looking forward to seeing what you guys add to the experience.\n\nHelpful | 5", "Mr_Robot123140Jun 2 at 12:27 PM\nThis game is amazing\n\nThis game is absolutely amazing. I let my family try it and they thought it was super cool that you get to move your hand around and make potions and play with the potions after they made them\n\nHelpful | 3", "chronictiaJun 4 at 6:08 PM\nHand tracking is frustrating\n\nWhen this experience first came out for use with the touch controllers, it was 4 stars from me. (Minus one star since the only way to find cool elements was to stagger on them haphazardly and accidentally. Some type of guidance would only add to the experience.) Using the hand reaching feature feels as though it was retrofitted and released before the kinks were worked out. Depth perception of how far items is inconsistent, making it very hard to even try to pick up items. Then it's very to pick them up and move or use them. They frequently fall. As for seeing your hand develop eyeballs and mime talking to the other hand? It lasted only about a minute, and I couldn't make it happen again. I tried to reset the game so I could use the controllers and was unable to do so. The whole hand tracking experience was very frustrating.\n\nHelpful | 8\nDeveloper ResponseJun 5 at 5:51 AM\n\nHi - Im Hrafn from Aldin. Thanks for playing Waltz and sorry to hear about your issues. Sounds like issues commonly experienced when tracking conditions are not optimal in the hand-tracking mode (or maybe something more, since you should be able to always switch freely between controllers and hands on the fly! Are you using OS17 on your Quest?). We published a blogpost that goes into more detail on how to achieve optimal tracking, also has a video demonstrate what your experience should be like in good conditions - https://tinyurl.com/hand-tracking So I better understand, you feel like the free update made the experience worth fewer stars? Id also appreciate hearing more in case you found issues not related to tracking. We always strive for top quality. Our Discord is best for feedback, or support@aldin.io.", "Danu_Jul 12 at 12:51 PM\nEPIC\n\nits really cool and entertaining. the hand tracking is amazing and i love all the things you can do\n\nHelpful | 0", "dead1617Jul 20 at 7:50 PM\nAmazing\n\nI love the new update with Lightning makes you feel powerful\n\nHelpful | 1", "Purpleguy0821Jun 15 at 4:59 AM\nGreat game but...\n\nThe hand tracking doesnt work as intended with my fat fingers. My hand keep disappearing and when I go to teleport, my index finger makes a hook instead of pointing. Other than that, with controllers, the game is great and I love it!\n\nHelpful | 0", "YoungdaggerlordJul 28 at 9:22 PM\nYou should buy\n\nGreat game\n\nHelpful | 0", "Cowboy1947Feb 25 at 11:09 AM\nGotta Love it !!\n\nThis is a special kind of puzzle and a special kind of experience. You can enjoy it just as an experience - dazzling VR art. Or, soon you realize there are puzzles to solve, things to do. Apparently ENDLESS things to do. Hours and hours of fun. The wizard's world is full of mysterious objects and crazy tricks. If you think you have run out of possibilities, check some \"cheats\" on the net. But see what you can do without the hints. I am HIGHLY sceptical of reviewers who say they \"played it out\" in 2 hours.\n\nIt's good clean fun for kids and grown-ups. I am in the second category, having tired of first-person shooters 1/2 a century ago.\n\nHelpful | 86", "noah.bieleckiJul 16 at 7:27 AM\nGood game.\n\nHand tracking is great, and this game is fun to play around in for hours!\n\nHelpful | 1", "Shortstuff368Jul 11 at 7:49 PM\nReally cool\n\nSuper fun game that got better with hand tracking. Still cant find all the infinity stones :P\n\nHelpful | 0", "BurbleBurbJul 4 at 9:19 PM\nGreat game, not great hand tracking\n\nTitle says it all, the game is great, I recommend it for the low price, but the hand tracking could be improved\n\nHelpful | 0\nDeveloper ResponseJul 6 at 8:35 AM\n\nThank you for playing! Here are a few tips for better hand tracking: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "LuckyDragonsJun 5 at 10:52 AM\nBest game Eva said 8 year old\n\nMy son loves this. He wanted me to write this review for him. He says he really wants to fight and kill the Knights but he can't find the door to kill them. just a bit of random there.\n\nHelpful | 2", "JVLIGMAJul 12 at 9:45 AM\nBest wizard game ever\n\nJust so amazing game mechanics is boss and the hand tracking is phenomenal\n\nHelpful | 0", "Kyan010Jun 29 at 9:59 AM\nCool game but im scared\n\nThis is a really good game but im scared to go into the portals in the snow globes, and i dont now how to open that mysterious closet .\n\nHelpful | 0", "DG107Jul 18 at 4:16 PM\nAmazing!\n\nMust play sooooo fun with hand tracking!\n\nHelpful | 0", "mayapapaya75Jun 27 at 11:30 PM\nI LOVE GAME\n\nI love this so much no bad things\njust love love love love it!\n\nHelpful | 2", "omega911May 26 at 12:10 AM\n\nWow shot out to the devs. This took the thought of handtracking being a cheap gimmick totaling it has infinite possibilities. Only wish you guys would incorporate a in debt tutorial to instruct noobs how to get to the meat and potatoes. Because actually battling with handtracking is immersively magical.\n\nHelpful | 0", "labensonJul 16 at 10:49 AM\nBest played with actual hands\n\nNot much to say, but it is worth the $10.00\n\nHelpful | 1", "thomas_wadsworthMay 29 at 2:12 PM\nGreat showcase of all things vr\n\nSome truly fun things to do in this game, you just have to work to find it. The hand tracking is great and works really well most of the time. Their are plenter of fun mysterious to discover. Visuals are great some, some whimsical sound effects and snappy writing from the bone head\n\nHelpful | 1", "MettaSphereJul 14 at 7:22 AM\nDoes not work\n\nTried this and could not get past the beginning. It told you how to stop moving and yet that did not work and it told you how to open a menu and that did not work. This Hand tracking is a joke and does not work. I would love to get my money back from this junk. Oh and Hand tracking works on the quest menu with out a problem.\n\nHelpful | 1\nDeveloper ResponseJul 14 at 8:41 AM\n\nHi, can you please try restarting the game and see if the issues persist? Please contact support@aldin.io if the issues remain.", "RowdyRocketFeb 28 at 12:02 PM\nNo Hand Tracking\n\nPlayed through this originally on the steam version. Very amazing experience. Watched a few videos showing it with hand tracking and that excited me to play through again. Unfortunately, it still doesn't have hand tracking. This is the perfect game to implement it on. Devs, What are you waiting for?\n\n\nResponse to Dev: Awesome to hear that you guys are ready! Oculus what are you waiting for?\n\nHelpful | 56\nDeveloper ResponseMay 24 at 4:38 AM\n\nThe hand tracking update is available now :)", "Jsoy417Jun 24 at 5:43 PM\nA ton of fun!\n\nThis game is so much fun! Highly recommend it! And its only ten bucks!\n\nHelpful | 2", "GRex2Jul 9 at 1:54 AM\nBest game ever\n\nWhen I started playing this game it made me feel like a real wizard 10/10\n\nHelpful | 0", "5HR3DD3RMay 26 at 1:09 PM\nGood game but can't hang with the Devil.\n\nThis a very good game with good concept. My daughter and I loved the demo. As soon as I saw hand tracking I had to get it. But as I was exploring the game I ran into a Baphomet statue with a upside down pentagram. I was okay with casting a few spells but, worshipping the devil is not on my to-do list. People have a right to their opinions, but those opinions can rule out others who don't agree. I believed this game could have been neutral for all peoples to enjoy, and for my family to enjoy, but obviously it has ruled out my family, unfortunately. I was eager to show more of my family the game, those new to VR, but as some hold strong to their beliefs, I see it difficult to appeal to a everyone (neutral). I know the game is somewhat dark, but acceptable, but the Baphomet Statue made it full biased for me. As much as I would like to keep the game and share it....I can't. Maybe if the satanic symbolism was gone, I would definitely keep this game.\n\nHelpful | 7", "SOLAlexBlackMay 26 at 7:43 PM\nHand tracking is so cool\n\nThis new update made it so amazing to play the only problem is that right now it feels as if both the quest and waltz of the wizard hand tracking is still in beta. My right hand can't interact because the quest is losing it while it's right in front of my face and I'm flipping the skull off\n\nHelpful | 1\nDeveloper ResponseMay 27 at 6:13 AM\n\nThank you for playing! Regarding the hand tracking mode here are a few tips: - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "thedogofpowerJul 9 at 2:11 PM\nGreat game, could improve.\n\nI love this game, I wish we had a way to reverse the Easter egg though\n\nHelpful | 0", "mikeymike589May 24 at 2:25 AM\nBrilliant, immersive & a bit terrifying\n\nIt was on special offer and as I love games where you enter a whole new world - as opposed to ones like Beat Saber which aren't about world building - I thought I'd give it a go. It's brilliant. I've only played it for 3 hours but it's one of those games which I look forward to playing as, like a good film or TV series, I can't wait to see what happens next. The graphics are great, it's got quite a bit of charm, and sometimes it's just terrifying. It's the only game that's had me cry out in fright a few times.\nUpdate: Once you complete the maze bit there's not a whole lot left. While this bit was great, not much happens afterwards. The part where you meet the super powers seems unsolvable - you're given items to manipulate but I've given up on this part of the game. Similarly the canyon also seems a dead end. On the whole it feels like half of a truly amazing game.\n\nHelpful | 1\nDeveloper ResponseMay 24 at 4:36 AM\n\nThank you for leaving a review :) Waltz of the Wizard is expanding and there's much more content to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "QuarklessJul 2 at 8:03 PM\nFun but trivial\n\nI haven't completed it yet, but what I have seen, including hand tracking is great and entertaining\n\nHelpful | 0", "Lightsouls86Jun 26 at 3:41 PM\nAmazing\n\nOnly one complaint I had a very hard time figuring out some of the riddles had to look them up. Other than that 10/0 would recommend!\n\nHelpful | 1", "arcsulaJul 5 at 4:23 PM\nFull of bugs and frustrating as hell\n\nThis game is so buggy it's not playable. Some spells require using a xylophone and this is completely unusable with finger tracking - hands disappear, fingers press multiple notes... all ruining the spell. It's completely unseuable.\nThen when I go back to using the controllers, I get given paddles to strike the notes! Great, that works... but I lose controls like picking up objects with the controllers.\nI was an ok concept and I played it for about an hour, struggling through the many, many bugs and problem interfaces. (One time, when using a spell to manipulate objects, all objects crashed and couldn't render - hurt the eyes big time.)\n\nThis seemed like a good concept, but was so buggy it feels like a beta version.\n\nHelpful | 1\nDeveloper ResponseJul 6 at 8:43 AM\n\nHi, sorry to hear that you didn't have an optimal Waltz experience! Could you please try running the game again on full battery and seeing if the issues persist? Regarding hand tracking, please try running the game in another room and cleaning the cameras. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking Please let us know if any of this helps you! Also always feel free to contact us at support@aldin.io", "kylefosJul 17 at 6:49 AM\nLove this game\n\nThis game is so cool\n\nHelpful | 0", "thekingofcardsMay 19 at 8:07 PM\nGreat game\n\nIm not a game critic but Im a causal gamer and this is THE best vr experience I have had on the quest so far mostly because I always dreamed of having super powers growing up (I would write more but Im sure other reviewers have said it for me)\n\nHelpful | 2", "karum.bhawnaniJul 1 at 1:23 PM\nHeeelllll yea!!!!\n\nDude, this is one amazing game. The graphics are amazing and the physics are great. Love it!\n\nHelpful | 1", "Wolfieboi465May 18 at 12:28 AM\nFantastic\n\nIll admit this game has given me the chills and made me jump a couple times but its a fantastic game pretty tough too amazing replay ability cant wait for hand tracking for this game\n\nHelpful | 3", "JoelMagicalJul 17 at 9:42 AM\nIts good\n\nI like it\n\nHelpful | 0", "Hud2Hud52May 23 at 7:00 PM\nAbsolutely MAGICAL! (no pun intended)\n\nThe hand tracking perfectly sells this game! I originally purchased this game when the hand tracking trailer was released and even before then it was great but now its almost prefect you can play the entire game with hand tracking enabled its not just parts of it but the full game!!\n\nHelpful | 0", "MasonMax19105Jun 2 at 5:43 AM\nJust amazing\n\nWhen I first saw this game I thought its probably not that fun but I gave it a try and its amazing!\n\nHelpful | 3", "Shnoob_ShnoobJul 7 at 5:26 PM\nGood game\n\nThats my review its a good game so buy it\n\nHelpful | 1", "dave.wickett.313May 30 at 10:55 AM\nVery frustrating and VERY fun\n\nYou can spend hours in the main room and hours more in side challenges. Its not a game that walks you through a story so is quite challenging but solvable.\n\nHelpful | 2", "brian1puronJun 26 at 10:27 AM\n\nGreat game. Love everything about it. Great riddles a d the magic. I hope they can add more to it.\n\nHelpful | 1", "jprallJun 15 at 10:55 PM\nDon't waste money on a demo\n\nThis is yet another 'demo' of hand tracking that isn't worth the money or the time. It's really just being in a room and mixing some potions together of which there are remarkably few. These potions are just more demos. Another 'game' that simply isn't. Lastly, hand tracking sucks. Neat idea, but not ready for prime time at all.\n\nHelpful | 2\nDeveloper ResponseJun 18 at 6:23 AM\n\nThank you for playing Waltz and sorry to hear you werent satisfied! There's more content to come. In the meantime make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece. Also, sounds like you may not have optimal tracking in the hand-tracking mode. We published a blogpost that goes into more detail on how to achieve optimal tracking and uncut footage of how reliable it should be - https://tinyurl.com/hand-tracking", "RektorAmsyJul 19 at 1:14 PM\nIts cool but needs work\n\nI feel like the game itself has a nice concept, but it feels really unfinished and works really poorly with hand tracking. It could be my lighting or something\n\nHelpful | 0", "Fletcher2020Jun 7 at 5:29 AM\nAwesome interactivity but lacks depth\n\nAs far as inerratcting with objects go this is one of the best.\n\nGood: Great game for 1st time players. Its magical and endearing. Puzzling at times and fascinating all in one.\n\nOne mini game was very good and took me some time to complete.\n\nBad: Lacks depth, I read that the developers cut most of the game out due to funding issues, this leaves me a bit stumped as this isn't the cheapest game out there.\n\nHand tracking is poor on this game. Maybe this is just me but the controllers work much better.\n\nThe game is a bit pointless, more just for fun but I would definitely question the replayability. I think where they have gone wrong is the puzzles are hard and too hard for children, yet the gameplay is definitely suited to children. So for me if your making puzzles for adult minds, and gameplay for children you end up leaving both parties disappointed. I would have loved a better story and an ending.\n\nI would also like to see an option for free moving instead of teleportation movement. Perhaos the lower back buttons would let you move freely instead of always needing to point and click to move.\n\nOverall: I enjoyed playing it the first time round, however, it's not one I often revisit. I would say if this was 10 it would be better value for money.\n\nHelpful | 2", "olegdavvJul 11 at 4:15 PM\n\nReally good game\n\nHelpful | 0", "chris.marello.5Apr 30 at 3:48 PM\nFun sandbox style game\n\nI really enjoyed this game gave me a few hours of really fun gameplay. No real mission here experiment and explore to your hearts content. The graphics to me are a little bit on the low side but there is so much to do I forgot about that after about 5 minutes\nIf you are looking for a long story driven game or something with tons of replayability this probably isn't for you but it's a great price for what it is but If you are looking for a game to show friends or family vr this is a great game for that\n\nHelpful | 2", "illuminaut45Jul 15 at 6:55 PM\nHi devs...\n\nHello\n\nHelpful | 0", "nishruu2Jul 9 at 2:57 AM\nnot more than a grand experience\n\nmake all the spells ...\n\nHelpful | 0", "RayAllenTaylorJun 11 at 2:17 PM\nIf only it worked.... \n\nI like the game, if I can even call it like that\nIt feels more like an experiment for hand tracking, promessing as much as letting me down.\n\nThe hand tracking constantly breaks up. That kills a lot of fun for me..\nAlso the game keeps on crashing.\n\nThere is also some problems with movement.\nLike in the Labyrinth. There is a part, where you have to solve a bridge riddle. Once you sis, you can walk over to the other side. Well, .. I can't, without beeing hit by motion sickness. The bridge is only passable by step teleportation, not by point to point teleportation, which I prefer, because step by step is making me motion sick\n\nThis is the first game , I am concidering a refund. I think , I hope the developers will solve all those oroblems, within my refund time, otherwise, I guess I will go for it.\nIt would be a shame, cause it exactly that kind of game I wished .. so please make it work !\n\nHelpful | 2\nDeveloper ResponseJun 12 at 2:49 AM\n\nHi, thank you for playing and we are sorry to hear you're having issues! The crashing you mentioned should not be happening. You can reach us directly at support@aldin.io and on our Discord (https://discord.gg/cxHB5zF), if you can give us more details on the issues you are having, that would be greatly appreciated :) Regarding hand tracking it sounds like you don't have optimal tracking in the hand-tracking mode in Waltz. Here are a few tips: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "Dbix11Jun 7 at 9:07 PM\nSorry\n\nI put in a refund request on the 14th of April and just found out it never got approved.\n\nOculus won't respond to me so maybe this will help resolve things.\n\nI apologize to the software company for having to do this.\n\nHelpful | 8", "Etoine20Apr 27 at 1:46 PM\nIt's good but mot that much\n\nI bought this game with the red matter bundle. I found this game is quite entertaining but after a few hours I don't see what else I could do. But I have to say the interactions with the skull are really funny and I'm always trying to find new ones. In general it's a good game but not incredible compared to other games.\n\nHelpful | 2\nDeveloper ResponseApr 28 at 1:38 AM\n\nThanks for playing! There's also much more to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "olossgamingJun 19 at 5:32 AM\nAmazing, 10 stars if it had multiplayer\n\nGreat game, hand tracking works brilliantly, if it had a PvP mode, I would never stop playing five stars\n\nHelpful | 0", "JahustleJun 19 at 8:12 AM\nGreat game!\n\nPerfect vr game for all ages\n\nHelpful | 1", "wheresmysandwich12Jun 22 at 3:13 PM\nFirst cool game I bought on the quest\n\nThis is awesome I really like it. But can you make it where we can go in the basement?\n\nHelpful | 1", "CleenexApr 25 at 4:55 AM\nSweet and short\n\nThis is not so much of a game as it is an experience. Its mystifying. Just using the spells and living in that enviroment makes you feel like a wizard! I would love this game to have more content but nonetheless this game is rich in what it has to offer. The puzzles are challenging and graphics are on par. Finishing a puzzle is extremely satisfying and fun. I found myself getting stuck on puzzles all the time. It took me actually quite a while to beat, I still wish the game was longer but for what is there it's polished to perfection. If you're into magic and like puzzles in this game is a must-have!\n\nHelpful | 2", "Squishy2008May 26 at 9:27 AM\nMultiplayer pls\n\nI have the game but so does my friend were wondering if you could add like a quest mode or people that are oculus friends or what ever you are playing on you can go in their wizard house but the game is still great.\n\nHelpful | 1", "bobbyjoe444May 27 at 8:43 AM\nAmazing\n\nThe best game Ive played. Incredibly well made for the oculus and especially the hand tracking now. It has some bugs but over all this game is amazing and you truly feel like a powerful wizard in the making\n\nHelpful | 1", "RaZe_CLAPPEDMay 25 at 5:07 PM\nAmazing game\n\nI bought this game because of the Low price and hand tracking it worked extremely well but the hand tracking might need a little improvement\n\nHelpful | 2", "DudeBro789Jul 3 at 3:22 PM\nI love it\n\nYesss this is awsome\n\nHelpful | 0", "trentondJun 25 at 4:27 PM\nHand tracking\n\nThe handtracking over all was good with a few hiccups here and there but very good game\n\nHelpful | 1", "AgentCougarJul 15 at 3:22 PM\nThis game is bad, dont get\n\nThe hand tracking in this game is very bad and is weird, it also gives me such a small amount of things to do while playing, no guidance just a skull telling me Im doing my job wrong\n\nHelpful | 1\nDeveloper ResponseJul 16 at 2:04 AM\n\nHi, based on your review it sounds like your hand tracking experience was far from optimal (the game can also be played with controllers). Here are few tips to get better hand tracking: Please try running the game in another room and cleaning the cameras. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "XenothiosMay 25 at 4:14 PM\nActual magic\n\nWhile in game, this will turn you into an actual wizard with very real (virtual) powers\n\nHelpful | 2", "murray20105 days ago\nGlitchy can't play with it\n\nIt's really good game but there's really weird glitch with black particles on your screen and you can't play with them because they're obscure your vision if you can work on this glitch I'll be happy to play again p.s. when I exit and go on again it's still happens\n\nHelpful | 0\nDeveloper Response5 days ago\n\nHi and thank you for playing Waltz! This issue is not specifically related to Waltz. For now, restarting the game and/or Quest is the only solution.", "ThE_CaNarY4Jun 20 at 11:22 AM\nGreat game!\n\nThis game is extremely fun and shows you what it feels like to have powers!\n\nHelpful | 0", "DeepMellowJun 18 at 8:59 PM\nNot good.\n\nThis game is so lame with wonky controls. Played the game 15 minutes and instantly requested refund. I didnt like the game. Refund denied. I was told I had too many refunds in the past even though I purchased dozens of games and own more than 25 purchased games totaling several hundred dollars.\n\nHelpful | 4", "jedi07Jun 3 at 12:42 PM\nGreat game with hand tracking\n\nIts great but you need to fix some bugs but is is the greatest game Ive played so far. Thank you for making this game to what it is today.\n\nHelpful | 0", "kingoftheuglyJun 1 at 1:42 PM\nGreat game BUT...\n\nI have heavily tattooed hands. Turns out hand tracking really cant handle the patterns, and doesnt recognize my hands as hands for more than a few seconds at a time. Not your fault, the tech just isnt there for it yet and I dont want to wear gloves every time I play. Still cool though!\n\nHelpful | 1", "zackspider1204Jun 29 at 10:47 AM\nIts great\n\nHand tracking\n\nHelpful | 1", "spazzyvomit916May 27 at 10:57 AM\nLove it!\n\nJust half of the game would be worth all what I paid for it. Only four star because I'm having a little trouble figuring the quest out, and I'm not one to watch walk-throughs ;)\n\nHelpful | 1", "Bloodjack16 days ago\nSame black big pixels glitchs BUT\n\nOk so, for the few minutes I was able to play, this game is brilliant (why the 5 stars). But As soon as i started to play with the coins, the screen got filled with black pixels. BUT AGAIN :D , I closed the app, switched to \"elixirs\" and the same black pixels came up straigh away. So i'm pretty sure it is not a WOTW issue but more of a \"Oculus hand tracking\" bug issue.\n\nHelpful | 0", "lampost2007Jun 11 at 10:34 PM\nGreat game but\n\nI wish you could grab the time slow thing upside down so i dont have to bend my wrist\n\nHelpful | 1", "Bluepolarbear07Apr 29 at 2:20 PM\nGreat game\n\nIt is a really great game I thing people should get it but after you get done with all the spells it isnt as interesting. I mean it is really fun to make the skull a frog or him float and stuff but it would be a lot better if the spell could also effect you or there was one that could be a secret one that could be used with the orbs for the xylophone by putting them in it could give you and special thing of note that could teleport you to a different room or somewhere that could make you fight a dragon with you magic and you get a special spell that can do interesting thing with the room and they could be a key hidden for the little cabinet behind you when your at the table that could hold a wand that you can use to combine spells but it is a wonderful game but there could be more to it to make longer for people to explore and stuff\n\nHelpful | 1", "ShadowProgrammerMay 24 at 6:04 AM\nAwesome! But maybe...\n\nCould you please add more spells?\n\nAnd maybe more maps?\n\nThank you!\n\nEdit: SOOOO glad hand tracking was released. Im so hyped, this marks a huge milestone in VR history!\n\nHelpful | 1", "realaschJun 3 at 5:31 AM\nJust Nice\n\nIt is funny but handtracking is kind a gliching but its still one of the best games i played in VR also the price is fair.\n\nHelpful | 1", "BerserkerClawsMay 10 at 4:11 PM\nA must have\n\nAnyone with a VR headset need this game ... And there is more to it than it appears.\n\nHelpful | 4", "P-NuTTyMay 10 at 2:29 PM\nGreat interactive game!\n\nInteract with pretty much everything. For the price you can't go wrong. With hand tracking update just around the corner it will add even more value to this title.\n\nHelpful | 2", "KainOrionMay 29 at 8:17 PM\nFun but...\n\nSo the game was great but it was real short, I was wondering if there would be any incoming dlc for the game, otherwise a great game\n\nHelpful | 0", "GavinB230822 days ago\nEaster egg?\n\nHas anyone else noticed the infinity gauntlet with hand tracking yet? I've found three of the stones, all in the tower, but I can't find any of the other stones. If you find them, put them on your left hand. You should see lightning, and then it will fuse to your hand. I wonder what happens when you get all of them, then snap.\n\nHelpful | 0", "KillCounter0505May 25 at 12:31 PM\n\nThis game is grate to play with your family I love it and would recommend it.\n\nHelpful | 2", "MobsterLobster23May 24 at 8:10 PM\nGud game\n\nBut I want there to be a finger Gun palm system for non teleport locomotion.\n\nHelpful | 2", "Nicky.P.SmalleyApr 16 at 11:10 AM\nEnchanting!\n\nEverything about this app is what is good about VR. I love how everything in the environment can be interacted with, made it completely immersive. Most of all it was fun!\n\nI want a sequel! Maybe with some story and levels involved. Now weve got the spells, lets set them in action!\n\nHelpful | 2", "SpectrumswordtailsMay 30 at 6:18 PM\nHand tracking\n\nTheirs no polite way to say this so I'll just be blunt. The hand tracking for this game sticks. Every time I tried using it on my quest. It lost the tracking and my hands just disappeared. Can't touch anything let alone pick it up. Not to mention it kept making the game crash and forget the quest boundary forcing to redraw it. I'm usually one to complain. But for the sake of my sanity, fix it. Please.\n\nHelpful | 1\nDeveloper ResponseMay 31 at 5:50 AM\n\nThank you for playing Waltz and sorry to hear you're having issues! Sounds like you definitely don't have optimal tracking in the hand-tracking mode. Here are a few tips: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "Torta_de_banana7 days ago\nAmazing for 30m, then unplayable\n\nI really enjoyed this game, but could only play it for 30m. After that black pixels started flashing on my screen, making the game unplayable. Restarting does not work, and its only on this app. Why does this happen?\n\nHelpful | 0\nDeveloper Response5 days ago\n\nHi and thank you for playing! This issue is not specifically related to Waltz. For now, restarting the game and/or Quest is the only solution.", "Tanner14Jun 6 at 4:53 AM\nAmazing\n\nIs is what I call a perfect hand tracking or non hand tracking VR game. Amazing job.\n\nHelpful | 0", "ZinthossMay 9 at 11:19 PM\nLots of fun!\n\nEvery new game that comes out is just axing with the Oculus Quest and Waltz of the Wizard continues to push the envelope of whats possible.\n\nHelpful | 2", "AuldstockMay 29 at 12:45 AM\nHand tracking is glitchy\n\nWould get more stars, but I spent as much time trying to interact with things as I did actually interacting with things, hands dissappear randomly, refuse to line up with your actual hands, teleporting is hit and miss as well, hand gestures are only recognised about half the time. It's a pity as it is a well made experience aside from that\n\nHelpful | 0\nDeveloper ResponseMay 29 at 6:21 AM\n\nThank you for playing Waltz and sorry to hear you're having issues! Sounds like you definitely don't have optimal tracking in the hand-tracking mode. Here are a few tips: - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "CoolcatmanJun 20 at 8:03 AM\nGood\n\nGood game\n\nHelpful | 0", "SpacedOut22May 4 at 9:32 AM\nGreat Demo Bad Game\n\nThis is a great interactive experience and a great way to demo VR if thats what youre looking for but its not something you can play with for more than a few days or potentially even a few hours. You can experience most everything it has to offer within one sitting. Still a great experience and demo just be aware of what youre getting.\n\nHelpful | 3\nDeveloper ResponseMay 5 at 7:46 AM\n\nHi thanks for playing! Waltz will expand in the coming future and we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "Timsters25Jun 3 at 10:15 PM\nGreat game\n\nThis game is so much fun with so much to do, the new hand tracking is amazing also!\n\nHelpful | 1", "Twister-42Jun 5 at 1:25 PM\nTerrible, just terrible\n\nAfter playing Elixr i got this hoping it was as excellent but with more to do...however, the tracking is shocking and drops all the time.\nExtremely frustrating not being able to control anything accurately.\n\nHelpful | 3\nDeveloper ResponseJun 6 at 2:53 AM\n\nHi, is it possible you played Elixir in another environment than Waltz? Sounds like you definitely don't have optimal tracking in the hand-tracking mode in Waltz. Here are a few tips: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "phillyg2020Mar 1 at 11:15 PM\nDoesnt say seated, but I play sitting!\n\nGreat game. I love the devs for the updates and interactions with their patrons! I bought it now because when they bring in hand tracking the price should go up... I also like the fact that I can play seated, even tho its not listed, but with all the locomotion options and user height adjustment it was very easy. I like using my Quest on my exercise bike and this game will help me warm up my Quest lenses before I get my workout on!!!\n\nHelpful | 10", "Dextroyer101Mar 23 at 3:31 PM\nGET IT NOW!\n\nThis game is an amazing addition to the oculus quest and Im glad that the developers decided to have it on this platform. The games graphics and play style both work very well with the quest. Also I LOVE IT\n\nHelpful | 8", "mjg298Jun 8 at 12:04 AM\nFun but short lived\n\nFun game with a few things to do but you soon manage to exhaust the offerings here. Hand tracking addition is welcome but sadly isn't as smooth as desired causing a loss of immersion. The teleportation especially is frustrating.\n\nHelpful | 0", "NeptuneBoiMay 26 at 12:31 PM\nHand tracking meh\n\nHand tracking is kinda buggy like my hands will disappear and ruin the immersion but other than that its good\n\nHelpful | 1\nDeveloper ResponseMay 27 at 6:13 AM\n\nThank you for playing Waltz! Regarding the hand tracking mode here are a few tips: - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "RickNadalJun 3 at 1:12 PM\nGames looks awsome bit the handtracking\n\nAs the title says game looks awsome and has alot of potential but the handtracking is utterly bad and i mean very very bad. It cant track anything with my hands they disappeared constantly and i cant play this game unfortunately. Im not sure if this is my headset but i dont think its the game eather.\n\nHelpful | 1\nDeveloper ResponseJun 4 at 3:25 AM\n\nThank you for playing Waltz and sorry to hear you're having issues! Sounds like you definitely don't have optimal tracking in the hand-tracking mode. Here are a few tips: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "ollybugMay 22 at 1:34 AM\nFantastic vr sandbox\n\nThis is a great sandbox showing what is possible with vr. Heaps of things to do and very well polished. Really recommend this.\n\nHelpful | 1", "darran.palmerMay 19 at 9:09 AM\nSo immersive\n\nSimply great experience, currently one of my top 3 games in VR\n\nHelpful | 2", "lefteri.fournaris.3Jul 3 at 10:18 PM\nIt was great but short\n\nThis is a game I expected to be long and fun but I bought it and its really short\n\nHelpful | 0\nDeveloper ResponseJul 6 at 8:36 AM\n\nThank you for the playing! Waltz of the Wizard is expanding and there's more content to come - in the meantime make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece. We've opened a new Discord community and will share more news on upcoming content soon. https://discord.gg/cxHB5zF", "mdm2291May 24 at 5:36 PM\nGreat game I recommend\n\nI had fun and its very immersing\n\nHelpful | 2", "RumpelforeskinMay 29 at 8:30 PM\n\nAmazing that you have made the entire game playable with hand tracking\n\nHelpful | 1", "Amazedgarlic804Apr 20 at 3:29 PM\nFun to mess around in\n\nThis game is an amazing game and it is fun to mess around in.one thing I did was make everything in the room huge.it was fun to get around after that.\n\nHelpful | 3", "j70610May 22 at 10:59 AM\nCant believe theres hand tracking\n\nWhen I first saw played this game a few months ago I said this would be amazing with hand tracking and it is.\n\nHelpful | 1", "instructorbkMay 6 at 4:59 AM\nSimplistic and Disappointing\n\nThis is an experience, but it's so simplistic. Once the initial \"games\" are completed (which happens quickly), there's nothing else to do. It's also disappointing that a couple of the rooms don't appear to have much going on. There just isn't enough actionable content in this experience. You have all of this power and so little to do with it.\n- Update to Developer: I did all of those things in about an hour. Then spent hours trying to figure out if I missed something, but I didn't. It's just too simplistic. Most of the items are just junk. They don't even matter. Great... I hear all the little pieces and demon statues talking. Who cares? How about some action? The cat comes out in one of the other levels? Is there anything to do there? The observers -> I've gone there so many times and done so many things, but nothing really happens (other than variations on snarky comments) and then I get sent back. As for the scavenger hunt, it lasts about 5 minutes or so. Pretty to look at but not much of a game.\n\nHelpful | 7\nDeveloper ResponseApr 26 at 3:33 AM\n\nHey! Make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece! There's also much more to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "kenekoKittenJun 25 at 3:36 PM\nDONT GET ITS A SCAM\n\nI am trying to open the game but it keeps on saying to update my Oculus and I check is there is a update, there isn't! I even restarted my Oculus it didn't work.\n\nHelpful | 2", "mango_powpowMay 24 at 5:27 PM\nAwsome\n\nMy mind was blown\n\nHelpful | 2", "mcajjMay 18 at 1:32 PM\n\nIts fun playing with different things, and make different potions, while being instructed by a nagging skull. One down side is that this game requires a certain degree of free space. I played it in my room, where I had very limited space to move around. Id either knock things off on my desk, or not being able to reach the cauldron desk in the game.\n\nHelpful | 1", "00HiZaMFeb 26 at 8:02 PM\nSorecerous Fun\n\nI had a small time to play before going to bed, and let's say I just failed at that. The game just kept me trying more and more stuff, finding more and more stuff it's an amazing experience of exploration.\n\nExtremely recommended and it'll be part of my set of things I show to new people when they try VR\n\nHelpful | 8", "jonsie_playz_ytMay 20 at 2:39 PM\nSurprisingly fun\n\nThats it thats my review\n\nHelpful | 2", "plummer16Jun 9 at 1:26 PM\nShort\n\nThis is an amazing game but i feel like its really short i beat it in just 2 hours including the scavenger hunt but besides the lack of content this is a must have on quest.\n\nHelpful | 0\nDeveloper ResponseJun 9 at 3:51 PM\n\nThank you for the playing! Waltz of the Wizard is expanding and there's much more content to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "BenriversJul 19 at 10:50 AM\n\nIt is kind of good\n\nHelpful | 1", "The_CriticMar 28 at 7:12 AM\nStunning\n\nI dont know what else to say that hasnt already been said in another review! This game kept me trying new things for hours on end, and I was finding new things all that time. The initial telepath movement system felt unique, and kept away from any sort of motion sickness.\n\nHelpful | 2", "SeverinGreenMay 17 at 4:00 PM\nTop\n\nSays it all. Great Game\n\nHelpful | 2", "OasisRezthJul 14 at 6:11 PM\nIts amazing, with one issue\n\nFirst of all, its an amazing game, hand tracking is amazing for what oculus gave devs, but one issue is that sometimes you teleport in a wall and have to restart. Now this would be fine if you didnt have to restart the maze thing. If this gets fixed in the next update and I see it in the patch notes, 100% will go 5 stars\n\nHelpful | 1\nDeveloper ResponseJul 16 at 2:06 AM\n\nHi, thanks for the review! Any chance you can record a video of the issue and send it to us at support@aldin.io?", "Draek2017May 31 at 3:19 PM\nNo direction, hand tracking is bad\n\nI didnt enjoy the hand tracking. It frustrates me. Books fly out of your grasp and its just show in general. Touch controls are much more fun\n\nStill though didnt find a lot of direction in my first play.\n\nHelpful | 1\nDeveloper ResponseMay 31 at 3:35 PM\n\nThank you for playing and sorry to hear you're having issues! Sounds like you definitely don't have optimal tracking in the hand-tracking mode. Here are a few tips: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "dbiiiMay 31 at 8:20 PM\nYeet\n\nBest game ever ever\n\nHelpful | 1", "junger2000Apr 17 at 5:25 PM\nGreat immersive environment\n\nIt seems like your really in a room with magical things. You can interact with everything in the room. Some of the puzzles are obvious although not necessarily easily solved. But there is no guide to what you can accomplish so just experiment.\n\nHelpful | 1", "TheXGamerMay 11 at 4:53 AM\n\nIt is a really good game but short An confusing\n\nHelpful | 2", "gustavoCOOLMay 31 at 11:40 AM\nGreat\n\nI recommand\n\nHelpful | 1", "Flashbang2411Feb 28 at 6:47 AM\nBrilliant game, loads of potential\n\nThis is a fun game, doesn't take to long to complete, it requires some clever and creative thinking to solve all the riddles. The gameplay is great, as I say, not that long and fairly easy to solve when you get the hang of it. One thing I'd love to happen is for there to be a little more to do. It's one of those games that once completed ends up being a bit of a dead game. If it was possible to have more to do, maybe a free roam mode or even more to uncover and explore. There seems to be a lot of things you could possible interact with, though their purpose is unclear...\n\nAll in all, Great fun game, good way to kill a couple hours!\n\nHelpful | 5", "bender352May 26 at 5:54 PM\n\nIT HAS HAND TRACING AND MAGIC\n\nHelpful | 0", "JimmyBreuerMay 23 at 3:56 AM\nHand Tracking\n\nSimply mind blowing with hand tracking!\n\nHelpful | 1", "ii_moshi5 days ago\nPretty good!\n\nIts fun and cheap I enjoyed it Id recommend it to anyone who likes magic.\n\nHelpful | 0", "pandaboi09May 26 at 3:58 AM\nThe game with hands or not\n\nIt good\n\nHelpful | 0", "Woopv333May 26 at 3:42 PM\nAmazing\n\nAmazing\n\nHelpful | 1", "MogwieApr 24 at 11:17 PM\nYour a Wizard ( your name here )\n\nA must have for any puzzle loving want to be mage! \n\nHelpful | 2", "AnOnionDoesStuffJul 6 at 1:20 PM\nBoring\n\nNot much to do and only lasted me about an hour. Not worth it at all.\n\nHelpful | 2\nDeveloper ResponseJul 7 at 3:38 AM\n\nSorry to hear your disappointment, Waltz of the Wizard is expanding and there's more content to come - in the meantime make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece. We've opened a new Discord community and will share more news on upcoming content soon. https://discord.gg/cxHB5zF", "Josh_MandelDec 10 at 5:57 AM\nA tremendous amount of fun\n\nThis game didn't take me long to finish -- probably 2 hours and change -- but I loved every minute of it. It's full of surprises and twists and all sorts of clever details. It also does a great job of giving you the feeling that you're a sorcerer. Overall, it does a terrific job of demonstrating what's possible in VR, and it was worth every penny of its low price.\n\nThe one request I'd have of the developers is to make the updated \"Reset All Progress\" option a true reset of the ENTIRE game. Right now, it only seems to reset the spells; the trophies remain earned and the item you retrieve from the labyrinth is also retained. I so want others in my household to play this game, but I want them to be able to experience it from the very start.\n\nHelpful | 165", "VRDJKhaledJun 30 at 8:58 PM\nNow THIS is VR\n\nI have just bought my Oculus Quest today and decided out of quite a few options to sink my money into this game and honestly, it has so much clearly put into it with interactions, secrets, and just plain things to do. One minute youre throwing fireballs around the room the next youre playing fruit ninja with a lightsaber. This is a must have for starting VR users, combining so many well known ideas with plenty of creative ones to explore\n\nHelpful | 1", "DynaJoe623Jun 30 at 2:11 PM\nAlmost Fantastic\n\nThis game is incredibly fun to play. The powers are cool, and theyre really fun to use. BUT, beyond finding all the powers, solving the riddles, and a few secrets, there isnt much else to do in the game. Thats all. Its possible Ive missed a few things, but I wish there was a way that pay with the powers in a more diverse combat game than the one you get in the snow globe.\n\nTL;DR: Great game, worth the price, just needs a little more\n\nHelpful | 0", "LanrovusMay 30 at 7:53 AM\nWaltz of the wizards\n\nKeeps freezing up. Have to start from the beginning over and over again! But its still a good game.\n\nHelpful | 1", "Deadsnake507Feb 20 at 8:57 AM\nAmazingly fun game.\n\nThis game was completed in about 4maybe5 hours maximum.But on the good side of this game is that its really fun and I had the most fun out of this game than any other.Making potions messing around with secret wands it was absolutely amazing!If youre looking for a fun game thats not as expensive as others.This game is the perfect opportunity for exitement!\n\nHelpful | 3", "Freaker013Jul 12 at 12:18 PM\nBetter than I thought it would be.\n\nI played it for I dont even know how long. I really lost track of time. I didn't think it would be as good as it was. I'm sure my kids will love it even more than I do. Great price, Great game.\n\nHelpful | 0", "mvanvemdenApr 27 at 2:35 PM\nNo goal\n\nIts just doing stuff, throwing OR shooting without a goal. Feel like a training for a game that does never starts.\n\nHelpful | 7\nDeveloper ResponseApr 28 at 1:37 AM\n\nHi! Make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece! There's also much more to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "FrolainheuJun 20 at 5:53 PM\nAwesome!\n\nThis game really worth the money you put into. I had a lot of fun playing with all the spells (my favorites are fireball, air drawing and conducting). At some point, when I discovered all spells and interacted with most objects in the first room, I was wondering why I bought this game. It became boring and I did not knew where was all the things I saw in the preview. I watched some videos on YT before making a bad review and OMFG I understood the fantastic point of the game after that.\n\nFor those who are stuck in the room, a little clue: Search well and everywhere, you're gonna find a way.\n\nI will absolutely add a star if the handtracking better (I play with the controlers ) cause it's almost impossible.to play with it.\n\nHelpful | 1", "killer_chicken8o6 days ago\nSo far great\n\nI just got it, got all the spells and Im wondering how I do the mini games\nEdit:I found out how, but the game just is underwhelming. Honestly it just sucks sometimes, the hand tracking is kinda bad.\n\nHelpful | 0\nDeveloper Response5 days ago\n\nHi, based on your review it sounds like your hand tracking experience was far from optimal (the game can also be played with controllers). Here are few tips to get better hand tracking: Please try running the game in another room and cleaning the cameras. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "TheVrGamer420Jan 24 at 7:06 AM\nPerfect but could use more content\n\nThis game is pretty darn good, I got because of seeing captain sauces videos on it and once I got the oculus quest for xmas I knew I had check if this game was on the quest store and to my luck it was so yeah I believe this game could use more content but its pretty good for a 3 hour-2 hour VR experience\n\nHelpful | 8", "Dun2141Apr 4 at 9:24 AM\nVery cool\n\nI am really enjoying this game. Figuring out these puzzles and just taking in the art is great!\n\nHelpful | 2", "GreenoSylveonFeb 12 at 8:41 AM\nIt's an amazing game to play\n\nI really enjoyed playing Waltz of the Wizard, it's fantastic fun and for 10 dollars I definitely got my playtime out of it. The riddle was tricky, but I figured it out. I kind of wish the rewards were a little more worth it for figuring it out (not gonna spoil it) but it's still fun little things to play with. I only wish there were more ways to use your magic abilities, rather than just in your room. But that didn't stop me from having a lot of fun anyways! Great game, I hope there's more like this in the future\n\nHelpful | 3", "gsmith1718Jul 19 at 12:11 PM\nInteresting but shallow\n\nIt's hard to give more than three stars to something just because they tried something new. It's not so much a game as an experience. You have a room where you can create spells but have nothing to use them for. Hand controls are interesting but so erratic they are all but useless in the maze. That leaves the maze as the only real game and all you need in there are the objects you find there (using the controllers). Sorry, folks, this has a LLLOOONNNGGG way to go. Wait till it's on sale if you want to kill a half a day.\n\nHelpful | 0", "CisFormaldehydeMar 3 at 8:28 AM\nIts okay\n\nIts an okay game, but i dont know if that justifies a $10 price tag. Its basically a tech demo, but with less things to do. I would only recommend this game to those with friend that are hesitant about VR or people who haven't use VR before, but for the average VR consumer its not worth the price.\n\nHelpful | 6", "GoldenBudzzz420Apr 2 at 8:28 PM\nGreat game\n\nIt's a pretty great game but I'm really wanting to see how the hand tracking is, is there any news about when we can expect it? Main reason I bought the game\n\nHelpful | 0", "Starfinder393Feb 24 at 8:50 PM\nAwsome\n\nI love it its so good that you can do this stuff with the things \n\nHelpful | 4", "TwitchyTwistMar 7 at 3:05 PM\nFun for the whole family\n\nApprox 2 hours per play through. The discovery is the fun part. Figuring out how to make spells, getting to the other worlds, a couple of mini games, and a few other secrets.\n\nThere were a couple of creepy bits for my 9yr old but I think thats part of the fun.\n\nOverall very satisfying.\n\nHelpful | 1", "King_of_MilkApr 7 at 2:06 PM\nfantastic\n\ngreat game if your stuck in quarantine, has a lot of hidden secrets and things to keep you occupied. Cant wait until hand tracking comes out for it!\n\nHelpful | 1", "sebastian.kurz.583May 27 at 12:56 PM\nAmazing\n\nCreating butterflies and letting them land on you fingers is phantastic, I really felt the air from their wings :-) Its a wonderful playground to fool around, I see me coming to this place regularly. Alone bathing the hands in the magic cauldron is worth the money ;-)\nVery well done, cheers to the devs!\n\nHelpful | 2", "SwagStar59Apr 3 at 8:48 AM\nAmazing game\n\nThis game is so great with a ton of spells and constant updates the devs are working super hard to make this app great so lets give them some love\n\nHelpful | 0", "JoeJoe31May 26 at 1:37 PM\nEhh\n\nI like the game but it doesnt feel very comfortable\n\nHelpful | 0\nDeveloper ResponseMay 26 at 2:30 PM\n\nHi, thanks for playing Waltz. Can you elaborate what doesn't feel comfortable? - You can contact us on Discord https://discord.gg/cxHB5zF or send mail to support@aldin.io.", "HanzFlamenApr 14 at 7:51 AM\nGreat Game\n\nThis game is fantastic and it is a great price. I was very happy with my purchase.\n\nHelpful | 1", "Blaine04920Apr 25 at 8:06 PM\nRead other reviews\n\nUp there\n\nHelpful | 0", "AlmightyGeminiApr 16 at 4:31 PM\nVery Good Starting Game\n\nMany things to do, you could spend a lot of time on this game.\n\nHelpful | 1", "zacksta97Jun 22 at 2:27 PM\nVery cool\n\nVery interactive and fun experience. Something new with each little mission. Enjoyed it very much. Much better using the controllers though as there is more fun things to do when using them.\nDefinitely recommended.\n\nHelpful | 1", "ChivonneMar 22 at 1:06 AM\nFun game\n\nIt's a fun little game. There are spells to be discovered, puzzles to solve and adventures on other worlds. Would be even greater is there was an actual storyline to follow, but it has me laughing, oops!-ing as well as some tense moments. Graphics are pretty good as well.\n\nHelpful | 4\nDeveloper ResponseMar 22 at 8:22 AM\n\nHey! Thanks for the review. There's also more to come, taking the experience to a new level - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "Ahjay_GhaleJul 10 at 5:25 PM\nA great demonstration\n\nI got this game free with a 10$ voucher, and immediately was excited to try it out because of the new hand tracking feature. I quickly explored all there was to this game, and was fairly disappointed to how short it was. I saw that there was a free demo version, with less content, and I don't know how that plays, but this is a very fast experience, at least for those well versed in VR games. I switched to controllers halfway through, because the hand tracking was not the best at all, but it's still a beta feature, so it's fine. All around fun experience and something I'll show to my friends, but not something I'll play by myself again\n\nHelpful | 0\nDeveloper ResponseJul 13 at 9:10 AM\n\nHi thanks for playing! Waltz of the Wizard is expanding and there's more content to come - in the meantime make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece. We've opened a new Discord community and will share more news on upcoming content soon. https://discord.gg/cxHB5zF", "NARRWALMay 2 at 5:04 PM\nIt was very fun for the first 15 minutes\n\nThe game was very fun for the first 15-30 minutes, however the game has next to no progression, and relies solely on small mini-games and cut-scenes.\n\nHelpful | 0\nDeveloper ResponseMay 3 at 3:55 AM\n\nHi! Make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece! There's also much more to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "Totheson09Jul 25 at 7:58 AM\nGreat\n\nGreat game not many improvements needed\n\nHelpful | 0", "Sonictheboss8472Dec 6 at 11:33 PM\nBest experiance Ive ever had\n\nIve played this since the first release before the extended edition when I first bought my Vive. This game holds a special place in my heart and I must say that seeing this game in a higher resolution is mind blowing, not to mention the countless additions since first release. Im horrible at writing these reviews but this game is 115% worth the 9.99$ take the 2 coffees out of your week and get yourself this amazing experience.\n\nHelpful | 65", "Superblue5Jun 30 at 5:20 PM\nI love it but needs better hand tracking\n\nThis is an awesome game, but its really hard to do hand tracking and I was really looking forward to that. P. S. I dont like to elaborate on anything.\n\nHelpful | 0\nDeveloper ResponseJul 1 at 2:37 AM\n\nHi and thank you for playing Waltz! Here are a few tips for better hand tracking: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "H2GunsJul 28 at 6:12 AM\n\nIts just fun\n\nHelpful | 0", "mrmario.nobleMay 31 at 5:36 PM\nGood but has hand tracking issues\n\nI purchased this game to try out hand tracking. It's a fun concept and there are a lot of interesting details. You really feel like you're casting spells.However, the gesture and navigation to move seems very counter intuitive and doesn't get triggered easily. I'm also never able to swing my arms and move. Also, picking things up is a very hit or miss affair. If they fall to the ground, they're essentially gone without a room reset. The table upon which you do your work doesn't quite fit into the minimum quest area, often leaving you fighting the Quest guardian grid to grab or interact with the items at or beyond the boundary. This succeeds about fifty percent of the time. That said, I think it's a good effort for new tech and I'm giving an extra star for it.\n\nHelpful | 0", "Zilo0098Jul 12 at 11:28 PM\nAmazing\n\nNothing to say besides this game is super well made and hand tracking is just\n\nHelpful | 0", "Graham808May 30 at 2:46 AM\nA step towards the future\n\nMassive credit to the developers as without someone creating games that use new tech we would have no progression. That being said I don't think hand tracking is ready yes it's great to try but it's quite frustrating. You can use the game with your hands but I became quickly frustrated at the lack of accuracy hands disappearing not always reacting in a natural manner. I have tried in natural light a dim room a well lit room the same can be said of all conditions however slightly better in a naturally bright room. However I believe that at present this represents the best example of hand tracking. And after everything I have said you can go back to using your controllers. If your after the experience of using your hands I would recommend this as it does just that with good gestures that are straightforward. But remember this is new tech , not perfect but a massive step thanks to the developers.\n\nHelpful | 1", "klarkent91Feb 5 at 8:09 AM\nSpells and riddles, what else?\n\nI'll start with the part I didn't understand, without making spoilers. It seems like there is a story, it's not clear to me though. I didn't really get if there's something more to see even after one completes all the trophies or not.\nStory apart, the game is very nice. The spells were the least attractive to me. I loved the riddles, the hidden things and the \"trial and error\" it takes to get all the trophies.\nIt's not glitch free but it's very manageable. The menu is too simple but works.\nBuy if you like to complete a game and find out all the secrets \n\nHelpful | 2\nDeveloper ResponseFeb 28 at 5:21 AM\n\nHey! Glad you enjoyed :) There's more to come, taking the experience to a new level - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "DrivencombMay 29 at 3:07 PM\nIts good\n\nIts a good game overall with a cool idea and the fact that it can use hand tracking is even better with the fact that you can interact with everything in a new way but after a while it gets a little bowering hopefully in the future they can add more spells and make it easier to teleport while using hand tracking\n\nHelpful | 0", "DisneyPandaApr 9 at 2:10 PM\nInteresting, for a bit\n\nWhen I started the game was very fun! However, as you progress and finish the missions there isnt much left to do. Ultimately it was fun for about an hour. The game mechanic were great and I would love to see more levels.\n\nHelpful | 1\nDeveloper ResponseApr 10 at 2:04 AM\n\nHey! Thanks for the review. There's also more to come, taking the experience to a new level - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "ThunderkingvmJul 18 at 3:21 PM\nGreat game\n\nGreat fun for friends and family\n\nHelpful | 0", "its_mikeMay 30 at 1:40 PM\nAwesome for the Price\n\nIve bought around 10 games on the Quest so far and this was definitely one of the best purchases. Interactive and fun and, for $10, totally worth it!\n\nHelpful | 3", "TinyTexanMay 24 at 7:20 AM\nPretty good\n\nIll be honest, the only reason I got this game was for a hand tracking game demo. And for that, its alright. Hand tracking is obviously limited with cameras only on one side, but its not a bad use of it in this game. You can do most things pretty easily. However, I think that the locomotion when using hand tracking should be different, as that was definitely a hassle. Although, the hand tracking is developed by oculus, not game devs, so Im not taking any stars off. As for just a game, its pretty good. Its fun to make all the different spells, and test out each one. My only gripe about the game itself was the combat stage. The main problem was that you only have one life. One hit and your out. This was frustrating, particularly when one of the floating orbs hits you with a fireball from behind. Overall, its a fun game. It is $10, so I wont complain that its pretty short, because thats what you get for that cheap.\n\nHelpful | 0\nDeveloper ResponseMay 24 at 8:03 AM\n\nThank you for playing! Waltz of the Wizard is expanding and there's much more content to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "MichaelSanFranciscoDec 16 at 10:22 PM\nFantabulous\n\nThis has a limited gameplay, but that does not make it a bust. I loaded it up and spent a fast two hours having a blast.\n\nThe graphics are superb, the interactions cool, and the overall experience is the epitome of VR gameplay.\n\nI strongly recommend this game. Pay the paltry $10. You won't regret it.\n\nP.S. This is a wonderful title for the kids, or to show friends and family what all the fuss is about with VR. Take your headset to parties or Christmas get-togethers. You will be the hit of the soiree.\n\nWarning: keep a sharp eye on your headset, or be willing to press felony grand theft charges on Gramps for his trying to steal your headset.\n\nBonus Comment: If your headset disappears, check the trunk of Granny's car. It is most likely in the space where the spare tire is stowed.\n\nHelpful | 15", "BubbakadMar 1 at 3:06 PM\nGood but could be more\n\nThis game was a lot of fun! For about two hours, but its short but sweet. Just fooling around with the spells was tons of fun and all the other stuff is crazy. I wont spoil anything but this game is a good pick\n\nHelpful | 0", "Kaden0102Jan 21 at 3:20 PM\nAMAZING\n\nI had so much fun in this game that I kept resetting my progress and beginning again I love this game so much and it will forever be my favorite be game I have played. Thank you very much to the developers who made my brother experience amazing.\n\nHelpful | 5", "JoeMama2123Mar 5 at 7:36 PM\nCant wait for hand tracking!\n\nExtremely fun to mess around with,cant wait for hand tracking!\n\nHelpful | 3", "LukeBuildsYTMay 30 at 1:41 PM\nOMG GET THIS GAME!\n\nIts EPIC so far and Im so speechless its so awesome I would recommend this game Im also gonna tell my friend to get it.\n\nHelpful | 3", "DakkardDec 5 at 12:10 PM\nShort, simple but entertaining\n\nPerfect game to show off to people who have never experienced VR or to the older generation.\n\nDidn't take me long to locate all the spells but it's still a good alternative to first contact or first steps.\n\nHelpful | 91\nDeveloper ResponseDec 7 at 5:23 AM\n\nThanks so much for playing Waltz! Glad you enjoyed it and hope you also try out the many teleportation scenes using the xylophone transporter, discover all the interactive objects and easter eggs, minigames, achievements  and defeat the knights of the maze!", "ThePilgrim666Feb 14 at 2:09 PM\nAbsolutely Amazing\n\nI never get bored in this game with like 12 spells to create and gloves and a xylophone that allow you to go to different places so youre never too restricted in your small tower with a talking skull (LOL). Totally recommend this app for anybody with a compatible VR headset\n\nHelpful | 1", "ZoracleJun 29 at 7:50 PM\nCouldn't get the hand tracking to work\n\nInteresting game with the controllers, however I could not get hand tracking to work right. My hands kept disappearing and preventing me from doing alot of the moves I was trying to do.\nWith the controllers however it is a fun little game to play around with\n\nHelpful | 0\nDeveloper ResponseJun 30 at 2:52 AM\n\nHi, it sounds like you don't have optimal tracking in the hand-tracking mode in Waltz. Here are a few tips: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "GamingPizza859Jan 23 at 1:23 PM\nVery good, but rather puzzling\n\nThis game is great. Short and sweet, but very enjoyable. But some of the Easter eggs are a bit TOO hidden. For example, I still have no idea what the blue crystal does, or what to do with the ring, or how the Observers tie into all of this. A bit more of a guide would be great, but other than that, its is great. Keep up the good work.\n\nHelpful | 1", "mrkrabkrabJul 14 at 1:33 PM\nOk\n\nWell I guess its... just ok. Nothing special. Nice idea. Fun. Super glitchy. Not as impressed as I expected myself to be. Its fun, but very glitchy and a bit expensive\n\nHelpful | 0\nDeveloper ResponseJul 16 at 2:09 AM\n\nHi, if you're looking for an improvement in the hand tracking mode - please try running the game in another room and cleaning the cameras. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "zachghallMar 3 at 8:50 AM\nAmazing\n\nI'm new to vr I have a few games not many though I got Walt's if I think it's fantastic\n\nHelpful | 2", "DudeMan35Jun 21 at 12:23 PM\nFun\n\nSuper fun but the hand tracking is a little off but it's fine. They should add more spells to make aswell.\n\nHelpful | 0", "EpicBrewJan 17 at 5:32 PM\nFun experience!\n\nFun VR experience. You start in a room. Discover spells, and explore. Discovery is half the fun! There are trophies as achievements. There are other locations but you must uncover how to get there on your own. There are secrets and riddles! There is a scavenger hunt...can you complete it? Overall enjoyable! Touch everything! Interact! What else might the object to or could be used?\n\nHelpful | 8", "MagnusHawkFeb 27 at 8:42 PM\nExcellent fun\n\nThis is a smart game for the Quest. It has movement and freedom and also lots of variety in use of motion controls. Just a joy to play and share with others.\n\nHelpful | 0", "PGDVenomFeb 10 at 3:26 PM\nFun game\n\nFun game with a lot of Easter eggs. Right when I thought I was done with the game, I found a cool escape room type puzzle scavenger hunt thingy. Great game would recommend\n\nHelpful | 2", "christiangogeter65Mar 3 at 3:53 AM\nAmazing\n\nSort but sweet\n\nHelpful | 3", "benlebJun 13 at 6:17 PM\nThis should be your first purchase!\n\nMy girlfriend was *so* skeptical of Oculus and this app had her sold in seconds! So much fun trying to get new spells!\n\nHelpful | 1", "LilMathFlashMay 23 at 5:44 AM\nBest game ever!\n\nI love this game, I bought it because of the hand tracking update and it was so worth it! Its amazing even if you use the controllers because of the added stuff like the crossbow, the lightsaber and the swords and stuff.\n\nHelpful | 1", "Havok_007Feb 5 at 10:41 PM\nCool app but\n\nThis game is really fun to play and Ive played it quite a bit and Im still not bored of it but its kinda hard to find all the different things you can do in the game cause there is Easter eggs in the room but overall its super fun\n\nHelpful | 1", "AngystoneJun 21 at 9:57 AM\nExtremely cool\n\nThis is a very cool game, with a lot of secrets funny to discover!\n\nHelpful | 1", "Patr076Jan 23 at 11:19 AM\nA nice first experience game\n\nI have done some VR games before I played this game, so I had things figured out pretty quickly except for some other small things that I figured out later. Till this day I love being in the game for short periods of time to experience the magic features in the game. I enjoy it the most when my friends are watching me, playing around with the talking skull.. Totally worth it! It would be 5 stars if the game would have more levels and more spells.\n\nHelpful | 2", "MegaOofJul 3 at 1:27 AM\nA great and all but theres a bad bug\n\nIts a great game but there is just one very very bad glich were a glitchy black square that goes everywhere across the screen. This used to happen with Rec Room. Please fix this!!\n\nHelpful | 0\nDeveloper ResponseJul 3 at 8:20 AM\n\nHi and thank you for playing Waltz. Can you please try restarting the game and if that does not work, then please restart your headset :)", "Mr.NukinfutserJan 20 at 2:14 PM\nFun, developers continue to update\n\nThis game is really fun and a good game to get started or show people how cool vr games can be! The developers continue to update this and add new things like the Easter egg hunt\n\nHelpful | 4", "BjkillerswordMay 29 at 2:31 PM\nLove this game\n\nIf you s as we looking for a great time you should buy this game and the price is great for all the things you can do and the hand tracking is amazing keep up the good work.\n\nHelpful | 1", "zachary.denneeJun 21 at 1:20 PM\nI need help\n\nIve been watching videos on this game and i even bought it but mine is alot diffrent, first i dont have all of the items but others do, like i cant find a crossbow, lightsaber/sword, and the ring your supposed to find. So, what do i do\n\nHelpful | 0\nDeveloper ResponseJun 22 at 8:28 AM\n\nHi! Thank you for playing Waltz! Currently these features are only available playing with controllers. But look out for future updates - there is much more coming to hand tracking in Waltz soon :)", "Shadow1934Jun 18 at 1:28 AM\nI loved it but\n\nI love the game but once you get all the spells theres nothing to do\n\nHelpful | 0\nDeveloper ResponseJun 18 at 6:24 AM\n\nThank you for the playing! Waltz of the Wizard is expanding and there's more content to come - in the meantime make sure to check out the teleport areas, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece. We've opened a new Discord community and will share more news on upcoming content soon. https://discord.gg/cxHB5zF", "RIPTIDE5115Jan 21 at 4:07 PM\nLove it but not enough\n\nI loved this game but the problem is that there is not enough content but the thing that bothers me is that there is no story i had expected some sort of story because it seemed like it was setting up one but there was not and they kpet hinting at things that didn't matter which is not good for a kind of mysterious game. But it was fun even though It needed some story.\n\nHelpful | 2", "ayjayukDec 20 at 4:24 PM\nSo much to find , great for beginners\n\nThis is a wonderful way to introduce your friends or family to VR on the quest. It's a fun mix of trial and error, unlocks and magical spells and is great for all ages. A really comfortable experience for first timers with some features that really open people's eyes to what is possible in VR.\n\nI'd recommend changing the locomotion settings to regular teleport for new players.\n\nI bought this when I first got my Vive years ago, and bought it again today to enjoy it wirelessly. As a vr developer myself it's a great showcase of what is possible.\n\nA great buy!\n\nHelpful | 5", "paradise1018Jun 15 at 9:00 PM\nGREAT GAME!!!\n\nLoved this! Not much else to say from me! I really liked this game!\n\nHelpful | 0", "2005abrunoJan 10 at 4:15 PM\nGood game Cant understand one puzzle\n\nI love the game its loads of fun and I enjoyed it and I found out about the puzzle that has you go all around the tower but I keep getting stuck on one riddle about the \"Gongs of Sound\" and something about starlight it keeps bugging me and nowhere can I find anything on this topic.\n\nHelpful | 2", "WildpandadMar 2 at 5:33 PM\nNoice\n\nEvery thing in this game is exactly how I expected and I loved every thing in this game\n\nHelpful | 1", "Tigran2009Mar 14 at 6:09 PM\nVery fun game\n\nFun entertaining and interesting.\n\nHelpful | 1", "terry.valleryiiMar 11 at 9:31 AM\nHands Down Favorite\n\nCoolest thing I've ever done or will ever do.\n\nHelpful | 0", "kmagyarMay 29 at 9:56 AM\nWizard-tastic!\n\nThe game is awesome! I love how it is able to sense your hand, and how high-quality and non-laggy this game is! This deserves a full 5 starts!\n\nHelpful | 1", "OculusQuestFunJan 15 at 7:13 PM\nFun With Replayability\n\nMore fun than pulling a rabbit out of a hat! This is especially fun if you cast it to show others as they will be excited to see all there is to do around you. Graphics are on point. That little bit of mystery is fun. Cant wait for hand tracking. For full review, check out my gameplay video: https: https://youtu.be/1_jR3OLzuLM\n\nHelpful | 1", "Maceon.AUJan 24 at 4:46 PM\nGreat game, totally worth the money\n\nThis is a great experience despite being a little short. It has an amazing level of interactivity for the quest and felt just like the pcvr version. The new scavenger hunt is great fun too.\n\nHelpful | 2", "stephenjgolding123Jun 21 at 10:49 PM\nMust buy\n\nMUST BUY\n\nHelpful | 1", "SloppyComic2523Feb 16 at 2:18 PM\nSo fun\n\nThere is so much to do. I love the globe experiences. And the potions are so fun. Cant wait for hand tracking for this game.\n\nHelpful | 2", "sputukJan 10 at 7:58 PM\nAlways improving\n\nI initially played a version of this on the 1st Gen Vive and was already impressed, but since then, so much has been added and it plays every bit as well on the Quest.\n\nCons: While you can kind of play it seated as long as its a fairly high chair, it needs to adjust to your height better as you tend to end up staring at the work bench at eye level. But the experience is drastically better if you are standing in a large space and can walk around more naturally anyhow, so try to play it that way if you can.\n\nHelpful | 2", "goatboygamingJun 20 at 7:18 PM\nScary game warning\n\nIts scary\n\nHelpful | 0", "TheOnlyVibeMay 23 at 4:17 PM\nGreat Game\n\nIts an amazing game to introduce to new players, but the hand tracking is sensitive and hard to get the hang of. Other than that really good job\n\nHelpful | 0", "TheRealBroBossMar 7 at 7:00 AM\nGreat\n\nNon thing else but great just buy it.\n\nHelpful | 0", "styxgeistJan 10 at 11:53 AM\nGreat game with lots to discover\n\nVery entertaining game for the price packed full of stuff to do. There is actually a lot of hidden stuff to discover. The people that say they've completed the game in 20 minutes or suggesting it's extremely short haven't even discovered half of what the game had hidden away in content. Use your mind!\n\nHelpful | 2", "JoeroonFeb 18 at 8:11 AM\nYes\n\nIt very good very fun and allot to explore\n\nHelpful | 2", "vrabbitsDec 6 at 9:06 AM\nAmaizng\n\nJust an amazing game. So fun and has a awesome creepy feel to it without,being scary perfect to,show to family and friends.\nIs their an option to reset spell progress in game some where?\n\nHelpful | 16\nDeveloper ResponseDec 9 at 6:43 AM\n\nThank you for playing! We just updated the game, versions 1.0.80+ include \"Reset All Progress\" option in the game menu :)", "v2.trainingMay 26 at 7:09 AM\nGreat game BUT not for hand tracking!\n\nUPDATE: Reply from developer suggesting it might be my lighting or coloured nail polish (which I dont wear ) this isnt very helpful, considering I use oculus quest daily, including hand tracking for basic menu navigation. The hand tracking just doesnt work well for gaming, its not the lighting in my room or nail colour.\n\nI loved this game back when it came out and played on the Vive, was very excited to try it with hand tracking and was a let down, very frustrating experience. Not the developers fault as the tracking is new and not advanced enough to really be usable in game. Good try but dont buy if youre just looking for hand tracking, be prepared to use the controllers and enjoy the game properly.\n\nHelpful | 0\nDeveloper ResponseMay 27 at 6:12 AM\n\nThank you for playing! Regarding the hand tracking mode here are a few tips: - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "Bad_ProMay 31 at 8:10 AM\nHandtracking seems to hate me\n\nIt is fun and all, but my hands keep disapearing, so I can't truely experience the game\n\nHelpful | 0", "MJDreraJan 4 at 9:50 AM\nBrilliant!\n\nMy son and I are playing together, and, although I haven't found out yet how to get the item out of the labyrinth after the quest, we're trying now to hatch the egg using the clues around the main room, books, earpiece and cage. We still have to find out what the music player if for and why other people have chess while we have the viking chess pieces. It's so much fun! It's in English, which is a bit challenging, but it's good practice for us. We're waiting for updates, like the possibility to cross the suspended bridge and many other things we saw in other peoples' tutorials. Really enjoyable\n\nHelpful | 3", "NazoTheGray1999Jan 3 at 10:52 AM\nBrings out the 8 year old within me!!\n\nI love this game!! I still have things to discover, but I want to say I wanted this game ever since Youtuber CaptainSauce played Waltz of the Wizard! Definitely Family Friendly! That said I just got the Oculus Quest for Christmas and wanted to say Kudos to the developer of this game! Well done!\n\nHelpful | 6", "Killerfire1290Jun 6 at 8:13 AM\nShort\n\nVery short but super fun to play even after beating it\n\nHelpful | 0", "skinny.Pv2Jul 13 at 7:06 AM\nTo short\n\nTo short to reach cauldron \n\nHelpful | 0\nDeveloper ResponseJul 13 at 9:06 AM\n\nHi! In the in-game menu you can change your height to better reach the cauldron :)", "cooljules2010May 27 at 9:56 AM\nGood game. Not so good tracking.\n\nWhen i play my hand always disappear. Which is really annoying. But by far its a good game.\n\nHelpful | 0\nDeveloper ResponseMay 28 at 3:37 AM\n\nThank you for playing Waltz! Regarding the hand tracking mode here are a few tips: - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "ssessJun 6 at 9:55 AM\nBrilliant fun\n\nLove this game. A definite buy. So exciting\n\nHelpful | 0", "OnTheFrontLineDec 5 at 6:18 PM\nAbsolute banger!\n\nIve been playing this one since it first hit desktop VR and bought the extended version the second it hit. Very fun and interactive experience that cannot be skipped. Definitely pick this one up!\n\nHelpful | 14", "firecracker1369Jun 2 at 5:23 PM\nHelp\n\nThe game have many glitch. Like black squares everywhere\n\nHelpful | 0\nDeveloper ResponseJun 3 at 6:23 AM\n\nHi, thanks for playing! Could you please try rebooting your headset and running the game again?", "Samel_The_Camel08Jun 8 at 7:24 AM\nAwesome\n\nIm so glad I bought it\n\nHelpful | 1", "Mark-BlissJan 26 at 8:42 AM\nGreat game for all ages\n\nThis is a very enjoyable game that from the youngest child to the oldest adult could play and have fun with. There is no motion sickness graphics are fabulous well worth the money\n\nHelpful | 2", "DungewarMay 28 at 2:27 PM\nGood game, but...\n\nIt's a very cool game but there are only 12 spells. I love the hand tracking.\n\nHelpful | 0\nDeveloper ResponseMay 29 at 3:53 AM\n\nThank you for the review! Waltz of the Wizard is expanding and there's much more content to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "Garfi5hMay 29 at 9:54 AM\nThis game is great\n\nThe game is real good but how do I get outside like the trailer showed?\n\nHelpful | 1\nDeveloper ResponseMay 29 at 3:22 PM\n\nThank you for playing! To go outside you need to use the orb on the pillar next to the knight, and then play the song heard on the xylophone and enter the portal :)", "Novabruh2007Jun 2 at 10:15 AM\nI love it!... but\n\nI had expected more fighting parts in the game.\n\nHelpful | 1", "5MRTMay 25 at 4:59 PM\nGood game but..\n\nThe Game is good I just feel like hand tracking need to be more polished\n\nHelpful | 0", "DestromiteFeb 13 at 12:17 PM\nPretty boring and basic.\n\nI wish i had fun from this game but me and my gf didn't find it entertaining. It feels like a gimmick that should be $3. maybe I just haven't progressed through other levels or something but all there is are bland spells how long is a few under gimmicks like cutting apples that fly at you. there is one spell that turns everything into frogs you touch then they hop away. All but one spell are touch-based and only controllable by going back up to the workbench and holding your hand over the deactivate spell button.\n\nmaybe I just haven't unlocked all the secrets but you're basically just stuck in a room full of gimmicks you're bored with the moment you use them.\n\nHelpful | 1\nDeveloper ResponseFeb 28 at 5:19 AM\n\nHey! Sorry to hear it. Make sure to check out the teleport areas, labyrinth combat area, the Skull's scavenger hunt and secret audio hunting with the earpiece! There's also more to come, taking the experience to a new level - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "getwreckedson11Jan 20 at 7:25 AM\nGreat game!\n\nIts a fun game, I enjoyed the xylophone, the big and little drinks, and especially the spells. My little sister loved it and so did I, this game is short but a great value.\n\nHelpful | 3", "leeboiiMay 29 at 8:22 AM\nGreat\n\nAlso works with controllers and is super fun\n\nHelpful | 1", "KeegerwockyDec 22 at 2:47 PM\nExtremely Short, but incredibly Enjoyabl\n\nIt was very short, to the point of feeling like you have not completed it, many Easter eggs that I imagine there are are near impossible to find on your own and it feels like there's so much more that could be done with the game. For instance, there is a dragon egg, but no obvious way to hatch it; Its just a egg shaped bouncy ball. There's a genie's lamp. But when you rub it, sparkles shoot out the end and laugh menacingly, that's it. It feels like such a wasted Opportunity. However I think this game has an incredible amount of potential, and before you get to the point where you feel lost and confused, it's an absolute blast! This game would be amazing with hand Tracking, and despite its flaws, I think if the developers can listen and nurture there comunity, then well, <insert good thing here>.\n(My brain stopped doing the words right.)\n\nHelpful | 4", "dawsonsnyder7899Jun 26 at 6:11 PM\nHand tracking way off\n\nMaybe its just my headset but my hands kept dissapering and floating away and I couldn't do and snap move at all\n\nHelpful | 0\nDeveloper ResponseJun 29 at 3:06 AM\n\nHi, it sounds like you don't have optimal tracking in the hand-tracking mode in Waltz. Here are a few tips: - Reboot your Quest. - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "Maxiboy15Feb 9 at 12:43 AM\nGame play\n\nOke it's a very fun and cool experience but their is just not enough combat (yes I am a combat magic fan) or behaps a wand that you can cast spells from with specific movements. All and all it's a fun game but their can be more.\n\nWill change this if their is a update\n\nHelpful | 0\nDeveloper ResponseFeb 28 at 5:20 AM\n\nHey! There's more to come, taking the experience to a new level - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "DoomsdayDeluxeApr 10 at 11:42 PM\nAwesome Game! Just one thing\n\nThis game is amazing! It's really fun to play around with the spells but I wist you could use 2 different spells at once. This could be possible by having you dip you hand in the potion to set the spell to that hand allowing you to have one spell on each hand!\n\nHelpful | 0", "aaacreolMay 25 at 11:02 PM\nHand tracking us amazing\n\nGreat game to show the family\n\nHelpful | 0", "SteveJSJan 5 at 8:07 PM\nMagical\n\nFull of whimsy and imagination, I bought this game for my grandkids but doscovered how much I'm enjoying it myself. This is one of the apps I enjoy showing to people who have not experienced VR before. Well worth the price!\n\nHelpful | 1", "Toucan-ManJan 25 at 2:00 PM\nAWESOME!\n\nThough I haven't played it on my quest yet, I played for a long while at my friend's house. It's amazing! Worth the ten dollars.\n\nHelpful | 1", "jonbletzDec 6 at 10:41 AM\nAmazing Game!!\n\nDon't hesitate in this one! I buy most of the games but use the quest a lot to show and introduce people to VR. This game will be my new go to game for showing the quest to groups of people. It's super fun and the visuals are awesome. This is what VR is all about.\n\nHelpful | 3", "freddiej1909Dec 13 at 5:56 AM\nAmazing!!!\n\nI cannot describe how much fun me and my twin brother had whilst playing this. Hours at a time we would find secrets and we just need to find the trophy next to judgment. This game is just absolutely amazing and really fun. I would love more stuff in the game tho. Thanks to GamerReality for giving me the code to this game. Amazing and just... I cant describe my experience with this game.\n\nHelpful | 4", "Thrud00630Feb 10 at 11:05 PM\nCan't wait for finger tracking\n\nVery solid game full of wizards spells\n\nHelpful | 0", "majorroquiFeb 7 at 12:39 PM\nActualizando.\n\nThanks for your reply. I update the comment because it turned out to be a misunderstanding on my part. Everything is going well, and soon I am waiting for Oculus to allow developers to use hand tracking in games. Thank you.\n\nHelpful | 3", "Matt7273637Jan 19 at 11:56 PM\nSimply amazing\n\nIts a good and challenging game and I cant wait for Hand-Tracking to be implemented. You make great games dont stop with that\n\nHelpful | 1", "jestr999Dec 5 at 8:37 PM\nLoved it\n\nGreat game for just messing around in VR. The developers really get what is fun in VR and how it all works together. Thanks for this fun little title. Highly recommended!!!\n\nHelpful | 6", "henrythedog64Feb 10 at 12:51 PM\nToo good\n\nCrab\n\nPlay it. It's worth the money\n\nHelpful | 0", "aaron.sommers.1253Jan 28 at 5:42 AM\nWaltz of the wizard\n\nWhat a GREAT sandbox wizard experience. Come play with the Dark arts and have a blast like me :)\n\nHelpful | 1", "abreurey5Feb 10 at 2:10 PM\nIntriguing\n\nVery well made...worth the price\n\nHelpful | 0", "HalfAlrightDec 15 at 8:32 AM\nA modern rival to top VR titles.\n\nAn absolutely stunning game that will fully make you feel powerful controlling the world around you and the wide range of unique items in it. As well as power, the amount of exploration this game has to offer is breathtaking, and it gives many hours of enjoyable content and just plain fun.\n\n10/5\n\nHelpful | 2", "Blake3697Feb 8 at 10:54 AM\nWould give 10 stars if I could 10/10 ama\n\nGreat game riddles were hard though\n\nHelpful | 0", "Co0pFeb 14 at 7:02 PM\nMeh\n\nIt is not long at all. I bought this game expecting lost of cool things and missions. All I got was 2 hours of a quick, boring game. It was not the type of game I would play. I would recommend Espire 1 instead.\n\nHelpful | 2", "Sidx21Dec 30 at 12:25 PM\nFun but short\n\nThe mechanics and visuals of the game were amazing, the only downsides were how easy it was to obtain all the spells, and how little there is to do other than the globes. That being said what there was to experience was phenomenal.\n\nHelpful | 0", "TKA_lil_dudeJan 10 at 11:07 AM\nReally good, but\n\nI really like messing with the lightsaber, but if you pick it up, you immediately start lightsaber practice, there should be a choice to play it, like the crossbow\n\nHelpful | 1", "olbradleyFeb 7 at 6:49 AM\nExcellent\n\nAmazing game super entertaining\n\nHelpful | 0", "Oofer2567Feb 26 at 4:49 PM\nGood but quick\n\nI think it was a good game but I got bored within 30 min and am trying to get a refund would buy but not for a long multi day try to beat experience\n\nHelpful | 0\nDeveloper ResponseFeb 28 at 5:17 AM\n\nHey! Make sure to check out the teleport areas, labyrinth combat area, the Skull's scavenger hunt and secret audio hunting with the earpiece! There's also more to come, taking the experience to a new level - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "VR2050Dec 11 at 10:12 AM\nWOW!!\n\nThis is my favorite title in the store! I had so much fun trying out all the spells. Part 2 please. Thanks.\n\nThis is a must have!\n\nIs there any way to make the wizard hat to stop making noise? If I am not wearing the hat it constantly is making a sound for me to interact with it. It never stops.\n\nHelpful | 2", "T2theKingFeb 6 at 11:26 AM\n\nSooooooooo much fun!!\n\nHelpful | 1", "OstisomaDec 14 at 2:41 PM\nOkay\n\nIf you are a VR veteran you probably won't be too impressed by the interactive mechanisms it offers, and to be honest these are not the most beautiful graphics you've seen in VR games. I'm keeping this game for a friend of mine who is a Harry Potter fan and loves exploratory games more than I do.\n\nHelpful | 0", "ba55eJan 27 at 12:49 PM\nFun\n\nIts fun but please add hand tracking, it would improve it loads.\n\nHelpful | 1", "ImASquirrelYipeeApr 28 at 4:52 AM\nGreat but Im stuck\n\nYou learn all the spells, get 5 of the trophies, then what? It seems like your just throwing around balls.\n\nHelpful | 0\nDeveloper ResponseApr 29 at 3:06 AM\n\nThanks for playing Waltz! Make sure to check out the teleport areas using the Xylophone, labyrinth combat area, the new Skull's scavenger hunt and secret audio hunting with the earpiece! There's also much more to come - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "DemogorgonWhiteDec 9 at 10:28 PM\n\nI did expect something a bit different but then again it is what I wanted. A magic experience in vr that is more chill than action.\nGreat thing to show someone who is new to be as basically everything is interactive and I am sure I have not discovered the purpose of everything.\nThe one thing I wish would be more spells and maybe some other, bigger location to test them.\n\nHelpful | 1", "cjsparks115Dec 7 at 2:11 PM\nI absolutely loved it...\n\nI saw footage of people playing it when there was one teleport location and eight spells.It looked awesome and I wanted to try it.I beat the game in 3 minutes with all spells 8/8 silver trophies all three mysterious potions found and 1/4 golden trophies.The reason it is a four star is because there wasnt a lot to do and I couldnt get the three other golden trophies.So yes I loved it but if I were the game creators I would add more spells like summon that can summon a random animal or literally anything or ice that will freeze anything you touch and if you hold the grip it gives you fists of ice which are melee weapons.Or necromancy where you could revive the skull might or second skull (target practice) or heck maybe we could have multiplayer and battles or maybe just a telekinesis spell.I dont know but for now its a four star.\n\nHelpful | 6", "poayoFeb 2 at 1:00 PM\nShort but amazing\n\nLoved every second\n\nHelpful | 1", "jamtastic2018Jan 28 at 10:41 AM\nWould get\n\nI love it and rate it above 5\n\nHelpful | 2", "L31TH4LDec 18 at 7:41 AM\nGreat Beginner Game\n\nProbably my favorite game to let people try out VR for the first time. Novelty game that let's people get used to move TD and interaction! Also looks great. I hope the Labyrinth was a precursor to a legitimate game. so Much potential\n\nHelpful | 1", "kingdedede1273Dec 9 at 3:51 AM\namazing\n\nI can't wait to play this with hand tracking\n\nHelpful | 9", "CryoDrakonJan 12 at 8:38 AM\nFun, but....\n\nCool spells but not enough, great adventures but some too creepy, short but fun! Cool 10$ game 8/10.\n\nHelpful | 1", "allenwrench59Dec 10 at 6:26 PM\nBeautiful Game\n\nI really love the way this game looks such an awesome job from the developers!! If I had one minor gripe If they could put close captioning in the game please ! I do not hear well so I cannot tell what they are saying while I am playing. \n\nHelpful | 3", "Eli_B_3May 28 at 6:21 PM\n\nThe game is fun but I had some issues with the hand tracking it dosnt always want to register\n\nHelpful | 0\nDeveloper ResponseMay 29 at 3:52 AM\n\nThank you for playing! Regarding the hand tracking mode here are a few tips: - Try another room. - Be in a brightly lit environment. - Do not stay in direct sunlight. - Clean the camera lenses. - Passthrough can help you better understand what the cameras are seeing. We also published a blogpost that goes into more detail on how to achieve optimal tracking - https://tinyurl.com/hand-tracking", "Pro_420Jan 11 at 6:37 PM\nVery magical\n\nI loved this game! I liked all the references to things like harry potter and the monkeys paw.\n\nHelpful | 1", "ghostsquaddMar 10 at 12:55 PM\nHogwarts!! \n\nMakes me feel like a kid again with imagination running wild. Wondering what would happen if I mixed this with that or drank this potion . Theres so much to discover and I aim to unravel them all. Back to Hogwarts I go, I have a meeting with a talking  . \n\nHelpful | 0", "sinkkingDec 7 at 9:20 AM\nHell yea pretty good boy\n\nYou want supernatural power??, do you like xylophones?? then you want this game it's that simple.\n\nThese are great developers whoever they are.\n\nThis and Thrill of the fight are the tightest games on the quest.\n\nHelpful | 6", "XaranderJan 4 at 6:49 AM\nGrand game\n\nThis game is a must have for all true fantasy fans out there. It's great and has a ton of content for 5 bucks\n\nHelpful | 1", "StrictAphid4882Jan 8 at 8:02 AM\nLove this game!\n\nWhen I bought this game. I\nImmediately fell in love with it.\n\nI would recommend this game!\n\nHelpful | 0", "caige.sothernFeb 21 at 8:48 PM\nHi\n\nIt's to sort and cinda boring\n\nHelpful | 3\nDeveloper ResponseFeb 28 at 5:19 AM\n\nHey! Sorry to hear it. Make sure to check out the teleport areas, labyrinth combat area, the Skull's scavenger hunt and secret audio hunting with the earpiece! There's also more to come, taking the experience to a new level - we've opened a new Discord community and will share more news soon. https://discord.gg/cxHB5zF", "CipTDMJan 13 at 9:18 AM\nBest game Ive played so far.\n\nIf your new to vr then I recommend playing this\n\nHelpful | 1", "Studly_McSexfireDec 13 at 4:39 PM\nWow\n\nWow man. For 10 bucks too. Great value. Im so impressed with this game. So much detail and the most interactive vr game Ive played. Developers outdid themselves with this. Such a cool game.\n\nHelpful | 1", "TiltedSaltDec 8 at 9:41 AM\nMoose\n\nAaaaaaaaaaaaahhh\n\nHelpful | 7", "Tr3yNy3Dec 29 at 6:41 AM\nBest $10 game\n\nIt was great although there is a part that I dont understand with stars aligning and gongs\n\nHelpful | 2", "SankyuFeb 20 at 6:14 AM\nIt's Magic!\n\nAnd magic is cool \n\nHelpful | 0", "onatdayFeb 15 at 1:17 PM\nNo hand tracking\n\nI thought this had the hand tracking do you think I could get a refund?\n\nHelpful | 1\nDeveloper ResponseMay 24 at 4:41 AM\n\nHi! Sorry but Oculus hasnt given developers permission to publish apps with hand tracking yet. Were as excited about hand-tracking as you are and have quite a few things in the works! UPDATE: The hand tracking update is available now! :)", "kobe.claybrookDec 19 at 6:39 AM\nWorth the 10 bucks\n\nLoved the game, it was very immersive and I'm definetly going to play through it again when the hand tracking update comes out\n\nHelpful | 3", "BanjoVRDec 11 at 5:11 AM\nA magical experience\n\nThis should be the go-to introduction to VR. Its so immersive, fun, slightly creepy in places and definitely replay able. If this gets hand tracking too itll be even more of a must-have!\n\nHelpful | 0", "JulianBicknellDec 6 at 6:37 PM\nOne of the classic must have vr titles\n\nI played the original on the rift and this is the exact same except it has a little more content, definitely worth $10 and should 100% be most peoples entry vr title\n\nHelpful | 5", "noah.englmannJan 15 at 9:45 AM\nWorth every dollar\n\nGood\n\nHelpful | 1", "Din-DjarinDec 29 at 9:33 PM\nAmazing game\n\nWas very happy with the controls and gameplay. Would be great to see some dlc for it\n\nHelpful | 1", "Nathan.FortkneeDec 20 at 8:40 PM\nAmazing\n\nIt was a great game there was enough to do for me not to get more really fast and the maze was really fun just such a good game\n\nHelpful | 1", "Aaronb3434Dec 23 at 4:27 PM\nCool\n\nFun fantasy vr experience. if possible add more content and worlds.\n\nHelpful | 1", "ginwoo1985Dec 11 at 1:48 PM\nIm magical!\n\nIt felt awesome moving objects and creating butterflies! It was fun finding the spells! Now I have to use the xylophone to teleport and I cant wait!\n\nHelpful | 2", "DoctorDecterDec 18 at 7:43 PM\nVery nice\n\nIt was cool I tell ya i had the fun oh yeah very nice :)\n\nHelpful | 2", "tx11.95Dec 17 at 11:19 PM\nIt was awesome\n\nIt was amazing. So fun I loved it. I would love more spells.\n\nHelpful | 2", "TheHypeSlimeDec 7 at 6:24 AM\nGame review\n\nThe game was incredibly short it took me under an hour to get all the spells and go through the globes but it was an amazing experience\n\nHelpful | 5", "axopatrickDec 13 at 12:53 PM\nMagical !\n\nWaltz of the Wizard is definitely a must have for any fantasy/harry potter fan, and it's a perfect \"wow experience\" for a VR newcomer.\n\nHelpful | 2", "oculusnate12Dec 6 at 11:01 AM\nI love this game\n\nThis was my first game in vr in my vive and now that vr has changed so much since then its getting to a full circle, I would recommend to anyone.\n\nHelpful | 2", "zack.slotkowskiDec 6 at 10:42 PM\nAwesome\n\nLots of different stuff to interact with. Well worth the $10. I feel like I find something new every time I play.\n\nHelpful | 4", "Dominator740Dec 13 at 3:32 PM\nAmazing game\n\nGreat beautiful so much to do and so much fun!\n\nHelpful | 2", "Com32Dec 26 at 5:17 PM\nAmazing!!\n\nThis is one of the best VR experiences to date!!\n\nHelpful | 1", "vickyslApr 7 at 9:32 AM\nVicky\n\nLove it!\n\nHelpful | 0", "Snow2DApr 19 at 12:42 PM\nCrashing\n\nIt's fun and creative. I spent 2-3 hours in it and I've almost seen everything. In those few hours it did crash five times.\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:53 AM\n\nHi, sorry to hear about crashing issues. Please use our Discord if you can provide more details on the game crashes - https://discord.gg/cxHB5zF or email support@aldin.io :)", "justink9088Dec 13 at 1:23 PM\nAverage intro to vr\n\nNothing really stands out.\nFor kids the game would be a toy box.\nFor adults. Its meh. Not bad just not good.\nIts like you bought a Harry Potter intro to vr\n\nHelpful | 3", "FlameDiverDec 23 at 2:35 PM\nIts great\n\nBut a little too short\n\nHelpful | 1", "The-System-SlayerDec 9 at 1:07 PM\nIts a good game\n\nIts an awesome game but has a short story and you can complete basically the entire thing in about 2 hours\n\nHelpful | 1", "Lazer241Dec 11 at 1:20 PM\nIts fun but...\n\nIts super fun to be mixing all these ingredients together. But they could use some more ingredients. Theres only 12 spells. I also dont like the walking path instead of just regular teleporting. Needs some updates.\n\nHelpful | 4\nDeveloper ResponseDec 11 at 4:13 PM\n\nThank you for playing! In the game menu you can change between multiple types of locomotions. Also we hope you try out the many teleportation scenes using the xylophone teleporter:)", "RobustPaellaDec 15 at 4:31 AM\nA fun experience but no real thrill\n\nI wish it would have teleporting rather than jumpy movements, and that the place you're in could be reset or tidied up with some wand or spell, because it really becomes messy when fooling around with different spells.\n\nHelpful | 1", "habib.alaskariDec 16 at 5:10 PM\nI have the Oculus quest version 12\n\nAnd I have hand tracking but I can't play this game with them\n\n\nThis game is supposed to be one of the games that support the hand tracking\n\nHelpful | 14\nDeveloper ResponseMay 24 at 4:43 AM\n\nHi! Sorry but Oculus hasnt given developers permission to publish apps with hand tracking yet. Were as excited about hand-tracking as you are and have quite a few things in the works! UPDATE: The hand tracking update is available now for free on Quest OS version 17+ :)", "EggoMyLegoEggoDec 12 at 3:32 PM\nIt is a very fun game\n\nIt is a very fun game\n\nHelpful | 1", "rhythmjediDec 7 at 7:53 AM\nUm, where's the hand tracking?\n\nI just installed it and found no option or method to recognize my hands. Game details also specify the supported input method are the Touch Controllers. This was a demo for hand tracking... I'd even call it THE demo for hand tracking. Boo, weaksauce! Whether it will or won't have hand tracking should be loudly disclaimed by Oculus. Poor form! Boo!\n\nHelpful | 12\nDeveloper ResponseMay 24 at 4:43 AM\n\nHi! Sorry but Oculus hasnt given developers permission to publish apps with hand tracking yet. Were as excited about hand-tracking as you are and have quite a few things in the works! UPDATE: The hand tracking update is available now for free on Quest OS version 17+ :)", "joseph.capoun.54Jan 8 at 1:06 PM\nHow do I get a refund its not working\n\nHowww bruh I thought it was gunna have the new hand tracking\n\nHelpful | 2\nDeveloper ResponseMay 24 at 4:42 AM\n\nHi! Sorry but Oculus hasnt given developers permission to publish apps with hand tracking yet. Were as excited about hand-tracking as you are and have quite a few things in the works! UPDATE: The hand tracking update is available now for free on Quest OS version 17+ :)"]