{"App Title": "Wander", "App description": "Wander the world openly through the magic of VR.\n\nFrom the comfort of your living room you can teleport almost anywhere in the world - whether you wish to walk across the London Bridge, stroll the gardens of the Taj Mahal, or witness the enormity of the Great Pyramids of Egypt - unlimited exploration awaits!\n\nNotable features include:\n- Speech recognition for searching\n- Wikipedia integration for location-based learning\n- Historical jumping to witness changes over the years\n- Multiple navigation modes and more\n\nNote: This app uses data from Google StreetView but is not an official Google product.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User, Co-op", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "360 Experience (non-game), Exploration, Travel", "Languages": "English", "Version + Release Notes": "0.3392", "Developer": "Parkline Interactive, LLC", "Publisher": "Parkline Interactive, LLC", "Website": "http://www.parklineinteractive.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "TERMS OF USE\n\n\nLast updated March 14, 2019\n\n\n\n\n\n\nAGREEMENT TO TERMS\n\n\nThese Terms of Use constitute a legally binding agreement made between you, whether personally or on behalf of an entity (you) and Parkline Interactive, LLC., doing business as Parkline Interactive (\"Parkline Interactive\", we, us, or our), concerning your access to and use of the http://parklineinteractive.com website as well as any other media form, media channel, mobile website or mobile application related, linked, or otherwise connected thereto (collectively, the Site). You agree that by accessing the Site, you have read, understood, and agreed to be bound by all of these Terms of Use. IF YOU DO NOT AGREE WITH ALL OF THESE TERMS OF USE, THEN YOU ARE EXPRESSLY PROHIBITED FROM USING THE SITE AND YOU MUST DISCONTINUE USE IMMEDIATELY.\n\n\nSupplemental terms and conditions or documents that may be posted on the Site from time to time are hereby expressly incorporated herein by reference. We reserve the right, in our sole discretion, to make changes or modifications to these Terms of Use at any time and for any reason. We will alert you about any changes by updating the Last updated date of these Terms of Use, and you waive any right to receive specific notice of each such change. It is your responsibility to periodically review these Terms of Use to stay informed of updates. You will be subject to, and will be deemed to have been made aware of and to have accepted, the changes in any revised Terms of Use by your continued use of the Site after the date such revised Terms of Use are posted.\n\n\nThe information provided on the Site is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject us to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access the Site from other locations do so on their own initiative and are solely responsible for compliance with local laws, if and to the extent local laws are applicable.\n\n\nThe Site is intended for users who are at least 13 years of age. All users who are minors in the jurisdiction in which they reside (generally under the age of 18) must have the permission of, and be directly supervised by, their parent or guardian to use the Site. If you are a minor, you must have your parent or guardian read and agree to these Terms of Use prior to you using the Site.\n\n\n\n\nINTELLECTUAL PROPERTY RIGHTS\n\n\nUnless otherwise indicated, the Site is our proprietary property and all source code, databases, functionality, software, website designs, audio, video, text, photographs, and graphics on the Site (collectively, the Content) and the trademarks, service marks, and logos contained therein (the Marks) are owned or controlled by us or licensed to us, and are protected by copyright and trademark laws and various other intellectual property rights and unfair competition laws of the United States, international copyright laws, and international conventions. The Content and the Marks are provided on the Site AS IS for your information and personal use only. Except as expressly provided in these Terms of Use, no part of the Site and no Content or Marks may be copied, reproduced, aggregated, republished, uploaded, posted, publicly displayed, encoded, translated, transmitted, distributed, sold, licensed, or otherwise exploited for any commercial purpose whatsoever, without our express prior written permission.\n\n\nProvided that you are eligible to use the Site, you are granted a limited license to access and use the Site and to download or print a copy of any portion of the Content to which you have properly gained access solely for your personal, non-commercial use. We reserve all rights not expressly granted to you in and to the Site, the Content and the Marks.\n\n\n\n\nUSER REPRESENTATIONS\n\n\nBy using the Site, you represent and warrant that: (1) you have the legal capacity and you agree to comply with these Terms of Use; (2) you are not under the age of 13;(3) you are not a minor in the jurisdiction in which you reside, or if a minor, you have received parental permission to use the Site; (4) you will not access the Site through automated or non-human means, whether through a bot, script, or otherwise; (5) you will not use the Site for any illegal or unauthorized purpose; and (6) your use of the Site will not violate any applicable law or regulation.\n\n\nIf you provide any information that is untrue, inaccurate, not current, or incomplete, we have the right to suspend or terminate your account and refuse any and all current or future use of the Site (or any portion thereof).\n\n\n\n\nPROHIBITED ACTIVITIES\n\n\nYou may not access or use the Site for any purpose other than that for which we make the Site available. The Site may not be used in connection with any commercial endeavors except those that are specifically endorsed or approved by us.\n\n\nAs a user of the Site, you agree not to:\n\n\n\n\n\n\nUSER GENERATED CONTRIBUTIONS\n\n\nThe Site does not offer users to submit or post content. We may provide you with the opportunity to create, submit, post, display, transmit, perform, publish, distribute, or broadcast content and materials to us or on the Site, including but not limited to text, writings, video, audio, photographs, graphics, comments, suggestions, or personal information or other material (collectively, \"Contributions\"). Contributions may be viewable by other users of the Site and through third-party websites. As such, any Contributions you transmit may be treated in accordance with the Site Privacy Policy. When you create or make available any Contributions, you thereby represent and warrant that:\n\n\n1. The creation, distribution, transmission, public display, or performance, and the accessing, downloading, or copying of your Contributions do not and will not infringe the proprietary rights, including but not limited to the copyright, patent, trademark, trade secret, or moral rights of any third party.\n2. You are the creator and owner of or have the necessary licenses, rights, consents, releases, and permissions to use and to authorize us, the Site, and other users of the Site to use your Contributions in any manner contemplated by the Site and these Terms of Use.\n3. You have the written consent, release, and/or permission of each and every identifiable individual person in your Contributions to use the name or likeness of each and every such identifiable individual person to enable inclusion and use of your Contributions in any manner contemplated by the Site and these Terms of Use.\n4. Your Contributions are not false, inaccurate, or misleading.\n5. Your Contributions are not unsolicited or unauthorized advertising, promotional materials, pyramid schemes, chain letters, spam, mass mailings, or other forms of solicitation.\n6. Your Contributions are not obscene, lewd, lascivious, filthy, violent, harassing, libelous, slanderous, or otherwise objectionable (as determined by us).\n7. Your Contributions do not ridicule, mock, disparage, intimidate, or abuse anyone.\n8. Your Contributions do not advocate the violent overthrow of any government or incite, encourage, or threaten physical harm against another.\n9. Your Contributions do not violate any applicable law, regulation, or rule.\n10. Your Contributions do not violate the privacy or publicity rights of any third party.\n11. Your Contributions do not contain any material that solicits personal information from anyone under the age of 18 or exploits people under the age of 18 in a sexual or violent manner.\n12. Your Contributions do not violate any applicable law concerning child pornography, or otherwise intended to protect the health or well-being of minors;\n13. Your Contributions do not include any offensive comments that are connected to race, national origin, gender, sexual preference, or physical handicap.\n14. Your Contributions do not otherwise violate, or link to material that violates, any provision of these Terms of Use, or any applicable law or regulation.\n\n\nAny use of the Site in violation of the foregoing violates these Terms of Use and may result in, among other things, termination or suspension of your rights to use the Site.\n\n\n\n\nCONTRIBUTION LICENSE\n\n\nYou and the Site agree that we may access, store, process, and use any information and personal data that you provide following the terms of the Privacy Policy and your choices (including settings).\n\n\n\nBy submitting suggestions or other feedback regarding the Site, you agree that we can use and share such feedback for any purpose without compensation to you.\n\n\nWe do not assert any ownership over your Contributions. You retain full ownership of all of your Contributions and any intellectual property rights or other proprietary rights associated with your Contributions. We are not liable for any statements or representations in your Contributions provided by you in any area on the Site. You are solely responsible for your Contributions to the Site and you expressly agree to exonerate us from any and all responsibility and to refrain from any legal action against us regarding your Contributions.\n\n\n\n\nMOBILE APPLICATION LICENSE\n\n\nUse License\n\n\nIf you access the Site via a mobile application, then we grant you a revocable, non-exclusive, non-transferable, limited right to install and use the mobile application on wireless electronic devices owned or controlled by you, and to access and use the mobile application on such devices strictly in accordance with the terms and conditions of this mobile application license contained in these Terms of Use. You shall not: (1) decompile, reverse engineer, disassemble, attempt to derive the source code of, or decrypt the application; (2) make any modification, adaptation, improvement, enhancement, translation, or derivative work from the application; (3) violate any applicable laws, rules, or regulations in connection with your access or use of the application; (4) remove, alter, or obscure any proprietary notice (including any notice of copyright or trademark) posted by us or the licensors of the application; (5) use the application for any revenue generating endeavor, commercial enterprise, or other purpose for which it is not designed or intended; (6) make the application available over a network or other environment permitting access or use by multiple devices or users at the same time; (7) use the application for creating a product, service, or software that is, directly or indirectly, competitive with or in any way a substitute for the application; (8) use the application to send automated queries to any website or to send any unsolicited commercial e-mail; or (9) use any proprietary information or any of our interfaces or our other intellectual property in the design, development, manufacture, licensing, or distribution of any applications, accessories, or devices for use with the application.\n\n\nApple and Android Devices\n\n\nThe following terms apply when you use a mobile application obtained from either the Apple Store or Google Play (each an App Distributor) to access the Site: (1) the license granted to you for our mobile application is limited to a non-transferable license to use the application on a device that utilizes the Apple iOS or Android operating systems, as applicable, and in accordance with the usage rules set forth in the applicable App Distributors terms of service; (2) we are responsible for providing any maintenance and support services with respect to the mobile application as specified in the terms and conditions of this mobile application license contained in these Terms of Use or as otherwise required under applicable law, and you acknowledge that each App Distributor has no obligation whatsoever to furnish any maintenance and support services with respect to the mobile application; (3) in the event of any failure of the mobile application to conform to any applicable warranty, you may notify the applicable App Distributor, and the App Distributor, in accordance with its terms and policies, may refund the purchase price, if any, paid for the mobile application, and to the maximum extent permitted by applicable law, the App Distributor will have no other warranty obligation whatsoever with respect to the mobile application; (4) you represent and warrant that (i) you are not located in a country that is subject to a U.S. government embargo, or that has been designated by the U.S. government as a terrorist supporting country and (ii) you are not listed on any U.S. government list of prohibited or restricted parties; (5) you must comply with applicable third-party terms of agreement when using the mobile application, e.g., if you have a VoIP application, then you must not be in violation of their wireless data service agreement when using the mobile application; and (6) you acknowledge and agree that the App Distributors are third-party beneficiaries of the terms and conditions in this mobile application license contained in these Terms of Use, and that each App Distributor will have the right (and will be deemed to have accepted the right) to enforce the terms and conditions in this mobile application license contained in these Terms of Use against you as a third-party beneficiary thereof.\n\n\n\n\nSUBMISSIONS\n\n\nYou acknowledge and agree that any questions, comments, suggestions, ideas, feedback, or other information regarding the Site (\"Submissions\") provided by you to us are non-confidential and shall become our sole property. We shall own exclusive rights, including all intellectual property rights, and shall be entitled to the unrestricted use and dissemination of these Submissions for any lawful purpose, commercial or otherwise, without acknowledgment or compensation to you. You hereby waive all moral rights to any such Submissions, and you hereby warrant that any such Submissions are original with you or that you have the right to submit such Submissions. You agree there shall be no recourse against us for any alleged or actual infringement or misappropriation of any proprietary right in your Submissions.\n\n\n\n\nTHIRD-PARTY WEBSITE AND CONTENT\n\n\nThe Site may contain (or you may be sent via the Site) links to other websites (\"Third-Party Websites\") as well as articles, photographs, text, graphics, pictures, designs, music, sound, video, information, applications, software, and other content or items belonging to or originating from third parties (\"Third-Party Content\"). Such Third-Party Websites and Third-Party Content are not investigated, monitored, or checked for accuracy, appropriateness, or completeness by us, and we are not responsible for any Third-Party Websites accessed through the Site or any Third-Party Content posted on, available through, or installed from the Site, including the content, accuracy, offensiveness, opinions, reliability, privacy practices, or other policies of or contained in the Third-Party Websites or the Third-Party Content. Inclusion of, linking to, or permitting the use or installation of any Third-Party Websites or any Third-Party Content does not imply approval or endorsement thereof by us. If you decide to leave the Site and access the Third-Party Websites or to use or install any Third-Party Content, you do so at your own risk, and you should be aware these Terms of Use no longer govern. You should review the applicable terms and policies, including privacy and data gathering practices, of any website to which you navigate from the Site or relating to any applications you use or install from the Site. Any purchases you make through Third-Party Websites will be through other websites and from other companies, and we take no responsibility whatsoever in relation to such purchases which are exclusively between you and the applicable third party. You agree and acknowledge that we do not endorse the products or services offered on Third-Party Websites and you shall hold us harmless from any harm caused by your purchase of such products or services. Additionally, you shall hold us harmless from any losses sustained by you or harm caused to you relating to or resulting in any way from any Third-Party Content or any contact with Third-Party Websites.\n\n\n\n\nSITE MANAGEMENT\n\n\nWe reserve the right, but not the obligation, to: (1) monitor the Site for violations of these Terms of Use; (2) take appropriate legal action against anyone who, in our sole discretion, violates the law or these Terms of Use, including without limitation, reporting such user to law enforcement authorities; (3) in our sole discretion and without limitation, refuse, restrict access to, limit the availability of, or disable (to the extent technologically feasible) any of your Contributions or any portion thereof; (4) in our sole discretion and without limitation, notice, or liability, to remove from the Site or otherwise disable all files and content that are excessive in size or are in any way burdensome to our systems; and (5) otherwise manage the Site in a manner designed to protect our rights and property and to facilitate the proper functioning of the Site.\n\n\n\n\nPRIVACY POLICY\n\n\nWe care about data privacy and security.By using the Site, you agree to be bound by our Privacy Policy posted on the Site, which is incorporated into these Terms of Use. Please be advised the Site is hosted in __________. If you access the Site from any other region of the world with laws or other requirements governing personal data collection, use, or disclosure that differ from applicable laws in __________, then through your continued use of the Site, you are transferring your data to __________, and you agree to have your data transferred to and processed in __________. Further, we do not knowingly accept, request, or solicit information from children or knowingly market to children. Therefore, in accordance with the U.S. Childrens Online Privacy Protection Act, if we receive actual knowledge that anyone under the age of 13 has provided personal information to us without the requisite and verifiable parental consent, we will delete that information from the Site as quickly as is reasonably practical.\n\n\n\n\nTERM AND TERMINATION\n\n\nThese Terms of Use shall remain in full force and effect while you use the Site. WITHOUT LIMITING ANY OTHER PROVISION OF THESE TERMS OF USE, WE RESERVE THE RIGHT TO, IN OUR SOLE DISCRETION AND WITHOUT NOTICE OR LIABILITY, DENY ACCESS TO AND USE OF THE SITE (INCLUDING BLOCKING CERTAIN IP ADDRESSES), TO ANY PERSON FOR ANY REASON OR FOR NO REASON, INCLUDING WITHOUT LIMITATION FOR BREACH OF ANY REPRESENTATION, WARRANTY, OR COVENANT CONTAINED IN THESE TERMS OF USE OR OF ANY APPLICABLE LAW OR REGULATION. WE MAY TERMINATE YOUR USE OR PARTICIPATION IN THE SITE OR DELETE ANY CONTENT OR INFORMATION THAT YOU POSTED AT ANY TIME, WITHOUT WARNING, IN OUR SOLE DISCRETION.\n\n\nIf we terminate or suspend your account for any reason, you are prohibited from registering and creating a new account under your name, a fake or borrowed name, or the name of any third party, even if you may be acting on behalf of the third party. In addition to terminating or suspending your account, we reserve the right to take appropriate legal action, including without limitation pursuing civil, criminal, and injunctive redress.\n\n\n\n\nMODIFICATIONS AND INTERRUPTIONS\n\n\nWe reserve the right to change, modify, or remove the contents of the Site at any time or for any reason at our sole discretion without notice. However, we have no obligation to update any information on our Site. We also reserve the right to modify or discontinue all or part of the Site without notice at any time. We will not be liable to you or any third party for any modification, price change, suspension, or discontinuance of the Site. \n\n\nWe cannot guarantee the Site will be available at all times. We may experience hardware, software, or other problems or need to perform maintenance related to the Site, resulting in interruptions, delays, or errors. We reserve the right to change, revise, update, suspend, discontinue, or otherwise modify the Site at any time or for any reason without notice to you. You agree that we have no liability whatsoever for any loss, damage, or inconvenience caused by your inability to access or use the Site during any downtime or discontinuance of the Site. Nothing in these Terms of Use will be construed to obligate us to maintain and support the Site or to supply any corrections, updates, or releases in connection therewith.\n\n\n\n\nGOVERNING LAW\n\n\nThese Terms shall be governed by and defined following the laws of __________. Parkline Interactive, LLC. and yourself irrevocably consent that the courts of __________shall have exclusive jurisdiction to resolve any dispute which may arise in connection with these terms.\n\n\n\n\nDISPUTE RESOLUTION\n\n\nInformal Negotiations\n\n\nTo expedite resolution and control the cost of any dispute, controversy, or claim related to these Terms of Use (each a \"Dispute\" and collectively, the Disputes) brought by either you or us (individually, a Party and collectively, the Parties), the Parties agree to first attempt to negotiate any Dispute (except those Disputes expressly provided below) informally for at least thirty (30) days before initiating arbitration. Such informal negotiations commence upon written notice from one Party to the other Party.\n\n\nBinding Arbitration\n\n\nAny dispute arising out of or in connection with this contract, including any question regarding its existence, validity, or termination, shall be referred to and finally resolved by the International Commercial Arbitration Court under the European Arbitration Chamber (Belgium, Brussels, Avenue Louise, 146) according to the Rules of this ICAC, which, as a result of referring to it, is considered as the part of this clause. The number of arbitrators shall be __________. The seat, or legal place, of arbitration shall be __________.The language of the proceedings shall be __________. The governing law of the contract shall be the substantive law of __________.\n\n\nRestrictions\n\n\nThe Parties agree that any arbitration shall be limited to the Dispute between the Parties individually. To the full extent permitted by law, (a) no arbitration shall be joined with any other proceeding; (b) there is no right or authority for any Dispute to be arbitrated on a class-action basis or to utilize class action procedures; and (c) there is no right or authority for any Dispute to be brought in a purported representative capacity on behalf of the general public or any other persons.\n\n\nExceptions to Informal Negotiations and Arbitration\n\n\nThe Parties agree that the following Disputes are not subject to the above provisions concerning informal negotiations and binding arbitration: (a) any Disputes seeking to enforce or protect, or concerning the validity of, any of the intellectual property rights of a Party; (b) any Dispute related to, or arising from, allegations of theft, piracy, invasion of privacy, or unauthorized use; and (c) any claim for injunctive relief. If this provision is found to be illegal or unenforceable, then neither Party will elect to arbitrate any Dispute falling within that portion of this provision found to be illegal or unenforceable and such Dispute shall be decided by a court of competent jurisdiction within the courts listed for jurisdiction above, and the Parties agree to submit to the personal jurisdiction of that court.\n\n\n\n\nCORRECTIONS\n\n\nThere may be information on the Site that contains typographical errors, inaccuracies, or omissions, including descriptions, pricing, availability, and various other information. We reserve the right to correct any errors, inaccuracies, or omissions and to change or update the information on the Site at any time, without prior notice.\n\n\n\n\nDISCLAIMER\n\n\nTHE SITE IS PROVIDED ON AN AS-IS AND AS-AVAILABLE BASIS. YOU AGREE THAT YOUR USE OF THE SITE AND OUR SERVICES WILL BE AT YOUR SOLE RISK. TO THE FULLEST EXTENT PERMITTED BY LAW, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, IN CONNECTION WITH THE SITE AND YOUR USE THEREOF, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT THE ACCURACY OR COMPLETENESS OF THE SITES CONTENT OR THE CONTENT OF ANY WEBSITES LINKED TO THE SITE AND WE WILL ASSUME NO LIABILITY OR RESPONSIBILITY FOR ANY (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS, (2) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE SITE, (3) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SITE, (5) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SITE BY ANY THIRD PARTY, AND/OR (6) ANY ERRORS OR OMISSIONS IN ANY CONTENT AND MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY CONTENT POSTED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE SITE. WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE SITE, ANY HYPERLINKED WEBSITE, OR ANY WEBSITE OR MOBILE APPLICATION FEATURED IN ANY BANNER OR OTHER ADVERTISING, AND WE WILL NOT BE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND ANY THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES. AS WITH THE PURCHASE OF A PRODUCT OR SERVICE THROUGH ANY MEDIUM OR IN ANY ENVIRONMENT, YOU SHOULD USE YOUR BEST JUDGMENT AND EXERCISE CAUTION WHERE APPROPRIATE.\n\n\n\n\nLIMITATIONS OF LIABILITY\n\n\nIN NO EVENT WILL WE OR OUR DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE DAMAGES, INCLUDING LOST PROFIT, LOST REVENUE, LOSS OF DATA, OR OTHER DAMAGES ARISING FROM YOUR USE OF THE SITE, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. NOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, OUR LIABILITY TO YOU FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE FORM OF THE ACTION, WILL AT ALL TIMES BE LIMITED TO THE AMOUNT PAID, IF ANY, BY YOU TO US. CERTAIN US STATE LAWS AND INTERNATIONAL LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MAY HAVE ADDITIONAL RIGHTS.\n\n\n\n\nINDEMNIFICATION\n\n\nYou agree to defend, indemnify, and hold us harmless, including our subsidiaries, affiliates, and all of our respective officers, agents, partners, and employees, from and against any loss, damage, liability, claim, or demand, including reasonable attorneys fees and expenses, made by any third party due to or arising out of: (1) use of the Site; (2) breach of these Terms of Use; (3) any breach of your representations and warranties set forth in these Terms of Use; (4) your violation of the rights of a third party, including but not limited to intellectual property rights; or (5) any overt harmful act toward any other user of the Site with whom you connected via the Site. Notwithstanding the foregoing, we reserve the right, at your expense, to assume the exclusive defense and control of any matter for which you are required to indemnify us, and you agree to cooperate, at your expense, with our defense of such claims. We will use reasonable efforts to notify you of any such claim, action, or proceeding which is subject to this indemnification upon becoming aware of it.\n\n\n\n\nUSER DATA\n\n\nWe will maintain certain data that you transmit to the Site for the purpose of managing the performance of the Site, as well as data relating to your use of the Site. Although we perform regular routine backups of data, you are solely responsible for all data that you transmit or that relates to any activity you have undertaken using the Site. You agree that we shall have no liability to you for any loss or corruption of any such data, and you hereby waive any right of action against us arising from any such loss or corruption of such data.\n\n\n\n\nELECTRONIC COMMUNICATIONS, TRANSACTIONS, AND SIGNATURES\n\n\nVisiting the Site, sending us emails, and completing online forms constitute electronic communications. You consent to receive electronic communications, and you agree that all agreements, notices, disclosures, and other communications we provide to you electronically, via email and on the Site, satisfy any legal requirement that such communication be in writing. YOU HEREBY AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND OTHER RECORDS, AND TO ELECTRONIC DELIVERY OF NOTICES, POLICIES, AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA THE SITE. You hereby waive any rights or requirements under any statutes, regulations, rules, ordinances, or other laws in any jurisdiction which require an original signature or delivery or retention of non-electronic records, or to payments or the granting of credits by any means other than electronic means.\n\n\n\n\nCALIFORNIA USERS AND RESIDENTS\n\n\nIf any complaint with us is not satisfactorily resolved, you can contact the Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs in writing at 1625 North Market Blvd., Suite N 112, Sacramento, California 95834 or by telephone at (800) 952-5210 or (916) 445-1254.\n\n\n\n\nMISCELLANEOUS\n\n\nThese Terms of Use and any policies or operating rules posted by us on the Site or in respect to the Site constitute the entire agreement and understanding between you and us. Our failure to exercise or enforce any right or provision of these Terms of Use shall not operate as a waiver of such right or provision. These Terms of Use operate to the fullest extent permissible by law. We may assign any or all of our rights and obligations to others at any time. We shall not be responsible or liable for any loss, damage, delay, or failure to act caused by any cause beyond our reasonable control. If any provision or part of a provision of these Terms of Use is determined to be unlawful, void, or unenforceable, that provision or part of the provision is deemed severable from these Terms of Use and does not affect the validity and enforceability of any remaining provisions. There is no joint venture, partnership, employment or agency relationship created between you and us as a result of these Terms of Use or use of the Site. You agree that these Terms of Use will not be construed against us by virtue of having drafted them. You hereby waive any and all defenses you may have based on the electronic form of these Terms of Use and the lack of signing by the parties hereto to execute these Terms of Use.\n\n\n\n\nCONTACT US\n\n\nIn order to resolve a complaint regarding the Site or to receive further information regarding use of the Site, please contact us at:\n\n\nParkline Interactive, LLC.\n6133 Clarendon St\n#170360\nBoston, MA 02117\nUnited States\nPhone:(617)3315850\nkyle@parklineinteractive.com", "Space Required": "219.5 MB"}



["5 stars\n46%\n4 stars\n22%\n3 stars\n11%\n2 stars\n7%\n1 star\n14%", "Senorsenorpedro13 days ago\nAfter bugfixes: worth every penny\n\nI like this app very much, when it works. Unfortunately thats very rare. The first location loads flawlessly, but then it goes downhill. The longer I use it the more slower the app gets, after 2-3 mins its basically only loading indicators. The map also gets just plain blue after zooming in a bit.\n\nRight now this app is in a very sad state and I cannot recommend paying for it. I really hope the developers fix the issues quickly, because when it works its a really nice experience.\n\nEdit: after the update it works really nice, only one small bug: occasionally, after using the random button, the big map is bot updated and still shows the previously location, so its not possible to find out where one is at that point. Apart from that, great app would recommend it to everyone\n\nHelpful | 16", "ZygsterZJul 14 at 6:20 PM\nGood, but buggy\n\nIt's very fun to go popping all over the world. It does tend to be a little buggy though. I've only had the program about three days and it started making my elevation higher and higher with no apparent way to change the setting. I'm about 20 feet in the air now and everything is distorted. Pressing the Oculus button for a few seconds changes heading, but not elevation. That's a real bug there.\n\nHelpful | 59", "AlanBell682 days ago\nLove this app, but bug in latest update\n\nAmazing app that I have been using with my wife, dad, and sister to travel the world, even though we are over 3 thousand miles apart.\n\nJust installed Alcove, and noticed that, when trying to return to Alcove from Wander, with the new icon, it it appears to be looking for the GO version of wander into my device, and takes me to a setup page. I want quite sure what was going on at first, and clicked the button to set it up, but this now is just stuck whirling around like its busy, presumably because it is trying it install the GO version?\n\nPerhaps the code Tor return to Alcove is using the wrong internal id for the Quest version of Alcove?\n\nWould love a fix for this, as the two apps really complement each other.\n\nThanks for an otherwise great app!\n\nHelpful | 0", "TexMex22 days ago\nPretty good but needs improvement.\n\nIt's a pretty good experience. The one annoying thing is that when you go to a place/dot the teleport circle is really big and distracting. You basically have to aim up to see what is around you. Also, Some of the places you can't view despite showing up on the map. It's a pretty good app for the most part.\n\nUpdate:\nThe last update seemed to help. The big dot is gone for the most part.\nIf you can't be heard using multiplayer try a voice search. It seems to wake the microphone.\n\nHelpful | 0", "sdaniels001Jul 11 at 11:12 AM\nGreat app - walking the earth\n\nThis is a cool app that takes you all over the world. There are many places I want to see in the world but would never pay to travel to see.\n\nThe places I do want to go, I can plan ahead and get an opportunity to the best views and see the surrounding earth/scene/area.\n\nVery cool app. Pics take time to download and thats the only drawback. Sometimes waiting several minutes to get full detail on 360 degree views - but thats a small gripe. Overall great experience and family will use a lot.\n\nHelpful | 4\nDeveloper Response10 days ago\n\nHi, The blue dots on the are user uploaded locations and can be slower to load than the blue lines. Might be helpful to know when exploring!", "ZanyZarlyMay 21 at 3:56 AM\nNo Google Earth VR but still worth it!\n\nI'm a huge Google Earth VR fan, it's something that I hope one day will come to the Quest. I had originally dismissed Wander as a prospective purchase because it sounded little more than Google Street View in VR. Which I suppose it is! But don't let that put you off picking this one up.\n\nI found myself in Google Earth VR \"oohing and aaahing\" at the ability to fly around cities and countries seamlessly. I never really used it as a street view navigator, it seemed like streetview in Google Earth VR was added as an afterthought. Google Earth in hindsight is all pretty and full of \"wow's\" but didn't really make me feel like I was visiting places in person.\n\nWander is impressive in its own right, yes -- it's Street View in VR, which doesn't sound terribly impressive but it's surprisingly very enjoyable to revisit old streets, houses and parks that you haven't seen in years. The VR element puts everything into scale, it's easy to imagine being present in the streets that you are virtually walking down.\n\nTLDR: It's not Google Earth but it's a worthy edition to any Quest owners library.\n\nHelpful | 42", "GorillaSaladApr 23 at 1:29 PM\nProbably the best \"global\" VR experience\n\nThis is at its core Google StreetView, which itself is a mashup of years of on-street 360 degree images Google has taken as well as 360 VR images others have taken and submitted to Google. The result can be a bit disjointed; you can traverse images along streets in sequential order, but depending upon the quality of the user-submitted VR sites this may or may not be possible. Image quality varies, though it is typically pretty good. A good portion of the imagery is taken by 360 cameras that are mounted atop cars or held above people, so generally you feel like a ten to twelve foot tall alien viewing all of this. None of this can be changed or fixed by the developer here... they're limited to the medium they're utilizing.\nThat said, I think they've done a very admirable job in navigating what is a very complex and massive dataset. There is a learning curve to the controls, but lifting the controls in front of your face renders them with every button and stick labeled with its function. It's very easy to identify what everything does, and after an hour or so it becomes second nature.\nWhat you ultimately get out of this will be largely based on your own expectations. If you want a fully 3D, go anywhere in the world adventure, this isn't it... you're limited to the scope of StreetView. It will always be a 360 view of two dimensional images. In most densely populated areas, there's enough imagery to allow you a good degree of freedom in where you go. In less densely covered ones, you're a bit more \"on the rails\" in what you can explore.\nI'd agree with other posters that some kind of selection of ambient noises would add the immersion here, but perhaps you're better off with your own soundtrack though a set of headphones. It would be a massive lift to even tag 1% if the StreetView library with a relevant \"soundtrack\" for each area. I would like the ability to be able to zoom into individual images a bit if possible to pick out a bit more detail.\n\nHelpful | 183", "hellochas5 days ago\nGlitches appear to have been sorted\n\nI have deleted my previous negative review as the problems I mentioned were promptly addressed.\nGreat to use now.Apologies for my rather rude review,I understand the developers are doing their upmost to sort any glitches.\nRecommended.\n\nHelpful | 0\nDeveloper Response5 days ago\n\nGlad it's working better for you now! Hope you have a great time exploring and let us know if you have any other feedback! We can be reached at info@parklineinteractive.com", "Bolsen.nz13 days ago\nIncredible\n\nRevisiting places Id been and being able to change the years, what incredible technology. I noticed the recent update improved things. However, it seems to have broken things too. In New Zealand the years available range from 2010 to 2020. With the recent update, the years between 2013-2020 are missing in places they previously were available. In some of those places, there are a couple new years that werent there before. Seeing new content like this is incredible but losing a lot is not very good either. Its also strange when you start on say 2018 and 2012 is available and jump to that, then suddenly 2014 is available but if you jump to 2018, 2014 isnt there. I hope they fix these issues sometime.\n\nHelpful | 3\nDeveloper Response13 days ago\n\nHi, if you can help us pinpoint some of these locations we'll see if we can get them back! Please send us an email at info@parklineinteractive.com on how to find the right spot(s).", "TheBossA1dan20017 days ago\nGoogle Maps.. But VR!\n\nWander is the google maps port to oculus quest in my opinion. The Pros is that you can see mostly any part of the world and you can look at it with friends and search by address and all the goodies. The cons are....\n1. The interface takes some getting used to. The map can sometimes be hard to navigate, especially when trying to zoom in and out using the VERY sensitive slider on the side.\n2. The teleport feature is pretty much useless because it just moves you to the next 360 picture closest to where you teleported.\n3. The pictures can sometimes be blurry or take forever to load. This could just be my internet but usually it isnt that big of an issue.\nOverall, perfect for showing people where you have been or would like to go, or just looking at your favorite monuments or tourist spots without shelling out the money. 6/10\n\nHelpful | 2\nDeveloper Response10 days ago\n\nHi! Two quick tips, the joysticks can be used to control the map while you're pointing at it. The left controller zooms in and out and the right moves the map. Also, blue dots on the map are generally slower to load than the blue lines which (depending on your internet) typically load very quickly. Hope this helps!", "Hibooba8 days ago\nWander\n\nExcited to travel the world with this app.,and could visit old addresses of homes past owned. However, today when addresses were entered it placed me in unknown areas in the correct town but not as the address showed. Very disappointed.I am hoping that it is a minor glitch which will be corrected.\n\nHelpful | 0\nDeveloper Response6 days ago\n\nHi, we've just released an update that should restore the accuracy of search!", "joedav8Jun 14 at 1:08 PM\nSolid experience to show certain people\n\nHad this on GearVR back in the day and decided to grab for Quest to maybe use it for showing off VR to less technically inclined/older people. Pretty cool application to checkout and get a feel of places around the world. Wish they would add some content though that was more involved, like a game where you can get randomized and guess where in the world you are. There is a browser game called GeoGuessr which is exactly this, but in VR it would be pretty awesome I think.\n\nHelpful | 8", "jpgsussexJul 21 at 1:38 PM\nWas good until it stopped working.\n\nI paid for this to go on my Quest-it's not free, unlike on Go.\nI've enjoyed Wander since purchasing my Quest. I have spent many happy hours in it. The trouble is that it no longer works. I can get into it but when I do all I get now is a blank screen. The map and menu is visible. When i stated getting a problem the 360 images appeared but were distorted. I have unistalled the app and reinstalled it without success. It has nothing to do with my internet connection as other apps including the YouTube app works quickly and efficiently. I feel my Quest experience has been adversely affected by this. Not too happy. Help! Give it 5 star at the beginning but now 1 star.\n\nHelpful | 6\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix this, please let us know if you're still having trouble by emailing us at info@parklineinteractive.com", "netanel.giat.6613 days ago\nOh dear god\n\nI was so excited to buy this game and explore the 360 word but when i tried it i was shocked i couldn't go anywhere i uninstalled and reinstalled it and it still didn't worked i wasn't able to teleport anywhere please tell me what to do to fix it and i will give t stars because the idea of the game is lovley please help me!!!\nEdit: thank you! After i updated this it worked better than i expected there is a really high quality and the voice search work incredible when i bought this i thout it might be boring but it so interesting and have incredible potential i really enjoyed playing. this is the number 1 basic game that every headset user should have. The only thing that can get better is the timeline. Its sometimes comfusing and show you a slightly different position and it shows you less or more time to go back but its not really matters\n\nHelpful | 0", "gordon.macleod.96113 days ago\nGreat way of getting around!\n\nUpdate was a pain but glad to say my favourite app is up and working again. Really enjoying this app. Great to be able to go places and in different time periods too. Due to Covid-19 lockdown can't get out and about much, and sure it's not the same as being there in person, but it's great just to be able to look around. Recommended.\n\nHelpful | 1\nDeveloper Response13 days ago\n\nUnfortuantely we don't have much control over the update process. It may be worth trying to uninstall and then reinstall the application.", "richlcasper11 days ago\nGreat app, and responsive DEV team.\n\nUpdate: Very impressed by the responsiveness of the Wander DEV team. They addressed the favorites issue almost immediately. Updating my rating. 5 stars for a great app and a great team.\n\nOriginal review: Use this app a lot recently, now as of this last update, I can no longer edit/update the name of favorites I save. This makes Favorites pretty much useless as spots you want to save rarely have any description other than date. Fix this issue, and this is a 4.5 star app. This favorites issue makes it a 1 for me at the moment.\n\nHelpful | 1", "WuzdarapJul 9 at 4:48 AM\nVery good\n\nThis is a good app for our current era... I cant wait to see future iterations where it links in with video or live street view. Some of the places I wasnt able to move around as freely as I wouldve liked but again, this is the best we have for where we are currently. Also, interesting side point, this helped me get through being isolated in my room after contracting COVID-19.\n\nHelpful | 1", "kev7450A day ago\nGreat way to travel in a pandemic!\n\nI love this app. I have been able to see many places that are not currently possible, due to the coronavirus lockdowns. I wish the technology existed to glimpse more than street view, but this is the next best thing!\n\nHelpful | 0", "whtwtrstnJul 19 at 10:07 AM\nI want to know how to export my favorite\n\nI like the scenery in this app because it looks so close to the real thing. However, I have a problem with it. I have registered many points as my favorites. But when I initialized the Oculus, they were all gone. Is there any way to save them?\n\nHelpful | 0", "jason.kankiewiczJul 20 at 2:14 PM\nFrustrating virtual keyboard\n\nVisual navigation works about as well as one could expect given the low odds that clicking on a unique blue dot will cause a unique 360 photo to appear (Google's fault apparently) but the low odds that clicking on a virtual keyboard button will cause a character to appear at the cursor in the search bar is entirely the developer's fault.\nThere's no apparent rhyme or reason to which virtual button clicks will be ignored or when they'll be ignored so check the search bar after every click or you'll be clicking the backspace button a lot.\n\nHelpful | 0\nDeveloper Response14 days ago\n\nHi, we've released an update that improves the keyboard! Thanks for the feedback, we made the change after reading this review!", "jess.d.hJul 19 at 1:52 AM\nWander can't connect to server\n\nI recently purchased Wander and it doesn't work. I kept getting error message that it can't connect to the server. It can't load anything or take me anywhere. I tried to uninstall and reinstall several times, and reboot the headset, but still couldn't make it work. I already checked and the headset connected to wifi with excellent signal. Please fix it!\n\nHelpful | 3\nDeveloper Response14 days ago\n\nHi, we've just released an update that should fix this, please let me know if the updated version is still not working for you by emailing us at info@parklineinteractive.com, thanks!", "dizzylimesJun 30 at 4:52 AM\nIts a 360 Google Street View\n\nBasic Google Street View. Not really helpful as on mobile or PC where you just take a quick look at street and surrounding places to have an idea where you might have to get.\nGood for first-try VR Headset people like friends or family that had never had a VR experience to make an idea of what this technology is capable of.\nFrom time to time i experienced dizziness due to image distortions, weird 360 rendering once in a while.\n\nHelpful | 1", "aaronhryJun 21 at 3:32 PM\nEnjoyable, but lacks MP features.\n\nGiving it a 3 star review as I bought this for the sole purpose of traveling at home during the pandemic. We have two Quests at home connected to the same FB account but unfortunately found out that the multiplayer of Wander doesnt work in a local co-op setting. Would give this a 5 star review if this was implemented.\n\nHelpful | 3", "Sydney_RobsterJul 26 at 8:59 PM\nAwesome - Google Street View VR\n\nIt does exactly what it states. I've used it to check out past personal locations, wonders of the world, or future holiday locations. The 'Random' location button is also fun. I've never had any bugs or probs. The interface is simple and I like that it's got voice search function too. It's not an app I use often but I would recommend it.\n\nHelpful | 0", "mrbrush123 days ago\nTurn left/right not working.\n\nNot able to turn left or right since the Google update. Any solutions to this? Would be 5 stars otherwise.\n\nHelpful | 0", "carbongirlJul 4 at 9:07 AM\nBest vacation ever!\n\nSheltering at home?...need a new view?...take a virtual vacation! Travel to your home town, or visit New Orleans, or your the Great Wall of China, or go into an Egyptian temple, or walk the streets of London. You can see and almost feel anywhere you want to go in the whole world. Completely immersive. Love love love it.\nOnly wish there was video 360. Would love to sit by a favorite beach for a while.\n\nHelpful | 4", "mhebeJul 25 at 4:28 AM\nMore transparenty would be good.\n\nIf the App (Server) works its a great experience. Show a status of your Server if there is a problem and it would be perfect.\n\nHelpful | 3\nDeveloper ResponseJul 22 at 5:19 AM\n\nOur apologies, unfortunately there was a server-side issue yesterday. It has been fixed and the app should now work for you, please let us know by emailing us at info@parklineinteractive.com if you're still having trouble. We're working on a backup to prevent this sort of thing from happening again.", "iliketurtles597Jul 21 at 1:28 PM\nFantastic\n\nThe ability to travel to any continent and see sights that you could never travel to altogether is breathtaking. To travel to the top of a mountain top and see the great sight of being elevated thousands of feet in the air while in the comfort of your living room is something I wish that all people will do. 5/5 stars for this experience\n\nHelpful | 0", "thefridlunds9 days ago\nStunning\n\nWorks really well after update. Great app.\n\nHelpful | 0", "Fletcher2020Jun 18 at 8:28 AM\nPotential to be great\n\nOkay so it's basically Google Street view and I have wondered (on pun intended) if this would be any different to Google Street view via the browser but it is slightly better.\n\nGood: if your a geek like me and like looking at random places you know, your mates houses, an old holiday destinations then this is cool. The user interface is cool too, the search function has the potential to be great. You can now favorite places so that you can easily revisit them. Voice search (which is very poor) for ease of use and clear images.\n\nBad: outdated images. The contolls are not very responsive. You find yourself tapping the teleport/move forward button over and over and nothing happens. Please fix this. Even worse is the voice search, it doesn't understand what you say very well and always comes out with some random places, annoying.\n\nIf they fixed the two things I just mentioned, but most of all the poor response when you try to teleport it would be awesome.\n\nOverall: is it worth 8? YES. Fun game that can be played sitting down. Multi-player function is decent. Plus you can check places out before you pay to actually visit them. Just sort out the occasional lag and add some more cool features please\n\nHelpful | 4\nDeveloper Response10 days ago\n\nHi. Teleportation has been improved in the latest update, hopefully you find it to be an improvement. Voice search is powered by Google speech-to-text services and admittedly it works better for some people than others. Let us know if you're still having trouble with teleportation in the updated version! We can be reached at info@parklineinteractive.com", "redsky1999Jul 22 at 5:17 AM\n\nThe app is back up working again, there was an issue with a Google server over the weekend. This is the greatest app ever it's essentially Google Street on VR. You can travel all over the world in 360 photos. For people who want to see the world from their couch this app is for you.\n\nHelpful | 0", "JMarchner20 days ago\nGreat use of VR\n\nWander allows you to view Google imagery in VR. the controls are a bit wonky but once you get the hang of it you can explore anywhere in the world. If you have VR and haven't tried this yet you are missing out.\n\nHelpful | 0", "DylPickle197Jul 4 at 5:16 PM\n\nIts not bad its just not for me. Its google maps but with vr which isnt bad but when you cant use smooth locomotion it takes you out of the experience. Can any show me how to get a refund?\n\nHelpful | 0", "ElbarkeroVR23 days ago\nJust like GeoGuesser\n\nIts basically google earth in VR.. The random location feature is great fun because you can guess where you are from what is around you. I will use this nearly everyday just for the fun.\n\nHelpful | 0", "SmithJ09Jun 26 at 5:43 AM\nWanderful!!!\n\nI have two children with autism that I homeschool. Travel is impossible! I have incorporated Wander into their lessons and they absolutely love it!!\n\nYou can create a folder of favorite places, so I can pre plan locations or even meet up with them so we can explore together. There are so many museums, castles, cathedrals, and hidden places to explore. My personal favorites are the British museum and Westminster, we spent hours there just walking room to room, seeing the exhibits and tombs.\n\nIt has become my favorite teaching tool. Pictures in history books dont even compare to visiting these places in VR. Wander opened up a million opportunities for people with disabilities who would never have a chance to see places like this. Much love to the creators for opening up a whole new world for us!\n\nHelpful | 2", "victormanuel710 days ago\nDO NOT BUY\n\nApp is currently not working. I recommend when it is working but at the time it is not working DO NOT PURCHASE in current state. Will update when app is working.\n\nHelpful | 0\nDeveloper Response8 days ago\n\nHi Victor, we've just released an update that should help. If you're still having trouble, please email us at info@parklineinteractive.com and let us know what is or isn't working so that we can fix it!", "EC4Mar 16 at 4:16 PM\nSuper cool not user friendly\n\nCan be glitchy and tough to use at times with very unintuitive controls, but what it delivers is so very much worth the headache. Such an amazing thing to be able to have on This device. I love showing grandparents and family, places theyve always wanted to see.\nIt should borderline be a crime to own a quest and not this app!\n\nHelpful | 91", "Nitr8VRJul 14 at 12:34 PM\nEnjoyable\n\nA little buggy here and there, but generally it is enjoyable. A few minutes can turn into an hour exploring. Resolution is a bit poor but I imagine that is hardware related (Quest) and not software.\n\nHelpful | 1", "FireWolf9Jul 5 at 9:38 PM\nWander - your gateway to the world\n\nWander was one of the games that made me want to buy Oculus. I love being able to revisit places Ive been and and places I still want to visit. In this time of quarantine, its been invaluable to see the world without leaving my home. Its a way to share experiences with family and friends. Ive discovered that it can also be a tool to decide whether a place is worthy of visiting in person. I think it would be great for tour agents!\n\nIts a must buy!\n\nThank you for giving me a passport to the world!\n\nHelpful | 0", "BronzeBluefishMar 29 at 11:52 AM\nGood, needs improvement\n\nI really enjoy this as an interface to Google Street View. It's really cool to try the random feature AMD see what backwoods you end up in. It can really feel like you're there, except when you load a user-uploaded image (the dots on the map). Then it's a very long wait, sometimes several minutes, and ruins the experience. Maybe that is only in control by Google and not the fault of the app. It could use an intro video to show you how to use it.\n\nHelpful | 21", "ForwardBlueMay 10 at 7:53 PM\nLove this app but same problems\n\nYes it is glitchy and a lacks some smoothness but really enjoy going everywhere and seeing some amazing things! The multiplayer function is fun. My buddy and I hope on and hit the random button and try to guess where we landed by scrolling around and just looking at each unique place before we look at the map to find out. BUT you gotta set up the multiplayer right or random people will join your room - although my buddy had a nice convo with someone in England for a few minutes.\n\nHelpful | 3", "JeaneenabeanApr 17 at 10:21 PM\nLove Hate relationship\n\nLove love love the multiplayer function.\n\nHate the fact that there is not a where am I? button and that there isnt a back button so you could return to the last place youd been.\n\nLove the fact that you can make something friends only, but would also love to see a mode that was invite only - weve been taking our parents on trips down Memory Lane and it is very unsettling when a random person jumps in.\n\nAlso, if there was a way to allow someone to move using the joystick instead of having to repeatedly press the arrows, that would be incredible.\n\nMaybe allow people to post photos of the area? Limit to 360 photos if needed.\n\nHelpful | 17\nDeveloper Response14 days ago\n\nHi, there is a back button in the main row of buttons, and you can also use the left controller to move forward and backward. Multiplayer sessions can be restricted to friends by pressing the 'friends only' button when creating a room. If you're having trouble please email us at info@parklineinteractive.com and we will help you out!", "tommyjw6206May 24 at 9:28 AM\nReally good but...\n\nOnly negative is, as with all real world visuals I've experienced with the oculus, the perspective is off. I feel like I'm a mosquito flying around. Physical displacement between the eyes needs to be increased to bring the perspective closer to real life.\n\nHelpful | 2", "CaylubNothingJun 10 at 9:08 AM\nWorked great for 2 days\n\nThis game worked great for 2 days and now its just a black screen. I can see the home room and the maps but everything else is black. It doesnt work. I have reinstalled reset my WiFi etc. its been 3 days and the game is broken. Dont waste your money or time. I found reddit forums all about how this game quits working all the way back to 2018. Super upset and a waste of time!\n\nHelpful | 4\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "Alexandro_iiiJul 15 at 12:43 PM\nThe app keeps crashing\n\nI recently bought the app and it was perfect by the second time I wanted to use it didnt work. Can someone please advise me on what to do\n\nHelpful | 1\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix this, please let us know if the updated version isn't working by emailing us at info@parklineinteractive.com, thanks!", "EndigiMay 25 at 5:02 PM\nGreat App\n\nThis is an app I will keep going back to and introducing to friends and family it is amazing. Being able to explore the world in this fashion is satisfying. I randomly decided to join a multiplayer room and was taken on a tour through Germany and then the world by a randomly friendly person. This app brings a smile to my face and will for years to come.\n\nHelpful | 4", "phDaveMay 3 at 12:47 AM\nPassable only because of 360 VR\n\nVery glitchy and very unintuitive controls. You could be pursuing the menu button for ages and it never shows up, then suddenly it would appear but it's behind you?!? Also, you cannot favourite your position. I've found my childhood home, but cannot favourite it so I can go find it easily again the next time I log in!?! Typing addresses is really difficult and long winded!\n\nI mean Wander uses Google Maps for it's data etc.... Google Maps certainly have APIs that allows you to place pins etc... You just can't do a whole lot of things in this app.\n\nApart from the 360 immersion, you might as well sick with Google Maps on a PC or tablet. And don't be fooled, this is NOT 3D, everything is a flat image from Google Maps, just down in your VR Headset.\n\nHelpful | 18\nDeveloper Response14 days ago\n\nHi, we've released an update that should improve the experience for you. You can also favorite items by clicking on the description under the row of buttons in the menu!", "Arrel17 days ago\nLove Wander!!!\n\nI spend hours exploring on Wander. One of my favorite purchases.\n\nHelpful | 0", "janet.woodvilleJun 28 at 6:29 PM\nWonder Is so Awesome !\n\nIve been so many places. It makes me feel more free. Going all over without leaving home. It also takes the stress away from being locked down. My latest place was The Eiffel tower in Paris. It took my breath away. Paris is so beautiful.\n\nHelpful | 1", "drjedijayJun 15 at 4:18 PM\nOh the places you'll go...\n\nThis is a great app that allows you to travel all over the world. The good is that you can visit a TON of places and even go inside certain museums and attractions. The bad is that it's not a free world, roam where you want experience. You're limited to what's captured by Google Earth. However, all in all it is a great way to get out and explore, with or without COVID-19 related restrictions!\n\nHelpful | 0", "tjmortJun 21 at 7:32 PM\nIts Google maps on steroids!!!!!\n\nI love how I can see areas of the world I might never see. But when Im in the app and I stand on a street in Rome, stand on our favourite beach in Portugal or stand in the lobby of our go to resort in Cuba. I can see it in a way not possible with normal photos.\n\nHelpful | 0", "DeepMellowJun 18 at 9:25 PM\nIts google street view should be free\n\nIf you want to pay for a worse experience than the free google street view than this is for you. Wonky controls and just lame. Dont waste a refund on it. Read the refund policy you can get stuck owning bad games even if you played them five minutes on the first day.\n\nHelpful | 2", "duncanhustleJul 26 at 8:53 PM\nCoolest thing ever.\n\nYou can go anywhere in the world, like you are actually there. Enough said...\n\nHelpful | 0", "FoxxMulder10 days ago\nVery bad aplication, lot of bugs\n\nNot updated since release one year ago \n\nHelpful | 0\nDeveloper Response8 days ago\n\nHi, we've released several updates recently, including one just a few minutes ago that may help if you were previously unable to load the application. Please let us know if you're still having trouble with the app by emailing us at info@parklineinteractive.com. We'd love to fix any bugs that you're encountering.", "coolestdaniel123Jun 9 at 2:13 PM\nHorrible\n\nWaste of money. I cant do anything. No map shows up. When I click on a location, it thinks for a while than nothing happens. Microphone doesnt work on this app. I have traveled to only one place so far and nothing works since then.\n\nHelpful | 3\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "dapperdonJun 3 at 9:34 AM\nShould be Free....Buggy\n\nIn my opinion and experience this is little more than Google Map 360. With poor overlapping image loading....sluggish movement from point to point. Didn't bother to ask for a refund in hope that they will work on improving the app at some point in the future.\n\nHelpful | 3\nDeveloper Response14 days ago\n\nHi, we've released an update that should improve the experience, please let us know if the updated version is still giving you trouble by emailing us at info@parklineinteractive.com.", "Eh-JayMar 29 at 5:39 AM\nPerfect, no, but incredible!\n\nWander is by far a must have app for Quest. It does use google earth yes so you have to wait for it to load, yes it can be a bit laggy but who cares! You can stand atop the Eiffel Tower and look at Paris or go to Christ the Redeemer in Brazil and gaze out over the city, or go check out your own neighborhood and you can do it all with a group of friends who have Quests. Its incredible, and the detail of the important areas of the world are rich and full. Dont think about buying it, just buy it! While Im still in my 30s I think this would be incredible for the elderly, especially those shut in to be able to see the world, what a magnificent way to do so. This is our go to app for showing others what the VR system can do. I find myself wandering the world sometimes for hours looking at places I may never get to. Also we use this to check out many hotels and vacation areas, you can really see if the area is nice and if youd like to visit. I cant believe the rating isnt 5 star all the way. This app is pretty great!\n\nHelpful | 23", "PytheusJul 30 at 11:17 AM\nNot at all impressed.\n\nJust google street view poorly wrapped in 360 degrees. Not at all the experience I was hoping for.\n\nHelpful | 1", "dadofgeorgeJul 27 at 2:29 PM\nDisappointing\n\nAll that I could get on this was a bunch of country roads that got boring REALLY quickly.\n\nHelpful | 0\nDeveloper ResponseJul 28 at 6:50 PM\n\nHi, if you press the B button to open the menu and select the map (far left icon) you can move through almost every street in most major cities throughout the world. You can also search for specific addresses or try exploring curated collections of interesting places.", "steveortegaMay 18 at 9:54 PM\nJust like being there\n\nLooking at places that I grew up seems as if I'm there again. I really enjoy the clarity and the roll back years. I have a wish for this app. I would be cool if somehow the creators could find as many very old photos from the 70s and beyond at least to the 20s and load them and align them with todays photos. Black and white to color. If possible, that would be great\n\nHelpful | 2", "jayinatlantaMay 21 at 11:30 PM\nLike it but...\n\nFor the most part it's a high quality virtual experience to be able to use Google Earth in static 360VR.\nHowever, I really think it should have a) automatic motion to the next set of street view photos based on the active arrow b) ability to switch to high quality aerial view of the scene (not just mini map) so we can fly above destinations also. Thanks and I look forward to the next experiences from this developer.\n\nHelpful | 1", "FOOD-STAMP-PHONEMay 17 at 9:26 AM\nWOW\n\nthe fact that I can go back to my old neighborhood where I grew up, makes this app so important to me.\n\nI live in a rural town in Florida, and at any given time I can go back to the park bench in Baltimore Maryland and relive the day my dad told me that he got full custody of me.\n\nFor several years Ive been taking pictures of the places Ive been throughout my life, so I can have some kind of documentation of all my memories. This is my new tool. I can go to all of these places and be there anytime I want, however long I want, and I love it.\n\nHelpful | 2", "qingbo.liu.96Jun 7 at 4:58 PM\nnot perfect yet but amazing\n\nIt is not perfect yet but it is a great start. You can wander around in many places but not everywhere yet for example China. I guess maybe it is because their firewall. But it works well in most countries I assume. Tried UK and France and it is really amazing.\n\nHelpful | 0", "Corky1961May 16 at 7:45 PM\nGodsend during the lockdown \n\nI brought myself a Bar table and chair to go with using the Wander app. Why you may ask? By putting places I've been on holiday in the past, in its favourites section. (You do that by clicking the info address below the menu, you'll see a black star turn gold after you click on it)\n\nThen go through my favourites, while having a beer, play some ambient sounds like wave sounds for a beach or crowd sounds for a pub. Having no garden and living in a 2nd floor, this makes a great solution for no holidays for me this year.\n\nHelpful | 2", "WeezyWoofApr 28 at 6:57 AM\nOverall Fantastic\n\nThis app is an absolute joy. It allows you to go to familiar and unfamiliar places alike. I just love how you're basically in your own teleporter going wherever you want In the world. Now that being said, it can be a bit buggy at times but besides that it's a very unique and fun tool to explore, learn, or just have fun.\n\nHelpful | 0", "ryleeblueMay 20 at 12:16 PM\nGreat!\n\nDoes exactly what you think it would do and more! Hoping they expand on the features. It's kind of annoyingly slow sometimes though maybe that's the Quest or Google and not the app.\n\nHelpful | 0", "Y06URTJun 4 at 5:58 AM\nGood idea, but too buggy to actually use\n\nIf you just want to pop to random spots on Earth, then this app is ok, because that's what it does. But if you want to cruise around Google Earth in VR this app will disappoint you greatly.\n\nIt seems to let you control for a few minutes, but then places you in random places around Europe, instantly, randomly and without pressing any buttons.\n\nIt also is constantly giving speech recognition errors when I had no desire to use my voice. Even when you try to use the voice controls, they are broken also.\n\nI tried to show my kids a specific country, kept popping back to Europe. Then we decided maybe we can just look at our house, couldn't do that either.\n\nGreat idea, broken app\n\nHelpful | 1\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "h_r_ngt_n_famJul 12 at 4:20 AM\nClumsy google maps for $10\n\nWorst $10 I ever spent\n\nHelpful | 2", "humanauroraApr 20 at 6:17 PM\nGlitchy, not user friendly\n\nI had a lot of glitches happening as I was trying to explore and all of the menus are annoying to use. I do appreciate that it has voice commands, but it is hard to navigate places and I often couldnt teleport where I wanted to be.\n\nHelpful | 4", "kernelpanic3Mar 29 at 8:36 AM\nExcellent fun & learning in one Package\n\nThis app is one of the best that weve ever purchased. We have Quests after upgrading from GOs. We loaned our GOs out to two of our close friends during the COVID-19 outbreak. Both parties were so impressed they want their own sets and cant wait to get them. Together we all took turns leading each other to places weve been, where we grew up, awesome places we discovered, and places we want to see.\nFrom 14 to 72-year-olds it was a blast, a learning experience, a geographical enlightenment, and a strengthening of frienship.\nThank you Parkline Interactive, Oculus, Facebook, and Google for collaborating this into existence.\n\nHelpful | 10", "jvescheMar 26 at 7:10 AM\nNot as expected\n\nThis was a joke. Not good at all. Glitches way to much and takes to long to move around. I tried to get a refund back and they said I was past my half hour time limit for a refund. It took to long for me to try to get the game to catch up to even try it! Not worth even $1.00. So disappointed\n\nHelpful | 22", "spiraloidMay 24 at 1:05 AM\nawesome co-op streetview but...\n\nwe dug it, but it overheats the quests after about 15 minutes. needs better heat management.\n\nHelpful | 1", "pandejaponApr 25 at 8:31 PM\nBonkers that there are any bad reviews\n\nRead the previous reviews and thought it sounded not so good but saw it on a sale and it seems one of the few if not only ways to access Google Street View on the Quest, at least untethered, so I tried it. I know I said this about Beat Saber too, but this little $10 app makes the Quest worth every penny of it's $400 cost. Using it is an honestly breathtaking experience. I have no idea why people are dissatisfied or even finding room to complain! The design is brilliant: it's full featured but the interface is not intrusive. Everything can disappear leaving you just surrounded by another place. Even being able to walk down a street with left joystick is brilliant. Bravo designers!I even started using nature sound apps on my phone in the background and it plays with your head it's such a present feeling in the many endless places around the world. Miss the beach? I was just there: first in Portugal then a favorite beach on the Carolina Coast. It really feels like you're teleporting around the world on a whim. Even the map's design, intuitive, easy and being able to ring finger trigger drag it right to where you'd normally hold a map in your hands like when walking in a new city to determine where you are and where you want to go. It really just feels so believable. Granted I love traveling and an missing it, but this app is a dream come true. I was just standing on a bridge in Tasmania yesterday learning something about a place I've never been.\n\nHelpful | 2", "Astro_1289Apr 10 at 2:41 PM\nExcellent interface, worth the money\n\nDoes exactly as promised; explore Streetview in VR. Works very well, interface is intuitive and responsive. Streetview images load lightning fast, surround images take a while longer. I like the explanatory text appearing around the controllers when examining them at close distance. The random-option is the best!\n\nHelpful | 1", "Freaker013Apr 27 at 2:16 AM\nIt's a'ight.....I guess\n\nWas cool at first....but then there are certain streets I can't go down that I could on Google Street view......so I don't know why that is......plus the maps are outdated.....went to the town I grew up in and there's a dollar general and a taco bell there......been there for over a year.....not in this this they're not. They use Google Street view data but they don't update it in the game the way google does. Kinda lost that thrill for me.\n\nHelpful | 1", "Nightflame456Jul 15 at 9:58 AM\nEat your Heart out, Google Earth\n\nYou know what? This app is awesome! Its basically Google Earth, but fully immersive. Its like Im really there!\n\nOnly one negative, though. The only way to search for a specific location is to use voice commands, and those get misheard sometimes. Not a lot, but enough to be an error.\n\nHowever, that is not a negative reflecting on the actual content of the app, just how to reach certain points to view the content. Great app with brilliance written all over it!\n\nHelpful | 0", "augvandogMay 4 at 7:49 PM\nGreat App! Most used app on my Oculus!\n\nIve really enjoyed this app. Sure, it is google maps in an app, but once you get the interface down good, (which doesnt take long), you can explore the world so easily. I googled Most amazing places to visit and checked them out. Visit tons of museums and unique locations. Get acclimated to a vacation destination, before you even go on vacation! An absolute must have for the Oculus!\n\nHelpful | 1", "MisterE2097Apr 25 at 5:29 PM\nGood but speech recognition terrible\n\nFun to use (as many others have said its just street map in vr )but be warned the speech recognition is terrible and you will have to type in destinations. Its does incorporate the timeline feature which is really good.\n\nFun and just worth the cost but 2 stars off because of this.\n\nHelpful | 0", "Playar1Apr 23 at 4:14 PM\nDont hesitate like i did.\n\nI have had my eye on this for almost a year! but thought I would rather have google maps for free. But as of the lockdown I thought I would feel like im getting out so I bought it and WOW! I only wanted to put it on for 5 minutes, but I found myself looking around all the old places that i have memories of for 3 hours thanks to my back up battety. Its such a high definition experience it almost feels like you are there (looks real as its not a computer graphic being generated) You can also roll back the years and see how all these places have changed. My whole family all had a go and was in awe. Pop some tunes on and sit on a swivel bar stool chair for the optimum viewing experience so you can spin round to view the whole world to add to the realism. I love it!\n\nHelpful | 2", "cruickfamApr 10 at 3:10 PM\n\nLoved being able to travel to place in the world I have been to but not likely to get back and places I will likely never get to. During the lockdown It means I dont have to stay home.\n\nTravel to dangerous places and see up close. Love it.\n\nHelpful | 1", "desertrose007May 19 at 5:55 PM\nFriends without Facebook account\n\nno lockdown here. love it! love the 360 explorations too. Really love that I can connect with friends and others without a facebook account. I wish more games will allow that. Thank you!!\n\nHelpful | 1", "Jake_GJul 16 at 4:35 PM\nGood but needs improvements\n\nIt can be glitchy and often has blurry spots. I got it on sale for 7.50 after tax and I cant complain. It needs some improvement to the images and updating but overall its worth the money. It can also be cool to show others when you hang out.\n\nHelpful | 0", "Zenra456Apr 19 at 2:37 AM\nGoogle Street View\n\nIt's just the content of Google Street View with a nice user interface. Some collections of places like houses and most viewed places.\n\nI don't know what I should rate here - Google? Did you used the framework + Google? From this point of view it's disappointing.\n\nOn the other hand, you can use this app like a quicklink to Google Street View so it's a nice VR Experience.\n\nHelpful | 2", "Helly_BellyJun 14 at 9:35 AM\nCool experience\n\nVery cool to see all the different places in VR.\n\nHelpful | 0", "moraband10 days ago\nGreat App to Explore the World\n\nOnce 'in' I wandered the world for straight 6 hours, visited several favorite childhood places which brought on pure nostalgia. If you ever longing to revisit any places of your past, this app is perfect. I highly recommend.\n\nHelpful | 0", "Jori.8618 hours ago\nGreat WHEN it works..\n\nBought it yesterday.. it worked great for a bit but now it wont let me look at new places through the microphone\n\nHelpful | 0", "KC_RykerJun 29 at 9:50 PM\nPretty Cool But Perspective is Off\n\nIt is a great start but I look forward to further development. The thing I don't like about it is that your view is from 10 feet off the ground. It would be awesome if one day the view would look like you are walking rather than hovering above the ground.\n\nI also found that some of the images were zoomed in so that things and people looked abnormally large.\n\nHelpful | 0", "puddlediver1May 26 at 8:58 PM\nGreat\n\nWhat an excellent app. I can revisit places Ive been to and explore places I havent yet seen. Thank you devs\n\nHelpful | 0", "CharblargerJul 26 at 2:33 PM\nOne of my Favorite Apps\n\nI was hesitant to buy this thinking it was just going to be a bunch of blurry street view images but this is seriously a high quality viewer. Love the time travel ability and the ease of jumping between street view points. My biggest gripe with Google Earth VR was how clunky it was to tour insides of buildings and this app nails it.\n\nHelpful | 0", "amante63Apr 21 at 8:58 AM\nBoring :-( !\n\nThis is like being in Google street view, boring and big waste of money :-( ! Can't wander anywhere the Google car didn't travel except for a few special sites they placed the camera on a walker.\n\nHelpful | 4", "Appy72Apr 15 at 7:41 AM\nAmazing\n\nIf like me you like street view your going to love this I can spend hours roaming the streets looking at all the places Im planning on visiting all in amazing vr\nWorth every penny and a must if you own a oculus\n\nHelpful | 2", "Acobian2Mar 26 at 3:17 PM\nNot worth $10\n\nThe maps are glitchy the controls arent all there and the interface is just not user friendly. Its the same google maps but at your face. This should be brought down to $5 or better $2 . Fun to look at your house for some time periods but the random button just loves open roads and no where cross street. Really bad experience.\n\nHelpful | 3", "JackVaderMar 28 at 4:21 PM\nWrong address\n\nI tried to go to my grandparents house and it took me to a warehouse\n\nHelpful | 4", "KenondpMay 9 at 3:25 AM\nJust needs a zoom feature\n\nGreat price, Great Interface (Love it) & Features, please add a x1/x2 zoom function as this is my goto app to relax & kickback with. Highly Recommend.\n\nHelpful | 1", "AndulackaMar 3 at 10:48 PM\nExcellent\n\nI actually prefer this to Google Earth. While the flying feature on Google Earth is undoubtedly cool, I find its dashboard less convenient to manage, especially when you want to get inside buildings. Maybe there's a way to do that easily on Google Earth too, but in Wander all you need to do is write the name of the attraction that you want to visit, hit the name that comes up in search, and you're in.\nFor me, its best feature is just that, the ability to explore museums, galleries and historical buildings in VR, and without the crowds.\nIf Google one day gets round to photographing indoor spaces from eye level rather than from the elevated position that's also used for outdoors, then it'll be perfect.\nBut even now, it's a brilliant way to discover new places and reminisce the places you've visited or lived in, and see the sights of the world.\nIt does appear to be missing some areas that are on Google Earth, hopefully those will be added eventually. Still more than well worth its modest price.\n\nHelpful | 5", "KasmanB52Jul 14 at 12:45 PM\nI love the App - if it worked\n\nI purchased it last night and loved it. Easy to use interface, pick the years (if available from Google) of 360 views, point and click - super App. It has already booked hours of usage. Thank for making this App, especially during these COVID 19 days. I don't feel as cooped up. Cheers!\n\nHelpful | 0", "maxvectorApr 20 at 6:07 AM\nArmchair travel at its finest\n\nIt does what the label says and as such is one of my favourite apps at the moment. Armchair travel at its finest. I think it would be nice to have a list of popular destinations by category.\n\nHow about a white noise soundtrack? Forest, beach, city sounds? That will make it so much more immersive. And maybe use the soundtrack previous wanderers have selected as the default one when you arrive at a new location?\n\nHelpful | 4", "HardcoreHarlowJan 21 at 12:22 PM\nMissing a lot\n\nIts ok. Dont be expecting Google Earth, or even current Google street views, but it does have a lot to look at. I went in hoping to check out some places in Germany and was really disappointed that it seems a lot of Germany just doesnt have anything available. Baumholder, in particular, has two spots. Womp, womp. But whatever. Its neat for what it is. Oh, yeah, you are floating about 10 feet off the ground. I once looked below myself and saw a dudes balding head. Was LOLstartling. I hope the devs continue to fill in whats missing.\n\nHelpful | 16", "mscheckoutqueenApr 24 at 4:11 AM\nMany problems...\n\nAnd they dont seem to be working on them. Unfortunately I couldnt get my money back because this is not worth it. Google maps works much better on our phones... And its free.\n\nHelpful | 2\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "floke_mcwudApr 28 at 9:20 AM\nBasically Google Earth for VR\n\nIt is what it is. Not bad but not really fun or user friendly either. Would raise to 4 stars if the UI were better.\n\nHelpful | 1", "TheRealAndrewDApr 1 at 10:41 AM\nNeeds interface improvements\n\nThe interface is not intuitive as it should be. Worth owning, hope that it is updated soon\n\nHelpful | 4", "BaileyBunchApr 15 at 6:23 PM\nVisit old neighborhoods\n\nThis has been great during Covid lockdown. My husband lived in Australia for two years over twenty years ago and he was able to show us his old neighborhoods. The kids really liked to see how famous places actually look up close.\n\nHelpful | 0", "sputukDec 15 at 10:16 AM\nJust needs a geoguessr mode\n\nI have spent way more hours than I care to remember just exploring the world in Google Street view on the PC, and later playing Geo guessr when it came along, but doing both in VR is a whole new level.\n\nIt seems not all the world of street view is accessible through this app with some big chunks of the world not including more than a few isolated spots, but more than enough of the world is available to be hours of fun.\n\nI play the game of guessing where in the world I am with myself anyhow even without there being an actual scored version in the game, but hoping they add this in eventually.\n\nHelpful | 93", "MadmartagonJan 5 at 8:54 AM\nAwesome, but not what i expected..\n\nWhile i still enjoy this app alot, and no doubt will use it to scout out future travel destinations... this is not Google earth VR although it does use Google streetview, and a huge collection of user submitted 360photos of special destinations. I miss flying over places a 1000' above ground, spotting something interesting looking and swooping down for closer investigation. But if you know where you want to look, the map feature is great.. just point, click.. you're there. Definitely worth the price and download.\n\nHelpful | 21", "JJ_REE_kidApr 2 at 5:28 PM\nNot good\n\nI got this thinking it would be fun and a cool way to look around the world but no. If you want to pay $10 for google maps vr with some cool features then this is perfect for you. I even tried to get a refund and they declined it.\n\nHelpful | 4\nDeveloper Response14 days ago\n\nHi, unfortunately we have no control over the refund process. If you email us at info@parklineinteractive.com we will see what we can do.", "MeakaMay 4 at 12:34 PM\nNot great. Do not recommend.\n\nOk but not great. Resolution is not very good. Movement is horrible. Exploration is barely possible. I would not recommend buying this.\n\nHelpful | 0", "meduzoJan 21 at 3:48 PM\nHopefully gets a hand tracking mode\n\nThis app delivers as promised, it is a very good Google Street View VR. However one of my complaints about this is the button that brings you to a random place, this is an app that is best used with family and friends and people that are not very VR savvy generally speaking. So while random bottom it's an interesting part of the experience for better suited players it can be quite distracting for newcomers.\n\nSomething that happened often also was that while dragging the map people wear position somewhere else they didn't want to be maybe the nearest Street View place or just a random place nearby.\n\nThis app is a must for people that want to relieve memories from places you've visited before or just want to mess around wherever in the world you want.\n\nMaybe it is not Google Earth VR but it's close enough.\n\nHelpful | 7", "BloomieBloom1Apr 21 at 3:07 PM\nThere is no bigger buzz...\n\n...on Oculus Quest than asking someone their first ever home address, entering the details and then putting the headset on them for the first time.\n\nHelpful | 0", "AdventurousBunnyApr 20 at 9:49 AM\nNot worth it\n\nThis is just a street view from google map.... not what I thought it would be.\n\nHelpful | 3", "diego400May 5 at 3:09 PM\nGoogle maps but costs\n\nThe app is not what I expected and I can't get a refound.\n\nHelpful | 2", "City_ExplorerApr 22 at 8:28 PM\nThe Best App in Oculus Quest\n\nThis is my favorite app in the Quest. It is the real world without leaving home. Perfect for trip planning.\n\nHelpful | 0", "Dr_Jekyll-Apr 23 at 12:43 PM\nJust perfect !\n\nThis app is awesome! You can go everywhere you want when you want!\n\nHelpful | 0", "MitchernyJun 13 at 10:03 AM\nStunning!\n\nWander is just what I expected. Like google maps, BUT, seeing/navigating streets and landmarks 360 degrees up close feels like you are actually there. I sometimes even forget where I am, so intense is the pleasure of a virtual escape. Providing your Internet can handle fast data transfer, the scenery will be loading almost instantly.\n\nHelpful | 0", "frankgoortaniApr 5 at 6:15 PM\nNeed more google earth features\n\nReally love the idea but it feels incomplete. I would pay more for google earth features.\n\nHelpful | 1", "Vc1234Apr 24 at 10:12 PM\nNever worked\n\nIt literally never worked. Dont waste your money\n\nHelpful | 2\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "Adlerauge1Apr 17 at 7:53 AM\nGreat and beautiful world\n\nIts almost a must have on VR great and inspirend for dreams travels\n\nHelpful | 0", "Avalon90May 5 at 5:19 PM\nWander in Oculus Quest\n\nIts an wonderful way to see the world in VR. However, Ill like to take a picture of what I see, similar to the National Geographic app in the Oculus. I hope you review my suggestion. Thank you\n\nHelpful | 1", "ValddorApr 19 at 12:43 PM\nBoring\n\nNot worth purchasing. Whats worse is I cant even get a refund so stuck with something I regret buying.\n\nHelpful | 1", "kkuzma1982Feb 7 at 3:46 AM\nThis is not simply street view in VR\n\nI was really pleasantly surprised how good interface changes the overall experience of this application. You have everything under hands, random place button, nearby interesting places, multiplayer wandering. Really recommend it especially with this price.\n\nHelpful | 3", "antrynApr 17 at 10:04 PM\nGreat!\n\nIts a must have!\n\nHelpful | 1", "mjaramjaJun 21 at 8:20 PM\nArmchair traveling\n\nNew to VR but a fun favorite app so far!\n\nHelpful | 0", "xxxrasmanxxxFeb 20 at 3:33 PM\nTitle Does not Work as advertised\n\nI bought this with a simple expectation that it would at best work when installed. Having had this for a few weeks now I can say that only once has it actually worked which was great. I am using an Oculus Quest. For all the other times I was presented with the main screen and then going to map, home nearby ect resulted in a blank screen. Does this app for the quest need to be tethered as I have tried it both Wireless and connected via USB. I cannot recall how it was connected when it did work. Has anyone else had issues or worked out how to run this and could help please.\n\nHelpful | 9\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "FalkuniasJul 15 at 5:29 PM\nSehr gut ... // Very good ...\n\nGoogle Streetview, but better.\n\nHelpful | 0", "SMODomiteApr 23 at 3:56 AM\nA little glitchy, but very cool\n\nWander is a great way to put yourself in some amazing places around the world you may not normally get to go, or go places you have been and remember memories. Tried wander last night and got my wife to wear the Quest and travel around for over an hour when before she hadn't put the headset on for more than a minute, that alone was well worth the purchase to me.\n\nCons: a little glitchy, some things only work sometimes like the voice search, and choosing random it would be nice if it told you where you were now\n\nHelpful | 0", "Roxtar73Jul 15 at 7:27 PM\nGoogle earth street view lite\n\nWhile I have had a great time revisiting my childhood homes or seeing some of the ancient wonders of the world. I cant help but wish I just had google earth proper not this crippled version that contains a small slice of it. Like I said not a bad app but get it on sale.\n\nHelpful | 8", "yates8809Apr 25 at 5:22 PM\nCurious George\n\nI really enjoy playing the app. but when I put in an address SOMETIMES it doesn't take me right to the address I ask or put in. I wish it did!!Also when Iam at a destination I can't go to another street with the arrow move button..But other than that it's a very fun enjoyable app.\n\nHelpful | 0", "BlooddrawnJul 15 at 11:10 PM\nSo far so good\n\nI am enjoying it so far\n\nHelpful | 0", "xiaobujianApr 18 at 6:21 AM\nI don't know how to use it\n\nThe worst user expirence\n\nHelpful | 1", "brian.langhoffApr 25 at 1:41 AM\nVery nice\n\nNice experience, voice recognition not always great. Would love if they could combine it with Wikipedia or something like that and put info on things you pass on the way. For example, if you are in front of the Eiffel tower, press the 'i' for information about this.\n\nHelpful | 0", "gaza2492May 16 at 2:37 AM\nWasn't sure about buying this\n\nSo wasn't sure about buying this but was well pleased that i did have even seen my own house from years ago in here so if you like 360 pictures real pictures not fake made up pictures but real ones your goin to love this\nAnd also another helpful tool that's here is you can speak to it telling it where you want to go to so there's no having to type out and no spelling needed\nA MUST BUY!!!!!!!\n\nHelpful | 0", "rfmanJan 18 at 7:45 PM\nNice app\n\nVR brings Google Street View to life in an impressive way. Instead of having to click, click, click to move, it would be nice to have a way to move smoothly and more easily. But how nice to see places and feel almost like being there!\n\nHelpful | 1", "queeg505Oct 20 at 3:12 PM\nGood but a few bugs\n\nThis is a good app, essentially just google street view. However its very buggy, voice search doesnt always seem to work and is very hit and miss. It often hangs up as well either when trying a voice search or even just trying to move down a street.\n\nThe time line feature is useful although it would be good to know when an image was precisely taken. You can walk down a street with trees and one minute its summer and the next winter with no leaves at all which is a bit weird, so they have stitched together images from various time periods.\n\nSo in summary it does need some polishing and bug fixing.\n\nHelpful | 43", "BrianQuesterFeb 6 at 4:03 PM\nPoor searc capability\n\nIts fun to wander at random, but if you want to visit a particular place, you need decent search functionality. Sadly, the voice search in this app is abysmal. The only word it correctly recognised was zoo. This NEEDS a virtual keyboard to be really useful. Hopefully in a future update?\n\nHelpful | 29", "XxARNTxXJan 4 at 1:54 PM\nDont wander off...\n\nFirst, theres no wandering. Its Google Earth with street view with the limitations that brings. Nothing bad, its just....what it is. Cant understand the hype about this app. Its a 360 image viewer with chuppy images and buggy voice reconition. Have fun.\n\nHelpful | 3", "baeblaydFeb 14 at 6:05 AM\nKind of \"Meh\"\n\nIt's just google Earth streetview in VR. You can select a random location, save locations, and look them up. I wish there was a way to fly around like there is on similar Rift S games. This kind of feels like a rip off. Not really worth $10 unless you plan on using it a lot.\n\nHelpful | 0", "shawnersDec 30 at 11:03 AM\nGood App - Different View of Google Map\n\nIf you come in understanding this is google maps shown in VR, then your expectations will be met. Not sure why others have complained about voice control as I didnt experience any issues with it. Some of the rural Wisconsin areas I searched didnt have much coverage, but again, not the apps fault its based on the available map data.\n\nHelpful | 0", "quackmeatJan 2 at 2:50 PM\nI Wander....\n\nI Wander... why they were allowed to put this clearly unfinished app on the site when there is no search available.\nThe voice search just doesn't work so if your not interested in looking at the few pre loaded images you are there you are out of luck come back Google earth all is forgiven\n\nHelpful | 9", "keebzDec 5 at 9:24 PM\nI just don't get the hype\n\nIt's Google Street view with limited multiplayer. It's a fine app, but people are making it out to be something more. It's good, but I don't want people to think it's like google earth, it isn't. It's one of those apps that just exists and does exactly what it should.\n\nHelpful | 4", "philg7onr123Jan 8 at 6:54 AM\nA useful tool\n\nHave used this app when booking my travels to the USA, gave me the chance to have a good look around San Francisco and surrounding area.\nA good way to look at street view, nothing startling, but very useful.\n\nHelpful | 1", "bamsnakeJan 15 at 9:24 PM\nLike being anywhere\n\nWhen I originally saw its just google street view I was nonplussed. But then i tried it and was impressed. The sense of presence is so much more than looking at a computer screen. And there or so many thousands of locations that you can go almost anywhere in the world. (Antarctica, anyone?). The interface and program is very lovingly implemented. Highly recommend.\n\nHelpful | 3", "Khalill_KrushersJan 20 at 11:58 AM\nVacation from your living room\n\nI stumbled across this experience and am so glad I took a chance on it. It took me a little bit to figure out how to maneuver and get where I want to be and see more of it, but after that it was amazing. Basically you need to know that use the search button to type in the location you want to teleport to, once there, use the map to find nearby blue dots to see more and get closer. Yes it is \"street views\" from google maps, but so much more in depth. It also includes some views you don't get from \"the street\". You'll really feel like you are there. It's a great big world and this may be the only way to see all of it (well most of it anyways as some areas haven't been \"google mapped\" yet.)\n\nHelpful | 0", "DSpuds87Jan 2 at 5:47 PM\nAlmost there...\n\nThis program is sorely lacking in many parts of the world BUT heavily delivers in others. I walked through Zurich, Buenos Aires, San Diego, Samut Sakhon, etc. Amazing app well worth the price and is expanding and improving. I would highly reccomend.\n\nHelpful | 1", "steve13870Dec 27 at 1:40 AM\nGo anywhere\n\nLove it ,just think of all the places you would like to visit and then visit places from your childhood etc ,then press the random button ,great value and good clear three sixty images .highly reccomended ,needs info for the places you visit but thats a small thing in an otherwise great app\n\nHelpful | 1", "Mark-BlissJan 26 at 8:37 AM\nGoogle earth remake\n\nWander is no more than Google earth through the headset. I looked my home up on Google earth and I looked it up on wander and its the exact same time. Exact same picture. All theyve done is taking what Google earth filmed and put it in the VR its nothing new\n\nHelpful | 5", "Topdog66Jan 14 at 5:05 PM\n\nWander lets you visit location everywhere and see place that you have been. It takes you back to the moment when you were there! My wife also likes to get on wander to look at place that she would like to go. Time flies by and you get lost in another time! My wife has a friend that had lived in Scotland for a couple years and her friend was our house and was able to show my wife where she lived and let her into another part of her life. I cannot say enough about this app. So far it is awesome!\n\nHelpful | 2", "stormtrooper89Feb 15 at 4:45 PM\nGood around the world looker!\n\nMy dad purchased it for me since I like geography and like learning places and it awesome! I like how you can go basically everywhere in the world! I love it!\n\nHelpful | 1", "RayJayTraderMar 11 at 7:59 AM\nWanderer\n\nDoes not work!\n\nHelpful | 2\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "Juan-117Apr 25 at 6:27 PM\nBrings Back Amazing Memories!!!\n\nI really enjoy this app because it allows me to revisit places that I traveled to during my study abroad year in Germany! It is so cool to be able to relive my memories by visiting certain places that are special to me! It is unfortunate that some people dont enjoy this app but every app will have those people. I highly recommend this app to my fellow world travelers or curious minds who have an itching for travel! VR is amazing but nothing beats being there in person. So maybe let those places that you visit in Wander encourage you to visit them in real life once this pandemic is over.\n\nHelpful | 0", "AgentHVApr 22 at 9:00 AM\nNice app\n\nNice app. I mean its a Google Earth Interface, theres not much to criticize that isnt Google Earths fault. Maybe you could be teleported to a cool place if you search for a city (at least if its a big city). Its a bit weird if you chose Barcelona and get teleported into a generic fitness studio.\n\nHelpful | 0", "JadeShivaJan 30 at 3:53 PM\nTry hitting random\n\nI originally posted a 1 star review, but now it's working. Working, this is a fantastic app. Seeing street view in 360 degrees is just cool. Hitting random and trying to figure out where I am is a blast.\n\nHelpful | 1", "iWufeiMay 3 at 12:40 AM\nAmazing app for Quest\n\nThis is truly one of the most amazing apps for VR and quest. You don't get the chance to move around due to only 360 degree pictures, but its amazing anyway. Hoping for maybe also support of 360 videos from google!\n\nHelpful | 0", "Tyr03May 30 at 12:10 AM\nA bit disappointed\n\nThis is just Google Street View within your Vr headset, no interaction at all\n\nHelpful | 1", "s-ynthJan 2 at 11:14 AM\nNice way to visit places\n\nThe application does what it says and its a very nice way to visit and discover places. Im giving it 4 stars because its a little bit buggy. Worths the price.\n\nHelpful | 0", "DRDILLISNov 12 at 12:02 PM\nAwesome, but..\n\nWonderful application. However with the new quest update we really need a no tracking required mode so we can use this app in the dark. There is no good reason this application should require 6DOF tracking, its really just a Google Street view wrapper for the Quest.\n\nHelpful | 9", "torvangerJan 12 at 2:25 AM\nBetter than expected\n\nI really like this app and the quality of the 360 images are better then expected. I'm using the app to re-visit places I've been to and it's working flawlessly. Some locations haven't been mapped but that's up to Google to fix.\n\nThanks for a good VR experience!\n\nHelpful | 0", "DrKotulakNov 17 at 4:45 AM\nGoogle maps 360\n\n5/5. This is essentially google maps 360. Im giving it a 5 star rating because I believe it perfectly functions as just that. Some people may not fancy paying out for something like 360 maps but I will say that I have actually had a lot of fun exploring, more than I ever had in google maps. I found it cool to just end click a point anywhere in the world and next thing you know you feel almost like a ghost, sent to a snap shot in time. I explored a lot of Africa and I found the towns quite vibrant and interesting and as ignorant as it probably sounds, I do feel like I got a glimpse into the world of people I would never get to meet.\n\nHelpful | 24", "ZekeBrancoNov 28 at 3:06 AM\nyes.\n\nI like that the app has a random teleport feature as I can teleport then try to guess where I am and this app is also really good to see famous buildings in places like Machu Picchu or the pyramids. The only downside is that it is kind of hard to teleport sometimes if your walking along somewhere you might get stuck because you have to teleport to a super specific spot to start moving again so please make teleporting less buggy.\n\nHelpful | 1", "AmberAmber12Feb 2 at 12:41 PM\nAround the world in 8 minutes\n\nInteresting I guess in bursts. Lots of same old same old locations if you dont have somewhere specific in mind. The wow factor wanders pretty fast. \n\nHelpful | 0", "NinjaXMJan 14 at 10:02 AM\nGot to visit where I grew up\n\nThat alone is worth every buck I paid. Yeah its not 3D but like seriously? Just being in places I havent been to in 10 years has relit something in me. Im happy and Im thankful for the existence of this.\n\nHelpful | 0", "aliendave51Feb 14 at 4:04 PM\nStick with google earth\n\n7.99 for this is a joke can do the same on google earth google street\nI should of asked for refund but to late now\n\nHelpful | 1", "tychoMar 22 at 5:22 PM\nIt's nice but with some flaws\n\nIt's ok for what it is. But has some annoying things.\n\nFirst of all the views are not 3D. This isn't the developer's fault because it uses Google Street view but it takes some of the magic away.\n\nSecondly when you pop up the UI it pops up where you last used it. This may be behind you so you think it doesn't work. It should just pop up in front of your face if you're turned.\n\nFinally I didn't find the UI very user friendly.\n\nBut it does what it does, it's not too bad.\n\nHelpful | 0", "dennychrissyDec 27 at 7:08 PM\nI want a refund\n\nHow can I get my money back? This is literally google earth. Cool idea but to have paid for it Im kinda upset.\n\nHelpful | 9", "CobaltChickenMar 21 at 11:24 AM\nI miss Google Earth on Quest.\n\nSomebody really needs to port Google Earth VR for this platform. Viewing Google Streetview in VR is impressive, but this interface is not the nicest, with the dashboard cluttering up the view. It's not easy to pick out a particular street on the map. Requires too accurate a point.\n\nHelpful | 0", "joeyvitale12Mar 29 at 12:08 PM\nBest money I've ever spent\n\nThis is the greatest app on the quest by far. I visited all my past homes and was about to cry from nostalgia. If you're thinking about buying this game, do it. I visited Japan and just stood there in shock as I looked at mt fuji. Load times really aren't an issue if you have a decent connection.\n\nHelpful | 0", "AutumnManApr 17 at 8:50 PM\nTIME TRAVELLING IS PRETTY AWESOME\n\nYou will love this..You can visit anyplace in the world!!!!Possible to shift between different years..Revisit places you want to see again..Brings Back alot of Great Memories\n\nHelpful | 0", "christopher.w.ottOct 4 at 9:12 AM\nGetting a black screen? Read on...\n\nI love this app! Yes, it's basically Google street view, but the VR makes it come to life like it never could looking at a flat screen. I get lost in this app until the battery dies, it's that cool. Originally got it for my Oculus Go, and now that I've upgraded to the Quest it showed up in the Oculus store as a free app.\n\nUnfortunately one of the updates from a couple months ago broke the app for me. I don't have trouble connecting with anything else, just this app. I sent a couple emails to the developer, but didn't get any response. Reading through other reviews, it seems that the problem was related in some way to using a dual band router (2.4GHz and 5GHz). I have a different SSID for the two bands, and it worked perfectly before that update. Setting my phone as a 5GHz hotspot and connecting to that worked perfectly.\n\nAnyway, I was able to solve it permanently by setting up a guest account in my router using the 5GHz radio only. So now my Oculus Go and Quest both connect to that guest account and this app is working once again. Hopefully the developer will address this in the future since I've seen that others have the same problem.\n\nHelpful | 9", "negrila.catalinOct 12 at 3:01 AM\nNot that great and kind of glitchy\n\nAfter reading some reviews I finally decided to give this app a try. Unfortunately I have entered with high expectations and found out that this app is average, with a lot of problems, but with great possibility for growth.\nFrom the 5 to 10 minutes I spend in I found out that the app was not loading as fast as I would like(and it's not my internet connection, trust me). The movement is not that great, I mean you could rotate everything by dragging not turn by turn with 35 degrees increments.\nI didn't mind that the pictures was from a high point; you can actually see the surrounding not the blurred people.\n\nAll and all 3 stars is quite a lot from me on this app.\n\nPS: Oculus store should put all apps for a trial. That way you can try things before you buy it.\n\nHelpful | 10", "RayCarissimiDec 6 at 4:51 PM\nMy most played \"game\" on the Quest\n\nAbsolutely amazing. A must have for any human, period. People get so caught up in their little bubble that they forget how big the world is. This really puts things in perspective. Some glitches but once you get used to them it's fine. Please update and fix them though!!\n\nHelpful | 5", "mattphotoJan 4 at 11:06 PM\nVoice commands never work\n\nEither fix it or take it out.\n\nHelpful | 2", "Alexbuba26121975May 12 at 4:43 AM\nNot so good (((\n\nRather boring. Its like a google map but VR\n\nHelpful | 0", "ta00015Dec 20 at 1:10 AM\n\nit's too silence during this experiences ,need some background music\n\nHelpful | 2", "Marvelous.MikeDec 29 at 3:11 PM\nVery relaxing\n\nGoogle earth with strangers is so cool we take each other for tours around town very interesting and immersing meeting people and exploring I need a longer straw for my cocktail\n\nHelpful | 0", "BertHalfpintNov 24 at 10:20 AM\nGive it a go , it will reward you plenty\n\nDisclaimer . I am writing my review after having the app from its launch on the Quest. The Submit button was not available on my tablet until recent update. So I am catching up.\n\nWander is much more than just Google Maps because the scale and 360 proximity to locations is simply jaw-dropping. I still have \"Oh my\" and \"Crikey\" moments when exploring. Vistas and details are full size and you spend ages just gawping at the clarity and up-close minutiae of buildings, places and nature at its most awesome.\n\nWe will never travel everywhere and this does give an insight into the wonders of the world in a really well designed immersive interface. Awe and wonder is there at a click of a trigger.\n\nGet your virtual ruck sack packed ,your hiking boots on and seek out those truly unique places.\n\nEnjoy!\n\nHelpful | 5", "MissionReneJan 17 at 10:49 PM\nNot bad\n\nNeeds improvement\n\nHelpful | 0", "BloomieBloom1Dec 24 at 10:20 PM\nThere is no bigger buzz...\n\n...on Oculus Quest than asking someone their first ever home address, entering the details and then putting the headset on them for the first time.\n\nHelpful | 4", "TiFinVROct 22 at 10:02 AM\nThe most important VR application\n\nThis is for me the most important VR application, as it allows me to navigate anywhere in the real world. It is the best way to explore the Street View database and visit all places that have been photographed in street view. Street view navigation its even better than in Google Earth VR, as it allows you to navigate continously in space through the 360 photos, while in Google Earth VR the street view photos are accesible only one at a time by bringing the controller close to your face and navigation can be performed only outside of streetview. Thank you Developer for this excellent app!!!\n\nHelpful | 6", "george.lovitzDec 31 at 9:46 AM\nOk for price but some things dont work\n\nI like that you can change years and such but the voice option never seems to work.\n\nHelpful | 0", "Vsawhney23Mar 28 at 8:19 AM\nVoice Recognition Fails\n\nThe voice recognition often fails for no reason\n\nHelpful | 0", "CarraraGalsJan 3 at 10:27 AM\nNot bad\n\nIts like google maps but your virtually there at the image\n\nHelpful | 0", "JeffRiftingJan 1 at 2:53 PM\nAmazing must explore !\n\nI like doing random and guessing which place I am in. We stream it to the phone and play a game with a few friends of it.\n\nHelpful | 0", "willoughby4989Mar 28 at 9:59 AM\nJust ok !\n\nFound it freezes sometimes and will not move. Had to keep coming out of it.\n\nIf it worked properly would be good !\n\nHelpful | 0", "SidiliumApr 21 at 7:39 AM\nJust a flat plane in vr\n\nThe images are not stereoscopic, just some flat planes in vr, kind of disappointing\n\nHelpful | 1", "willz290Dec 28 at 11:45 PM\nemm\n\nit doesn't let me go where I want to go and that 6 that I spent on it was not worth it don't buy this\n\nHelpful | 2", "Zef_GedeOct 10 at 10:09 PM\nGreat for scoping out new spots\n\nI don't use it very often. But in the time that I have used it has done well and paid for itself. Very useful for me to check out locations that I need to travel to. Also if I find a new restaurant in town I've never been to I can look it up and find parking beforehand. Very convenient app. Just not a daily user for me. I can't imagine anyone would have it as a daily user. But it is very useful tool. I highly recommend it to anyone that travels or likes to see a location before going.\n\nI drove across country twice and I truly wish I had this then. Disentomb a traveling across country amazing.\n\nHelpful | 6", "mirnawellaNov 8 at 4:09 PM\nI am disappointed\n\nI dont know why they dont let us to write the place instead of the voice search And the recognition is failed all the time please please add keyboard\n\nHelpful | 23", "shaun.walmsley1Nov 27 at 5:44 PM\nGreat app!\n\nOne of my favourites , also one of my 1st paid apps i bought on the occulus quest, awsomne, transports you to almost anywhere in the world you like, awsomne,love it, 5 stars *****\n\nHelpful | 2", "ZooZooUwUMar 29 at 12:08 PM\nIt was okay\n\nI enjoyed it for like about an hour and then I kind of lost interest.\n\nHelpful | 0", "flbldirishNov 7 at 5:56 AM\nAmazing\n\nThis app is very similar to the google earth app for the oculus rift. Its amazing what we can do with technology. I spent probably a solid amount of time exploring Walt Disney World, I went there as a kid and the nostalgia of reliving those memories by walking around Epcot was an incredible feeling. I also visited a few countries that I always wanted to see as well. Overall I would recommend this app. I would recommend sitting for this experience if you are not a seasoned VR user\n\nHelpful | 5", "Drake_NobleNov 25 at 5:46 AM\nConvenient travel\n\nMy mother can't travel because of her medication. Thanks to this app she can kinda travel the world. I do hope the library updates and there's more interactable items but as is she loves this app for her meditation and when she wants to go see something nice\n\nHelpful | 2", "ray.bradshaw1Jan 3 at 4:07 PM\n\nBrilliant app go anywhere in the world in vr love it\n\nHelpful | 0", "dingofoxvrfoxDec 11 at 4:44 AM\nDont bother\n\nIts basically google maps in vr mainly so they can rip you off on the software price stay away its a scam app and shouldnt be installed by anyone\n\nHelpful | 7", "Abc123xzvndrDec 13 at 12:57 PM\nGood not great\n\nCant explore all places around the world. A bit limited for certain locations\n\nHelpful | 0", "CjjohnDec 19 at 4:19 AM\nLove it!\n\nIt is Google earth in VR form. I use Google earth all the time and I find this to be an awesome way to view it!\n\nHelpful | 0", "JJ_B3Oct 7 at 5:11 AM\nGood but needs to work with tracking off\n\nIt's great, has loads of features like voice search, saving places, putting yourself in a random place and being able to go through the different photographs of each place taken through the years if available. And all for such a low price. The only issue I have is that it is only 3DOF. This wouldn't be a problem if that meant it works with tracking off, but it doesn't. This is all I need to make it five stars.\n\nHelpful | 2", "LetsGoCollinDec 27 at 10:59 AM\nBasically Google maps in VR.\n\nAble to get all this content for free. slightly interesting because of what VR adds.\n\nHelpful | 0", "VladimirMBOct 7 at 5:47 AM\nNice App but\n\nI like this app but I have a super Idea that team Wander need do real.. option for export the view of a place to the Desktop App. Then you can use Desktop app importing the place that you like. It happens to me because I stay some vacation time in Sheraton Hotel in So Conrado in Brazil, when I use Wander and enter to a room of this Hotel and I want work with my laptop (like I did sometimes) because so comfortable room.\n\nHelpful | 1", "oysterassassinJan 1 at 8:07 AM\nClunky\n\nClunky. Didnt like it. If i paid for it im sorry i did\n\nHelpful | 0", "JipsomSmamsDec 19 at 2:16 AM\nFloating 6 feet off ground\n\nLooks like it might be interesting, but I'm always floating off the ground no matter what I do. Don't know why, but it's broken for me.\n\nHelpful | 1", "ChiChiLoveDec 25 at 6:22 PM\nThis game didnt load for me\n\nIt looks great, but doesnt work\n\nHelpful | 2\nDeveloper Response14 days ago\n\nHi, we've released an update that should fix any issues you've been having. Please let us know if the updated version is still not working properly for you by emailing us at info@parklineinteractive.com, thanks!", "billy.rockstar56Dec 10 at 2:21 PM\nWander\n\nLove this one can go almost any where , see the world like never before and never leave the couch fantastic !\n\nHelpful | 0", "JacktheSwagDec 26 at 10:41 AM\nOk cool\n\nCheaper google maps be\n\nHelpful | 0", "rob-b127Sep 6, 2019 at 3:59 AM\nshame it doesn't work\n\nso this is basically google street view in VR.. which would be great IF it were functioning correctly.. i get to move down a street about 3 times then is just wont move any more.. i have to wait for AGES then it plonks me in the middle of one of its \"tours\" Colosseum etc.. then i have to go back to where i was then the same thing happens.. OR i have to restart the app a total PITA !\n\nclearly theres some sort of server issue.. i have ZERO network issues with any other apps or devices in my house so its NOT my WIFI connection...a decent app poorly implemented..i give it 2 stars until its fixed.\n\ni checked on reddit quest subreddit some other quest users have had the same issue.\n\nHelpful | 12", "alex324324Nov 22 at 6:48 PM\nterrible\n\nwas very upset about this app. has no point. just go on google maps. wish i could get a refund for this not worth any money.\n\nHelpful | 3", "supermaksDec 8 at 8:23 PM\nGreat app\n\nThanks to this app anybody can visit any place in the world at any time!\n\nHelpful | 0", "homerperisOct 19 at 10:26 AM\nSave your money\n\nI bought it like 1 month ago and i have only play for 20 min! Its just google maps in vr , dont waste your money Pointless.....\n\nHelpful | 8", "Ash.FarangOct 13 at 2:18 PM\nA jorney awaits you!\n\nOne of the best apps in the store so far and also one of the cheapest. This should be the first app everybody buys. From your sofa you'll depart on an AMAZING journey to The Great Pyramid in Egypt through Ha Long Bay in Vietnam and the green hills of Guilin in China. You'll visit the over 2000 years old tomb of the First Emperor and the Giant Buddha of Leshan build during the Tang Dynasty. This is the only app with nearly endless content which is constantly updated. Enjoy the journey!\n\nHelpful | 6", "denise3237Oct 5 at 3:55 PM\nLove it\n\nMy husband and I really enjoy Wander. Its fun to see places that weve been to in the past, as well as travel to places we are going to visit. Its a great way to check out the neighborhoods of hotels and apartments, as well. Finally, it is cool to visit places we probably wont ever see in person.\n\nHelpful | 3", "mike.k.kohnkeJun 16, 2019 at 7:06 PM\nIt's Google Street View in 360\n\nI already knew that the source images are still-shots, but since some others didn't , I thought I'd mention it up front. So just to clarify, yes, the images ARE static, and NOT animated.\n\nIf you've used Google Street View, then you've already used this app, just in 2D. That's literally what this is - all of the images are from Google Maps. The difference is that you're immersed in the center of the location instead of looking at it from one angle at a time. It's cool to be able to look around just by turning your head instead of dragging with a mouse. You can also just use the joystick on the controller to look around. It has the same features as Google Maps including user-submitted pics from popular locations.\n\nThe one drawback is that everything is viewed from about 12 feet in the air. If you've seen a Google Map car, you'll know that the cameras are on a pole on the roof of the vehicle, so it's not shot at street-level. While you don't really notice this on a computer screen, in a VR setting, it seems like you're floating about 12 feet above the ground. You look down and see the tops of people's heads. Instead of feeling like you're walking down the street, you're eye-level with the 2nd floor of the buildings, looking down on the roofs of cars. Of course nothing can be done about this; it's just an unfortunate result of the source material. Pretend you're riding in the top level of a double-decker bus, if that helps.\n\nThe only difference between this and uaing Google Street View is 360 immersion (again, from 12 feet off the ground). If that is what you're wanting and not expecting anything more, you'll enjoy this app. If you want live video or interactivity, don't buy this.\n\nHelpful | 235", "John-De-RienzoOct 19 at 5:05 AM\nPersonally I love it!\n\nSeverly underated, this is super cool, yes you can go online and look at google maps, but there is no comparison to travelling around the world with the headset on. So much potential going forward and absolutely great as it is. Love it.\n\nHelpful | 0", "Mathias.CordinaSep 10, 2019 at 1:01 PM\nEssential (should be included)\n\nDefinitely a VR essential. Great app to show non VR enthusiasts, e.g. family and friends. I wish Google had released an official Street View VR app for the quest, but Wander is as good a replacement as you could hope for.\n\nHelpful | 5", "daddyshark4Sep 15, 2019 at 1:07 PM\nWander\n\nThis is my go to app when I'm exhausted playing physical games like Ninja Legends and Beat Saber. Just to be able to pop in, anywhere in the world with a cool 360 view. I've gotten lost in this app for hours just exploring cool stuff around the globe. I do wish there was a camera button, however. It would be neat to have a photo album in the game to look back on cool stuff I found. But bookmarking sites is almost as good. Great app! Worth every penny.\n\nHelpful | 5", "robbieloseeAug 24, 2019 at 6:55 PM\nTravel the world\n\nIts just google street view, but seeing it this way makes it feel like youre there. I like to teleport to random places and wander around trying to gather clues to figure out where in the world I am. Then I check the map and see how far off I was.\n\nHelpful | 6", "DactaurMay 22, 2019 at 12:17 PM\nBrilliant app but teething problems\n\nHad this on the Go and enjoyed many hours exploring with my friends. Got the Quest yesterday and this was my first app to download. Works great on its own, but in multiplayer, between two Quests, the audio when you talk is very muffled and quiet, even with the audio turned up on max. There is no audio at all between cross platform multiplayer between the Go and a Quest. Really looking forward to these issues being fixed so we can get back to the Random game in multiplayer ;). Other than the above this should be your first purchase when you but the Quest. To me the street views look sharper through the Quest, over the Go. Will come back and give five stars once the audio issues are resolved :).\n\nHelpful | 183", "zander.strachan.88Sep 12, 2019 at 5:34 AM\nBest app\n\nThis app is amazing go in it ever chance I get could wander round for ages, only lately the app has been freezing or at least not letting me move on it , it works fine soon as I start it then stops after a little while , my WiFi seems fine and everything else on my quest so hopefully it will sort its self out or I will be gutted \n\nHelpful | 4", "daddyphatstaxMay 22, 2019 at 11:10 AM\nUpcoming Honeymoon\n\nMy fianc and I have been planning our honeymoon for the past four months. When quest came out yesterday I had her put on the headset and go to the hotels that we have been considering staying at on the Amalfi coast of Italy. After spending 10 minutes inside she took off the headset and changed her mind about which hotel we would stay in based on what she saw. This device and this app are beyond awesome and I cant wait to see where else well go.\n\nHelpful | 614", "amr.m.kandilSep 13, 2019 at 6:47 AM\nIt's just Google Street view\n\nIt's mainly Google Street view, that doesn't meant it's bad, it's just not a unique experience. It has VR controls, enough is nice, but don't expect an immersive experience. It's recommended if you're planning a trip it like to lay back at your home and see some landmarks.\n\nHelpful | 0", "growingup.withdadAug 21, 2019 at 4:32 PM\ndissapointing\n\nim so frustrated with this... i have been eyeing up this purchase for a couple of days now and i finally bought it.. i had such high hopes and im left angry and cheated... i feel this is google maps and nothing more i request a full refund i am mortified.\n\nHelpful | 9", "zack.slotkowskiNov 1 at 10:55 PM\nAwesome\n\nI love looking back at my old house!\n\nHelpful | 2", "gemini1976Oct 6 at 5:33 PM\nNot bad\n\nCan only go down street that google car went down and sometime picure is not focused but good other than that\n\nHelpful | 0", "TPHSVRSep 18, 2019 at 10:00 PM\nAwesome\n\nPretty awesome app. One request please. I have 6 quest headsets I use in the classroom under the same account. Is it possible to allow the room multiplayer to work without using 6 accounts and buying the app 6 times?\n\nHelpful | 3", "kidwithacomputerAug 15, 2019 at 4:20 AM\n\nThis is a really fun way to explore google street view and definitely worth the purchase. It would be an easy 5 stars if there were a way to smoothly drag to look left and right instead of skipping incrementally with the joystick.\n\nHelpful | 1", "jim.harris.5070276Sep 29, 2019 at 2:43 PM\nFrustrated\n\nI think I should be able to move around in the app. I can turn right, but not move forward. Can I go into Zlizzie Borden home? Is this just a collection of photos? Frustrating.\n\nHelpful | 0", "roman.ramos.7127Jul 7, 2019 at 6:27 AM\nMy Wife Cried for half an hour \n\nSo I wanted my wife to try the Oculus and since shes not a gamer a thought that Wander would be a good way to show her VR... well, she hasnt visit her hometown in a few years so I took her to the street she grow up at, exactly in front of her house... she was just quiet for a few minutes looking around in silence until she removed the headset and I noted she was in tears and couldnt stop crying for a while... shes not the too emotional type but this experience really took her to the actual place and was able to relieve good memories in just a few seconds .... this is definitely worth the investment ! Now we are using it to plan about possible places to visit in the future ! Highly recommended !\n\nHelpful | 11", "MegaFlopsSep 17, 2019 at 9:12 AM\nExploring the world from my living room\n\nWorks great. Havent looked at all the options yet, but revisited places where I have been a long time ago and it has been so much fun! For me, it has already been worth every penny.\n\nHelpful | 0", "CoachNinSep 22, 2019 at 9:18 AM\nNot very good\n\nThe app has issues with filling the screen (parts remain pixalized), it is frustrating to use. The images are all still images. Not the best app to show the power of VR. I was very disappointed and underwhelmed.\n\nHelpful | 0", "toltalchaosSep 4, 2019 at 5:20 PM\nCool... But Google Earth VR is free...\n\nThis is the perfect game to capture what I think of the quest. It costs alot and hardly meets the bare minimum, plenty of bugs and to boot Google Earth VR is free... If only oculus had an app to let you stream from your PC baked in! Now there's an app I'd pay for.\n\nHelpful | 1", "orcatekJul 17, 2019 at 1:55 PM\nNot bad, have some wishes\n\nFirst off, voice search is great. I use it for local business names. I like using the map for nearby things. I wish as others have stated it was a standing height view and not the higher, I understand why as Google Street view is primary source. I would love to go into buildings where it exists. I used to be one of the original people contracted with Google who did the interior tours that link to street view. It would be a lot of fun. Some museums etc are part of this as well as tons of private businesses. So adding interiors seems like it would be fairly easy. Odd bug I found, went to my house and there was no history. Moved two clicks down road using navigate and history was available, and then I navigated back and history was shown. Repeatable.\n\nHelpful | 2", "jjam3774Sep 26, 2019 at 11:02 PM\nGreat app\n\nWalk around my hometown and was amazed at how much had changed. This is a very useful app.\n\nHelpful | 2", "psbAug 19, 2019 at 7:21 AM\nFun,\n\ndefinitely a buy, but its shortcoming is that it is based on monoscopic 360 photography. So no substitute for a true Google Earth experience...\n\nHelpful | 1", "mrmike77469Oct 9 at 3:41 PM\nRefund\n\nHow do I request a refund\n\nHelpful | 2", "Donbomb95Aug 29, 2019 at 12:43 PM\nWtf\n\nThis game made me sick to my stomach and made the 7 wonders of the world look like a flaming barrel of garbage. Feels like Im looking through Google cardboard but $22 more.\n\nHelpful | 3", "wgdSep 19, 2019 at 10:23 AM\n\nOther than changing the perspective the app doesn't offer much more than google maps. Perhaps adding interactive tours would improve the experience.\n\nHelpful | 1", "iceyiceybabySep 7, 2019 at 9:33 PM\nQuite good\n\nStreet view on steroids 8)\n\nHelpful | 1", "lgram3May 27, 2019 at 10:55 AM\nIncredible VR\n\nI don't know how anyone could be disappointed in this app. I was a US Army helicopter pilot for 32 years and traveled the world. Since retiring 10 years ago, my wife and I have been back to Europe 8 or 9 times. I have used the app to go back to many of the places that I/we have seen. It is the next best thing to being there.\n\nThe first time I ran the app, I was on top of a boat in the Grand Canal in Venice with nothing beneath me. The image was so real, I was afraid to move for a minute because I was afraid I would fall onto the deck of the boat!\n\nI've been back to Heidelberg, Paris, Venice, Pompei and Florence in the past 24 hours. Admittedly not all of the images are as startling but if you zoom in using the map feature, you can find terrific shots that you can save to albums created in the Favorites part of the app. If you save the best ones, you can take a nice trip down memory lane anytime you want and share those experiences with family and friends that have never been able to travel.\n\nHad I known how great this app was, I would have purchased the Quest for it alone!\n\nHelpful | 38", "arleigh.anchetaJul 31, 2019 at 7:17 AM\n\nIt would be great if Google can do live feeds say of a certain part of a city in 360! That would be so awesome it would be like youre there in real time!\n\nHelpful | 3", "BlueSigilJul 14, 2019 at 9:13 PM\nNot great\n\nThis game doesn't give the option of year, roads and many towns on the Quest if I had know it wasn't up to date I would not have buy it. It's not worth spending $10 bucks on it. MY RECOMMENDATION IS DONT BUY THIS GANE!!!\n\nHelpful | 12", "WonderStrikeJul 30, 2019 at 11:23 AM\nPerfect for house buyers\n\nFound this really useful to check out various streets for a potential house to buy. Also great to revisit places you've been to. It's a very quick and slick interface. Perfect example of a good use for VR. The random places is brilliant fun.\n\nHelpful | 8", "glitchenSep 16, 2019 at 9:22 PM\nTerrible controls/scene rendering\n\nI want to love this but I can't. The rendering is slow and terrible. The controls are basically google street view. This was incredibly disappointing for the Quest.\n\nHelpful | 2", "SuperBonAug 27, 2019 at 12:54 PM\nPlaces name\n\nEvery time I go into wander the 1st place show up is impressive , if wander can highlight the place name instead of we zoom in to find out, its will be very good.\n\nHelpful | 1", "GubleJul 11, 2019 at 3:35 PM\nA lot more than just street view\n\ntl;dr: great app, even better for sharing with others (both local and multiplayer)\n\nWas on the fence, but decided to buy this app thanks to a fair amount of positive reviews. Figured worst case I could request the refund.\n\nIt was immediately clear that it was worth buying, after travelling to my first destination. I used to work in a remote northern community, which was a fly-in only community. Being able to revisit brought back so many memories and feelings. I passed the headset to my wife and she loved it. We both agreed this would be great for showing family and friends where weve lived.\n\nI immediately suggested my online friend download, which he did. We then spent three hours showing each other points of interest that were important in our lives.\n\nDefinitely a great app for discovering new places, but also very amazing for revisiting or sharing important points of interest.\n\nThe 360 views are great, easy to use and hide menu bar, favourites tab is very handy, but my favourite feature by far is multiplayer. Being able to host a room and have a friend follow you around while you give them tours is amazing. This app is way more than just street view.\n\nHelpful | 13", "guenter.baumann1711Sep 19, 2019 at 2:51 AM\nUltracool!\n\nNice standing suddenly in my hometown :D\n\nHelpful | 2", "thedeancorpAug 5, 2019 at 12:57 AM\nMeh. Its just google maps.\n\nIts ok. Im not sure what I was expecting but not really worth the money imo. Maybe at half the price but its literally just google maps. Maybe if I could use the joystick to move around itd be more fun? But clicking the google maps arrows is about as fun as it is in a browser.\n\nHelpful | 3", "CorehavokerJun 25, 2019 at 5:37 PM\nLove the app but...\n\nSo I love the app but had one of the most frustrating things happen to me today. I couldnt take a route I literally took a minute ago.\n\nI tried making sure the year was correct and it was, made sure I didnt click on a circle by mistake, I hit the back button and was able to get on it but then I hit it one too many times and I couldnt get back on that same route!\n\nOne note for developers; I believe it would help, being able to disable public uploads. I cant tell you how often I click on the line all zoomed in and the application somehow goes to the dot :(. This is especially painfully in popular destinations.\n\nHelpful | 3", "stefcodeOct 16 at 5:33 AM\nToo Short = 1h !\n\nVery too short\n\nHelpful | 0", "FinnyWiggenJun 9, 2019 at 6:52 PM\nA really good side-along app\n\nThis app is a lot of fun, and very interesting. It allows you to use Google Street View and other services to go pretty much anywhere. The real benefit for us though has been as a side-along app for our young children, and our older relatives who want to experience vr, but who it would take more patience than we have to teach them how to work the controllers.\n\nWe get in one headset and set it up as following the other, and then we take them on a VR tour. They don't have to push any buttons, or work the controller at all. Which is a pretty killer feature to have in VR. We take them to their childhood home, or their old school, etc.\n\nOne Feature Request that I will just throw out there, which I think would be absolutely killer. I understand if you can't do it. I just throw it out there.\n\nI would live if you would superimpose Google Satellite imagery on a a globe, and put a fake blue sky above. It would allow you to feel like you were flying. Street view is amazing, but I think \"flying mode\" would also be incredible. Especially while ridding on a plane! Forget about looking out the window! In VR I could see the view of where my plane currently is in total 360 glory!\n\nThat request aside, this is a phenomenal app!\n\nHelpful | 9", "JoyOverloadJul 16, 2019 at 4:49 AM\n\ncons: its basically google streetview; depending on your internet speed- images can take a while to load; not much interactivity.\nPros: great price; userful for researching place to visit; you can save some of your fav places; images look nice on the quest.\nIts an ok app but nothing really new.\n\nHelpful | 0", "Coconut4MeAug 15, 2019 at 1:13 AM\nEnjoy your world!\n\nMeet new people! Get to know the world! Their are so many things so see and adventure. Share all you can with others to make the experience even better! Enjoy!\n\nHelpful | 2", "ArnookieMay 20, 2019 at 7:51 PM\nThe best Google Street view alternative\n\nWander is a great app for exploring and visiting the entire globe from within your Oculus Quest headset.\nSimilar to Google Street view and maps wander lets you explore the entire globe at street level with high quality and great detail.\nVisit places in current time and days from the past.\nSelect your year and see your childhood neighbourhood or visit places you never normally could. The world is your playground when using wander.\nEasy to navigate you can take a trip to Disneyland or walk down a street in your local neighborhood.\nYou can visit just about every country tourist sites and other areas in great detail.\nThis app is perfect if you can't afford to travel or have disabilities that stop you traveling.\nGreat if you want to see what a holiday resort would be like before you pay expensive travel costs.\nWander is a must have app and I highly recommend it for all VR users.\nReviewed by ArnookieVR\nhttps://www.facebook.com/groups/390629631672716/\n\nHelpful | 32", "OctopusGardenJul 1, 2019 at 8:59 AM\nThe Perfect App\n\nI can not honestly think of anything that would make this app better. I am sure there are some that think that it is not worth five stars. Yes, granted the resolution could always be better, the 3D effects could be better, but we have to judge the app for what the Oculus Quest is capable of and in my opinion, the experience is close to the ability of the quest. The Google Map and ability to explore is incrediable. I wish thst Google would have entered more places shopping malls, parks, amusement parks &c. But the is definitely a great app. I revisited the area that I vacationed last year. It was nice to be able to sit a hope and see things that I saw and travel down the same roads that I walked down.\n\nHelpful | 6", "splappySep 9, 2019 at 8:41 PM\nSave your money\n\nPretty worthless. Not any better than cell phone vr\n\nHelpful | 1", "ornerybuddhaAug 7, 2019 at 12:44 PM\nDisappointing\n\nBasically it's Google maps on a giant screen. No real interactivity other than being able to walk around outside some places. And it's in lower resolution than it is on your phone, tablet or PC.\n\nHelpful | 2", "DAX_QcAug 30, 2019 at 10:28 AM\nGreat.\n\nGo and see for youself.\n\nHelpful | 2", "Bigelowed18 days ago\nAn incredible way to view the world\n\nAlone or with others, Wander gives you a glimpse of places all over the world thanks to Google Street view. It enabled me to visit the Arctic again, or to visit my old home and highschool in England. Or even just to re-watch my house in Canada change over the years that Google did new photos. Amazing!\n\nHelpful | 0", "marcia.avila.33May 24, 2019 at 5:43 PM\nCool but cant seem to change date\n\nSeeing the world from my living room was very cool. However I was very interested in the feature of changing the year. I went to the Statue of Liberty hoping to see it through the years but the timeline feature was not enabled. Then I picked a random location in NYC and still only could see the current time. I dont know if Im doing something wrong or if its not working but I would think that NYC would have many photos throughout the years.\n\nHelpful | 8\nDeveloper ResponseMay 24, 2019 at 7:25 PM\n\nHi! NYC does indeed have many photos from the last decade. The timeline feature does not work in user uploaded images (blue dots on the map) but does work well in many other locations (blue lines on the map). For example you can try using voice search to say \"Times Square New York City\" and you should end up in a location that includes images from 2009 to 2018. Most blue lines in cities include multiple dates. Hope that helps!", "Vance_PorterJun 22, 2019 at 3:54 AM\nNostalgia Packed\n\nI enjoy this app, especially the different years you can visit. Its Google Street View with that amazing Virtual Reality feel. Ive spent more time in Wander than I have some of my actual games! Checking out places from when I was younger to places I want to go see, you can lose track of time easily in this.\n\nHelpful | 8", "alixwassonAug 16, 2019 at 5:35 PM\n\nBoring!\n\nHelpful | 3", "DahGahdJul 29, 2019 at 7:39 AM\nSo far pretty cool\n\nI'm giving 3 stars because I keep getting the voice recognition failed message. I'll update with 5 stars if that can go away.\n\nHelpful | 0", "psimaticJun 13, 2019 at 8:51 AM\nWorth the price & much more! Few issues\n\nI was really on the fence about this at first but so so glad I got Wander. I don't know I made such a fuss over the ten dollar price now that I've spend a good number of hours already diving head first into the app. First off, I love the gaming experience for the Quest and really see my library expanding but I wanted to make my quest headset a versatile Swiss army knife of uses more than just a gaming device. I might pick up Tilt Brush and or Tai Chi for this fact as well. If you are in the same dilemma as I was - not sure if you'd really get any use out of this, here is what I've done so far: explore all my past homes, neighborhoods, past schools, my Alma mater, places of nostalgia, past vacation spots, epic places I've not yet visited, and also even had my wife show me her old hometown when she was a kid, and I was watching the cast alongside using my phone. I have a list on my phone for places I want to check out later when I jump back in Wander. There are a few issues that definitely does not take away the value of the app - 1. Typing keyboard needs a shift button, the caps lock button makes it an extra click to alternate between upper and lower case letters gets tedious fast. 2. The text field could also benefit from being able to edit anywhere in the beginning or middle. It seems of you want to correct a type-o or add a word in the middle, you have to delete and retype. 3. Sometimes when navigating around using a lot of the buttons, I'd all of sudden jump to the middle of the world (zero coordinates, in the ocean, to the nearest 360 image of some couple in a random location that is not geocoded correctly). 4. The app could use a power optimization update, seems to be a bit more drain than I expected- even with the headset plugged in while using the battery percentage dropped from full 100% to 70% after a couple hours of use...and might go even lower with longer usage. The headset also gets kinda hot. 5. The app seems to stream and render Google Street view images much much faster than user submitted 360 images which take like 5 times longer, like up to a minute to see some clarity in rendering the image. Other than those issues - I've been so happy with Wander. The fact that you can bookmark locations, cut/paste and make folders as well, and also jump back to older Google Street view images, are all really good features to help make this a solid app. Just be aware that images and locations might not be 100% correct cause this is all Google Street view and user submitted. Some funny/weird occurrences due to tourists spotting the Google \"orb\". Even though the experience is not true VR 3D in the same sense as other VR games, the Wander app has so many uses - you'll get way more value than you expected.\n\nHelpful | 11", "mvwoodJun 7, 2019 at 9:21 PM\nGreat but could be even better\n\nLike others have said, this is a very cool streetview application.\n\nWould be good if they could allow you to adjust the vertical (maybe by changing where the ground is the same way as when the oculus grid is calibrated). If you could put the ground at 4 feet off the actual floor it would let the user look at buildings and landmarks from a position that seems a but more natural. Just a thought and no idea if it would work, but it does feel very weird to look down and feel like you are 12 feet off the ground.\n\nAll in all though excellent app and well worth the cost.\n\nHelpful | 1\nDeveloper ResponseJun 9, 2019 at 10:02 AM\n\nHi. We would love to do that but unfortunately it isn't possible with the way these images are captured. The camera is where it is. In some cases it'll be at more or less the right height, but in many locations it's mounted on top of a car and is higher off the ground than a normal human viewing position. Happy to hear that you're enjoying the app though!", "OcululentMay 31, 2019 at 6:08 PM\nIdeal if you know what to expect.\n\nWander is essential Google Street View but in VR. If that is the experience you are looking for, its right here, explore the streets of the world in full 360 view from the comfort of your home. A helpful menu system with text, voice and map browsing imput makes getting where you want to go very simple. Wander also features two significant yet easy to use options in the menu; one allows you to jump through the years that Google has captured an image, letting you see locations through various times and another option to be placed in a random location in the world, this can show you something you would never even think to look for, maybe a new vaction location or can even be used as a game to try and figure out where you are in the world. Wander is a perfectly functional VR experince that offers so many locations, places to explore (even with friends via multiplayer) and although it is just a flat 360 image, it really does feel like stepping into a still 3D world.\n\nHelpful | 2", "Tact2May 24, 2019 at 5:31 PM\nMust own app.\n\nHonestly, I knew if I could never get into the games I thought I would be interested in either because they turned out to not be enjoyable or I couldn't handle getting sick playing, Wander would be an app that would be worth the price of the headset alone.\n\nI love going back in time to places I have lived. And it's fun looking at places I have heard of but never visited.\n\nHighly recommend to all types of users. A must own.\n\nHelpful | 6", "ralphael_ninjaJul 2, 2019 at 6:44 PM\nWonderful 360 but frustrating\n\nUpdate review to 5 because I managed to get to places that I would never go to in real life like the statue of Christ redeemer and with vr it is almost as good as a holodeck. Huge learning curve as you really have to be specific on the places you want to go. Navigation on left controller is a hit or miss with you getting stuck for no reason. I was never a great fan of google earth because of the awkward google interfaces and it shows even in wander. First of all I wanted to see Machu Picchu and it took me to a small town that I presumed the ruins are nearby but after wandering the town I had no clue and of course the navigation was terrible as I kept clicking on x which is the voice button... aaaargh! Which I clicked over and over and over and frigging over. So I tried teleporting nowhere. Ok so fine it was exactly like google maps where trying to walk around wasnt really easy. So I wanted to see the pyramids, Egypt pyramidal day and it took me to a pyramid museum. I never got to see the pyramids. I did look at the 8 cells of suggested places but I didnt know how to scroll (I just bought this quest yesterday) and every application uses the buttons differently, so I never saw more than one page of unknown places. I kept hitting voice and while that was great when I said a swear word and it took me there. I love the 360 and when I figure how to get to the great pyramids of geeessa (intentional spelling) Ill rate this app to maybe 3. Im back and I finally got to the pyramids of Giza. I did get to machu pichu by selecting nearby places. No mars or the moon though. I did go back to Edmonton where I was born and discover that all the buildings have changed. You can get rid of the menu and then the left hand can navigate a bit better. Still hangs from time to time? Save in favorited then select it will unlock yourself if you are stuck. Good app and good 360 views. Very kinky but probably from google data and interfaces. Be really patient with learning this app as it can take you anywhere on earth in a holodeck fashion. It is a must have! Highly recommended.\n\nHelpful | 5", "red2lucasMay 22, 2019 at 12:21 AM\nIf youre on the fence...\n\nBuy it! Ive just spent the last hour looking at places Ive been and reminiscing about past holidays. Ive also been using it to plan our next holiday, picking out spots Id like to visit.\n\nHelpful | 14", "BRK34Aug 13, 2019 at 6:12 PM\nMy fav so far\n\nThis is a must for oculus quest until google earth artives\n\nHelpful | 0", "MalteseDadJun 14, 2019 at 5:21 AM\nGoogle Street View in 3D\n\nOK, so this allows you to explore the Google Street View images in 3D, from around 12 feet up in the air (the placement of the cameras in Google cars. The immersion is quite real, but please note that:\n\na) the images are static\nb) the perspective is often wonky, especially with uneven terrain, with small items (plants, wildlife) appearing extra large and/or having a skewed perspective.\n\nIt is great for some use cases, as long as you know what it is, and you do not have the same expectations for this as other titles that have been specifically created for VR.\n\nHelpful | 0", "nyra.raynJul 25, 2019 at 10:05 PM\nAmazing \n\nExplore where you have been and wish to go. It's great to see places I love but haven't been to in a while.\n\nHelpful | 0", "jacob.wulffJun 9, 2019 at 4:16 AM\nGreat Google Earth Alternative\n\nI love Google Earth on the Rift and wasnt sure about this one, but wanted the earth experience with street view on my Quest. This is great and I love how quickly it loads. One thing I think this app is missing is an audio background or music ala Google Earth. Otherwise, great app to easily burn hours in just exploring.\n\nHelpful | 4", "PalomedesJun 11, 2019 at 1:32 PM\nGreat app for a great price\n\nHaving been used to Google earth on my rift, I was not expecting a great deal from this app. However I was pleasantly surprised by how good it was. I took a journey back to the town in Germany where I used to live and I was surprised by how many photos there were and how good the content is. Money well spent!\n\nHelpful | 2", "YOUR-ARCH-ENEMYJun 28, 2019 at 11:50 PM\nPretty neat!\n\nVery surreal to see your own house in vr! Visit the world in your Quest!\n\nHelpful | 1", "MadReasonableJul 7, 2019 at 2:46 PM\nA very useful tool\n\nIt's Google Street view in VR, and it's an incredibly useful tool for photography, drone, and travel planning.\n\nHelpful | 2", "DrTabooSunJun 12, 2019 at 2:09 PM\nGreat time for would be travelers\n\nMuch like Google Earth, this app allows you to travel the world. Before too long I found myself walking around Disneyland and the zoo in Budapest, then started randomizing my location and trying to guess where I was. Before I knew it four hours had passed in the blink of an eye. Great times.\n\nHelpful | 1", "VirplMay 21, 2019 at 9:10 AM\nLike Google Streetview VR but Social\n\nAwesome app. Everything runs super smooth and nothing like running around the world with friends in streetview. Highly recommended pretty much a must buy\n\nHelpful | 10", "CrwlyJun 19, 2019 at 8:14 PM\n\nThe app has its limitations but it is awesome to be able to visit new places and old from your armchair.\n\nHelpful | 0", "martin.oconnor.543Jun 5, 2019 at 11:35 PM\nBrilliant!\n\nSo I got this on the Go and was really impressed (given the limited power that the Go has) and the Quest version is stunning. I am enjoying the visuals far more as my IPD was borderline on the Go. The control interface is much better with the Quest controllers. The only thing that would make this better would be if it were possible to use the Google Earth mapping rather than just street view but I understand how challenging that would be on a mobile headset. Buy it now!\n\nHelpful | 4", "MeukishJun 1, 2019 at 3:25 AM\nJust great\n\nIf you're having doubts, thinking it's just like Google Maps, then go for it. It's not just looking at pictures of places in VR. It really adds the extra layer of actually being there. Revisit past travel locations or check out future destinations. 2 thumbs up bru.\n\nHelpful | 2", "haha3469Jul 13, 2019 at 10:13 AM\nawsome\n\nEverything was the experience I wanted.\nThe only thing that is missing is that there is no screen zoom in function.\n\nHelpful | 0", "ThevrcatJul 17, 2019 at 9:35 AM\nNot what you see\n\nIts not as cool as the ad said\n\nHelpful | 0", "saberbatorMay 29, 2019 at 9:39 PM\nNot as advertised\n\nThis is Google maps with a price. The database doesn't justify the cost. I grew up in Minnesota, usa. I can't even see the streets of the houses I grew up in, let alone a good idea of any location I want to revisit or see for the first time. Overpromising underperforming. Google should offer this to people whose passion is adding quality experience. I'm sorry I spent money on this.\n\nHelpful | 11\nDeveloper ResponseMay 30, 2019 at 7:25 AM\n\nUnfortunately, as we are not Google, we do have to pay Google for use of their data (which is almost definitely the largest collection of VR compatible imagery in the world) and developing a way to explore these locations in VR also of course has an associated development cost. I would suggest checking out the collections tab as there are some great curated sets of interesting locations. We would really, really appreciate it if you could send us an email at info@parklineinteractive.com with your thoughts so that we can understand how we could improve as well as what you see as the gap between what was advertised and what was delivered? Nearly every major tourist attraction in the world is covered. Thankfully there is no need to ever regret spending money on an Oculus app as you can get a refund.", "darceyderosaJun 4, 2019 at 4:17 AM\nTitle is misleading\n\nThe app is visually appealing, however, I can't wander on Wander. I thought you would be able to look around the area you want to view. I only had limited success with moving controls and that took away from the enjoyment I thought it would give me.\n\nHelpful | 2\nDeveloper ResponseJun 4, 2019 at 1:20 PM\n\nWe're planning to include better instructions in an update as we realize that when you can wander around is not as clear as we'd like it to be. In user uploaded images (blue circles on the map) you are often unable to move by teleporting around the scene. In almost all other locations (blue lines on the map) you have freedom of movement and can get around by pointing at the ground and pulling the trigger.", "michael.levitreMay 30, 2019 at 10:37 AM\nFirst time experience - Truly Amazing\n\nMy girlfriend is from Peru and I was able to see where see grew up and went to school - such a great and fun experience folks. I would highly recommend this app because its so addicting to see the world thru Oculus VR.\nJust know that time never stops when your virtually travelling. Highly recommended and its journey for sure :)\n\nHelpful | 2", "xxxpogoxxxJun 7, 2019 at 11:15 PM\ngreat app & Just fantastic service\n\nApplication does exactly what it's supposed to do very intuitive easy to use looks good too and the developers when I contacted them about the software got back with me within 30 minutes of me emailing them which I did not expect it all I was blown away\n\nHelpful | 2", "BusFahrer85May 23, 2019 at 7:36 AM\nNot what I expected\n\nIt's basically Google maps with the possibility of watching the 360 pictures people took around the world. I didn't really enjoy the experience as the 2d but 360 effect is quite wired and of course depending on the pictures people made it can be quite useless.\n\nI expected a bit of 3d content.... Videos in 3d.... It's interesting if 2d is enough that you want to see.\n\nHelpful | 5", "darwins.lastMay 28, 2019 at 6:25 PM\nMust Have\n\nThis is my check out vacation sites, visit childhood neighborhood, travel virtually anywhere in the world, explore sites while taking a break from the action, show friends my favorite places, walk around the space station, find personal hideaways in the South Pacific, look at neighborhoods before buying a house, relaxing app! So awesome.\n\nHelpful | 2", "festusquestJul 27, 2019 at 6:47 PM\n\nAmazing\n\nHelpful | 1", "SalforzMay 27, 2019 at 8:27 PM\nA Must Have For Your Quest!!\n\nWhere to start!! Wander is simply amazing. To be able to travel to almost anywhere in the world and see it in full 360 is just incredible.\n\nI picked up Wander on my Oculus Go and immediately loved it. Now we have it for the Quest and it is just as awesome. A definite 5 stars from me!! Pick it up and travel the world :)\n\nHelpful | 2", "belial.3964Jun 12, 2019 at 5:49 PM\nAmazing\n\nThis is my first review, but i want to support quest. This app is simply amazing. Its a def buy if you ever wanted to travel the world. It illicits a great deal of nostalgia revisiting past vacations. Im currently scouting my next trip.\n\nHelpful | 0", "SpeledingMay 24, 2019 at 10:06 AM\nTrips down memory lane\n\nI pressed the \"voice search\" button and told it an old home address and... tears almost came to my eyes. It's awesome to walk through your childhood. Well worth the price of admission. Quick tip: the function of the buttons change when you hide the map, it took a while for me to figure that out.\n\nHelpful | 3", "raeseneMay 25, 2019 at 10:38 AM\nGreat way to travel the world\n\n.. from the comfort of your home.\n\nThe interface for this title is pretty good and as long as you've got a decent Internet connection you can move from place to place quickly.\n\nI like the timeline feature that lets you see how places looked at all the times when the Google streetview car went by.\n\nThe ability to do things like go inside the Sydney Opera house was an unexpected (but welcome) surprise.\n\nHelpful | 2", "kawboiJun 27, 2019 at 8:25 AM\nAmazing\n\nI was very surprised at the visual clarity of this app. The controls are very intuitive. I highly recommend this to everyone who is interested in travel.\n\nHelpful | 1", "prettyinpunkJul 29, 2019 at 1:22 AM\nQuestion\n\nHow do I return this and get a refund?\n\nHelpful | 2", "CodeMusicXJun 17, 2019 at 5:30 PM\n\nNice if 3D. But still 99% rating!\n\nHelpful | 0", "z0ninJun 8, 2019 at 4:32 PM\nDefinitely worth the price\n\nInitially seemed like it should have been free (like access to Google Maps) but the functionality and features built into the app to help you explore are well worth the price point. Exactly what I was looking for.\n\nHelpful | 1", "timothy.moser.jrJun 19, 2019 at 2:01 PM\nNot working good on Oculus Quest\n\nI have reinstalled several times. The app does not load maps and images. I have strong internet. It recently starting doing this. I am very disappointed. App is buggy.\n\nHelpful | 5\nDeveloper ResponseJun 19, 2019 at 2:07 PM\n\nHi Timothy. Please send us an email at info@parklineinteractive.com and we will try to figure out what might be going wrong for you. It might be worth trying the app on another network as it looks like something is blocking your connection.", "nowhereman_May 27, 2019 at 11:14 AM\nCan't move fwd/back, voice search fails\n\nOn Quest, the left joystick does not move forward and back as indicated which sucks all the fun out. The voice activated search fails recognition every time. I uninstalled/reinstalled but still has same problem. Works OK to point at a place on the map and then just pan around with the right joystick.\n\nHelpful | 0\nDeveloper ResponseMay 27, 2019 at 8:01 PM\n\nHi. Not all locations support teleportation. Sorry if this is not as clear as it should be. Blue dots on the map are user uploaded images which are usually not connected to other locations. Blue lines almost always support forward/back movement along with teleportation by pointing and pulling the trigger. There does seem to be an issue with voice search right now that we are looking into, some users have been able to fix it by resetting the microphone permissions for the application. Please email us at info@parklineinteractive.com if you are still having trouble!", "brian.roebuck.7Jun 4, 2019 at 2:20 PM\n\nGreat app but microphone not responding after reading other users with the same problem powered down and restarted solved problem will monitor it\n\nHelpful | 0\nDeveloper ResponseJun 4, 2019 at 1:22 PM\n\nHi Brian, can you send us an email at info@parklineinteractive.com so that we can look into what's going wrong for you? Sometimes if you are in a party with another user it can interfere with microphone access.", "doug_wareMay 27, 2019 at 7:29 AM\nWould like a refund\n\nThis wasn't really what I expected and I played with it for maybe 10 minutes before deciding I don't like it, but in spite of the refund policy link here, the order history page in the browser does not offer the ability to request a refund that I can see, just circular links back to the refund policy page.\n\nHelpful | 2\nDeveloper ResponseMay 27, 2019 at 8:01 AM\n\nHi. Sorry that Wander was not what you expected. Refunds are available in the Oculus application on your phone. You'll find the option under Settings->Purchase History. Please email us at info@parklineinteractive.com if you have any trouble. We would also really appreciate it if you could send us an email and just let us know how Wander was different from your expectations and what we could do, if anything, to better set expectations.", "wrigs99Jun 18, 2019 at 2:33 AM\nGreat App\n\nGreat app to pass away hours of Wandering. Fills the gap of not having Google Earth VR ported to Quest. Recommend\n\nHelpful | 1", "TheBigLambinoMay 22, 2019 at 4:23 PM\nTRAVEL THE WORLD FROM YOUR LIVING ROOM\n\nI have this App on the Oculus Go and now on the Quest. I love this App. It is a simple yet freeing experience. Ever wonder what it looks like to walk the streets in another country? This App will show you. I have visited the North Pole, Antarctica, random islands in the Atlantic, numerous cities in every country, and even Chreynobl.\n\nThis App is my go to experience to introduce friends and family to VR. Simply an amazing idea well executed.\n\nHelpful | 5", "PlatMan17May 28, 2019 at 1:01 PM\nDon't let this replace a vacation\n\nSpending $10 to teleport anywhere in the world will get you what you paid for: an experience that will make you never want to visit your dream destination ever again. Not only are most locations, like famous landmarks, completely pixilated for MINUTES, but I often found the positions in which they put the cameras at were noticeably awkward, especially when you get in alleyways, the perspective often leaves me squinting my eyes and moving around in the real world to get a better view (in this sense, the Quest is the perfect console for this game).\nWhile you can explore anywhere in the world, I wouldn't recommend this game, the same way I wouldn't recommend watching streetview on a PC and calling that a definitive vacation.\n\nHelpful | 2\nDeveloper ResponseMay 28, 2019 at 1:07 PM\n\nHi! Wander is not intended to be a replacement for a vacation. User uploaded locations (blue dots on the map) do sometimes load slowly, however standard locations (blue lines on the map) should load quickly. You can also turn off \"maximum\" resolution in settings to speed things up. We appreciate any and all feedback, please send us an email at info@parklineinteractive.com and let us know how you think we can improve.", "niravdesaiMay 21, 2019 at 6:28 PM\nIt is not VR. Only pictures. Dont buy\n\nThis app has pictures from different places in the world. I was expecting a VR experience. Very disappointed.\n\nHelpful | 26\nDeveloper ResponseMay 22, 2019 at 8:39 AM\n\nHi, sorry that Wander was not what you thought it would be. We would love for you to give it a real shot as there is a ton see (a huge amount of the world is covered) but if 360 imagery just isn't something you have any interest in you can of course get a refund through the Oculus application on your phone. The refund option is under settings, then purchase history.", "SunnyDays321May 22, 2019 at 3:59 PM\nFantastic\n\nI highly recommend this app. I can now view the whole world from my armchair without the headache of losing my luggage at the airport . Also, everyone should stop flying to save the planet. PEACE.\n\nHelpful | 4", "TheMichaelScottJun 2, 2019 at 8:37 PM\nMore entertaining than you would think\n\nI bought my first VR headset for games like Superhot and I never expected to spend most of my time in apps like this and Google earth VR. If you are considering buying this just do it.\n\nHelpful | 0", "ian.sears.102May 22, 2019 at 3:25 AM\nGoogle Earth on Steroids\n\nIts just an enhanced version of Google Earth. I suppose if you are going somewhere its good to get an initial perspective of the location to familiarise yourself\n\nHelpful | 2", "LamestGamrJun 14, 2019 at 11:45 AM\nGet Lost for Hours\n\nIt's so much fun visiting places in this and, well, wandering...\n\nAlso, it's a perfect introduction for VR newbies.\n\nHelpful | 0", "minbari73Jul 2, 2019 at 3:15 AM\nWhy the F\n\nIsnt this on Rift or Rift S\n\nHelpful | 0", "DacotahdMay 23, 2019 at 6:01 PM\nPhenominal\n\nGirlfriend just returned from a trip to Spain. Instead of looking at the photos she took we used this app. The level of detail completely blew us away, would recommend.\n\nHelpful | 3", "SupersonicblueMay 23, 2019 at 6:12 AM\nAmazing as always\n\nThis app is great, it has many fun elements to it and the multiplayer is so fun to just travel and look at the world with friends or family, this is a must have in your library\n\nHelpful | 1", "bonus21May 22, 2019 at 2:15 PM\nNot a fan\n\nBasically google maps at a street level view. Pixels take a while to load and just boring for the most part. I would just prefer google maps on my computer.\n\nHelpful | 4\nDeveloper ResponseMay 22, 2019 at 2:31 PM\n\nHi. Regarding load times, user uploaded images (the blue dots on the map) load slowly compared to other imagery (blue lines). There is also an option in settings to use lower resolution imagery which loads approximately 4x faster. You can also of course get a refund if you find that Wander just isn't the right kind of app for you. The refund option is available through the phone application under settings then purchase history.", "keir.buckleyMay 24, 2019 at 6:50 PM\n\nNothing great. Would be more enjoyable if it was in 3D\n\nHelpful | 3", "Dejv_CZJun 15, 2019 at 8:12 AM\n\nCool\n\nHelpful | 0", "JerCinemaMay 26, 2019 at 12:45 PM\nOne big flaw..\n\nMany locations are not what they claim to be.\nExample: \"Sinatra\" in Las Vegas isn't the restaurant, but the parking lot outside\n\nHelpful | 2\nDeveloper ResponseMay 26, 2019 at 2:00 PM\n\nI would also love to be able to see the inside of every restaurant and attraction! Right now we get as close as possible and maybe sometime soon someone will upload an image from inside Sinatra! Most imagery is outdoors with a huge portion of the world covered and ton of indoor locations are available. This includes the insides of museums, cathedrals and other major landmarks like the White House or the Guggenheim in New York. Sorry if there was any misunderstanding regarding the capabilities of Wander.", "bootstrapparadoxMay 21, 2019 at 8:55 AM\nBrilliant title\n\nThis my favourite quest title. I enjoy exploring the world\n\nHelpful | 6", "michael.smith.7792May 24, 2019 at 6:37 AM\nAmazing App!\n\nIts great the way it is, but I can see this getting even better in the future!\n\nHelpful | 0", "kennymockcomedyMay 21, 2019 at 5:04 PM\n\nNot what I expected I thought it was a game. However its just pictures from around the world. And its not interactive\n\nHelpful | 11\nDeveloper ResponseMay 22, 2019 at 8:37 AM\n\nHi. Youre right that Wander is not a game but a way to explore the real world through VR. It is interactive in that you can teleport to other panoramic imagery within a location but of course it is not interactive in the way a game would be. We apologize for any misunderstanding. I hope you enjoy it as there's a lot to see, but you can of course get a refund if it isn't something youre interested in.", "Crazybee0072019May 24, 2019 at 10:08 PM\nWorse app ever...\n\nIf you have quest getting this app is waste of money\n\nHelpful | 5\nDeveloper ResponseMay 27, 2019 at 8:03 PM\n\nHi. I'm sorry if Wander was not what you expected. I would love to understand what you did not like and would very much appreciate it if you could send us an email at info@parklineinteractive.com!"]