{"App Title": "Wands", "App description": "AWARDED VR GAME OF THE YEAR @ IMGA\n\n\"It feels magical.\" - VentureBeat\n\nWANDS is a first person VR experience that offers fast-paced magic duels against other players online. Equip your wand with a wide variety of spells and battle other Wielders for fame, power and glory in the fantastic realms of The Beyond. Explore new spells and hone your skills in your secret workshop in between battles.\n\n- Action-Packed Magic Duels \n- Friendly, Cross-Platform Community\n- Spectacular Battle Arenas\n- 25+ Powerful Spells\n- Competitive Gameplay \n- Strategic Wand Loadouts\n- AI Opponent\n- Frequent Updates", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Shooter, Strategy", "Languages": "English, Chinese (China), French (France), German, Japanese, Spanish (Spain)", "Version + Release Notes": "1.7.0", "Developer": "Cortopia Studios", "Publisher": "Cortopia Studios", "Website": "https://www.wandsgame.com/", "Release Date": "September 19, 2019", "Developer Privacy Policy": "None", "Space Required": "677.7 MB"}



["5 stars\n57%\n4 stars\n23%\n3 stars\n5%\n2 stars\n5%\n1 star\n9%", "bird_brosJul 10 at 8:44 PM\nThis is a must play\n\nso I have a few reasons I love this game. One, it's based on strategy. Strategy games are my jam. Also, MAGIC! Hagrid would be proud. Still waiting for him to burst through my door and say, \"your a wizard.\" Any day now. Anyhow. The way you unlock spells as you go is really well done. You don't even get a token by winning or losing, just by playing long enough. Also the cosmetics. OH the cosmetics! You don't have to pay money to get the cosmetics in fact, there isn't any way to pay money at all! And you get dust really quickly i only played for about a total of 2 and a half hours and am almost a third of the way into getting the most expensive skin, and only have 5 spells left to unlock! Each spell has its own use and gimmicks and if you play your cards right, any spell can be super deadly. The way some were designed to go with other spells was done very well. Like the Phoenix and devils spit is an incredible combo and it keeps destroying me, but a good counter for that combo is the shield that covers your whole body (idk the names) it uses your mana quick though so you gotta time it right. Now i do have one complaint. There isn't a story mode! I could imagine a story mode working so well for this game. Developers if your reading this, make it happen!\n\nHelpful | 11", "TimmyTimThomThomApr 30 at 1:19 PM\nAmazing game and would buy again but...\n\nThis game is overall an amazing game! I just have a few tweets about it. 1. I wish teleporting wouldnt take up so much mana because sometimes it just gets really annoying and can cost you the game. 2 I wish that you could see how much health your opponent has and how much health you have. 3. I wish there were more spells... I know there are probably going to be some more but I think it would be fun now. 4. I wish there was a permanent game mode where you can only use the four elements, water, earth, fire, and air. 5. Like I said before I know this is probably going to come just like more spells but I want more maps! 6. I wish that there was a motion to spells that you should learn so it feels more like a wizard/witch game. 7. I wish you can control how powerful the AI are. 8. I wish you could test a spell before you get it so you know if you want it. 9. Now I am not a 100% sure on this but I wish you could turn off the turn motion thing on the controller and you could just turn and look around by actually looking around... I know you can look around by turning your head but sometimes Im in a battle and I turn and I accidentally turn with the control and it makes me miss. Overall this is an amazing game these are just my little nit picks so the game could be better. If I could only chose 3 things out of my list to go into the game it would be 1, 4, and especially 6! If you are into the market to buy a wizard/witch game get this one!\n\nHelpful | 109\nDeveloper ResponseMay 4 at 7:52 PM\n\nThanks for the feedback, TimmyTimThomThom. More updates are coming. Stay tuned ;)", "Ihrie3 days ago\nA fun magical dueling strategy game\n\nQuite enjoyable though once youve unlocked everything theres not a lot left to do beyond leader board etc.\n\nUpdate: I will say the dual wands using the touch buttons on each controller to select/use spells is a definite step up from the old single wand option IMO.\n\nWould love to see a sequel and see where they might take this concept.\n\nHelpful | 1", "RavensverdJun 1 at 6:24 AM\nMust play..\n\nThis is a must play. At first I thought the teleporting was a hindrance, now that I'm used to it.. it works,well..the spells and combos you can create are fun and very satisfying watching your opponents succumb to your spellslinging.\n\nThe only cons I have ,which are in no way gamebreakers are..\nMORE Spells!\nMore custimization.\nAnd more players... sometimes uts slow to make a match.\n\n\nOverall great game\n\nHelpful | 13\nDeveloper ResponseJun 1 at 7:23 AM\n\nThanks for the great review, cisc1. We hear you!", "ShadowProgrammerJul 11 at 5:30 PM\nAccio Excellent Game!\n\n(I know, bad joke. Sorry!)\n\nThis game is awesome! Opponents are nice, spells are nice, everything is nice!\nHowever,\nWish List:\nMore spells;\nMore load outs;\nMore costumes;\nDual wield option for 100,000,000 dust?\nEach load out unlocked unlocks more powerful spells;\n\nThank you!\n\nHelpful | 6", "ExwerksJul 10 at 9:51 AM\nDon't really like new update\n\nOkay, I know what you're thinking, \"who's this random kid hating on our update?\" Let me explain. When I first saw this, I was like \"Hell yeah! Dual Wielding!\" But when I launched the game, I quickly realized that it would ruin the experience for me and I'm sure many others. The only thing I'm really complaining about is the duel wielding, but I have some suggestions and feedback too. Duel wielding in general is definitely epic in any game, including wands obviously. I think this is a nice addition to the game, but not executed properly (Big words). I think most people will not like this update because it changes the controls. I, personally have gotten very used to the old controls and they feel natural to me. What I'm trying to say is, the duel wielding should have it's own game mode separate from the single wanded one. (Unless there is and I'm blind) I feel that two wands are difficult to use so maybe you can add a crossplay mode where one wielder has one wand and the other has two. Ok, that's done with, onto spell suggestions. I only have two spell ideas, because otherwise I would be making modifications to others. #1 maybe you can add a duplication spell that temporarily makes you shoot two spells instead of one #2 a blinding spell that makes your opponent's screen go black for about 3 seconds. That's it. The reason this review is 5 stars is because this is still a very good game, and I would definitely recommend buying it. Love this game. (And thank you for the reply, I had a feeling I just wasn't finding the right button.)\n\nHelpful | 5\nDeveloper ResponseJul 10 at 4:14 AM\n\nThanks for the feedback and spell ideas, Exwerks. We left the original single-wand control scheme in the game for this very reason. Just disable \"Dual Wielding\" at the blackboard and you can keep using the old controls! .... But after a little practice with the new control scheme, I'm pretty sure you'll never want to go back :)", "Anselm-Jul 10 at 11:06 PM\nimprove the control scheme\n\nMake the controller buttons configurable, please. I often press teleporter button by mistake with my middle finger and this blocks the chosen spell.\n\nAlternatively you can deliver a free hedge trimmer with which I can cut off my middle finger.\n\n---------\n\nWith the update you do not improve the control scheme with one wand, you created a new game with two wands. This might be interesting for enthusiasts but not for me. I will stop to use this game.\n\nHelpful | 0", "GlitchVertexJun 4 at 10:19 AM\nGood game but has a few problems\n\nI got this game when i was sick at home and played it all day. But then after you play a lot it get quite repetitive maybe a new mode or other things to change things up.I also wish that there was a way to free mov and not just go to teleportation spots.\n\nHelpful | 7", "beavis28Jun 28 at 6:35 PM\nUnderrated game but amazing one\n\nI check the most sold ranking often and this doesnt come up in the short list,, well I have to say this is underrated game for that.\n\nI played many of oculus games and this comes to one of best expressed VR game in my opinion.\n\nIm not so strong to nausea coming from VR, but this one is absolutely fine.\n\nBesides battle with anyone online is amazing,, I wish they extend the item more but overall this is 5star game.\n\nHelpful | 3\nDeveloper ResponseJul 9 at 2:41 PM\n\nWow! thanks so much, beavis28. More items are coming in future updates!!", "catbird62Jul 4 at 6:42 AM\nMagical Game!\n\nI am very happy with this game purchase. The graphics and movement and game play are awesome! I really like the different arenas to duel in. I really like the ability to upgrade wands and avatars and being able to buy more spells. I would love this game even more if I could duel both my daughters at the same time. Also, if you could actually test the spells before you buy them. And last...More avatars and spells! But especially, for me, the ability to play against more than one player would make this game perfect! Thank you!\n\nHelpful | 2\nDeveloper ResponseJul 9 at 2:39 PM\n\nThanks, catbird62. We hear you!", "Memes_R_UsMay 12 at 6:19 AM\nIts awesome! I just have one suggestion\n\nI have unlocked every spell and almost every wand and character in Wands, and trust me they are not difficult to get. Thats the thing. I like how the characters and wands and spells are easy to get, but I feel like there could be more of a variety to all of those topics in the next update. Now, again. As much as I like zapping my friends with lightning before they have the chance to turn around, I feel like it could use more options.\n\nHelpful | 8\nDeveloper ResponseMay 25 at 12:11 PM\n\nWe hear you, Memes_R_Us! Thanks for the feedback", "dantheman656Jun 25 at 6:10 AM\nAmazing\n\nI got this game yesterday and i love it. The People i met were really nice and gave me tips.But around the this morning I couldnt get into a match and when i did and finished that i got into another match with the same guy.Other then the amount of people playing early and i know thats out of the developers control.this game is great to make you feel like youre a wizard and have fun\n\nHelpful | 2", "MrDunceApr 6 at 8:13 AM\nSkill based, not level based.\n\nEvery time you level up you can unlock a new spell and by level 4 you could have the strongest loadout possible. Even with the best loadout you could lose to someone with more experience. If you put effort into learning how to spot different types of players you could beat just about anyone you face-off against. Its really fun!\n\nHelpful | 32", "virtualytJun 20 at 9:05 AM\nI love this game so much\n\nI could honestly play for hours I only got it yesterday but I have fell madly in love with it my only issue is sometimes not very often though it can take a little while to get into matches and find an opponent but apart from that the game is great please add more spells I want to have more spells to use\n\nHelpful | 2\nDeveloper ResponseJun 23 at 12:32 PM\n\nThat's great to hear, virtualyt! Thanks for the feedback. Feel free to stop by our Discord chat if you haven't already. You can find it at www.discord.gg/wands", "crcogJun 4 at 3:50 PM\nHard, but amazing!\n\nAt first, it was very hard to play. It took me about a half an hour until I was doing ok. The games is fantastic, awesome graphics. I would recommend this game to anyone who likes magic and action. 5 stars!\n\nHelpful | 9", "kvg1988Jul 26 at 9:49 AM\nWelcome to Hogwarts!\n\nRelease your inner wizard or death eater in a highly immersive yet simple to play gem of a game.\n\nHelpful | 2", "thorsonofoden25 days ago\nIts pretty fun\n\nThats it.\n\nHelpful | 3", "duckonentryJul 1 at 4:25 PM\nIts fun but seems dead\n\nIts fun and i hope it gets additional updates. Kinda tired of the same spells and maps. I mainly play friendly duels with friends as the matchmaker can take forever to find a game.\n\nHelpful | 2\nDeveloper ResponseJul 3 at 11:06 PM\n\nMore updates are coming!", "nikpaseJul 24 at 3:24 PM\nAfternoon hangout with friends\n\nBest for quick matches , hangouts with friends . Nice game.\n\nHelpful | 2", "SalfaneApr 17 at 5:31 PM\nMostly good\n\nIm very happy Wands. The matches are a lot of fun and it takes a lot of skill and strategy to win. The game has two parts where it falls short. 1- while waiting in the lobby it can take a while to get a match and there's NOTHING to do while you wait. Let me grab my wand and blast off some spells or practice switching spells while I wait! The avatars also move really creepily and not at all naturally as players move. It's like your opponent it's possessed by an evil spirit, which can add to the feel of the game.\n\nHelpful | 6\nDeveloper ResponseJul 9 at 2:53 PM\n\nThanks for the feedback! Today's update includes changes that make your opponent appear to move more naturally :)", "DomCody55Jul 7 at 6:49 PM\nOk but needs alot of improvement\n\nSo I started to play the game and I really liked it, but when I found out I couldnt walk in game that kinda sucked and was very sad. Also it isnt about skill or how fast or quick you are its just who has the batter spells and who is just better at the game. Plus mana in the game needs to be extended or you have less costs on mana.\n\nHelpful | 1\nDeveloper ResponseJul 9 at 2:37 PM\n\nHey DomCody55. Thanks for the feedback. The update that came out today officially makes the game room scale, so you can move around more freely. However the game isn't about walking around, and it never will be, it's about skillful dodging and strategic teleporting. Regarding the mana suggestion, I think you have a really good point!", "CaptainFandangoApr 30 at 11:35 PM\nGood, but a bit pricey\n\nWands is, in fairness, a pretty cool game. The tactical loadout, strategic combat and fast paced game play all add up to a pretty interesting experience.\n\nBut the reality is that this is purely a multiplayer experience. I know they put in an A. I bot to play against, but there is nowhere near enough depth in that gameplay to call it a single player mode. That means that if no one else is online playing when you want to play, then you simply do not have a game.\n\nThats where the issue of price becomes relevant. This is honestly the first time that the price of a game has ever affected my enjoyment, but I just cant shake the feeling that this should have been priced much more in line with Skyworld Kingdom Brawl. That had all the same considerations, but far from leaving a bad taste in my mouth because of being overpriced, its become one of my favourite games.\n\nEDIT: The game is really, really fun and the skill/strategy mix to the gameplay is just great, and the community on discord is really engaged. I still think its too expensive, but its not bothering me as much now.\n\nHelpful | 10\nDeveloper ResponseMay 4 at 7:51 PM\n\nThanks for the review, CaptainFandango. We're happy to hear that you're enjoying the game so much now :) We're improving the AI in a new update that's coming later this week, which will make it a lot more interesting!", "Maktoxic076Jul 4 at 3:46 PM\nI love It\n\nThis game is amazing\n\nHelpful | 4", "wpolofrik1Apr 1 at 8:38 PM\nImmersive, addicting duels and tactics\n\nDid not expect this to be great: A buddy and I bought the game and dueled for 90 minutes, time evaporated we were so into it. Spells were interesting, unfortunately some of the obvious combos dont work together (like prison and poison). 3 people could probably fit into each battlefield, why not allow brawls? Still- best multiplayer experience Ive played on Quest.\n\nHelpful | 21\nDeveloper ResponseJul 9 at 2:56 PM\n\nWe appreciate the feedback, wpolofrik1. We hear you!", "OutlawSoonMay 7 at 11:29 AM\nAmazing Game\n\nThis is the best VR game Ive played. Its challenging, strategic, extremely fun and has a supportive community on Discord that really sets it apart. The replay value is huge, and Ive yet to find a game that remotely compares to it. Buy.This.Game.\n\nHelpful | 6", "jzap5Jun 21 at 10:56 AM\n\nThe game is amazing.I love it its probably one of the best experiences Ive had in VR.\n\nHelpful | 3", "C4nn4bis-TentaculaMay 3 at 1:56 PM\nThe perfect VR game\n\nI started playing VR a few weeks ago and I was really enjoying it; I bought this game a few days ago and now Im LOVING it.\nUnlike other VR games that are fun to play around with every now and then, this game gets you invested in creating and testing new builds and strategies. I like to think of it as the perfect cross between Chess and DotA2/League of Legends, where you get to live out your Harry Potter fantasy in VR.\nI get easily sick of games where it feels like youre just going through the motions over and over again, but the number of possible spell combos and the ability to play against other human beings keeps you on your toes and excited for every duel. The AI improves as you do, making it a sufficient opponent to practice against. I also love that dueling other people is a no-stakes activity; every loss is just an experience to learn from. Matches are only 3.5 minutes max, so if youre getting stomped its no big deal.\nThe game play takes a little getting used to, and finding a build that works for you takes some experimental effort - but once youve got the hang of things, youll find this is one of the best VR experiences out there. I highly recommend checking out Magic VR on YouTube; he has some great videos with some advice to help you get started. As mentioned by other people in reviews, it would be great to have something to do while waiting to be matched up with a dueling opponent, and obviously the more spells and courses, the better!\nProps to the developers, you guys did a fantastic job!\n\nHelpful | 4\nDeveloper ResponseMay 4 at 8:00 PM\n\nThanks for the amazing review and feedback! If you haven't already, we'd love for you to join our community at www.discord.gg/wands!", "MaoserJun 7 at 9:16 PM\n\nGreat game to get your wizard duel on. It takes practice to manage your mana and movements, but it's fun and so rewarding when you get those wins.\n\nHelpful | 3", "Mr_hespicableApr 29 at 1:37 AM\nA good game but...\n\nFirst off, this is an amazing game. The mechanics are really good. When I started off, the game taught me how to play and I got into it quickly. One thing I would like to see is to be able to teleport with both hands, not just one. Like I said, a great game and I definitely recommend it.\n\nHelpful | 5\nDeveloper ResponseJul 9 at 2:51 PM\n\nThanks for the feedback! Today's update adds the ability to teleport with both hands", "T.H-HMay 7 at 10:31 AM\nFull of wonder, skill and strategy.\n\nI got this game in early January on the Oculus Go. Really good graphics, high definition, smooth movement and a good progression.\nWhen you first start you will gain Relic Dust which currently is only used to get different wands and different outfits. These items are aesthetic only and do not affect your gameplay.\nAlso, you will earn Spell Tokens to get additional spells to place on your wand. Before too long of playing, you will have gained enough tokens to have all the spells available. In the early days it is more a question of in what order do you want to get the spells. As you progress you will gain an additional two wands up to a current total of three. Each of these can have a different spell set-up/combination that you create to use depending on what type of match/duel you find yourself in.\nI found the learning curve of this game, incredibly steep. When you decide to use the portal to find a duel, you also have the option to explore the different arenas, duel the AI (Artificial intelligence), use the practice hall or play a friendly duel. I would encourage using these options to get a feel for the game, before offering yourself up to duel anyone that is available at that time.\nThis is not a classic FPS. There is a lot strategy, anticipation, manipulation, planning of how you are going to duel. This will change each duel as the player and their wand setup can change, as well as the arena the duel takes place in. There really is a lot to this game; it is definitely a thinking persons game, not a run around firing off spells and hope to win.\nHaving said that, there is a dedicated Discord forum for Wands which is incredibly useful and helpful. All the members of the forum are friendly and knowledgable. They will help and support in any way they can.\nWhen you first start off in this game, you will almost certainly begin a significant losing streak. This will last until you have played many duels, against many different opponents in all the different arenas. However, stick with it and use the discord forum. You will grow and develop and all of a sudden, the game will be one of, if not the best games you have.\n\nHelpful | 3", "OcularMigraineMay 6 at 8:38 AM\nMy favorite VR game\n\nI've been playing Wands for a few years now and enjoy it so much that I play at least several times a week, and often even more. The spells are spectacular and a joy to fire at your opponents and try to defend against when they're coming at you (there's nothing like bouncing a giant meteor off your shield, or dodging a blast of lightning!). You have a lot of spells to choose from, which means that you can make a huge number of combinations in your loadouts. The teleportation tiles work well in this game, since you use them strategically for placing spells, predicting where your opponent might go next, and picking the best ones for escape or sudden attacks. It's an exciting, fast paced game that will allow you to hone your skills at dueling. The community is also terrific, with many people happy to help new players get the hang of it, and I've made many friends who also like to play.\n\nHelpful | 3", "bdeissJun 8 at 10:19 AM\nWizarding duels are magical!\n\nSo much fun, lots of strategy! P.s. sidestepping and dodging is effective 90% of the time so give it a shot!\n\nHelpful | 3", "LennieBApr 10 at 10:41 PM\nQuite like it, balance and content meagr\n\nSo I quite like the game, people are often friendly. The skills combinations can be overwhelming but also feel meager. I feel that the quest players are often at a disadvantage next to go players, which I think is unbalanced. Customization also feels underdone and feels like it could use some expansion. Experimenting with different load outs is what has to give you a sense of achievement in the game. All in all I feel like it is a nice game, but skill is required to enjoy it to the fullest.\n\nHelpful | 3\nDeveloper ResponseJul 9 at 2:55 PM\n\nThanks for the feedback, LennieB! The #1 ranked player uses Quest, so you don't need to worry about Go being too powerful! Update: Today's patch includes a new (more powerful) control scheme for Quest, as well as other balance changes!", "Magic_VR_Apr 17 at 11:33 AM\nBest Multiplayer Game I have EVER played\n\nI Bought the Quest just to play this game ... Best Multiplayer VR Game ever created and I would put 10 Stars if I could. Imagine a game that would be a mix of Dungeons and dragons - Harry Potter - Chess and Pavlov ... There is a reason why it won the prize **Game of the Year** by IMGA...\n\nIf you read other review, some people complain that there is no use of the left hand... Fake news ... Left hand is used to do snap turn, re-center and can also be used to teleport. The developers are doing an incredible job at improving the games with updates all the time\n\nIf you are a real gamer and love challenges you will love this strategic game. I have been playing this game for over a year and I'm still learning new strategies everyday. Check out my YouTube Channel ( Magic VR ) to see my gameplays and learn the basics of this game.\n\nHelpful | 23\nDeveloper ResponseMar 21 at 2:12 PM\n\nThank you so much, Magic_VR_! And congrats on your THREE championships! Anyone who is looking for tips to improve should check out his YouTube channel. It's full of great content!", "tom.florentin.frMay 21 at 1:51 PM\nVery great looking, cool game\n\nBest graphics Ive ever seen on the quest.\nSo beautiful game !\n\nDevelopers, can you add geastures to cast a spell ?\n\nI love this game.\n\nHelpful | 5\nDeveloper ResponseJun 1 at 7:18 AM\n\nThanks for the feedback, tom.florentin.fr!", "TheVeggieSlayerMay 5 at 4:23 AM\nPolished\n\nThis game is highly polished and feels smooth. It has very intriguing game mechanics that make you want to improve your skill. It also supports Cross-Play with pretty much every VR headset that exists, so it's a great way to play with friends.\n\nHelpful | 3", "pheonix.maccllumJun 23 at 10:31 AM\nits not bad\n\nHello\n\nHelpful | 2", "KiritsuyMay 8 at 12:07 PM\nSo far, so good.\n\nI haven't played much so far, but so far I'm loving this game. My only request is to include a story-mode of some kind. Even something as basic as Towers like in Mortal Kombat would be cool.\n\nHelpful | 2", "johnnyotvMar 17 at 7:56 AM\nGets better and better\n\nI still maintain that this is the best game in VR. I played on the Gear VR for awhile and now have a Quest, it is even more magical than before, and it's still 'hockey chess' as a fast and furious strategy game. I love being a part of the community as well!\n\nHelpful | 11\nDeveloper ResponseMar 21 at 2:08 PM\n\nYou're amazing, Johnny! Thanks for all that you've done for the community.", "awesome.lueApr 18 at 11:22 AM\nI want a refund\n\nI was looking for the Wizard game. & this is nothing like what I wanted. There's only one profile, so IF there was a tutorial & my kid watched it, then I completely missed out on it. I played a few rounds against the AI and I really don't like this game. It took me forever to try playing it & now it's probably too late to get a refund but I really want one.\n\nOut of all the games I've bought for Oculus Quest, this is the only game I sincerely regret buying & I wish I could undo\n\nHelpful | 5\nDeveloper ResponseApr 19 at 3:41 PM\n\nYou can restart the tutorial from blackboards in the Workshop. Just click on \"Options\" then \"Reset Tutorial\"", "gbr90May 10 at 5:17 PM\nFeels like youre Harry Potter\n\nIts really nice, its strategy and accuracy. Would be great if we could have something more useful on the second hand\n\nHelpful | 2\nDeveloper ResponseJul 9 at 2:48 PM\n\nI think you'll like the new update ;)", "A10dency2noobMay 30 at 4:41 PM\nGood game just not what I expected\n\nIt's a great game don't get me wrong but the player base is tiny\n\nHelpful | 2\nDeveloper ResponseJun 1 at 7:24 AM\n\nHey A10dency2noob. If you're having trouble finding an opponent, you can check https://www.wandsgame.com/ongoing-matches/ to see who is currently playing.", "kem423Dec 19 at 11:08 PM\nFun game. Single hand use not so much\n\nWhen I first got this I was disappointed. I thought it was lame and did not make good use of the Quest compared to other titles Ive played. Then I kept playing, and playing, and playing some more. The more I played and started customizing my wand(s) and play strategies I realized wow, Im having a great time and this is a lot of fun. The people I have played against have been awesome too. I played against someone who was a Grand Master and destroyed me but it was still a lot of fun. It was satisfying to get some good shots in here and there and learn from how he was playing. I wasnt discouraged at all, even though he beat me 13-0. This is a great game and I am giving it 4 stars for graphics, replay and fun factor. I just wish my non-wand hand wasnt just a limp noodle that really does nothing. Even if it were to be used to grab health or power ups that would be better than nothing. Dual wielding wands would be epic. Defense and shields in one hand and offensive firepower in the other, or whatever combination you can imagine.\nThe online duels is really where this game is fun. Trying to outsmart and predict the moves of your opponent is so much better than playing against AI. I like the building and customization of spells in the wand. It is fun to figure out which combinations work best for my style of play.\nAs others have mentioned, team duels or in my opinion multi-player magic frag fest would be great.\nThis is not a game that you will really use the 6dof to move around like you might be used to on other titles but it is great fun and an enjoyable experience.\n\nUpdate...the newest update as of 12/18/19 has use of both hands with the non-wand hand used to select the tile you want to teleport to. Honestly, this is weird since you still have to point your wand at the space and pull the trigger to teleport. There really is no need whatsoever to use the non-wand hand for teleporting unless you can do the entire teleport mechanic with that hand and simultaneously use the wand hand for attack and defense. Sorry DEVs this is just not a useful mechanic as it currently is.\n\nHelpful | 92\nDeveloper ResponseJul 9 at 3:52 PM\n\nDid someone say \"dual wielding wands\"? Check out the new update! :D", "OccyRingMay 19 at 5:18 AM\nSo much fun!\n\nLove this game\n\nHelpful | 3\nDeveloper ResponseMay 25 at 11:27 AM\n\nThank you!", "CSAdamsFeb 25 at 7:03 PM\nScared, Potter? You wish.\n\nIf youve ever wanted to experience what itd be like to battle wizard-style, this is it! Allows you to quickly develop your own style and gets the competitive juices flowing. Could the spell-casting system be more involved?sure, but well take what we can get til then. \n\nHelpful | 11\nDeveloper ResponseMar 9 at 3:24 PM\n\nThanks for the review, CSAdams! Feel free to send suggestions to support@cortopia.com or to post them on the Wands Discord at www.discord.gg/wands", "trace_onMar 25 at 12:46 AM\nAddictive - when you play with friends\n\nThis is a really fun game. It's fast paced, it involved strategy and you definitely need to think and plan. I play with friends and I really enjoy to see how we all grow together in our way of playing and how we develop strategies and then come up with ways of foiling our opponents'.\n\nMy only complaint is that there's a fixed number of arenas that never change. I wish the developers added a new one every once in a while - either free additional content or paid. Or, in an case, modify the current arenas to add variety.\n\nOverall, one of my go-to games!\n\nHelpful | 1\nDeveloper ResponseApr 1 at 9:44 AM\n\nThanks for the feedback, alex.palacios. More arenas sounds like a good idea. :)", "Echo1124Jun 30 at 7:43 PM\nPretty good, for Vr\n\nThis game is good. it definitely has the potential to be better, but so far i love it. more spells would be nice, and i hope to see new maps. AI enhancement would be nice, and i would like to see the timing on attacks reflect on how the shielding mechanisms work. i shield, it doesnt block if the projectile is within 5 ft of me. little annoying, but i love this game. maybe enhance the sound awareness all around you. itll help hear incoming fire. Thanks!!\n\nHelpful | 0", "packofstainsMar 18 at 1:06 PM\nAmazing game. Stunning design.\n\nI have only been playing wands since this morning, but it is so safe to say, this game is amazing. The graphics could be improved in certain places, but the design and colours make for a truly amazing experience. I was surprised when i got connected to my first opponent, i wasnt sure anyone was playing. But as it turns out, there is a huge fanbase and playerbase, so youre never alone. And finally, the customisation. I do believe that the developers for this game are working on more spells, more wands, more costumes etc., but even now, the customisability is amazing. There are so many combinations and strategies that you can try and experiment with, that its actually wonderful, and provides so much replay value, as if there weren't enough already with the infinite opponents and duels. And the vest part? It's cross-platform!\n\nHelpful | 3\nDeveloper ResponseMar 21 at 2:23 PM\n\nWe're so happy that you're enjoying the game, packofstains! And you can rest assured that we are working on another update! Feel free to join our wonderful Discord community at www.discord.gg/wands, if you haven't already :)", "MellzebubApr 17 at 4:28 AM\n\nThe game is great. The only thing I would wish for is some kind if story mode/singleplayer.\n\nHelpful | 2", "PyrowhoJun 26 at 9:42 AM\nJust the beginning\n\nIve played this for only one day now. So far the game plays, looks and feels really good!\nThe accuracy is amazing, the spells are really quick and amazing to see.\nOverall thats five stars.\nWhy I gave it four stars?\nThere should be more; more players allowed to play at once. Maybe three vs three\nThere should be more levels that force you to move like the temple level with the sand storm.\nThere should be a story mode as well.\nOverall the game is totally worth the purchase. Just giving an idea as to what may help you earn more fans and revenue keep It up. Cant wait for the update!\n\nHelpful | 0", "BLACKJACK-GREENFeb 23 at 9:58 PM\nYou'll have fun\n\nI've been playing awhile now so I know my way around. The waves discord community is awesome and will take time with anyone who wants to master the game. People from all over the world play so it's a great way to make new friends also. I encourage everyone to buy this game and join the fam.\n\nHelpful | 8\nDeveloper ResponseMar 9 at 3:22 PM\n\nThanks for the review, BLACKJACK-GREEN! We're lucky that you're part of the community. :)", "sunny.kunaJun 21 at 7:44 PM\n\nMeh its okay\n\nHelpful | 0", "DraconicLightningMar 22 at 5:38 PM\nEverything one could wish for\n\nThis is such a fun game. It will make you push your problem solving limits as you battle. Be aware that though any first time player will probably suffer many defeats, you will soon get better. Overall, an experience that makes you come back for more\n\nHelpful | 3\nDeveloper ResponseApr 1 at 9:39 AM\n\nThanks, KyberLeader. Sounds like you're on your way to the top!", "CwendellMay 3 at 10:44 AM\nAmazing\n\nThis game is so fun, however, it gets a little repetitive.\n\nHelpful | 0", "saltyspencerJun 22 at 6:53 PM\nGood game but some issues\n\nSo this game is great, there is a lot too it and it is overall pretty fun !! The only things are that the hand tracking isnt super and when you look at other opponents their hands/arms are glitches meaning they are dangling everywhere (this isnt horrible but still there) and the teleporting is a little bit off\n\nHelpful | 0\nDeveloper ResponseJul 9 at 2:46 PM\n\nThanks for the feedback, saltyspencer. Your opponent's arm movements will be much more accurate in the next patch (coming soon). Update: Today's patch improves this issue significantly! Please let us know if you're still experiencing issues.", "TyGuy23Apr 30 at 3:20 PM\nAddictive\n\nWands was so addicting on day one it it didnt feel like a grind to get tokens and powder\n\nHelpful | 2", "Harcourt.MuddApr 4 at 5:56 PM\nIt's not as good as these reviews say\n\nOpponents are people or AI bots, and the AI bots do NOT train you to play very well. Great concept but in execution I don't find it enjoyable or bringing me back for more. Real life opponents are always way above my skill or I can fight the AI which is way below. Not sure how the game finds opponents but it feels like first come first served. A lot of other people seem to enjoy it but if they had a demo I think they'd only have half the sales. Save your money if it's not on sale, and even then you should save yourself the wasted time.\n\nHelpful | 1\nDeveloper ResponseMay 25 at 12:15 PM\n\nThanks for the feedback, Harcourt.Mudd. We're working on improving nearly all the issues you brought up. We hope you'll try the game again in the future and tell us what you think! Update: We've improved the AI significantly! You can now choose its skill level. At the highest difficulty, it will be much more challenging than almost any human player, so you can get plenty of practice against a tough opponent without having to duel real people. Also, the matchmaking is based on your skill level.", "HunshiMay 6 at 11:06 PM\nStarting to get mad\n\nYou buy a game and they fail to tell you no one plays it. And since its in a bundle you cant return it. Im honestly going to return my quest and stay away from VR till they stop peddling crappy games.\n\nHelpful | 0\nDeveloper ResponseMay 7 at 1:47 PM\n\nWe're sorry to hear that, Hunshi. We just released a new update that makes the AI way more fun to duel, so you can give that a try. And right now, there are lots of people dueling! It sounds like you were online at an unlucky time. We hope you can give the game another chance.", "BloodrenFeb 16 at 9:47 AM\nGreat game / Supportive community\n\nBought this game only today but I have had no issues with matchmaking, I get paired with some one with in 1 minute of match making. I love the combat and the teleportation is alot better than I thought it would be. It is a very tactical game trying to anticipate ur enemy's next move and not wasting ur mana. The community on this game are also very nice and supportive which is a big + for this game.\n\nBuy it and try it out, its definitely worth every penny.\n\nHelpful | 4\nDeveloper ResponseFeb 20 at 7:27 AM\n\nThat's great to hear! It sounds like you've found our Discord server (www.discord.gg/wands). The amazing community definitely makes the game more enjoyable!", "WiseScryerNov 25 at 10:30 AM\nThe core components are Assembled\n\nIn this game you play a witch who lives in the underground of magic. Peripheral lore tells you that Magic is hunted and frowned upon in society, and that being discovered is a quick way to a fiery death. However, using portals to pocket dimensions, witches can duel each other for power and practice their magic safely.\n\nAnd that all you do, you engage in duels against other spell casters in various arenas, unlocking spells as you do, and creating a magic strategy to defeat your foes. The controls are intuitive, the magic is creative and unrestricted in most ways, the art design is engaging, and the level designs are more than they appear in most cases, and are, importantly, unique from each other.\n\nThe scope here is narrow but well executed. People will complain about the matchmaking, but this is mostly due to the currently limited player base, not the fault of the programs or the Devs. But, again, the scope is narrow.\n\nAside from customizing your witch, customizing your spells, and customizing your wand appearance, you will be doing one thing and one thing only, dueling other witches. And that is the only place this game falls short. To see these mechanics used in a narrative, even a railroaded narrative, would be sublime.\n\nThe Core Components for something out of this world have clearly been assembled by the Dev team. My only fear is that they may stop stirring the cauldron too soon.\n\nHelpful | 78\nDeveloper ResponseJul 9 at 4:21 PM\n\nThanks for the amazing review and detailed feedback, WiseScryer! We really appreciate it. And we're still stirring the cauldron...", "tanner.vegetaMay 6 at 7:03 AM\nDisappoint\n\nI thought it will do play shooter and RPG. So just a simple shooter to AI and dual. That all. Pffft.\n\nHelpful | 2", "GAMER360DTBMar 31 at 6:35 PM\nFriend me plz\n\nLove the game but would be ten times more fun with friends so if someone could friend me on the game we could have some fun\n\nHelpful | 2", "ChefBoyard3Apr 7 at 10:59 PM\nFun but the price...\n\nListen. The game its fun..... For a few hours. I mean the game had me at first but theres just not enough content to be a $20 game. If the price was lowered then I would give it five stars.\n\nHelpful | 0\nDeveloper ResponseApr 16 at 9:59 AM\n\nThanks for the feedback, ChefBoyard3. We understand. Fortunately, the game has lots of replay value. Some players have played over 10,000 matches! So if you enjoy the game and keep playing, you're sure to get your money's worth!", "E-LightningFeb 1 at 10:47 AM\nI really like this game!\n\nIt has a great 1v1 way for battle with a variety of spells! Since you teleport you dont get sick which is great! Its my first competition vr game that works great!\nRecommended improvements:\n-more ways to customize your avatar\n-design your lobby room with things you can get through challenges or ranking up, or with points\n-more spells are always good\n\nHelpful | 5\nDeveloper ResponseFeb 20 at 5:09 AM\n\nGreat feedback! Thanks!", "AmberbluepoisonJun 22 at 3:03 AM\nGood but sad\n\nI love this game and everything about it but ibwish there was more to do rather than just duling. And also I would like to see more customization options\n\nHelpful | 0\nDeveloper ResponseJun 23 at 12:31 PM\n\nMore customization options are coming in future patches, Amberbluepoison!", "Wkolo_VRApr 2 at 1:13 PM\nGood\n\nVery good grafics, and gameplay.\n\nHelpful | 3", "DiamondNinjaJun 23 at 5:58 AM\n\nI love the game but if there was more choices for wands, Avatars and magic skills I think it would be much better. Also if the developers added a story mode and a multiplayer story mode I would rate it a higher rating. As for now I believe my rating is good for the game.\n\nHelpful | 0\nDeveloper ResponseJun 23 at 12:27 PM\n\nThanks for the review, DiamondNinja. More items to unlock will be added in future patches.", "AnonymousAddictJun 2 at 11:17 AM\nCould be amazing\n\nThis game is pretty cool, and would be amazing if:\n\n1. they had user profiles so other people can play without messing you up\n\n2. I know this might be a little complicated to do but a team mode would be cool, with a larger play area\n\nHelpful | 0", "Mark-BlissJan 26 at 8:19 AM\nGreat game\n\nA great game, very fast and hard to get the controls together. Sometimes it moves so fast that it causes you to push your controller in the wrong direction and miss things it takes lots and lots of practice. However it does get easier its just there are so many people out there much better than me that I have face the fact I will always lose. Dont be afraid to try this game its worth the money\n\nHelpful | 2\nDeveloper ResponseJul 9 at 3:04 PM\n\nThanks for the review! Pretty soon, you'll be one of those people you mentioned! :D Update: We've added a new control scheme to the game that's easier to learn", "NicoliDarkkJun 23 at 5:50 PM\nDidn't like it...\n\nI played Unspoken on the Rift and was hoping/expecting a similar experience. The main problems that I have are training and the fact that your second hand is basically useless. It shows you around but that's it. Basically here's your wand, go forth and get wrecked. I played about 5 matches and all 3 of my opponents had dragons breath and just teleported up to me and blasted me. The spell is way OP and needs to be nerfed. It needs to consume more mana or something.\n\nHelpful | 0\nDeveloper ResponseJul 9 at 2:44 PM\n\nThe second hand is no longer useless! Now you can use a wand in each hand!", "LinYao2008Mar 19 at 9:22 AM\nJust great\n\nOne if the best pvp vr games out right now\n\nHelpful | 3\nDeveloper ResponseMar 21 at 2:12 PM\n\nThanks, LinYao2008!", "Goatpuppies592Mar 16 at 7:46 PM\nVery fun\n\nIts very fun but there should be more spells and wands\n\nHelpful | 1\nDeveloper ResponseMar 21 at 2:07 PM\n\nWe hear you!", "SharqFinJan 9 at 9:26 AM\nBe wary of multiplayer vr games\n\nI was really excited for this game. Turned it on and ran through the tutorial, only to find out that the primary mode is multiplayer (an oversight on my research before buying.) With most games, a primarily multiplayer game is fine, even if you dont have friends to play it with u. Well, in the current state of VR, the odds of you matchmaking with someone else playing that same game at the same time in a region close enough to have a good connection, are very low, due to the low of amount of people that own vr systems. So with that in mind, don't buy this game if u expect to be able to just hit Play in multiplayer and instantly find an opponent. I sat there for half an hour and found no one.\n\nThere is a AI match you can play that yields actual exp like normal matches, but I'm not really into that. It's very unfortunate the developers can't do anything about not having players to play against.\n\nHelpful | 16\nDeveloper ResponseFeb 20 at 7:14 AM\n\nWands has a strong playerbase for VR. Fortunately, it's easy to find opponents during peak hours, but it's true that there are times when it's difficult to find an opponent. The AI helps fill the gap, but since you're not into that, you can check out the Wands Discord, at www.discord.gg/wands, where you'll usually be able to arrange a match with someone.", "MoneybagvrApr 2 at 12:35 PM\nThe quest sleeper\n\nUpdate\n\nDont sleep on the this guys\nThey make games u will keep coming back too..\n\nFirst replayability check\nSecond price 19.99 US. Not bad\nThird yet so important (people) check join the discord wandsvr and you will see it like a family they work together to make u the best at the game\n\nThe things it need to work on More dlc\nEx. boards\nbetter AI\nand for the hard core wands player more tournaments\nAnd try out\nDown the rabbit hole\n\nHelpful | 11\nDeveloper ResponseDec 28 at 10:53 AM\n\nThere's been a huge influx of new players recently, so you shouldn't have any trouble finding someone near your skill level right now! And there are lots of great players on the Wands Discord who like to help new players out. If you want, you can join us at www.discord.gg/wands.", "claytonmoore9717Apr 29 at 8:23 AM\nGood solid entertaining game\n\nThis is a great game for experienced or new to br players you can play online or practice against AIs either way rewards xp and dust to obtain new spells wands or costumes. It's full of entertainment as you can build your spell list and find the best combos that help you win. I've only just downloaded this game and am already raving about it.\n\nHelpful | 0", "AlexGrifeFeb 2 at 3:03 PM\nPretty good\n\nI wish It was more Than just point and click but it has good graphics a lot of spells wands characters and maps over all a very good game but it is mostly just point and click I wish you were able to grab things and move them.\n\nHelpful | 0\nDeveloper ResponseFeb 20 at 7:16 AM\n\nWe hear you. Thanks for your feedback!", "KeyBladeLegendsFeb 22 at 10:06 PM\nGood game but has the Worst controls\n\nThis game has a lot of potential to be very good but the one thing that holds me back from liking it is the controls and mainly having to do with spell switching. You could adapt them to the buttons and have them like that but I find myself switching spells to one that I want very frustrating with the analog stick. This would open up a solution to my other problem which is teleporting. The fact that you have to hold the button to teleport comes with major drawbacks but I'm not as upset with that because I can get used to it. I hope in the future we can get different control schemes to enhance the experience. I want to like this game but I just get the controls down.\n\nHelpful | 1\nDeveloper ResponseJul 9 at 3:02 PM\n\nGreat feedback! We've redesigned the controls from the ground up! Spell switching is now a thing of the past. And Teleporting is now much less cumbersome. We really hope you'll give the new Dual Wands control scheme a try", "dothedew8Feb 24 at 9:46 PM\nAmazing game\n\nThis game is amazing but the only thing is that it takes a long time to find a matchup even though I have full bars\n\nHelpful | 2\nDeveloper ResponseMar 9 at 3:23 PM\n\nHey dothedew8. The busiest times tend to be around evening in the US. And you can check if anyone is currently waiting for an opponent here: https://www.wandsgame.com/ongoing-matches/", "norabbitsFeb 14 at 3:05 PM\nGreat...if it wasn't a VR game.\n\nThe Quest has everything you need to conjure virtual magic with a wand: microphone for spoken spells, movement detection...on both hands, and yet \"casting\" is done by nudging a thumb joystick. Graphics and gameplay are fun, but it just doesn't feel...magical.\n\nHelpful | 1\nDeveloper ResponseFeb 20 at 7:26 AM\n\nThanks for the review! I get where you're coming from. Spoken spells is a fun idea, but I don't think it's very well suited to this particular game, since Wands is about fast-paced combat.", "The_Lord_Of_CinderJan 7 at 2:29 PM\nMy Favorite Game On The Quest\n\nI wasnt sure as to whether or not to buy this game after looking at a couple reviews that complained about bad matchmaking and limited gameplay. These first of thise reviews is FALSE. Every time I search for a match I find an opponent in under a minute. Additionally, they added a feature that lets you fight AI in the matchmaking area (which is essentially target practice, but still fun). The game itself works wonderfully in VR and is done well, but as some other people have said, its essentially an online-only game. However, if you dont have a problem with playing against other players this isnt a problem. The game is highly replayable and there are many, MANY viable builds/spell combos to make and test out. Overall I highly reccommend this game to anyone with a VR! Good Job Devs!\n\nHelpful | 4\nDeveloper ResponseJan 7 at 2:07 PM\n\nThank you so much, Athena-! If you'd like to join the community at www.discord.gg/wands, we'd love to have you!", "BlackysBroFeb 20 at 4:32 PM\nGood but hard\n\nIve played a few matches and it is really fun but playing against other players can be really hard.\n\nHelpful | 0\nDeveloper ResponseMar 9 at 3:11 PM\n\nKeep at it and you'll be a pro in no time!", "SessavonJan 3 at 12:17 AM\nWonderful performance - bad matchups\n\nEverything about the game is wonderful, but there is one problem I keep coming across: pvp matchups put new players against very experienced ones. Because of this, new players dont get an appropriate learning curve and often want to quit because they have no chance at winning. They dont know the spells or counters and lack the control that is required to oppose an experienced player. Before they can even practice on the player, they are killed.\n\nAdditionally, the player base is rather small so matchups take a minute to find. This is yet another reason new players get screwed. They cant be paired against new players so instead they go against whoever joins. More often than not, that player is experienced. Kind of ruins the game for new people.\n\nHelpful | 4\nDeveloper ResponseJan 7 at 2:05 PM\n\nWe hear you, Sessavon! The game does have skill-based matchmaking, but if nobody near your skill level is looking for an opponent at the same time, you'll eventually get matched up against whoever happens to be online. Fortunately, a lot of the veterans are really friendly and love helping new players learn, so I'd suggest turning on voice chat.", "magnelectroApr 1 at 7:32 PM\nNot impressed\n\nJust not that great for the price.\n\nHelpful | 2", "corgiwizardMar 7 at 9:37 AM\n\nIts fun with friends\n\nHelpful | 2", "ElDropsoFeb 23 at 5:11 AM\nFriend invitation\n\nReally nice game. But how can I invite my friends for a duell?\n\nHelpful | 0\nDeveloper ResponseMar 9 at 3:21 PM\n\nYou don't have to invite your friends! Just host a friendly duel and then have your friend choose to join a friendly duel. They'll see your name and will be able to join you. If you want more detailed instructions, please contact us at support@cortopia.com", "Adam793Dec 29 at 10:28 AM\nVery Fun\n\nI love this game! I kept seeing that there were lots of events for this game and it was on sale so I thought I would give it a shot. Also Im a big Harry Potter fan so this looked pretty cool. Anyways, I got it and wow, this game is so fun! The graphics are good, the maps are fantastic, and all the events that happen with the map each match are really cool. This game is super fun and addicting and is the closest vr game to Harry Potter on the quest. Thanks so much for this game devs!!! I will keep coming back to this game for a long time. Now, back to unlocking more fantastic spells...\n\nHelpful | 3\nDeveloper ResponseJan 2 at 2:10 PM\n\nThank you so much for the review! We're glad you're loving the game :)", "azllazFeb 14 at 11:54 AM\n\nWhen you start they put you with the hardest opponents, and when you fight the ai you cant hit them directly you have to whether there mana down to hit them or use some thing that can blow up. But in the end its a good game\n\nHelpful | 0\nDeveloper ResponseFeb 20 at 7:18 AM\n\nThe game has skill-based matchmaking, so if someone close to your level is looking for an opponent at the same time, you'll get matched up with them. But it sounds like only experts were on when you were playing. Thanks for sticking with it!", "PasdorDec 30 at 9:52 AM\nMust have title\n\nThis games so fun! Ignore the people that cant find matches, I find a match in seconds, the spells are creative although I wish there were more basic ones, the game is very strategic and you sometimes have standoffs trying to figure out what to do while defending its honestly so fun. Ive met a few people they were nice and I even helped someone (because you get put with players a similar level to you)\n\nIn conclusion buy it, the reason its four stars is because the teleporting is hard to aim which is quite bad in strategy games like this, also Id like more spells (if the devs see this I only counted 25 spells but you said theres 26 do you unlock a new one at a higher level?)\n\nJust got into around level 8-9 and people use the same to spells repeatedly, theres no cool down, hopefully Ill be able to play with friends and good players again soon\n\nHelpful | 0\nDeveloper ResponseJul 9 at 3:05 PM\n\nThanks for the review and feedback, Pasdor! The 26th spell is Teleport, but there's been some debate in the community about whether that counts as a spell! Update: The new Dual Wands control scheme makes Teleporting much easier. We hope you'll give it a try!", "brallan.chikueJan 1 at 8:34 PM\nGreat just amazing\n\nThis is the best game but I just need more options for the waaand please the wand plus spells to play or 2 Wands if you dont do that that would be always borring because we need real battleeeees more action and more maaapssssssss pleaaaaase duuudeees proos editorrrs thanks for the rest is a very good game and one more thing, to invited friends in the dojo and add friends dude seriously u.u and Moore characters seriously brooo seriously??? Pleaaaaaase that would be great good job guys\n\nHelpful | 2\nDeveloper ResponseJan 2 at 2:16 PM\n\nThanks for the review and feedback!", "hamza10203Feb 26 at 5:27 PM\nA very fun VR experience\n\nA very fun VR experience\n\nHelpful | 2", "michaelgnavApr 1 at 10:57 PM\nDont buy\n\nGame sucks\n\nHelpful | 2", "ralphaalpha325aJan 20 at 12:18 AM\nFor those about to give up on this game\n\nIf you have a vr and are looking on a desc for the game well im sry but i can tell you that at first this game may be hard but keep trying and have lots of fun\n\nHelpful | 3\nDeveloper ResponseJan 24 at 10:58 AM\n\nThanks, ralphaalpha325a. I hope to meet you in The Beyond!", "hightechfoolDec 19 at 11:44 PM\nSimple, straightforward, and awesome\n\nIf this had any sort of 'campaign' or story to it...would be an easy 5-stars! Aside from that, this game is pretty much perfect. Infinite replayability...easy to learn, and addictive gameplay. The levels are really unique and fun...all the details are well-executed. Highly recommend\n\nHelpful | 2\nDeveloper ResponseDec 28 at 10:50 AM\n\nWe really appreciate the review, hightechfool!", "Cheesecurls1227Jan 17 at 1:19 PM\nGreat game! Small prob tho\n\nResetting your position set you behind and to the left slightly, which means you have to walk back to the center. Otherwise, great game with awesome multiplayer!\n\nHelpful | 0\nDeveloper ResponseJan 19 at 10:36 AM\n\nDid you recenter with the Oculus button or with the X button? Recentering with the X button should always return you to the center of your tile", "idontgiveatruckDec 8 at 9:29 PM\nGreat game\n\nThis is a great game. I think the game is all there. The downside is matches aren't easy to come by. Maybe after Christmas when more people have it it will be better. Another thing the people could do is to update and make us see how many people are in matchmaking as we are online. This could help people who are curious. And I see some empty shelves so hopefully more spells to come. Overall great game just needs more users and more attraction for those times where there aren't any users online.\n\nHelpful | 5\nDeveloper ResponseDec 9 at 4:32 AM\n\nThanks for the feedback, idontgiveatruck. You can see if anyone is waiting for an opponent right now at https://www.wandsgame.com/ongoing-matches/.", "JonSnow97Sep 19, 2019 at 1:10 PM\nSuper fun and Addicting!\n\nI have been waiting for this release ever since i heard of it and let me tell you right now, this game? Lived up to the hype!!!! If you are on the fence about getting this gem, don't think, just buy!!! So far i only have 3 hours played but the replayability is phenomenal! There is a wand progression system and new charecters to unlock! 6 maps (hopefully more to come) and tournaments! The soundtrack is fitting and this is probably the best quest game i own right now! My only problem is the matchmaking. There is no way to invite specific friends to a game. And i found a bug where if you join a friends party via oculus menu and try to play a private match, there is no player audio. And if you leave the party, unless you reboot the whole game, you wont hear them. Other than that, the devs have givin us the best pvp/competitive wizard dueling game i have ever played. Please please support these guys and pick up this awesome game!!!! 5/5 for me :)\n\nHelpful | 218\nDeveloper ResponseSep 20, 2019 at 11:54 AM\n\nThanks for the wonderful feedback and for the bug report!", "notsomagnifacent11Jan 20 at 6:55 AM\nAmazing game, but one flaw\n\nThis game is amazing, I love everything about it but if it had more than one v ones like 2v2s or 3v3s it would be even better\n\nHelpful | 0\nDeveloper ResponseJan 24 at 10:57 AM\n\nThanks for the review and suggestion, notsomagnifacent11!", "Amazedgarlic804Feb 2 at 3:36 PM\nGreat game\n\nThis is a great game I just wish it had 3 or 4 player modes\n\nHelpful | 0\nDeveloper ResponseFeb 20 at 7:17 AM\n\nWe appreciate the review. And thanks for the feedback!", "ZethrockFeb 1 at 4:17 PM\nFun, but neess more\n\nMultiplayer is nice, it just needa a campaign or story mode\n\nHelpful | 1\nDeveloper ResponseFeb 20 at 5:09 AM\n\nThanks for the feedback, Zethrock", "vigoexisteMar 22 at 8:20 AM\nGreat but needs \"multi\" player\n\nCame here attracted by the multiplayer game where I wanted to battle my siblings only to realize it's just 1v1, which means taking turns.\n\nIs there the possibility of adding 3 or 4 player multiplayer (like Elven Assassin) in the near future? The possibilities are immense!\n\nHelpful | 0\nDeveloper ResponseApr 1 at 9:39 AM\n\nThanks for the feedback, vigoexiste. That idea is definitely on our radar!", "kilswitch10000Apr 1 at 4:08 PM\nGood game but...\n\nI like the game and the concept is amazing. My only problem with the game is the movement. I wish you could go any where in the arena,that would be much better way to move and would make the movement altogether more free.\n\nHelpful | 0", "ZliciousJan 11 at 11:32 PM\nHours and hours of fun\n\nI love playing \"Wands\" with my friends. We have so much fun trying to beat each other in the duals.\n\nHelpful | 3\nDeveloper ResponseJan 14 at 12:16 PM\n\nThat's great to hear, Zlicious!", "thatoneguy21Jan 29 at 6:23 PM\nGG\n\nThis is everything good in a magic VR game!!\n\nHelpful | 2\nDeveloper ResponseFeb 20 at 5:08 AM\n\nThanks, thatoneguy21!", "R0R_GuyMar 24 at 12:04 PM\nAmazing game, one problem though.\n\nI have only one problem with this game as a beginner player, the AI defense system. I cant cast a single projectile at an AI without them activated a dome or perfectly blocking it with the shield, other than that its an amazing game!\n\nHelpful | 0\nDeveloper ResponseJul 9 at 2:58 PM\n\nWe hear you! We've improved the AI so that it's not as good at blocking attacks at the lower difficulty levels.", "blinding-lightJan 29 at 4:02 PM\n\nIt's one of the best games I've tried\n\nHelpful | 2\nDeveloper ResponseFeb 20 at 5:08 AM\n\nThat's great to hear, Ulquiorra.net!", "JCsMagicLinesSep 19, 2019 at 2:15 PM\nDeep, Intense, Fun. High Replay Value!\n\nThis is one of the games that makes you think about timing, your surroundings, predicting your enemy's next move, dodging and figuring out what spell is best for the circumstance.\n\nIt can get pretty intense at times but because matches are short, they're highly replayable. 2-3 minute match duration seems like forever since you have to be hyper aware of many things as your opponent teleports around you erratically throwing you different type of spells and you figuring out how to counter them. It's a deep and fun game that you'll definitely come to and though it's not a physical workout, the intense matches seem like a mental workout. I recommend that you try this game out.\n\nAlso, their discord seems to be very active and welcoming.\n\nHelpful | 67\nDeveloper ResponseSep 20, 2019 at 11:56 AM\n\nThanks for the review, TheKingJC! We're very happy to have you on Discord. For anyone who wants to join us, the URL is www.discord.gg/wands", "AdjunxLynxDec 21 at 11:38 AM\nVery fun\n\nLove the game. Very exciting and love the idea. Would like different levels of ai difficulty to practice on but so good. Love to see more maps come out too\n\nHelpful | 3\nDeveloper ResponseDec 28 at 10:55 AM\n\nThanks for the feedback, AdjunxLynx. Different AI difficulty levels is definitely a good idea.", "icushmanDec 14 at 1:45 AM\nPvP only + tiny community = no game :(\n\nThe actual gameplay is strictly PvP only the AI is nothing more than target practice.\n\nThere's nothing to do in the PvP lobby but stand there. I waited for a few minutes with no indication that I'd ever get a game. Then I came here and saw there's a website that reports how many games are active. As I write this, that's zero games.\n\nThere may be a player base in some time zones, for players with some schedule. I don't know. All I know is I have a game in my library I'll probably never get to play.\n\nTo the devs: I'm rooting for you! It looks like you did an awesome job. The atmosphere is great, the spellcasting mechanics look fun. I bet figuring out the meta would be a blast. I just can't give stars to a game that's literally unplayable for me.\n\nHelpful | 3\nDeveloper ResponseMay 25 at 12:19 PM\n\nUpdate: We've significantly improved the AI and added difficulty selection. If you feel like giving the game another shot, be sure to challenge the new AI. I think you'll find that it's much more than just target practice now :) If you're looking for opponents but can't find any random players online at the time, you can usually find someone to duel on our Discord server at www.discord.gg/wands", "LilKubrickNov 13 at 11:33 AM\nAwesome PvP magic duels with friends\n\nHaven't seen many players on here but if you have a friend with a Quest, jump in here and start battling! Other than shooting guns or hitting a ball back and forth, there aren't many other engaging multiplayer games yet, and this one really shows the potential of the platform. If you don't have a friend with a quest, this isn't so great solo, but for battling your magical buddies, it's great!\n\nHelpful | 5\nDeveloper ResponseNov 14 at 8:08 AM\n\nThanks for the review, LilKubrick. We have a wonderful community at www.discord.gg/wands. Feel free to stop by if you'd like :)", "Apollo1-1Nov 26 at 10:53 AM\nReally really fun\n\nI would like it a lot more if the other players and my own movements were more accurate, the other players arms flail around a lot and its kind of annoying and I assume it looks the same for them. And it doesnt tell you how many other people are online so you dont know if youll ever get in a match.\nOther than that its a super awesome and fun game and would definitely suggest it to anyone interested.\n\nHelpful | 1\nDeveloper ResponseJul 9 at 4:17 PM\n\nThanks for the feedback, Apollo1-1. You can see who is online at www.wandsgame.com/ongoing-matches Update: With the recent patch, you and your opponent now move more naturally!", "Harrydog345Dec 25 at 2:24 PM\nAmazing game\n\nI would play this all the time if I could the quick start and helpful guide makes this game so fun and addictive\n\nHelpful | 3\nDeveloper ResponseDec 28 at 10:56 AM\n\nGlad to hear it, Harrydog345!", "triplejay2013Jan 6 at 10:00 PM\nGood dueling game\n\nFun to play. Better with friends. Simple mechanics but skill goes a long way.\n\nHelpful | 2\nDeveloper ResponseJan 7 at 2:07 PM\n\nYes, indeed. Thanks, triplejay2013!", "Alexgame11Dec 29 at 11:24 AM\nReally entertaining!!\n\nPretty competitive and entertaining! I like how strategy takes an important part to get the win!\n\nHelpful | 2\nDeveloper ResponseJan 2 at 2:11 PM\n\nYes, strategy is super important! Thanks, Alexgame11", "obi2kenobiSep 19, 2019 at 3:36 PM\n3 years later...\n\nStill playing and enjoying this game! I first got this on GearVR when it released and it was the only game that I consistently came back to and felt worth the hassle of shoving my phone in a case and overheating it in 10 minutes.\n\nI am so excited to have this on Quest and play with 6dof and the ability to dodge spells!\n\nWhy is Wands so great you ask? Well with the high number of spells and well planned maps, there is simply an infinite number of strategies you can take into a match, and people never quit inventing new ones (plus the devs routinely balance spells). You pick 4 spells for your wand, which basically fall under offense/defense/utility. Depending on the map and the distances between spots, certain spells will be more advantageous in certain areas, etc. Add to that the quick paced gameplay and it gets pretty thrilling.\n\nCortopia studios is also a great dev and are always listening to the community (much like the Sairento devs). I know in the past several of my suggestions made it into the game. Pop in the Wands discord to find matches, discuss strategy, or talk to the devs!\n\nIf you like competitive PvP this game is a no brainer. My other favorite multiplayer game for Quest, RacketNX, is priced at $20 as well so I feel Wands comes in at a fair price.\n\nHelpful | 30\nDeveloper ResponseSep 20, 2019 at 3:17 PM\n\nWe're lucky to have you in the community, obi2kenobi!", "K9SHAWN16Dec 29 at 2:07 PM\nMicrophone\n\nLove the game, but is there a microphone that goes with oculus quest\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:13 PM\n\nTo use voice chat in the game, make sure you have the audio permission for Wands enabled on the Quest. Then, in the Wands Lobby or during a match, go to the settings and enable \"Microphone\" and \"Opponent's Voice\". If you're still having issues with VoIP after doing that, please contact us at support@cortopia.com", "tedbrgrDec 19 at 11:38 PM\nGreat game\n\nThis is an amazing game! I recommend finding another friend who also play quest and fight against them because that is not fun!\n\nHelpful | 2", "daksh.jha.129Nov 25 at 10:17 AM\n\nGreat game really fun and exciting and easy to pick up. However, the player matching is flawed. In my first game I was matched up with a high leveled person. This game is fun but it is a little flawed\n\nHelpful | 2\nDeveloper ResponseNov 28 at 5:23 AM\n\nThanks for the review, daksh.jha.129. The game has skill-based matchmaking, but it sounds like the only player available at that time wasn't a good match. You can check www.wandsgame.com/ongoing-matches to see who is currently waiting for an opponent.", "HalfheadhalfdeadDec 31 at 3:30 PM\nGreat game!\n\nAdd more spells and stuff tho.\n\nHelpful | 0", "jasonrammalDec 22 at 11:48 AM\nMy favorite game on Quest\n\nWorth every penny 5/5\n\nHelpful | 3\nDeveloper ResponseDec 28 at 10:55 AM\n\nThanks, jasonrammal!", "Tiger-ClawSep 20, 2019 at 2:13 PM\nBest VR game on the market!\n\nI bought an Oculus Go about a week after it was released, and Wands was one of my first purchases. Little did I know, I would still be playing the game on a regular basis over a year later on the Quest. Like many fans of the game, I could talk about Wands for hours (and do so on the Wands Discord channel). But to keep it short, the game is incredibly fun and fast-paced, yet also very strategic. The best description I could give would be Harry Potter duels to the death on three dimensional battle-chess boards. The better you get, the more competitive it becomes, and before long you will find your heart pounding and hands sweating, wondering how the game hasn't become a televised e-sport yet. The Quest version was just released yesterday, but after a few hours of game play, it's pretty clear the developers hit it out of the park. Lastly, I have to add that one of the things that makes the game so great is the community of players. The game is cross-platform and the player base is international. Whether you're chatting over the microphone or on the Discord Wands channel, you won't find a better group. Don't get me wrong ... we take pleasure in annihilating one another. But you'll make some great people from around the world in the process.\n\nHelpful | 16\nDeveloper ResponseSep 20, 2019 at 3:06 PM\n\nThanks, Rahzar1! We really appreciate it!", "MoonflyerNov 3 at 12:26 PM\nReally gutted with the online play.\n\nSo, ill start by saying that wands is easily my favourite game on the quest so far.. but, I'm so disappointed with the online play which is pretty much all you play for. Ages spent waiting for another player in the lobby then if and when one finally turns up the matching is completely uneven meaning the new guy gets obliterated by the expert in seconds, that's it game over. Repeat 3 or 4 times until you realise that they really are completely unbeatable, leave the pairing to play someone new then get re matched up with them again as they're the only other player. I realise that you can only be matched with who's there so experience wise choices are limited but it's so frustrating. I'm keeping my fingers crossed for a whole load of new players at Xmas.\nIt would be brilliant to have a few more maps as well. I really need this as my only other game ( ultrawings ) is making me feel quite sick.\n\nHelpful | 11\nDeveloper ResponseNov 8 at 2:34 PM\n\nHey, sorry to hear you've had a tough time finding opponents near your skill level, Moonflyer. www.wandsgame.com/ongoing-matches shows a list of ongoing matches and waiting players. You can keep an eye on that page to see if anyone who looks like a good opponent is currently waiting. You can also join our Discord at www.discord.gg/wands. Typically, the game is most active during evening and night hours in the US, especially on weekends.", "XxsolarxXMar 19 at 1:59 AM\n\nIt a good game I just wish it had more spells to combo with other spells\n\nHelpful | 0\nDeveloper ResponseMar 21 at 2:12 PM\n\nThanks for the feedback, XxsolarxX!", "GroverGangSep 19, 2019 at 6:44 PM\nWhat oculus games should strive to be\n\nThis game is absolutely amazing and shows the amount of potential the oculus quest has. I am really looking forward to the idea of them adding 2 player duels or free for all. Anything other than 1 vs 1 would be great.\n\nThis game inspires some confidence that there will be rpg multiplayer games like this in the oculus. But other than that the moment you play everything works perfectly. The feel of the game is very comfortable from the beginning of play.\n\nHelpful | 13\nDeveloper ResponseSep 20, 2019 at 11:58 AM\n\nThanks, GroverGang!", "WDG_dahdumbguyDec 6 at 9:10 PM\nNo one is online...\n\nIt take up to 30 minutes to get into a match. How can you have a multiplayer game without an active community? I wish I could refund it, although it is too late.\n\nHelpful | 4\nDeveloper ResponseDec 7 at 5:11 PM\n\nSorry to hear that. Sounds like you got unlucky. Wait times are usually much shorter than that. You can check https://www.wandsgame.com/ongoing-matches/ to see if anyone is waiting for an opponent right now.", "FreeFire134Apr 1 at 7:20 PM\nGood title to buy\n\nNice visuals a\n\nHelpful | 2", "alexusssOct 19 at 4:07 AM\nGreat multiplayer game\n\nControls, system and graphics are great as well as the mechanics for spells. You get a great action game here where you have the opportunity to destroy you opponent, which is quite fun.\nas for every vr content, there could be more spells and maps for 20bucks. Vr needs a pricedrop if it wants to become successful, or the games need to get more content.\n\nHelpful | 2\nDeveloper ResponseOct 20 at 10:52 AM\n\nWe appreciate the review and feedback, alexusss!", "Ethan_2019Nov 18 at 9:29 PM\nMultiplayer\n\nIs there no way to prevent a new level 2 or 3 from being placed up agianst a veteran player or is the game just like that wpuld be willing to change my review if this hets fixed otherwise its staying at one star\n\nHelpful | 4\nDeveloper ResponseNov 20 at 8:19 AM\n\nThere is a skill-based matchmaking system, so if there are other players near your skill level who are also looking for an opponent, you'll get matched up with them instead of the veterans. However, if there aren't any players near your skill level looking for an opponent, you'll eventually get matched up with whoever happens to be waiting, regardless of how skilled they are. We decided that was a better option than extending wait times indefinitely. For new players, matches against experienced players are unranked, so they don't have an incentive to go hard on you. A lot of them enjoy chatting with new players and helping them learn the ropes!", "TheFinestEelNov 18 at 4:44 PM\nAmazing Game and Community\n\nThe game is very fun although there are several bugs and the community is so kind and welcoming I got the game just yesterday and so many people from the community offered help.\n\nHelpful | 2\nDeveloper ResponseNov 20 at 8:20 AM\n\nThanks, DatBou! We're happy to have you!", "hansokarlssonOct 19 at 12:23 AM\nAddictive and great fun\n\nI n spite of not being an ardent gamer - I prefer making VR to playing - I find myself plying a few roubds of this game every day. I only wish swithing weapons was faster and more intuitive. It would make the play more enjoyable if it was less about mastering the controls and more about strategy. Well, it is abouylt strategy but all tge fiddling with the controls is distracting. Otherwise very nice!\n\nHelpful | 0\nDeveloper ResponseOct 20 at 10:51 AM\n\nWe hear you, hansokarlsson! Thanks for the feedback!", "FunkyGamer101Nov 6 at 4:46 PM\nAMAZING\n\ni LOVE it! its amazing, tons of replay ability. just with there was more for the offhand though i know the devs want to keep it fair between the quest and go players. so i have a suggestion: you should be able to utilize both hands in combat ex: holding down blazing fireball and use other hand to teleport towards enemy.\n\nHelpful | 3\nDeveloper ResponseJul 9 at 4:22 PM\n\nHave you tried the latest update? The new control scheme makes full use of the offhand!", "DrFaruqiNov 27 at 11:06 AM\nproblems\n\nGood game, but having issues that it gets stuck after a match. Happened multiple times already\n\nHelpful | 0\nDeveloper ResponseNov 28 at 5:29 AM\n\nWe'll look into it, DrFaruqi!", "BlakekunOct 1 at 2:22 PM\nGood but 2 issues\n\nI love this game. It is very fun an I love meeting new people on this game. There are still downsides.\n1.I came across this bug where when I won the game didnt continue. I was just stuck there in the battle with no battle until I closed the game. It only happened once though.\n2.I wish people could see what you are doing with your virtual hand. Im trying to tell my opponent good game by giving him a thumbs up and that is what I see on my screen but on his, it looks like I want a handshake.\n\nHelpful | 5\nDeveloper ResponseOct 3 at 2:35 PM\n\nThanks for the review, the bug report, and the suggestion. All good stuff!", "SeojinkOct 3 at 6:42 PM\nThe Best VR game!!\n\nI have been waiting for a good vr game to come out\nand as soon as I saw wands, I bought it. It is the BEST vr game and you should get it. I love how you get to buy different spells and cast them. I would like to see adventure modes or explorer modes come out where you go on in a storyline. I also wish there was 2 vs 2 . It is cheap and definitely worth the money.\n\nHelpful | 4\nDeveloper ResponseOct 6 at 1:33 PM\n\nThanks for the review and suggestions, Seojink!", "CobraStrike_Sep 22, 2019 at 4:05 PM\nBoring app game\n\nThis game is no different than the clash royale games on cell phones, but with movement. You start with a certain mana and movements and spell cost that. The first 4 matches I tried to play were matched against people that have already played hours and hours so I got smashed. Easy refund. I dont get how games like this get game of the year tags.\n\nHelpful | 15\nDeveloper ResponseSep 28, 2019 at 3:02 AM\n\nOne of the many, many differences between Wands and Clash Royale is that Wands has absolutely zero microtransactions. :)", "andythwSep 20, 2019 at 8:10 AM\nSo addictive\n\nI played on the Go nearly every day so now I have the Quest I just had to get it. The community of players is great. As you play real people strategy plays a big part. There is in game chat too and it's all very civilised. There is also a Discord group where a lot players and insiders chat. There is also an AI to play against that provides good practice especially if you are trying out a new selection of spells. The graphics on the Quest are just amazing but it's far more than just a pretty looking game.\n\nHelpful | 7\nDeveloper ResponseSep 20, 2019 at 3:07 PM\n\nThanks for the review, andythw!", "monkeybrain797Dec 4 at 9:58 PM\nFun, but hard\n\nHard to get very good at. I wish more people played.\n\nHelpful | 2", "gamer_kiddo3Nov 12 at 6:58 PM\n\nThis game was awesome! I think you should be able to either use wands or use your hands to cast magic. Otherwise it is really good\n\nHelpful | 1\nDeveloper ResponseNov 14 at 8:07 AM\n\nThanks, gamer_kiddo3!", "KingKaylubSep 21, 2019 at 11:29 AM\nTeam Duels?\n\nThis is probably the best multiplayer game I have played on the Oculus Quest. The only improvement I would look for is implementing team duels! I have two other friends I play with on Quest, but it gets boring just playing each other the whole time. I think it would increase the replay value if we were able to team up in teams of 2 or 3 and fight other people. Overall great game and Id highly recommend!\n\nHelpful | 6\nDeveloper ResponseSep 22, 2019 at 9:44 AM\n\nThanks for the review and the suggestion, KingKaylub!", "KeegerwockyOct 17 at 2:49 PM\nLess Customizable Than It Could Be\n\nMy one (Significant) Complaint Is that it is hard to customize the appearance of your wand or character because it takes a lot of grinding, There also Is not Many options To Choose From and There is no way to change the colors of your character or wand either.\n\nHelpful | 0\nDeveloper ResponseOct 20 at 10:50 AM\n\nThanks for the review, Keegerwocky. You can earn 1000 additional dust in the Easy Money events that occur every Tuesday and Thursday.", "Jackaboiman123Dec 26 at 11:12 AM\nToo much strategy\n\nI tried training by one of the best still no improvement and dont think it lived up to the hype\n\nHelpful | 1\nDeveloper ResponseJul 9 at 3:09 PM\n\nThe new control scheme is much easier to learn. We'd love to see you back in the Beyond!", "michael.power.583Sep 19, 2019 at 3:17 PM\nBUY IT NOW\n\nThis game is amazing the graphics are really good and it's a well polished game. It's worth the price too. Highly recommend everyone buy it and give it a try. 5 well worthy stars. The developers of this game deserve every success this game brings them.\n\nHelpful | 14\nDeveloper ResponseSep 20, 2019 at 11:56 AM\n\nThat means a lot, Michael. Thanks!", "NecromanccerSep 19, 2019 at 1:38 PM\nULTIMATE WIZARD DUELS\n\nThis game is so amazingly complex and has a TON of content! The community was really nice in welcoming quest players on day one :) really cant wait to get out of work and play some more duels! See you in the arena!\n\nHelpful | 15\nDeveloper ResponseSep 20, 2019 at 3:22 PM\n\nThanks, Ahmadcod!", "TheCrazyCookieSep 20, 2019 at 1:16 PM\nThis game is sensational\n\nI saw this from my phone on the oculus app saying it had just come out, now, I love fantasy so the title caught my eye. I immediately watched the trailer and just like that I was hooked. Id say I have gotten 5-6 hours out of this game in just the first day I got it and Im excited to play more. The only thing I would ask for is some sort of story mode that you can play with friends and fight against AI with some plot to it.\n\nHelpful | 5\nDeveloper ResponseSep 20, 2019 at 3:23 PM\n\nWe're so glad you're enjoying the game, TheCrazyCookie. Thanks for the review!", "LUCIFER0Dec 16 at 12:24 PM\nNot many ppl online\n\nFinally some decent graphic for quest. Though I don't really like the game and not many people online\n\nHelpful | 0\nDeveloper ResponseDec 18 at 2:52 PM\n\nWe're glad you like the graphics! You can usually find opponents at discord.gg/wands if nobody is waiting in the queue.", "HolyNovocaineOct 28 at 12:49 PM\nI dont get it\n\nFor me it was complicated, (and I play a lot of games) not terribly intuitive trying to play a friend on another quest and thats it. I just quit after not being able to figure it out. Ease of use is a big deal for me a this was not it. Might try to play again in the future but bad first impression imo (also heard its a port from a non 6dof game so )\n\nHelpful | 2\nDeveloper ResponseJul 9 at 5:51 PM\n\nThe new update makes the game much easier to learn. We hope you'll give it a try!", "PopwielSep 29, 2019 at 1:58 AM\nPeak of Virtual Reality\n\nYou'll find yourself spending half an hour crafting the perfect loadout of 4 spells; you'll carefully think out every scenario and what spells you'll use to counter them, and when your masterpiece is finally ready: you get decimated instantly buy the one fatal flaw in your plan. This being said, it is one of my favorite VR games of all time and I cannot wait to see what the devs have in store because it still has so much potential. Playing with friends is a blast, and once you unlock most the spells, (8ish hours playtime), nothing seems overpowered. If I were to give any advice to the devs, it would be to add larger maps so maybe someday you can have more than two people fighting. It would also be kind of nice to be able to duck. 11/10\n\nHelpful | 3\nDeveloper ResponseSep 30, 2019 at 7:27 AM\n\nWow! Thank you so much, Popwiel!", "Seabass220Oct 12 at 9:56 AM\nIts alright\n\nIts alright the movement is a little wankey and the time to find a match is forever but I love the mechanics of the spells and stuff like that but I would love a battle royale feature in it\nSuch as finding spells and wands on the floor and adding them\n\nHelpful | 0", "Ra2925Oct 26 at 10:24 AM\nAddicting but theres something missing\n\nLet me start by saying this game is addicting and fun when youre playing with other people. The amount quantity and quality of some spells arent there though, I wish there was more spells and more players on this. There are also limited numbers of arenas and you tend to cycle through them quickly. The AI can get boring to play with but it is a good way to practice.\n\nOverall its a great game to play, just wish that it had more content overall (and players). Still excited for what they will release though.\n\nHelpful | 2\nDeveloper ResponseOct 29 at 1:42 PM\n\nThanks for the feedback, Ra2925!", "Azazel08Sep 22, 2019 at 9:59 AM\nExcellent port of an excellent game.\n\nThe devs really went the extra mile bringing the game to Quest. I really enjoyed this game on my Go, but the updates have made the game even better. Great PVP and if you don't want to play a person... there is a challenging AI to go up against. This is a game that really makes you think about your game plan. With lots of loadouts to choose from there is a vast majority of play styles available.\n\nHelpful | 4\nDeveloper ResponseSep 22, 2019 at 9:56 AM\n\nThanks for your support, Azazel08!", "oleg.churgelSep 22, 2019 at 9:52 AM\nThe best VR PVP game Ive seen so far.\n\nThe idea is awesome, so you cant just win with the strongest spells, you have to pick the right set of them for each particular tactic, and of course you need to be faster and smarter than your opponents to win. There is definitely a lot of potential to grow for the game, however the core idea is really good.\nOne thing that could be better right now, If was a Developer of the game I would add more character look customization instead of a strict set of clones that people pick.\n\nHelpful | 4\nDeveloper ResponseSep 22, 2019 at 9:39 AM\n\nThanks for the suggestion, oleg.churgel!", "PinguinoPicanteOct 28 at 11:58 PM\nThe best game in VR\n\nIve spent at least 50 hours playing this game. Great complexity, strategy, skill required. In a good way. Very competitive. Amazing fun. Im #18 in the world now. Loved it so far.\n\nHelpful | 2\nDeveloper ResponseOct 29 at 1:46 PM\n\nThat's great to hear! Congratulations on making the top 20!!", "patinunesNov 5 at 2:24 PM\nIts pretty cool, but...\n\nI would have expected some sort of storyline or something to keep me interested, besides that, it is a great game.\n\nHelpful | 1\nDeveloper ResponseNov 8 at 2:30 PM\n\nThanks for the feedback!", "GlenLondonOct 24 at 6:13 AM\nGood game, but needs more players\n\nWorks really well and is very comfortable to play, mostly due to movement being teleport based. The game needs more players though, as there are often no matches available.\n\nHelpful | 1\nDeveloper ResponseOct 25 at 6:53 AM\n\nThanks for the feedback, GlenLondon! We're working on it! Feel free to stop by www.discord.gg/wands if you want to join the community. You'll usually be able to find a match there if nobody is currently playing. And if you have friends with a VR headset, there's a good chance Wands is supported on their device! You can duel them in private matches whenever you want :)", "ArcetosOct 22 at 2:36 AM\nProbably a good game.But,didn't enjoy it\n\nI've played around an hour and a half, didn't find any online player (and I waited a while) . But that's probably because I play in the morning. I had to play vs the AI, and in every duel, the ai opponent kept staring at me, putting out a shield every now and then till I killed him. I don't know how much do I have to play to increase the AI difficulty for this to be enjoyable. There should be an option to set the ai difficulty, because I don't want to spend the two hours being bored grinding to not be able to refund. Will wait for a developer response if there's any plan to set the Ai difficulty in the future before refunding it.\nA shame because I really think this is a great game, if I could play against players or decent AI\n\nHelpful | 2\nDeveloper ResponseMay 25 at 12:24 PM\n\nThanks for the feedback. Arcetos. There actually is a plan to let players increase the AI's difficulty in a future update! Update: Thanks to feedback like yours, we've significantly improved the AI and added difficulty selection. The highest difficulty is super tough. We hope you'll give it a shot!", "UntoldSlaughtaSep 20, 2019 at 8:47 PM\nGood port but needs improvements\n\nI was hesitant at first but I was able to get into it pretty easily game is fun plenty of content spells and characters to grind for, however I feel like I'm just holding the other controller for literally no reason we need button customization such as being able to grab powerups at least with the hand that doesn't have the wand in it and a tutorial on how to grab them I was in a match the guy kept grabbing the healthsouth because I didnt knownwe had to hold the trigger button for an extended period of time in order to pick up health in the game it would be fun to have a form of free for all as well perhaps release a mode with one big map for multiple people instead of the classic 1v1 style gameplay trailers made the game seem as if we'd be in a kind of all out spell battle but only a single 1v1 mode and facing the AI other than those few things the game is good just add something to the non-wand hand so it won't feel as unbalanced.\n\nHelpful | 4\nDeveloper ResponseJul 9 at 6:06 PM\n\nThanks for your feedback. We just released an update that lets you use a wand in your off-hand, so now there's plenty of stuff for your other hand to do!", "clov3rSep 22, 2019 at 1:08 AM\nControls?\n\nOnly played a little so far but I like it a lot, only thing is I wish you could customize the button configuration only because I'd feel more comfortable teleporting with my left hand while still using my wand in the right. All in all great game so far!!\n\nHelpful | 5\nDeveloper ResponseJul 9 at 5:58 PM\n\nWe're currently looking into ways to make the off-hand more useful. Thanks for the review! Update: There's a new control scheme that allows you to teleport with your left hand while still using your right hand to cast spells!", "Zodam777Sep 22, 2019 at 7:54 PM\nAn absolute blast\n\nI played Wands all the way back on samsung gear vr. Many great improvements. As many have said, I would love for greater purpose to be applied to the offhand, but this is not a massive issue. I would love more story, and maybe a game mode with more mana? Other than this, it is an amazing title and I would definitely recommend to my fellow quest folk!\n\nHelpful | 3\nDeveloper ResponseSep 24, 2019 at 6:21 AM\n\nWe're happy to have you back in The Beyond, Zodam777! Thanks for the feedback. We're looking into ways to make the offhand more useful.", "un-unknownSep 22, 2019 at 12:22 AM\nGreat overall game, still wanting more\n\nAfter a couple days of play using the quest, I have to say I'm quite impressed. the game itself has good graphics and a great overall feel and a great control scheme, but it still leaves me wanting more. I feel with maybe a story mode or campaign this game could captivate players for a much longer amount of time. Perhaps a raid system where you could team up with friends to gain loot or even just small mini-games here or there could really beef up this already fantastic game. I would still like to point out though that these are just suggestions and I respect if the developers want to take a different route with their figurative baby.\n\nThank you for putting in the effort to make a labor of love for people like me to enjoy.\n\nHelpful | 3\nDeveloper ResponseSep 22, 2019 at 9:52 AM\n\nThose are some interesting suggestions, un-unknown. Thanks!", "JohannasonSep 20, 2019 at 8:38 AM\n3 foot wands!\n\nPlenty of unlocks without resorting to premium currency or lootboxing. Lots of spells (though you can only equip 4 at a time) provide for a number of potential strategies.\nJust wish you could test out a spell before spending a token to unlock it. I had no idea you could only have 1 Soil Spikes out at a time.\nThere's also a rare bug that makes some teleport points untargetable(soil spikes, poison, teleport)\nEven so, absolutely worth the price. The arenas are varied and have their own gimmicks to manage, adding to your overall strategy.\n\nHelpful | 3\nDeveloper ResponseSep 20, 2019 at 11:30 AM\n\nThanks for the feedback and the bug report, Johannason!", "KoRRiaZNov 25 at 2:10 PM\nPure gem !!\n\nYou need to play Wands\n\nHelpful | 2\nDeveloper ResponseNov 28 at 5:30 AM\n\nThat's right :D", "kloudificOct 24 at 5:52 PM\nGood but...\n\nThis game is pretty good but your other hand is just there, not doing anything and gets boring after a bit so defiantly could use more content but pretty good.\n\nHelpful | 0\nDeveloper ResponseJul 9 at 5:52 PM\n\nThanks, HOLLOWGR4PHIC! We're currently evaluating different control schemes that would give your off-hand more to do. Update: Thanks for the feedback! We've added a new control scheme that lets you use one wand in each hand, so your other hand now has lots to do.", "nadaso8Sep 22, 2019 at 4:56 PM\nSpell Combos Galore\n\nThe variety of spells and differing effects make the gameplay possibilities almost limitless. You can go from honorable fighter to backstabbing assassin or anything in between.\n(My current top build)\nLightning strike\nChaos leap\nDevil's twins\nAcid cloud\n\nPS thanks to the devs for the response.\nI'd found that combo within the first couple hours, I combined it with acid cloud so that I can force my opponent to move constantly and confuse them without a projectile giving me away.\n\nHelpful | 3\nDeveloper ResponseSep 22, 2019 at 9:46 AM\n\nHave you tried Devil's Twins + Chaos Leap? ;)", "SmylekithSep 19, 2019 at 7:02 PM\nI like everything but the movement\n\nI wish you could at least teleport with one hand and shoot with the other. You end up teleporting, switching spells, casting, and blocking all with one hand and your other hand is just kind of there\n\nHelpful | 13\nDeveloper ResponseJul 9 at 6:09 PM\n\nIn the new update, you can teleport with one hand and shoot with the other. The new controls are much quicker. We hope you'll give it a try :)", "DzeegSep 29, 2019 at 4:45 PM\nHow is this considered good???\n\nNo player movement except for teleporting??? Only 4 spells??? I thought this game would involve some type of skill. Instead its just choosing a spell with a joy stick and hitting a button. I was dying to leave this game after 2 rounds. How did this win any kind of award??? I thought there would be some kind of movement necessary. Im getting so disappointed in the new content for the quest. This game doesnt even compare to dead and buried or drop dead or even sairento. At least you get to do SOMETHING in those games. This is absolute crap. I expected more from new content on this system and quite frankly this kind of garbage is making me second guess buying the system entirely\n\nHelpful | 8\nDeveloper ResponseJul 9 at 5:56 PM\n\nWe're sad to hear that you were disappointed, Dzeeg. I need to correct a few things to avoid any misunderstandings for people who read your review: 1) You can physically move around within a 3 meter (9.8 foot) area, which allows you to physically dodge attacks. 2) There are 26 spells in the game, not 4. You can only have 4 in your wands at one time, but you're free to change spells between duels. 3) This game's skill ceiling is very high. People who have been playing for years are still discovering new ways to improve.", "jimmyjam5000Sep 22, 2019 at 4:46 PM\nIts cool\n\nFirst off, the game is definitely worth the money. Its multiplayer and people are actually playing it. The wand upgrade menu is cool, the mechanics are easy to learn. I give it 4 stars because it can get repetitive and boring after a while. Im also not a fan of the locomotion. Teleporting is my least favorite mode, but Im trying not to let that cloud my judgement as the locomotion is pretty important in this game. But Id love it if there were a new mode where many players can battle on teams, free to look and walk where ever they choose. The battles would be way more intense.\n\nHelpful | 1\nDeveloper ResponseSep 24, 2019 at 6:38 AM\n\nThanks for the feedback, jimmyjam5000! Teleporting is a key part of the game's design, so I hope you warm up to it. Wands without Teleporting would be like a chessboard without squares!", "OdditoriumLeviathanSep 25, 2019 at 1:25 PM\nWow, what a spectacle\n\nThis game is a masterpiece. First and foremost, I must mention the amazing graphics and incredible shaders. The impressiveness this game brings to the quest in its sole visual aspect is one that is almost on par with the Vader Immortal series. The maps are well designed and teleportation locations are strategically placed and show off the asthmatic aspect of the game.\n\n\nNext is the game mechanics. Think wizards chess, but you you are the queen, smashing (or occasionally being smashed in by) the other pieces, moving and attacking with each action having a significant change on the tide of the battle. You have so much to keep track of, but it somehow all works together to bring an artful masterpiece of gaming together. The mana system not to be ignored, each spell having to be managed at the right time and at the correct opportunity.\n\nThe only issue Ive had is one where character models, never mind it be my own or someone elses, seem to have a noticeable lack of bones and normal functions of movement.\nOther than that, I would like to (like most) have a bit more use in my left hand, but that was my saving grace when my left controller died and I still won the match! Anyway, Im glad to be a part of this great game and the wonderful changes that I know the developers will add to the game\n\n\n\nP.S\nDevelopers, you could run a contest for users to submit an idea for a spell, Im sure the community would love to have a say in the combat. Just make sure its not too broken (Im looking at you acid cloud)\n\nHelpful | 2\nDeveloper ResponseSep 26, 2019 at 5:02 PM\n\nThank you so much for the in-depth review and feedback, OdditoriumLeviathan! Two of game's spells were actually suggested by the community at www.discord.gg/wands (Skull Specter and Cerberus Collars). And we hope to add more player-suggested spells in the future!", "eaglespaceOct 29 at 5:54 AM\nGreat game drops often\n\nThis game is great, however the game drops over and over during multiplayer. Otherwise Id play it more.\n\nHelpful | 0\nDeveloper ResponseOct 29 at 1:52 PM\n\nSorry to hear that, eaglespace. If the game is dropping at a very high rate, please make sure that your Internet connection is stable, as the game requires an Internet connection to function. If that's not the problem, feel free to reach out to support@cortopia.com and we'll do our best to help.", "Tenkaichi06Oct 29 at 2:51 AM\nThe Mage Experience You've Always Wanted\n\nThe title is self explanatory. With over 30 spells, this game is the best Harry Potter simulator you're gonna find for awhile.\n\nHelpful | 2\nDeveloper ResponseOct 29 at 1:47 PM\n\nThanks for the review, Tenkaichi06!", "Harlequin727Sep 30, 2019 at 7:14 AM\nGreat Wizard Action!\n\nThis game really makes one feel like they are in the wizarding world! The game is like a game of chess and really makes you think about your move 10 steps ahead. Now hopefully they add more locations and wands as the game progresses!\n\nHelpful | 3\nDeveloper ResponseSep 30, 2019 at 7:12 AM\n\nThanks for the review and feedback, Harlequin727!", "cotiso.cetinoiuNov 4 at 1:08 PM\nImmersive and fun!\n\nI own GesrVR version of Wands and wanted badly this Oculus Quest version too. Good job devs!\n\nHelpful | 2\nDeveloper ResponseNov 8 at 2:30 PM\n\nThanks, cotiso.cetinoiu!", "Lam-Ye-Moe-YeSep 23, 2019 at 7:52 PM\nAstounding\n\nThis game well and truly explores the potential of the oculus quest headset, the game has extremely fun customization options and unique methods for changing abilities but where the game thrives is the duels, an immersive experience you really cannot miss, playing with friends makes this game even better.\n\nA very good path for future oculus games to follow and a unique game and that assists in making virtual reality what it is today.\n\nHelpful | 2\nDeveloper ResponseSep 24, 2019 at 6:22 AM\n\nWe appreciate the review, Lam-Ye-Moe-Ye. Thanks!", "Sketchy_AnonSep 20, 2019 at 9:28 PM\nPerfectly Balanced\n\nI never imagined that an era of machines and magic could be made where the two are mixed together, but it has been done and it is beautiful. There are many different ways to play. You can combine spells to cage your opponent in one spot and dump acid on them, or you can create clones of you and use another spell to teleport to a random location in hope that your opponent attacks a clone. Those are just a few off of the top of my head. Imagine what YOU could come up with!\n\nHelpful | 2\nDeveloper ResponseSep 22, 2019 at 9:55 AM\n\nThank you so much, ShadowTamer5000!", "LKYVSTASep 21, 2019 at 10:52 PM\nMy favorite game on quest\n\nA unique and comfortable PVP experience. Very fun, extremely competitive. Mana based skills with a wide range of customization. Matches are intelligence and strategy best. 10/10 recommend to everyone with a quest.\n\nHelpful | 4\nDeveloper ResponseSep 22, 2019 at 9:51 AM\n\nWe really appreciate the review, LKYVSTA!", "vashoniteNov 13 at 3:09 PM\npossibly my favorite game on the quest\n\nbest multiplayer game ever\n\nHelpful | 2\nDeveloper ResponseNov 14 at 8:09 AM\n\nWow! Thanks, vashonite!", "SuperDuperAidanOct 23 at 6:47 PM\nNot entertaining\n\nAfter just a few minutes of playing this game you are in an amazing experience. Then you start to play the game where youll duel opponents. There after many times of trying havent been one online person. I had to play against AI which is very boring. The controls are ok kind of wonky. However you just stand there with you arm pointed outwards you cant swing it around for most spells either. You just stand there doing the same spell over and over again. If they plan on fixing the wand controls. If they add cross platform multiplayer then this game might be better. Until then Im sorry its not for me or foe most people. Great job to the developer though. Just needs a little more something to make it worth 20.\n\n-VR Reporter\n\nHelpful | 1\nDeveloper ResponseJul 9 at 5:53 PM\n\nHey, SuperDuperAidan. We're currently evaluating different controls schemes for Quest, since that's been a really common suggestion. We're also planning to add difficulty options for the AI, so it will be more fun to duel for skilled players. Update: We've introduced a brand new (and much more intuitive) control scheme in the latest update :) We've already added cross-platform multiplayer to the game, but you must have been online at an unlucky time. You can check the Ongoing Matches page at www.wandsgame.com to see who is playing right now. We hope to earn a better review from you after the next update, if you'll give the game another shot!", "Littlemack02Sep 23, 2019 at 6:41 PM\nMy Favorite game\n\nThis game is amazing. I did not expect this much fun out of it when I got it. Very simple controls yet very technical mechanics. I finished my review video on my YouTube channel if you wanna check it out (LittleMack02) great game well done!\n\nHelpful | 3\nDeveloper ResponseSep 20, 2019 at 11:23 AM\n\nThanks, Littlemack02! Can't wait to check out the review.", "GeeseBeGoneSep 20, 2019 at 5:24 AM\nWish there was more for the off-hand\n\nWands is a decent game. Its got good graphics, an excellent tutorial and also supports friends and playing against a single AI. I was just a bit underwhelmed by it. I was disappointed that there was nothing for the off-hand to do in-game. The offhand does use the stick for snap rotation....but this is Quest! I can just physically turn around! (I think including snap rotation is a good thing...I just wish it wasnt the only thing the off hand was for)\n\nI was hoping to be throwing lighting bolts or fireballs...but it honestly ends up feeling like point and click.\n\nItd be nice if the off hand had an option to use the stick for either snap rotate or teleport. Im so used to stick teleporting in Robo Recall that Wands teleporting doesnt feel intuitive.\n\nHelpful | 10\nDeveloper ResponseJul 9 at 6:08 PM\n\nHave you tried the new update? Now you can use a wand in both hands!", "SlooperopolsOct 8 at 10:26 AM\nToo Hard\n\nI am not a gamer but I bought Oculus Quest because the VR is awesome and I think its the interface of the future. I bought Wands because the concept for the game is really cool. But the longer I play the less fun it is. I am trying, and I thonk Im getting better, but the AI is getting better faster. I cant win ever, anymore. When I lose match after match I should not be getting promoted and the AI should not be getting harder to defeat. The game is practically worthless to me and I never got any good at it. I tried against real players and they kicked my axe so I know I need to practice against the AI. But all it does is stomp me too now. Please fix the AI so players on a slower learning curve can play too.\n\nHelpful | 2\nDeveloper ResponseMay 25 at 12:26 PM\n\nThanks for the feedback, Slooperopols. We'll look into adding an option to change the AI's difficulty. Update: We've added a difficulty selection for the AI, so you don't need to worry about it getting too good too fast. The easiest version of the AI is now available to duel whenever you'd like!", "KuyaTotoVetSep 27, 2019 at 7:23 PM\n\nI get stuck at loading. Please help fix. Been waiting for more than 30 mins. I still haven't played it yet. Thanks for a fast response\n\nUpdate. Working now\n\nHelpful | 4\nDeveloper ResponseSep 27, 2019 at 9:25 AM\n\nHey, KuyaTotoVet. Sorry you're having trouble loading the game. The issue is probably caused by a bad Internet connection. Please make sure your Quest is connected to the Internet and that the connection is reliable, and try again. If the problem continues, please contact us at support@cortopia.com and we'll help you out!", "superthunder485Sep 20, 2019 at 11:20 AM\nNeeds improvement\n\nLove it just need more powers to the wans a custome mode where u can use to wands or something. Also dlc more maps or a dlc with more powers I would buy alot of people would. Also 2v2 or a or a one for all eith 4 players\n\nHelpful | 3\nDeveloper ResponseJul 9 at 6:06 PM\n\nThanks for the feedback, superthunder485. We're always looking for ways to improve the game! Update: Now you can use two wands!", "TheLastWizardSep 26, 2019 at 11:29 PM\nWizard Approved \n\nIf I know my wands, which I should, this game is very close to the real thing. When I get tired of creating spells and sending people to the unknown in the real world, I enjoy taking a break playing Wands and doing it in VR!!!\n\nHelpful | 2\nDeveloper ResponseSep 28, 2019 at 3:04 AM\n\nHappy to hear it has your approval, TheLastWizard!", "EnashkaSep 24, 2019 at 2:25 PM\nBest game ever ever ever\n\nBed freakin game ever in the history of games, even better than chess and CS combined. Been waiting a while to be ported on quest ever since I gave up my go. Get that ish and let s duel!\n\nHelpful | 3\nDeveloper ResponseSep 26, 2019 at 4:55 PM\n\nThank you so much, Enashka!", "jefffguitarSep 20, 2019 at 7:46 AM\n\nAwesome game once you get into it \nWould like to see a vibration option for the controller though.\nVibration - On - Off\n\n\nHelpful | 6\nDeveloper ResponseSep 20, 2019 at 3:07 PM\n\nWe appreciate the feedback, jeff. Thanks!", "Distorted8Sep 21, 2019 at 7:51 PM\nWow\n\nYou can play this for years and not get bored! Don't give up if you try it and don't like it, keep adding new strategies and spells. I recommend lightning it's ungodly!\n\nHelpful | 4\nDeveloper ResponseSep 22, 2019 at 9:50 AM\n\nWe're glad to hear you're enjoying the game, Catasaurus! Lightning happens to be my favorite spell. :)", "JudeOsborneNov 17 at 5:33 AM\nPretty good\n\nThe gameplay is cool but may not be worth unless you like that sort of thing ( wizards etc )\n\nHelpful | 1", "SheerChair11Oct 12 at 12:23 PM\nSUPER ADDICTING\n\nI've been waiting for this to come out and it finally did! I mean who doesn't like magical duels in real life?\n\nHelpful | 5\nDeveloper ResponseSep 26, 2019 at 4:56 PM\n\nThanks for playing, SheerChair11!", "vShadow7Sep 20, 2019 at 8:16 AM\n\nIt's a very great game! But I don't feel as engaged in casting spells as I would like to be. I would like more movement options and different ways to cast spells but the game is still pretty epic!\n\nHelpful | 1\nDeveloper ResponseSep 20, 2019 at 3:22 PM\n\nWe appreciate the feedback, vShadow7!", "darwins.lastSep 19, 2019 at 8:54 PM\nIncredible Graphics\n\nLooks amazing! Love playing other people. And lots of upgrades... excellent replayability. No wonder it was Game of the Year.\n\nHelpful | 5\nDeveloper ResponseSep 20, 2019 at 11:59 AM\n\nThanks, darwins.last!", "dommommaSep 29, 2019 at 12:33 PM\nBest game on VR\n\nExtremely addictive. You get the feeling of wanting to grind for the coolest skin.\n\nHelpful | 4", "BuddyweiserSep 23, 2019 at 9:11 PM\n\nI like this game. I wish the locomotion was better but standing I don't mind it. I've had a LOT of fun playing this one.. I guess I just wish there was more maps and spells.\n\nHelpful | 2\nDeveloper ResponseSep 24, 2019 at 6:23 AM\n\nThanks for the review and feedback, iversonmatthew!", "HunterX70Sep 21, 2019 at 10:34 AM\nWould not Recommend\n\nGameplay is choppy and it doesnt really feel immersive. Consider looking at other games before throwing 20$ on this one because I was quite disappointed\n\nHelpful | 6\nDeveloper ResponseSep 22, 2019 at 9:43 AM\n\nSorry to hear that, Hunter. Thanks for giving it a shot.", "erasmushurtSep 20, 2019 at 1:05 AM\n\nThere is a progression system which is cool. Graphics aren't bad. Gameplay is more strategic than fast action though, and the teleportal system and slower paced combat wasn't my cup of tea. That having been said the overall production quality was high.\n\nI was only able to play against AI, I wasn't able to find any multiplayer matches though that isn't surprising considering I'm in Southeast Asia and was playing in the middle of the night for most players. So I can't rate the multiplayer.\n\nIn general though this seems like a quality title, just be forwarned that you will spend most of your time casting a spell then looking for a premade teleportal location to teleport to before your opponent can get off theirs, rinse and repeat. There is strategy to it, but it felt almost like a quasi turn based system to me.\n\nHelpful | 1\nDeveloper ResponseSep 20, 2019 at 3:16 PM\n\nThanks for the feedback, erasmushurt. Please let us know if you feel the same way after participating in a multiplayer duel.", "edwin.ramirez.969Sep 20, 2019 at 9:05 AM\nOnly 1 thing\n\nI Think they must assign a role for the second hand like shield or magic, but game overall is fantastic.\n\nHelpful | 5\nDeveloper ResponseJul 9 at 6:07 PM\n\nUpdate: We just added a new control scheme that lets you use any spells you want on your off-hand :)", "OutburnerOct 8 at 4:47 PM\n\nAwesime game. But need more content (wands, avatar skins, spells). Are that in plans?\n\nHelpful | 2\nDeveloper ResponseOct 10 at 12:32 PM\n\nThanks! We do have plans to update the game and add some new content!", "WorldMaster2598Sep 24, 2019 at 12:23 PM\nFavorite game on VR hands down\n\nReally enjoy the competitive play and the gameplay blows me away 5 stars easy.\n\nHelpful | 4\nDeveloper ResponseSep 26, 2019 at 4:54 PM\n\nThat's great to hear, WorldMaster2598!", "MadMax10169Sep 22, 2019 at 9:25 AM\nI am very satisfied!\n\nThis is a very fun game that definitely takes some practice but it worth it! If youre willing to put in the time its exactly as advertised and great quality!\n\nHelpful | 2\nDeveloper ResponseSep 22, 2019 at 9:53 AM\n\nThat's great to hear. Thanks, MadMax10169!", "user_24601Sep 24, 2019 at 5:22 PM\nGreat game\n\nSuper fun game! One of my favorite oculus titles thus far.\n\nHelpful | 4\nDeveloper ResponseSep 26, 2019 at 4:55 PM\n\nWe appreciate it, user_24601!", "AtreyuuuOct 4 at 6:02 PM\nGood\n\nI love this game but sometimes it makes you mad\n\nHelpful | 1\nDeveloper ResponseOct 6 at 1:35 PM\n\nThanks! Hopefully it makes you mad because of your opponent's skills and not the game's design. ;) If you have any feedback or want to chat with the top players, you can join us at www.discord.gg/wands", "ost_7Sep 26, 2019 at 12:22 PM\nA must\n\nOne of the best VR multiplayer games ever. It is really great!\n\nHelpful | 3\nDeveloper ResponseSep 28, 2019 at 3:03 AM\n\nThanks, ost_7!", "a_normal_person_5895Sep 26, 2019 at 6:02 PM\n\nGood\n\nHelpful | 5\nDeveloper ResponseSep 28, 2019 at 3:03 AM\n\nGood", "TexasNCGuyOct 5 at 7:31 PM\nExcellent!\n\nI just got this game today and have no complaints so far.\n\nHelpful | 2\nDeveloper ResponseOct 6 at 1:36 PM\n\nThat's great to hear! Thanks, TexasNCGuy.", "RyktusSep 26, 2019 at 9:27 PM\nAmazing\n\nThis game is ridiculously addictive and fun.\n\nHelpful | 3\nDeveloper ResponseSep 28, 2019 at 3:03 AM\n\nWe're glad you're enjoying it, Ryktus!", "AMyriadOct 3 at 2:52 PM\nA buggy mess\n\nIts pretty fun seeing how many spells there are and what they do, but matchmaking is horrible and its super buggy.\n\nHelpful | 0\nDeveloper ResponseOct 3 at 3:00 PM\n\nThat was me on a beta build (that clearly needs some more work). I apologize.", "SnowUseOct 6 at 5:01 PM\nCross buy!!\n\nPlus it's a great game. Thank you!\n\nHelpful | 3\nDeveloper ResponseOct 8 at 12:24 PM\n\nThanks, SnowUse!"]