{"App Title": "Where Thoughts Go", "App description": "Discover the dreams, fears and secrets of othersand leave your own for others to find.\n\nIn this award-winning social experience, human thoughts exist as sleeping creatures that can be awakened to reveal voice-recorded stories of other participants who were here before you. These anonymous stories are revealing and inspiring, encouraging reflection and introspection. To progress, you must leave your own stories behind for others to uncover\n\nVisually beautiful and wholly transformative, Where Thoughts Go thematically explores the course of a lifetime through five simple questions written to dig deep. The voice recordings you hear are unique and unidentifiable, left by individuals from every walk of life, every age and every background. Participants have no way to discern who they are hearing from, only how considerate and sensitive each and every person is. \n\nThis project is under development. Join our Community at http://WhereThoughtsGo.Me/Community and be part of the process!", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contentsOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "360 Experience (non-game), Relaxation/Meditation, Social", "Languages": "English, English (US), English (Australia), English (Canada), English (UK), English (South Africa)", "Version + Release Notes": "1.26", "Developer": "Lucas Rizzotto", "Publisher": "Lucas Rizzotto", "Website": "http://WhereThoughtsGo.Me/", "Release Date": "December 12, 2019", "Developer Privacy Policy": "PRIVACY POLICY\nWhere Thoughts Go: Privacy Policy\nWhere Thoughts Go is an online experience that allows you to discover the intimate thoughts of others as well as leave your own for others to find. Given the nature of the experience, we need to be able to share the recordings you make with other players  just as we share theirs with yours.\n\n\n\nWe care a lot about privacy, so its important to reiterate that we only collect the audio messages you choose to submit.No personal data beyond the voice recording is ever stored.No IP address. No E-mail. No Names. Nada.\n\n\n\nNow onto the legal stuff:\n\nThis privacy policy (Policy) describes how Thought Co. and its related works (Works) collect, use and share personal information of consumer users of this software, Where Thoughts Go: Prologue, (the Experience). This Policy also applies to any of our other works that post this policy. This Policy does not apply to works that post different statements. You must review and acknowledge the following information to proceed into the Experience.\n\n\n\nOUR TERMS OF USE  This Policy is part of the Terms of Use that govern your use of the Experience (see below).\n\n\n\nYOUR CONSENT  By using the Experience, you are consenting to the collection, use, disclosure, and transfer of your information as described in this Policy (and any Privacy Notices that apply to you). If you do not consent to the collection, use, disclosure and transfer of your information as described in this Policy (and any Privacy Notices that apply to you), you may not use the Experience.\n\n\n\nUSE OF PERSONAL INFORMATION and WHAT WE COLLECT  We collect and may share user-generated content in the form of audio recordings (Thoughts). While participating in the Experience you have the choice to record Thoughts and submit these recordings into a private archive (only accessed by Thought Co. and affiliates for the purpose of generating the Experience) without identifying yourself through a traditional user-generated account. We do not ask you to register yourself in order to participate in the Experience. By actively choosing to submit user-generated content you give Thought Co. a worldwide, irrevocable, perpetual, non-exclusive, transferable, royalty-free and fully sub-licensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform and distribute such user content in connection with the Experience and related Works. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right). We do not sell user-generated content, but have the right to if its intended use is within or related to the Experience.\n\n\n\nWe use user-generated and submitted Thoughts to populate chapters of the Experience through a randomized function linked to the private archive. We do not track Thoughts, nor label or categorize them. Once a user has consented within the Experience to submit their Thought to our archive, we have legal right to use the Thought for future iterations of the Experience. Users cannot remove their Thought once they have submitted it. We cannot identify and/or delete users Thoughts upon request. Information about how you access our Experience, including the type of device you are using (such as a headset, PC, etc.), your browser or operating system, and certain device identifiers that may be unique to your device will be shared with Thought Co. Information about your physical movements and dimensions when you use a virtual reality headset, as well as general location, will be derived and vetted by a third-party affiliate. None of this information will be shared or sold. User analytics and session statistics within the Experience will be shared with Thought Co. on a semi-regular basis from the hosting platform(s) the Experience is offered on, as well as by other affiliates of Thought Co. This information will be used to improve the Experience and future Works.\n\n\n\nSHARING OF PERSONAL INFORMATION  We may share anonymous Thoughts through social media without identifying who has recorded the statement. These references to our archive of Thoughts would be for promotional use only. We may share personal information, if applicable: to respond to lawful requests and legal processes; to protect the safety, rights and property of Thought Co., our agents, customers, and any persons; with those who need it to do work for us. Additionally this includes any efforts toward enforcing our agreements, Policies, and Terms of Service (see below).\n\n\n\nHOW WE PROTECT YOUR INFORMATION  We take reasonable precautions to provide a level of security appropriate to the sensitivity of the information we collect. Although we use reasonable measures to help protect your information against unauthorized use or disclosure, we cannot guarantee the security of information provided over the Internet or stored in our databases and will not be responsible for breaches of security beyond our reasonable control.\n\n\n\nPURCHASE OF EXPERIENCE  Users of the Experience may ask for a refund from the hosting platform. No financial data is shared with Thought Co. Users do not own any part of the Experience or affiliated Works when purchasing access to the Experience.\n\n\n\nMODERATION AND CREATOR DISCLAIMER  Any reference mentioned by a user-generated Thought within the Experience to a specific product, process, or service does not constitute or imply an endorsement by Thought Co. of the product, process, or service, or its producer or provider. The views and opinions expressed in any referenced user-generated content does not necessarily state or reflect those of the creators of the Experience or affiliates of Thought Co. While we moderate for sound quality, we are not responsible for any content some users may or may not consider appropriate. We will remove and/or report any messages that are threatening or we deem dangerous to the user or another party.\n\n\n\nA NOTE ABOUT CHILDRENS PRIVACY  You must be at least 13 years old to have our permission to use the Experience. We do not knowingly collect, use or disclose personal information about users under 13 years of age (or any participants). If you are under the age of 13, you can use this Experience only in conjunction with your parents or guardians permission.\n\nCopyright  Where Thoughts Go\n\nPrivacy Policy\n\nTerms of Service", "Developer Terms of Service": "TERMS OF SERVICE\nWhere Thoughts Go: Terms of Service\nWhere Thoughts Go is an online experience that allows you to discover the intimate thoughts of others as well as leave your own for others to find. Given the nature of the experience, we need to ask for your consent to share the recordings you make with other members of our audience  just as we share theirs with yours.\n\n\n\nWe care a lot about privacy, so its important to reiterate that we only collect the audio messages you choose to submit.No personal data beyond the voice recording is ever stored.No IP address. No E-mail. No Names. Nada.\n\n\n\nNow onto the legal stuff:\n\nThought Co.  Terms of Service\n\nLast Updated: May 27, 2018\n\n\n\nThese Terms of Service (Terms) regulate your access to and use of Thought Co.s product, Where Thoughts Go: Prologue (the Experience) and its related works (Works). With your acceptance of these Terms you acknowledge you have thoroughly reviewed the information presented below to you. Your acknowledgement of these statements is required before you are permitted to use the Experience.\n\n\n\nYOUR ACCEPTANCE OF OUR PRIVACY POLICY  By agreeing to these Terms of Use, you agree to the terms of our Privacy Policy (see above), which is expressly incorporated herein. Before using this Experience or related Works, please carefully review our Privacy Policy. All personal information provided to us as a result of your use of this Experience or related Works will be handled in accordance with our Privacy Policy. To the extent there are inconsistencies between these Terms of Use and our Privacy Policy, these Terms of Use control.\n\n\n\nOWNERSHIP AND LICENSING  The Terms applicable to Thought Co. and its Works protect the creators and their ownership of the product and brand of Where Thoughts Go: Prologue. The Experience is owned and operated by Thought Co. The Experience, including relevant content, visual interfaces, interactive features, information, graphics, design, compilation, computer code, products, services, and all other elements, including all associated intellectual property rights, are the sole and exclusive property of Thought Co. The Experience is protected by patents and copyright licensing registered under the laws of the United States and other jurisdictions, all attributed to the parent company.\n\n\n\nLEGAL USE OF CONTENT  You may not to sell, license, distribute, copy, modify, publicly perform or display, transmit, publish, edit, adapt, create derivative works from, or use the Experience, or aspects of the Experience, unless as expressly authorized by Thought Co. The parent company and creators reserve all rights to the Experience, current and future Works. Legal actions will be taken against any infringement of these rights, including and especially in the case of actions related to downloading or taping audio recordings (Thoughts) within the Experience or tampering with the private archive. In agreement of the Terms you shall not take legal actions against Thought Co. for the anonymous distribution of Thoughts you generate throughout the Experience at your choosing and risk.\n\n\n\nDISCLAIMERS  WE MAKE NO REPRESENTATIONS OR WARRANTIES WITH RESPECT TO THIS EXPERIENCE, ITS CONTENT, OR RELATED WORKS, OR ANY PRODUCT OR SERVICE AVAILABLE ON OR PROMOTED THROUGH THIS EXPERIENCE OR RELATED WORKS. THIS EXPERIENCE, ITS CONTENT (INCLUDING USER-GENERATED CONTENT), OR RELATED WORKS ARE PROVIDED ON AN AS IS, AS AVAILABLE BASIS, WITHOUT REPRESENTATIONS OR WARRANTIES OF ANY KIND. TO THE FULLEST EXTENT PERMITTED BY LAW, THOUGHT CO., ITS AFFILIATES, AND THEIR SERVICE PROVIDERS AND LICENSORS DISCLAIM ANY AND ALL REPRESENTATIONS AND WARRANTIES, WHETHER EXPRESS, IMPLIED, ARISING BY STATUTE, CUSTOM, COURSE OF DEALING, COURSE OF PERFORMANCE OR IN ANY OTHER WAY, WITH RESPECT TO THIS EXPERIENCE, ITS CONTENT, OR RELATED WORKS, AND ANY PRODUCTS OR SERVICES AVAILABLE OR PROMOTED THROUGH THIS THIS EXPERIENCE. WITHOUT LIMITING THE GENERALITY OF THE FOREGOING, THOUGHT CO., ITS AFFILIATES, AND THEIR SERVICE PROVIDERS AND LICENSORS DISCLAIM ALL REPRESENTATIONS AND WARRANTIES (A) OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE; (B) RELATING TO THE SECURITY OF THESE PRODUCTS, (C) THAT THE CONTENT OF THIS EXPERIENCE IS ACCURATE, COMPLETE OR CURRENT; OR (D) THAT THIS EXPERIENCE WILL OPERATE SECURELY OR WITHOUT INTERRUPTION OR ERROR.\n\n\n\nWE DO NOT REPRESENT OR WARRANT THAT THIS EXPERIENCE, ITS SERVERS, OR ANY TRANSMISSIONS SENT FROM US OR THROUGH THIS EXPERIENCE WILL BE FREE OF ANY HARMFUL COMPONENTS (INCLUDING VIRUSES). THOUGHT CO. DOES NOT ENDORSE AND IS NOT RESPONSIBLE FOR STATEMENTS, ADVICE AND OPINIONS MADE BY ANYONE OTHER THAN AUTHORIZED THE THOUGHT CO. SPOKESPERSONS. WE DO NOT ENDORSE AND ARE NOT RESPONSIBLE FOR ANY STATEMENTS, ADVICE OR OPINIONS CONTAINED IN USER-GENERATED CONTENT AND SUCH STATEMENTS, ADVICE AND OPINIONS DO NOT IN ANY WAY REFLECT THE STATEMENTS, ADVICE AND OPINIONS OF THOUGHT CO. WE DO NOT MAKE ANY REPRESENTATIONS OR WARRANTIES AGAINST THE POSSIBILITY OF DELETION, MISDELIVERY OR FAILURE TO STORE COMMUNICATIONS, PERSONALIZED SETTINGS, OR OTHER DATA. YOU ACCEPT THAT OUR SHAREHOLDERS, OWNERS, OFFICERS, DIRECTORS, EMPLOYEES AND OTHER REPRESENTATIVES SHALL HAVE THE BENEFIT OF THIS CLAUSE. APPLICABLE LAW MAY NOT ALLOW THE LIMITATION OF CERTAIN WARRANTIES, SO ALL OR PART OF THIS DISCLAIMER OF WARRANTIES MAY NOT APPLY TO YOU.\n\n\n\nLIMITATION OF LIABILITY  TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAWS WE, ON BEHALF OF OUR DIRECTORS, OFFICERS, EMPLOYEES, AGENTS, SUPPLIERS, LICENSORS AND SERVICE PROVIDERS, EXCLUDE AND DISCLAIM LIABILITY FOR ANY LOSSES AND EXPENSES OF WHATEVER NATURE AND HOWSOEVER ARISING INCLUDING, WITHOUT LIMITATION, ANY DIRECT, INDIRECT, GENERAL, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL DAMAGES; LOSS OF USE; LOSS OF DATA; LOSS CAUSED BY A VIRUS; LOSS OF INCOME OR PROFIT; LOSS OF OR DAMAGE TO PROPERTY; CLAIMS OF THIRD PARTIES; OR OTHER LOSSES OF ANY KIND OR CHARACTER, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES OR LOSSES, ARISING OUT OF OR IN CONNECTION WITH THE USE OF THIS EXPERIENCE. YOU ASSUME TOTAL RESPONSIBILITY FOR ESTABLISHING SUCH PROCEDURES FOR DATA BACKUP AND VIRUS CHECKING AS YOU CONSIDER NECESSARY. THIS LIMITATION OF LIABILITY APPLIES WHETHER THE ALLEGED LIABILITY IS BASED ON CONTRACT, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR ANY OTHER BASIS. IF ANY PART OF THIS LIMITATION ON LIABILITY IS FOUND TO BE INVALID OR UNENFORCEABLE FOR ANY REASON, THEN THE AGGREGATE LIABILITY OF THE RELEASED PARTIES FOR LIABILITIES THAT OTHERWISE WOULD HAVE BEEN LIMITED SHALL NOT EXCEED TEN DOLLARS ($10.00).\n\n\n\n_________________________________________________________________________________________\n\n\n\nAGREEMENTS  Please note any participation in this Experience will constitute acceptance of this agreement. If you do not expressly agree to abide by the above stated and legal Policy and Terms, please do not participate in this Experience.\n\n\n\nINDEMNITY  You agree to indemnify and hold Thought Co., its subsidiaries, and affiliates, and their respective officers, agents, partners and employees, harmless from any loss, liability, claim, or demand, including reasonable attorneys fees, made by any third party due to or arising out of your use of this Experience and related Works in violation of these Terms of Use and/or arising from a breach of these Terms of Use and/or any breach of your representations and warranties set forth above and/or if any material that you post using this Experience causes us to be liable to another. We reserve the right to defend any such claim, and you agree to provide us with such reasonable cooperation and information as we may request.\n\n\n\nCONTACT INFORMATION  We welcome your comments or questions about the aforementioned Privacy Policy and Terms of Service. You may contact us through our website: https://wherethoughtsgo.me/\n\n\n\nCHANGES TO PRIVACY POLICY AND TERMS OF SERVICE  The Privacy Policy and Terms of Service are subject to change together or separately at any time given laws and regulations regarding standards for both, as well as Thought Co.s opportunity to update details within the Experience, additional Works and/or future Policies or Terms. If we make any changes, we will change the Last Updated date above.\n\nCopyright  Where Thoughts Go\n\nPrivacy Policy\n\nTerms of Service", "Space Required": "824.4 MB"}



["5 stars\n66%\n4 stars\n5%\n3 stars\n11%\n2 stars\n8%\n1 star\n10%", "CalvinmationsMay 17 at 3:24 PM\nLacks Creativity and Exploration\n\nThe app is amazingly therapeutic, but you only really get 5 questions, but it has the potential to be so much more. If there was a way to write in our own questions and listen in on the anonymous answers that can allow people to get as deep with any topic they want. As it is now I would only price this game at $5.00 tops because for the $10 now youre essentially paying $2.00 a question and they feel like they fly by.\n\nAnother possible addition is to make the game more of an exploration to enjoy the scene, while listening to answers and thinking of your answer to the questions. This way it can also have hidden questions that are deeper in meaning or not.\n\nHelpful | 58", "chaoswhistlerMar 13 at 8:31 AM\nAn interesting experience\n\nYou sit in one place and grab floating orbs out of the air to listen to recorded answers to questions, and then you record your own anonymous answer to each question which will be listened to by other players in turn. It's peaceful, or might be called boring. I thought from the trailer that there would be more interactivity to it. Maybe if there were some hidden orbs that you had to find, or if they were little people on the ground instead of disembodied orbs, something where you had to *do* something, or if each environment was related to the question and you felt like you were going on a journey through life as the questions progressed.\n\nAnyway, it was nice to answer some of the questions. A few of them made me feel heavily emotional and I cried on one of them.\n\nTo the developer: Unfortunately, after the end of the main question series, I encountered a bug. After finishing the 5th question, I handed my recording to the little round black guy. Everything went black, and there was just a single point of white light straight ahead. I waited for a couple of minutes, and nothing happened. Finally I pressed the menu button and chose \"go back home\" or whatever it's called, then the game crashed. When I opened it back up, my progress had all been lost, and all the questions were locked. There is no indication if my recordings were saved or not. This also means that I couldn't access any of the bonus questions. So, my suggestion is that progress should be saved after every question.\n\nHelpful | 74", "Tony.DiIuorioMar 20 at 10:17 PM\nWas amazing, but too $ for how short\n\nThis is in no way a game, but it's more than a media player... I wish they'd price it more fairly, somewhere between it's game price and free, to indicate this.\n\nAnd it's not even finished I don't think, I hope they'll add more later. Only 5 questions currently!\n\nAnyway. There's 5 chapters as mentioned, and each one is a deep question. You get to listen to random bubbles containing previous players' answers that came before you, and then add your own spoken answer for future players to hear.\n\nIt's a brilliant concept, it's just that it's over in 10 minutes.\n\nListening to others is half of it, but after another 10 minutes you start wanting to hear answers to MORE QUESTIONS!\n\nPlease.\n\nHelpful | 16", "workingdog_Jun 2 at 3:44 PM\nShort and Buggy, but nice\n\nThis was a really nice experience for a while. I definitely enjoyed it. It's very very short though, and it crashed my Quest after I answered the last question and then all my progress was lost.\n\nHelpful | 1", "CasualCheetahFeb 28 at 7:58 AM\n\nIts been cathartic to whisper some secrets and feelings into a sea shell and toss it out into the ocean. While it was disappointing to have unknowingly disabled my microphone, so I ended up sharing silent logs, the time I spent listening to stories and the life lessons of those wandering voices has provided invaluable moments of reflection.\n\nThank you, to both Lucas Rizzotto and all the users, for the opportunity to experience something like this. Safe spots for sharing ideas in this manner make for a truly special occasion.\n\nHelpful | 21", "lorenzoidddMar 5 at 11:11 AM\nI feel less stressed now!\n\nI tried out this experience and I really like it! Being able to put out some things that bother me was great! However I would like to see a mode where you can put out your own questions for other people to answer, or for you to find questions yiu may want to answer. This would be a great opportunity to be able to sympathize and empathize with others.\n\nHelpful | 9", "Haine_PotterMar 26 at 10:17 PM\nAmazing App\n\nI really like the aesthetic kind of vibe it gives. Its so peaceful and I like that Im able to listen to other peoples stories. Like I can relate to some of them and understand them from their point of view. Its a beautifully made game. I absolutely love it!\n\nHelpful | 3", "vetrpaJan 28 at 4:15 PM\nNeat Product, but SAME Orbs (now fixed)\n\nI updated my rating from 1 star to 4 star. The developer fixed a huge bug which now allows the responses to be randomized! I went through a few other reviews about this app and had at first the same issue, but now I definitely hear some variety! I've gone back into the same chapter 3x's (yes, memorized majority of the voices .. had coffee!) and they were changing. You hear some really good quality ones, YET you also hear some really bad quality ones and ones where the person may be at a party or drops things, etc. You hear a \"few\" people outside the standard age range (I'm guessing 60+ based off the responses some gave, along with the obvious 6 1/2 yr old like voices LOL ). Also there are a few more ethnic/foreign voices too.\n\nThanks for that fix!\n\nThere are some other things that really should be looked at with the app, but the randomization was an extreme one.\n\n\n--- original statement below --\nReally liked this product and the simplicity of it. As a developer, it's hard to overlook the techy part but enjoyed this. One issue I have, after trying this 3 times is that the Orbs are the same exact messages left! I'm not finding any new Orbs after listening to them. I would think there would be several hundred (maybe at least more than 50??) but as of now, the ones I hear are the same ones. In addition to another review I read, even though I'm American and prefer English, I'm really surprised that all of the orbs are English speakers? I would think with the Internet and even here in the US, there would be tons of people leaving messages in many other languages. Just curious though, are you converting the orb messages to English, or is the person hearing a translated version automatically in their native language?\n\nI've saved mine already. How soon do we have ours listed with the other orbs?\n\nOne suggestion would be to have the newest orbs listed first so they would be\navailable for people to hear, or really randomize the list of orbs.\n\nHelpful | 8\nDeveloper ResponseJan 29 at 12:47 AM\n\nThank you so much for the positive review as well as helping me figure out the issue! The experience is better because of you <3", "1ostgamerApr 24 at 9:04 AM\nGreat\n\nYou listen to others stories and get to leave your own and surprisingly after I finished the 5 chapters I felt relieved somehow like a weight was taken off my shoulders. Shows you what telling strangers can do.\n\nHelpful | 0", "mallmagicianDec 12 at 9:54 PM\nWe need more developers like this in VR\n\nThe premise of this experience is really great. You see questions that at first may seem simple, until you have to come up with your own answers to them. With me, it triggered a deep thought process where I challenged my own initial thoughts and dug deep to give a true and heartfelt answer.\n\nI suspect many will praise this for the deeply moving responses that others that have been before you have left. And with good reason, there's something very intimate and raw about hearing how others answer the questions.\n\nThis is such a simple concept, wonderfully executed.\n\nBuy it! Support Devs like this!\n\nHelpful | 128", "Lucid360Jan 28 at 12:08 PM\nThank you for Your imagination\n\nThis is the most emotional VR-experience Ive tried. First time I stepped into the world I couldnt start because the whole setup hit me so hard and put me to tears. It was like \"I need to take my time with this\"... More like an intimate ceremony than a game.... I would rate this 6/5 If i could.\n\nHelpful | 17\nDeveloper ResponseJan 28 at 12:45 PM\n\nThank you so much <3", "MalteseDadJan 11 at 8:57 AM\nA Scam?\n\nYou are asked a question, and you can hear the answers left by other users, before you can leave your own. You listen to these sound bites by touching one of around 10 to 20 bubble faces meant to represent users. The answer you leave can be 'found' by other users. This is the theory behind the experience , if I understand correctly.\n\nIn practice, the voices seem scripted and recorded in the same professional environment. The accents are all very similar, so is the age-bracket of the people doing the voices. The age of the actor and the content are also often mismatched, making the experience more like a college class project than the output of a genuine audience.\n\nI found no way of discovering more than the 10 to 20 odd soundbites for each question. All similarly styled and voiced. Where are the real user sound bites? How do the devs filter out profanity and poor quality sound bites left by users? Who gets to choose? How are they managing to keep up as the user base grows? The model seems totally non-scalable for a small company, which is why this feels more like a scam than a genuine experience.\n\nAlso, there is absolutely no useful use of VR. This could have just as easily been a phone App, and not a good one at that. I am confused.\n\nHelpful | 29\nDeveloper ResponseJan 28 at 1:24 PM\n\nHi, Maltese! All messages in this experience are user-submitted and there was no scripting involved. Many of them sound really good because they were recorded with the Oculus Rift CV1, which has an amazing directional mic. That being said, I pushed an update today that fixed a bug that caused some of the recordings to repeat, so it should all be good to go! Personally I believe that listening to those stories (and sharing them) in this immersive environment changes things completely, but to each their own :)", "BigJoeyJoeJan 29 at 8:24 AM\nAn Awesome Vr Experience\n\nIm an older guy and a social worker who also deals with anxiety and occasional depression. Im constantly looking for experiences to help myself and others. This VR experience was incredibly simple and also incredibly cathartic. It also helped remind me of just how connected we are. When you cant actually see the person in front of you and you dont know their demographics it shuts down brain bias to an extent. It allows one to just hear another person and relate or hear something different from their own experience. Its so simple. Answer 5 questions and listen. The music and environment also lend themselves extremely well to the process. I cant wait to see where they take this next. I can think of lots of potentials and possibilities. More VR experiences like this, please!\n\nHelpful | 4", "MTrigsDec 13 at 11:08 AM\nUnreal. This is what living is about.\n\nWhat a completely unique and incredible experience. We spend so much of our lives disconnected to one another and keeping our thoughts to ourselves. This app made me feel connected to my fellow man like no other. I thank and praise every single person involved in the development of this game and I highly encourage them to continually add new questions. You guys are phenomenal.\n\nHelpful | 33", "VulpineyesJan 9 at 6:14 PM\nDeep and moving\n\nI purchased this well over a month before I launched it for the first time. I knew I would have to be in the right head space to experience this from reading the other reviews and I'm glad I waited. I'm very well versed in VR and have never experienced anything like this before. Most games are just that...games, not something that requires deep thought. In fact that's what I love about VR. It's a form of escapism therapy for me. This experience is NOT that. Its deep and moving. Its difficult to hear other's thoughts and more so answering the questions. At times it feels a little too intimate as hearing others hopes and dreams isn't something I'm used to in VR. We need more experiences like this.\n\nHelpful | 9", "ph0t0nv1s10nJan 26 at 3:08 AM\nBeautiful, innovative and moving\n\nHearing the stories of others and then taking part yourself makes you feel connected to the game and to the other players.\n\nThe realisation that you are changing the experience for others as you go through it is amazing.\n\nThis is such an amazing idea and it is easy to see why this won awards!\n\nHelpful | 4\nDeveloper ResponseJan 28 at 12:56 PM\n\nThank you so much for the positive review, ph0t0nv1s10n. I just released an update today with more content, hope you get to experience it! :)", "killboydotcomDec 14 at 11:17 AM\nNot for everyone\n\nLook I get the significance for this type of experience, and I'm thankful that it is a powerful and touching journey for a lot of people who maybe needed to hear some of these things, but for those who may not be in that head space, this may not be for you. I'm not taking anything away from all of the 4-5 star reviews, it deserves that if it connects with the user that way, but I think it's also important to keep expectations realistic for those going into it expecting more. It's a very simple journey, where you listen to other user's recordings, and although they are from the heart and mean a lot to those who voiced them, after a few minutes it becomes fairly generic and predictable. These aren't paid, experienced writers like dialog usually consists of. So if you could use some confirmation or uplifting inspiration, then by all means, jump in here and you will love it. But if you're not in that mindset at this point in your life, this will probably be a disappointing experience for you.\n\nHelpful | 51\nDeveloper ResponseDec 30 at 11:07 AM\n\nThanks for your feedback! Yeah, this is definitely an experience more geared towards people who are into VR, intimacy and exploring the minds of others :)", "dayekayeDec 12 at 12:22 PM\nI want to hug all of you\n\nI found myself talking to these orb people as if they were with me. physically reacting to their orbvatars with consolidating pats and scooping them in for hugs. We need more experiences like this on Quest\n\nHelpful | 61", "connoryoMar 14 at 3:53 PM\nEh\n\nMaybe for some people this would be very meaningful. The best part about this game is the introspection you are guided through. Not really worth the paid VR experience for me\n\nHelpful | 1", "ishkodekweJan 11 at 6:57 PM\nLove it! More please!\n\nThis is an amazing experience! The listening and sharing aspects are incredible. I felt engaged with those who shared, and even felt I could relate to them as if they were right there with me in real time. However, I was bummed there weren't more questions/levels! I'm not sure about anyone else, but I could've kept playing for hours more!\n\nHelpful | 3", "LucasRizzottoDec 12 at 5:16 AM\n10/10 would cry again\n\nThis game makes me cry all the time and it's all your fault\n\nHelpful | 158", "blackbanditshoDec 13 at 6:15 PM\nAn intimate experience\n\nBought it and I dont regret it. What an incredible experience! If youre into VR for its ability to connect you to people and the unique experiences that the platform provides, this is a very compelling game. Its so intimate. While not for everyone, this is one of my personal favorite must have titles. Its beautiful.\n\nHelpful | 7", "nelagalvez1984Jan 5 at 9:06 AM\nA completely different experience\n\nIf you are looking for a game, this is not a game, but it is absolutely worth it.\n\nThis game made me cry full of emotions, and it will make you grow and look the life in other way. Do not rush it, just sit down, and enjoy it.\n\nIt is short, and it has no replayability, but anyway, it is worth it.\n\nHelpful | 7", "nikkmitchellJan 22 at 11:30 PM\nWow.\n\nUnique, creative, beautiful, meaningful, and inspiring. This is a must try for anyone wanting to see how much more VR can be. Whatever else this dev makes next is a definite instant purchase for me.\n\nHelpful | 2\nDeveloper ResponseJan 28 at 12:57 PM\n\nThanks for the kind words, nikkmitchell <3 You can follow my work on Twitter at @_lucasrizzotto or join the WTG community at http://WhereThoughtsGo.Me/Community :D", "BeatzCreationsDec 30 at 11:18 AM\nPowerful at first..... then changed.....\n\n(Updated after first leaving a 4 star rating)\n\nPowerful is the first word that come to mind after my first time experiencing this.. i didnt know what to expect going into it but it was better then i thought it could be. Well the idea of it.\nThe design idea with the little orbs with faces being the peoples thoughts is brilliant.\n\nThe only issue i found and hopefully the developers will see this to get it updated.. the fourth thought i had to leave had letters missing from the question, i could make out what it was supposed to be but it lost a bit of the immersion during that  also at the end it put my recordings infront of me with just jumbled up letters going vertically through the orb which i wasnt sure why it was like that and then i didnr know what i was supposed to do.. i played a couple.. moved them round then pressed to menu and returned home, but then it showed the chapters as still locked so it seemed it didn't save my recordings.\n\nWhat should of happened at the end?\n\nAfter speaking to a few people asking them did it not sound like some of the messages left in the same chapter sounded like the same persons voice and then they think it may be the developers leaving the first messages which is fair enough if there legit and not faked to leave the feeling of an emotional message which if they ARE faked lefr messages (which a lot of them really sounded like acted lines read out and not genuine people just talking and leaving the message on the fly) then to me that is quite sad and not fair on people listening to them messages and as some of the other reviews show people gettin choked up or sad from listening to the stories left.\n\nThats kinda playing with peoples emotions same as telling someone a fake story to make them feel sad for you. I hope it isnt this as if thats the case then i dont support the app at all.\n\nI would of rathered there be No messages left in there until GENUINE ones are left from real people leaving there actual stories and memories.\n\nI will go back in at somepoint but part of me is saying not to bother. Such a shame.\n\nUPDATE AFTER RECEIVING REPLY FROM DEVELOPERS -\n\nIm not sure how i am supposed to respond to your reply as there wasnt an option anywhere.\nI apologise that i don't fully believe what you have said. Every single recording had the exact same quality to them, with added reverb and pretty much crystal clear audio. Yes i also understand that people can prepare there redording before recording it but i never so i would like to assume some others wouldnt.\nI recorded it naturally with my live thought being left as it came out at the time. I will re visit the experience again soon and hopefully come come out with a more positive outcome which i then will amend my review but currently my review is as it has been left above.\n\nHelpful | 10\nDeveloper ResponseJan 25 at 11:15 PM\n\nHi, Beatz! all the stories are genuine users submissions. There are no actors, no writing and they're all recordings made by people who played the experience. If 2 people have similar voices it's purely a coincidence. At the end you're supposed to listen to the 5 messages that appear in front of you and they float away as they're being played. Sorry it wasn't clear. Please consider changing your rating if you can! Update after your update: Many of the recordings have superb quality because they were made on the Oculus Rift CV1, which had an exceptional directional microphone. Facebook replaced that microphone on the Quest with a cheaper option. Also, recordings that are too low-quality or have loud background noises don't make it into the app.", "sableRaphDec 26 at 9:06 AM\nProfoundly moving\n\nWhere Thoughts Go makes you feel emotionally connected to other people in ways that even true social VR often doesnt. Hearing the stories of people who came before you has a profoundly moving effect that will stick with you for a while. I hope there will be more VR experiences like this one in the future.\n\nHelpful | 2", "gamingscienceteacherDec 12 at 4:48 PM\n\nI won't lie, I choked up a bit leaving a thought in this experience. It's one of those things that doesn't come across on paper - you have to try it for yourself.\n\nHelpful | 28", "dingoflingJan 2 at 3:38 PM\nSimple\n\nSimple in a good way. There is no wondering how to listen or record or interact. The \"Game\" is short but length doesn't matter when the content is stimulating mentally; and in a sense it never ends. Devs also let you know about updates , and such. Its interesting to hear instantly random deep replys to the question. Everyone I saw was serious and deep. Or simple and honest, hopefully.\n\nI hope the app grows, its a good social experiment and way to get statistics to personalities in a way. I could see this being good for people as well it is very zen and viseral in the honesty some people put out there i could go on. But it lights up the brain in good ways.\n\nIm very sick i hope that was coherent my energy level is zero but much respect and appreciation to the development team and team this was a risky unique successful move and put out.\n\nHelpful | 3", "oysterassassinJan 1 at 8:53 AM\nNo no no\n\nI find the interface odd and confusing. I often dont know what Im supposed to do next. The concept is great, but ive entered four answers. Two recorded fine. One recorded intermittently. And the final one was a deeply heartfelt answer about a friend i missed. Unfortunately i never saw any warning about a time limit. Nothing told me to stop talking, so i poured my heart into this only to find that only the first few words were recorded. Wish to hell i had gotten a refund. I uninstalled it. Quite angry at the waste of time and emotion. Really a stupid waste of time. Quite angry. Tell the speaker when their time is up! Give them a count down bar. Something! For Gods sake, dont waste peoples time like this. This is what puts people off of tech. It seldom, seldom works. Really angry. How many more emotional answers have you silently truncated!?\n\nHelpful | 7\nDeveloper ResponseDec 30 at 11:06 AM\n\nI'm going to make improvements on the next update. Thanks for the constructive criticism and the purchase! :)", "Roxtar73Dec 14 at 4:54 AM\nThis is not a game\n\nThis is not a game so dont buy it if thats what you are looking for. However if you are looking for a truly emotional VR experience then this might be the app for you. In this experience you are given a simple question. There are currently five. None really that personal but questions we can all answer because of our lifes experiences. You listen to anonymously recorded voices tell you their dreams and hopes and so much more. Its an experiment in the human condition and may cause you to feel many emotions.\n\nHelpful | 11", "benkesmithDec 15 at 11:30 AM\nOnly for English speakers\n\nI was disappointed... I thought it would be something like Lands End, but no. We have to listen to other people's voice messages, and leave our own messages for them. I didn't find it moving at all. Maybe I misunderstood the message... hence the 3 stars. I would've given it less... sorry!!!\n\nHelpful | 4\nDeveloper ResponseJan 20 at 1:48 AM\n\nHi, Ben! Translating content is expensive and I'm a one-man team right now. I'll look into this in the future!", "RobustPaellaDec 15 at 4:23 AM\nThis is what life should be about.\n\nThis is truly one of the best experiences I've had in VR. Anonymous and touching stories which have brought me to tears several times. The developer should be offered a buyout from Oculus, because this will hit so many people in different parts of their lives.\n\nI'm gonna show this to friends and family and let them sin in private and discover and share stories.\nThank you Lucas for making this\n\nHelpful | 8", "rishi_1999Jan 17 at 7:12 PM\nThank You\n\nThank you for this application. Sometimes we need to listen to what our heart has to say.\n\nHelpful | 1\nDeveloper ResponseJan 28 at 12:57 PM\n\nAnd thank you for your review <3 It's really sweet. Glad you liked it!", "inhaylexhaylJan 21 at 6:13 PM\nListening to the same stories in order\n\nI love the game itself the idea is amazing but i find when i log in after.pmaying the firstntime i have to listen 2 the same stories i heard again before i hear any new ones so they are all in the same order. I want to hear more variett of stories.\n\nHelpful | 1\nDeveloper ResponseJan 28 at 12:52 PM\n\nHey, inhaylexhay! There was a bug that was causing the same recordings to be replayed over and over. I just released an update today that fixes it. Sorry about that!", "GeeeBenjaDec 23 at 6:02 PM\nLove this concept\n\nAlthough my initial pass at this experience went by pretty quickly, i can see myself returning to this world in the future to listen to new responses and maybe to update my own. Its such thought provoking concept - a really innovative use of VR! Also I was pleasantly surprised at how honest these strangers had been and instantly felt like i belonged to a little therapy circle.\n\nI cant wait for more content and hope they add additional prompts/chapters soon! Thank you!!\n\nHelpful | 1", "Sanctums_AsylumDec 15 at 3:42 PM\nAmazing, powerful experience.\n\nThe questions the devs of this platform asks you are simple but it makes you stop and think about yourself and your life. It took awhile for me to answer \"describe the person you miss\", that one hit me quite hard.\n\nSome answers made me shed quite a few tears and I actually hugged their orbs, but I made sure I listened to every single orb around me because it does feel really personal in that moment hear what that person answered.\n\nHelpful | 5", "steff.yuanMar 6 at 3:31 PM\nDo not like\n\nNot what I thought. Do not like\n\nHelpful | 0", "dayophillipsDec 20 at 1:00 PM\nExploring your thoughts\n\nSharing a part of you, you had never explored in a most thought interactive manner\n\nHelpful | 3", "ArthurjiDec 18 at 9:28 AM\nDeep Sharing in Beautiful Surreal Scenes\n\nI love the soothing, surreal/dreamlike low poly environments, and having these glimpses into other people's lives -- and being given the opportunity to anonymously share my own answers to the provocative questions -- is wonderfully heart-opening. I also have this on SteamVR. I was happy to pay for it again for the Quest, both because I prefer it on a tetherless VR headset, and to support the developer and encourage more innovative indie VR experiences like this\n\nHelpful | 2", "MyNameJeff916Jan 10 at 3:07 PM\nDeeper than Billie Eybrows\n\nThis game is incredible and really needs to have inspiration taken out of it so more games in creative make you think instead of just shooting stuff\n\nHelpful | 2", "Tatchi-Mi-SamaDec 12 at 2:33 PM\nEveryone has a story\n\nYou can never know where someone comes from,what they experience, how they overcome it..but this experience is really eye opening and so glad i sign on to the beta version thank you Lucas Rizzotto\n\nHelpful | 15", "SampersonDec 12 at 11:55 AM\nYou need to show this to everyone\n\nTitle says it all. One of the most well designed, impactful VR experiences to date. I dont usually do the whole review thing, but this justifies it.\n\nHelpful | 19", "BaraboncDec 14 at 2:06 PM\nMy Thought Goes to..\n\nSuch a beautiful experience! This could be the crucial app where I could lead my wife into VR, and closer to the present in the same time :-)\nI'd love to go with her simultaneously chapter by chapter, recording our own thoughts, with a chance to finding each other's by just listening to them long enough..\nAll of this without having 2 headsets or 2 separate accounts.\nIs this an utopistic thought?\n\nHelpful | 3", "MarkazieJan 26 at 12:16 PM\nThis game is deceitful\n\nIt doesnt actually leave your messages behind unless the developer chooses yours. Making this game very inaccurate in it perceived intent.\n\nHelpful | 1\nDeveloper ResponseJan 28 at 12:55 PM\n\nHi, Markazie! All the thoughts go through a moderation process to protect the experience from trolls, but that's the only criteria we use for selection - everything submitted will be listened to at some point in time. There used to be a bug that caused the same messages to play again over and over in the same order, but I just released an update today that fixes it! Maybe you were stumbling upon that?", "FatSheamusDec 15 at 8:16 PM\nConnected and Introspective\n\nThis experience provides a deep emotional impact with a very simple premise. If you leave this app without feeling at least a little bit changed as a person, you're either not paying attention or completely lack empathy.\n\nHelpful | 3\nDeveloper ResponseJan 25 at 11:16 PM\n\nThank you so much for the words of encouragement :)", "Rylee.FJan 25 at 6:07 AM\n\nAlmost cried I loved it.\n\nHelpful | 0\nDeveloper ResponseJan 28 at 12:57 PM\n\nAw, thanks for the review, Rylee! I just released an update today and there's more coming soon!", "lukebobmapleDec 13 at 10:29 AM\nIncredible\n\nStarted this up last night, and was blown away by how genuine the thoughts were. It has beautiful surroundings and music, and this helped to coax a few thoughts out of me :) very relaxing experience\n\nHelpful | 4", "lewisross421Dec 16 at 6:23 PM\nCringe\n\nI found a lot of the user responses to be cringe worthy, and predictable. It has potential, but unfortunately its a little bit underwhelming\n\nHelpful | 4\nDeveloper ResponseJan 20 at 1:47 AM\n\nHi, Lewis! Thanks for the feedback and the purchase. These are real recordings left by real people, so sometimes they're a bit mundane, but I think that's part of the beauty of it :)", "FMFGSXDec 13 at 8:31 PM\nHeart warming journey\n\nThis game has an amazing concept that builds a great community behind. It has a very raw experience hearing everyones stories without every meeting them. Highly recommend you experience this for yourself!\n\nHelpful | 2", "JoannaPopperDec 22 at 9:27 AM\nLove this experience\n\nWhat a wonderful experience to hear soul-baring life stories from other users. Please make more like it.\n\nHelpful | 2", "Auld_PharrrtDec 13 at 3:03 AM\nI had my reservations\n\nand I wish I'd acted upon them and resisted buying this app. It's time to lose my refund virgin status with Oculus.\n\nHelpful | 11\nDeveloper ResponseJan 20 at 1:49 AM\n\nHi, Auld! This is a more quiet, intimate and meditative VR experience, so maybe it wasn't for you? :)", "BigInitialDDec 15 at 12:29 AM\nAmazing\n\nI absolutely loved this, it made me smile it made my cry and it out some things in perspective. This was an incredible journey that I will be sharing with everyone I can.\n\nHelpful | 1", "Star7SkyDec 12 at 3:40 PM\nExactly what it should be\n\nThe title says it all. The visuals are great and the experience really hits close to home <3\n\nHelpful | 10", "zack.slotkowskiDec 27 at 9:15 PM\nBeautiful\n\nBeautiful listening to everyones answers. My fianc and I loved it.\n\nHelpful | 2", "JohnReeseEDec 16 at 3:03 AM\nNo thanks\n\nI found this app to be rather boring. I can easily post these questions on reddit and read the responses they give, FOR FREE\n\nHelpful | 5\nDeveloper ResponseJan 20 at 1:47 AM\n\nHi, John! Where Thoughts Go is all about creating an immersive experience where you can go deep into the thoughts of others as well as your own. AskReddit is nice, but I think it's a totally different experience :)", "DAX_QcDec 13 at 6:27 PM\nGreat idea and potential but nope.\n\nToo empty. Not enough questions/content. Cant move. Basic design fit well yet too basic.\nRefunded. This should be almost free!\n\nHelpful | 5\nDeveloper ResponseJan 28 at 12:55 PM\n\nHi, DAX! We'll be adding new content monthly for free in the experience and grow it with the community ^_^ In regards to the price, I'm not sure what to tell you. A lot of people seem to be enjoying the experience and I need a way to support myself to keep working on this :)", "BobbiHereDec 14 at 11:09 PM\nDifferent ..Original\n\nOriginal concept. Interesting. Looking forward to more.\n\nHelpful | 1", "anshelsagDec 12 at 2:13 PM\nThoughtful\n\nI tried this experience months ago at Wonderspaces and it was extremely touching but also very easy to navigate and use. If you're looking for a VR app to touch you and others, this is it. It is a shared experience that really makes you think about your life and perspective.\n\nHelpful | 9", "bobfineDec 12 at 5:47 PM\nSimply Brilliant!!!\n\n10/10!!!\n\nHelpful | 8"]