{"App Title": "Within", "App description": "This is our love letter to the emerging art form of Cinematic VR.\n\n What it is: beautiful immersive stories  award-winning VR documentaries, animation, music videos, horror, + more\n Photo-real people & places: everything is captured with cameras or rendered CGI\n Quality > Quantity: we hand-pick only the best from independent creators, studios, and film festivals from around the world every month\n Hi-res: if you download the experiences (streaming is fast but lower res)\n Free: no charges, no ads\n What it isn't: an interactive VR game (though we love those too!)\n\nWith love,\nThe Within team", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "360 Experience (non-game), Movie, Music Video, Narrative", "Languages": "English", "Version + Release Notes": "5.8.1277", "Developer": "Within Unlimited, Inc.", "Publisher": "Within Unlimited, Inc.", "Website": "http://with.in/", "Release Date": "July 11, 2019", "Developer Privacy Policy": "WITHIN\nExperiences\nAbout\nCareers\nGET THE APP\n|\nSign Up\nLog In\nHome\nExperiences\nAbout\nCareers\nGet the App\nSign Up\nLog In\nWithin Unlimited, Inc. Privacy Policy\nEFFECTIVE AS OF JANUARY 31, 2020\n\nWelcome to Within Unlimited, Inc. (Within, we, us and/or our). We have prepared this Privacy Policy to explain how we collect, use, protect and disclose information and data when you use the Within website (Site) and any Within services, including any software, mobile applications, products, devices or other services offered by Within from time to time and other services offered through third parties integrating Within functionality (collectively, Services). You refers to you as a user of the Site or Services.\n\nWe provide important information for California residents here.\n\nTABLE OF CONTENTS\nPERSONAL INFORMATION WE COLLECT\nHOW WE USE YOUR PERSONAL INFORMATION\nWITH WHOM WE SHARE YOUR PERSONAL INFORMATION\nYOUR CHOICES\nOTHER SITES AND SERVICES\nSECURITY\nCHILDRENS PRIVACY\nINTERNATIONAL DATA TRANSFER\nCHANGES TO THIS PRIVACY POLICY\nHOW TO CONTACT US\nIMPORTANT INFORMATION FOR CALIFORNIA RESIDENTS\nPERSONAL INFORMATION WE COLLECT\n\nPersonal information you provide to us. Personal information you may provide to us when you use the Services or otherwise includes:\n\nContact data, such as your name, email address, mailing address and phone number;\nProfile data that you provide when you register for or update your account on the Services, such as your username and password, home city or town, age, profile image, height, weight, injuries and/or limitations, equipment you own, activity preferences, followers and workout ratings.\nFitness and performance data, such as, for our Supernatural service, heart rate data, classes taken, fitness performance history, achievements, workout history and details and additional fitness information that you choose to link to or share with us through Within.\nFinancial data, such as your credit card number and/or other related information that may be required from you to complete your purchase, however Stripe and other App Store transactions are stored solely by those partners/platforms.\nPurchase data, such as order history and information about the transactions you have completed with us.\nOther information that we may collect which is not specifically listed here, which we will use as described in this Privacy Policy or as otherwise disclosed at the time of collection.\n\nInformation collected automatically. We, our service providers and our third party partners may automatically log information about you, your computer or mobile device, and your activity over time on the Services and other online services, including:\n\nUsage data, such as the date and time of your access, visit or use of the Services, pages or screens you viewed, how long you spent on a page or screen, navigation paths between pages or screens, searches you conduct on our Site and information about your activity on a page or screen.\nDevice data, such as unique device identifier, media access control address, network information, hardware model, browser type, screen resolution, IP address as well as usage and traffic data and information about how the device interacts with the Services.\nPrecise geolocation data, such as when you authorize our mobile application to access your location.\n\nSome of our automatic collection is facilitated by:\n\nCookies, which are text files that websites store on a visitors device to uniquely identify the visitors browser or to store information or settings in the browser for the purpose of tracking user activity and patterns, helping you navigate between pages efficiently, remembering your preferences and generally improving your browsing experience.\nWeb beacons, also known as pixel tags or clear GIFs, which are typically used demonstrate that a webpage or email was accessed or opened, or that certain content was viewed or clicked, typically to compile statistics about usage of websites and the success of marketing campaigns. We may use web beacons to track your use of Site or to collect information about your interactions with our email messages, such as the links you click on and whether you open or forward a message, the date and time of these interactions and the device you use to read emails.\n\nThird party platforms. When you choose to connect with a social media service or other third party platform when using the Services, including Facebook, Google or Oculus, we may collect information about you from that platform, including any information that you choose to import into the Services. You may also be able to access posting and sharing tools on the Services that allow you to post information to a social media or third party platform. By using these tools, you acknowledge that some account information may be transmitted from the applicable platform account to us; our treatment of that information is covered by this Privacy Policy. Additionally, when you use one of these tools, the social media or third party platform may be collecting information about your online activity through its own tracking technologies, subject to its own privacy policy. We encourage you to read the privacy and other policies of any third party platform you use in connection with the Services.\n\nHOW WE USE YOUR PERSONAL INFORMATION\n\nWe may use your personal information for the purpose for which it was provided, including without limitation for the purposes described further below:\n\nService delivery. We may use your personal information to:\n\nprovide you with access to the Services;\nsupport and maintain your use of the Services\nmonitor your use of the Services;\nprovide you with the opportunity to participate in surveys, contests and other special offers;\nenhance or supplement the Services;\ncommunicate with you about the Services, including regarding the status of any orders of products and to respond to your inquiries, including for customer support; and\nunderstand your needs and interests, and personalize your experience with the Services and our communications.\n\nResearch and development. We may use your personal information for research and development purposes, including to analyze and improve the Services and our business. As part of these activities, we may create aggregated, de-identified or other anonymous data from personal information we collect. We make personal information into anonymous data by removing information that makes the data personally identifiable to you. We may use this anonymous data and share it with third parties for our lawful business purposes, including to analyze and improve the Services and promote our business.\n\nMarketing and advertising. We and our third party advertising partners may collect and use your personal information for marketing and advertising purposes:\n\nDirect marketing. We may send you Within-related or other direct marketing communications as permitted by law. You may opt-out of our marketing communications as described in the Opt-out of marketing communications section below.\nInterest-based advertising. We may contract with third-party advertising companies and social media companies to display ads on the Services and other sites. These companies may use cookies and similar technologies to try to tailor the ads you see online to your interests based on your activity over time across the Services and other sites, or your interaction with our emails. These ads are known as interest-based advertisements. You can learn more about your choices for limiting interest-based advertising, in the Advertising choices section below.\n\nCompliance and protection. We may use your personal information to:\n\ncomply with applicable laws, lawful requests, and legal process, such as to respond to subpoenas or requests from government authorities.\nprotect our, your or others rights, privacy, safety or property (including by making and defending legal claims);\nenforce the terms and conditions that govern the Services; and\nprevent, identify, investigate and deter fraudulent, harmful, unauthorized, unethical or illegal activity, including cyberattacks and identity theft.\n\nFor other purposes. We may also use your personal information for other purposes described in this Privacy Policy or at the time we collect the information.\n\nWITH WHOM WE SHARE YOUR PERSONAL INFORMATION\n\nWe may share your personal information with the following parties and as otherwise described in this Privacy Policy or at the time of collection:\n\nAffiliates. We may disclose your personal information to our subsidiaries and corporate affiliates for use consistent with this Privacy Policy.\n\nPayment processors. Any payment card information you use to make a purchase on the Services is collected and processed directly by one of our payment processors, Stripe or Oculus, and we never physically receive or store your full payment card information.\n\nOther users and the public. By using the Site or Services, including creation of a profile or submission of public queries, you may make certain of your Personal Information available to others, such as your name, your user name, and your picture. This information may be accessed by users who use the Site or Services and may be accessed by commercial search engines such as Google, Yahoo!, and Bing to the extent that such engines are permitted to access the Site or Services.\n\nService providers. From time to time, we may establish a business relationship with other businesses that we believe to be trustworthy and have privacy practices consistent with ours (Service Providers). For example, we may contract with Service Providers to provide certain services, such as hosting and maintenance, data storage and management, music integration and marketing and promotions. We only provide our Service Providers with the information necessary for them to perform these services on our behalf. Each Service Provider must agree to use reasonable security procedures and practices, appropriate to the nature of the information involved, in order to protect your Personal Information from unauthorized access, use or disclosure. Service Providers are prohibited from using Personal Information other than as specified by Within.\n\nAdvertising partners. We may work with third-party advertisers, search providers, and ad networks (Advertisers). These companies may collect and use information about your use of the Site or Services in order to provide advertisements about goods and services that may be of interest to you. Advertisements may be shown via the Site, the Services, or third-party websites and online services. These companies may place or recognize a unique cookie on your computer or use other technologies such as web beacons. Our Privacy Policy does not cover any use of information that Advertisers may collect from you or that you choose to provide to them.\n\nBusiness transferees. If Within is merged, acquired, or sold, or in the event of a transfer of some or all of our assets or equity, we may sell, disclose or transfer your personal information in connection with such transaction, in which case we will make reasonable efforts to require the recipient to honor this Privacy Policy.\n\nProfessional advisors. We may disclose your personal information to professional advisors, such as lawyers, bankers, auditors and insurers, where necessary in the course of the professional services they render to us.\n\nLaw enforcement. Within will cooperate with government and law enforcement officials and private parties to enforce and comply with the law. We may disclose your personal information to government or law enforcement officials or private parties if, in our discretion, we believe it is necessary or appropriate in order to respond to legal requests (including court orders and subpoenas), to protect the safety, property or rights of Within or of any third party, to prevent or stop any illegal, unethical, or legally actionable activity, or to comply with the law.\n\nFor other purposes. We may also share your personal information for other purposes described in this Privacy Policy or with your consent.\n\nYOUR CHOICES\n\nOpt-out of marketing communications. You can opt out of receiving certain emails by changing notification settings on the Site or in our applications, clicking the unsubscribe link provided in an email, or by emailing us at support@with.in. If you have questions or concerns regarding this Privacy Policy, please email us at support@with.in.\n\nAccount information. If you have purchased a subscription or otherwise signed up for an account, then you may access your account at any time once logged on, and you may modify, update and change your account settings through your account on the Services. When you update information, we may maintain a copy of the unrevised information in our records. You can also delete your account by emailing us at support@with.in. Please note that we will need to verify that you have the authority to delete the account. Also, some information may remain in our records after your deletion of such information from your account, and public activity on your account prior to deletion may remain publicly accessible.\n\nCookies. Most browsers let you remove or reject cookies. To do this, follow the instructions in your browser settings. Many browsers accept cookies by default until you change your settings. Please note that if you set your browser to disable cookies, the Services may not work properly. For more information about cookies, including how to see what cookies have been set on your browser and how to manage and delete them, visit www.allaboutcookies.org.\n\nPrivacy settings and location data. Users of our mobile application can disable our access to their devices precise geolocation in their mobile device settings.\n\nAdvertising choices. Like many companies online, we use services provided by Google, Facebook and others that help deliver interest-based ads to you. Your choices for limiting collection and/or use of your personal information by these companies include:\n\nBrowser settings. Blocking third party cookies in your browser settings using or ad-blocking browser plug-ins/extensions.\nMobile device settings. Using your mobile device settings to limit use of the advertising ID associated with your mobile device for interest-based advertising purposes.\nPlatform settings. Using Googles and Facebooks interest-based advertising opt-out features:\nGoogle: https://adssettings.google.com/\nFacebook: https://www.facebook.com/about/ads\nAd industry tools. Opting out of interest-based ads from companies participating in the following industry opt-out programs:\nNetwork Advertising Initiative: http://www.networkadvertising.org/managing/opt_out.asp\nDigital Advertising Alliance:\noptout.aboutads.info, which lets you opt-out of interest-based ads on websites.\nAppChoices mobile app, available at https://www.youradchoices.com/appchoices, which lets you opt-out of interest-based ads in mobile apps.\n\n\nThe opt-out preferences described above must be set on each device for which you want them to apply. Not all companies that serve interest-based ads participate in the ad industry opt-out programs described above, so even after opting-out, you may still receive some cookies and interest-based ads from other companies. If you opt-out of interest-based advertisements, you will still see advertisements online but they may be less relevant to you.\n\nDo Not Track. Some Internet browsers may be configured to send Do Not Track signals to the online services that you visit. We currently do not respond to Do Not Track or similar signals. To find out more about Do Not Track, please visit http://www.allaboutdnt.com.\n\nChoosing not to share your personal information. If you do not provide information that we need to provide the Services, we may not be able to provide you with the Services or certain features. We will tell you what information you must provide to receive the Services when we request it.\n\nThird party platforms. If you choose to connect to Within through your social media account on Facebook or Google or another third party platform like Oculus, you may be able to use your settings in your account with that platform to limit the information we receive from it. If you revoke our ability to access information from a third party platform, that choice will not apply to information that we have already received from that third party.\n\nOTHER SITES AND SERVICES\n\nOur Site and Services may contain links to or integrate with other websites and online services, or allow others to send you such links. These links are not an endorsement of, or representation that we are affiliated with, any third party. We do not control websites or other online services operated by third parties, and Within is not responsible or liable for any damage or loss related to your use of any such third-party website or online service. You should always read the terms and conditions and privacy policy of a third-party website or online service before using it, whether directly or in connection with your use of the Site or Services.\n\nSECURITY\n\nWe employ a number of technical, organizational and physical safeguards designed to protect the personal information we collect. However, no data transmission over the Internet or other network can be guaranteed to be 100% secure. As a result, while we strive to protect information transmitted on or through the Site or Services, we cannot and do not guarantee the security of any information you transmit on or through the Site or Services, and you do so at your own risk.\n\nCHILDREN'S PRIVACY\n\nWe offer to our users a range of Services, some of which are primarily targeted at children, and others that are intended for users of all ages and their families. We are required under the Children Online Privacy Protection Act (COPPA), with limited exceptions, to obtain verifiable parental consent in order to collect, use, or disclose personal information from children.\n\nMany of our Services are intended for general audiences and do not knowingly collect any personal information from children. If our Services request age information from your child and your child indicates that he/she is under 13 years old (except for our Supernatural service), the Services will block your child from providing personal information. However, please note that if your child indicates that he/she is under the age of 13, your child will not be blocked from using our Services (except for our Supernatural service). For more information on age limitations for the Supernatural service, please see our Supernatural Terms of Use.\n\nFor our Services that are primarily directed at children under the age of 13, we do not collect personal information, except in those instances under COPPA where personal information may be collected without verifiable parental consent. For example, if your child provides us feedback or contacts us (for support, for example), we will collect the data included in the communication. We will use this personal information to assist your child with his/her query or support request and then delete such information once we have fulfilled the childs query or support request. We do not share your childs personal information with third parties, other than as described in this Privacy Policy.\n\nWe do not knowingly collect personal information from children under the age of 13. If we learn that we have inadvertently collected personal information from a child under the age of 13, we will delete such information from our records. If you believe that we might have any personal information from a child under 13, please contact us at support@with.in.\n\nINTERNATIONAL DATA TRANSFER\n\nWe are headquartered in the United States and may use service providers in other countries. Your personal information may be transferred to the United States or other locations where privacy laws may not be as protective as those in your state, province, or country.\n\nPRIVACY POLICY CHANGES\n\nFrom time to time, we may change this Privacy Policy. If we change this Privacy Policy, we will give you notice by posting the revised Privacy Policy on the Site and within our Services. Those changes will go into effect on the effective date shown in the revised Privacy Policy. In all cases, by continuing to use the Site or Services, you consent to the revised Privacy Policy.\n\nPLEASE PRINT A COPY OF THIS PRIVACY POLICY FOR YOUR RECORDS AND PLEASE CHECK THE SITE FREQUENTLY FOR ANY CHANGES TO THIS PRIVACY POLICY.\n\nHOW TO CONTACT US\n\nIf you have any questions about this Privacy Policy or our information handling practices, you may contact us at support@with.in or via postal mail at the following address: Within Unlimited, Inc., Privacy Policy Inquiry, 3760 Motor Avenue, Los Angeles, California 90034.\n\nIMPORTANT INFORMATION FOR CALIFORNIA RESIDENTS\n\nThis section applies only to California residents and is immediately effective at the time this Privacy Policy is posted. It describes how we collect, use and share Personal Information of California residents in operating our business, and their rights with respect to that Personal Information. For purposes of this section, Personal Information has the meaning given in the California Consumer Privacy Act of 2018 (CCPA) but does not include information exempted from the scope of the CCPA.\n\nYour California privacy rights. As a California resident, you have the rights listed below. However, these rights are not absolute, and in certain cases we may decline your request as permitted by law.\n\nInformation. You can request the following information about how we have collected and used your Personal Information during the past 12 months:\nThe categories of Personal Information that we have collected.\nThe categories of sources from which we collected Personal Information.\nThe business or commercial purpose for collecting and/or selling Personal Information.\nThe categories of third parties with whom we share Personal Information.\nWhether we have disclosed your Personal Information for a business purpose, and if so, the categories of Personal Information received by each category of third party recipient.\nWhether weve sold your Personal Information, and if so, the categories of Personal Information received by each category of third party recipient.\nAccess. You can request a copy of the Personal Information that we have collected about you during the past 12 months.\nDeletion. You can ask us to delete the Personal Information that we have collected from you.\nNondiscrimination. You are entitled to exercise the rights described above free from discrimination in the form of legally prohibited increases in the price or decreases in the quality of the Services.\n\nHow to exercise your rights. You may exercise your California privacy rights described above as follows:\n\nRight to information, access and deletion. You can request to exercise your information, access and deletion rights by emailing us at support@with.in, visiting our website at with.in/CCPA or by calling (888) 602-4744. We reserve the right to confirm your California residence and will need to confirm your identity to process your requests. As part of this process, government identification may be required. Consistent with California law, you may designate an authorized agent to make a request on your behalf. In order to designate an authorized agent to make a request on your behalf, you must provide a valid power of attorney, the requesters valid government-issued identification, and the authorized agents valid government issued identification. We cannot process your request if you do not provide us with sufficient detail to allow us to understand and respond to it.\nRequest a list of third party marketers. Californias Shine the Light law (California Civil Code  1798.83) allows California residents to ask companies with whom they have formed a business relationship primarily for personal, family or household purposes to provide certain information about the companies sharing of certain personal information with third parties for their direct marketing purposes during the preceding year. You can submit such a request by sending an email to support@with.in with Shine the Light in the subject line. The request must include your current name, street address, city, state, and zip code and attest to the fact that you are a California resident.\nWe do not sell your personal information. Based on our understanding of the term sell under the CCPA, we do not sell your Personal Information and have not sold it to third parties for a business or commercial purpose in the 12 months preceding the effective date of this Privacy Policy. However, like many companies online, we use services provided by Google, Facebook and others that help deliver interest-based ads to you as described in the section above entitled Interest-Based Advertising. You can review your options for opting-out of such services in the section above entitled Advertising choices.\n\nPersonal information that we collect, use and share. We are required to explain the categories of Personal Information we collect by reference to the categories specified by the CCPA (in bold), as defined here, which are described in the list below. For each category, we list the type of data we collect and the source of that data as described in the section above entitled Personal Information We Collect. We have not sold your personal information in the preceding 12 months.\n\nIdentifiers\nWhat we collect: Contact data, profile data\nSources: You, third party platforms\nCommercial information\nWhat we collect: Profile data, fitness and performance data, purchase data, usage data\nSources: You, automatic collection, third party platforms\nFinancial Information\nWhat we collect: Financial data\nSources: You\nOnline identifiers\nWhat we collect: Contact data, profile data, usage data, device data\nSources: You, automatic collection, third party platforms\nInternet or network information\nWhat we collect: Device data, usage data\nSources: Automatic collection\nGeolocation data\nWhat we collect: Device data, precise geolocation data\nSources: Automatic collection\nInferences drawn from any of the above information to create a profile reflecting your preferences, characteristics, and behavior.\nMay be derived from: Profile data, fitness and performance data, purchase data, usage data.\nMedical Information\nWhat we collect: Profile data, fitness and performance data\nSources: You, third party platforms\nPhysical Description\nWhat we collect: Profile data, fitness and performance data\nSources: You, third party platforms\nProtected Classification Characteristics, which we do not intentionally collect, but may be revealed in other data we collect.\nBiometric Information\nWhat we collect: Profile data, fitness and performance data\nSources: You, third party platforms\n\nThe business/commercial purposes for which we use each category of Personal Information above are described in the section above entitled How We Use Your Personal Information. The categories of third parties to which we disclose each category of Personal Information above of Personal Information for business purposes are described in the section above entitled With Whom We Share Your Personal Information.\n\nThe above summary of how we collect, use, share Personal Information describes our practices for the 12 months preceding the effective date at the top of this Privacy Policy. Information that you choose to provide to us may include other categories of information.\n\n\n\nCompany\nAbout\nCareers\nContact\nTerms\nPrivacy\nDiscover\nExperiences\nHow to Watch VR\nCreators\nHelp\nPlatforms\niOS\nAndroid\nDaydream\nGear VR\nOculus Rift\nPlayStationVR\nSteamVR\nViveport\nWebVR\nFacebook Twitter Instagram Medium YouTube STAY IN TOUCH", "Developer Terms of Service": "WITHIN\nExperiences\nAbout\nCareers\nGET THE APP\n|\nSign Up\nLog In\nHome\nExperiences\nAbout\nCareers\nGet the App\nSign Up\nLog In\nWithin Unlimited, Inc. Terms and Conditions\n\nTerms Updated February 1, 2017\n\nIMPORTANT  THIS AGREEMENT (\"AGREEMENT\") IS A LEGAL AGREEMENT BETWEEN YOU (EITHER AN INDIVIDUAL OR ENTITY) (\"YOU\" or \"YOUR\") AND WITHIN UNLIMITED, INC. (HEREINAFTER \"COMPANY,\" \"WE\", \"US\" OR \"OUR\") THAT SETS FORTH THE LEGAL TERMS AND CONDITIONS FOR YOUR USE OF WWW.WITH.IN AND ANY OTHER WEBSITE OWNED AND OPERATED BY COMPANY (THE \"WEBSITE(S)\") AND COMPANY SERVICES, INCLUDING ANY SOFTWARE, COMPANY MOBILE APPLICATIONS (THE \"APP(S)\"), PRODUCTS, DEVICES OR OTHER SERVICES OFFERED BY COMPANY FROM TIME TO TIME AND OTHER SERVICES OFFERED THROUGH THIRD PARTIES INTEGRATING COMPANY FUNCTIONALITY (COLLECTIVELY, \"SERVICE(S)\").\n\nAgreement. BY USING ANY WEBSITES OR USING ANY SERVICES FROM COMPANY, YOU AGREE TO THE TERMS AND CONDITIONS OF THIS AGREEMENT. PLEASE BE ADVISED THAT THIS AGREEMENT CONTAINS PROVISIONS THAT GOVERN HOW DISPUTES BETWEEN US ARE RESOLVED, WHICH INCLUDE A JURY TRIAL WAIVER AND A CLASS ACTION WAIVER. PLEASE SEE SECTION 14 FOR MORE DETAILS.\n\nSOME OF OUR SERVICES MAY HAVE ADDITIONAL RULES, POLICIES, AND PROCEDURES (\"ADDITIONAL TERMS\"). WHERE ADDITIONAL TERMS APPLY, WE WILL MAKE THEM AVAILABLE FOR YOU TO READ THROUGH IN CONNECTION WITH YOUR USE OF THAT SERVICE. BY USING THAT SERVICE, YOU AGREE TO THE ADDITIONAL TERMS.\n\nWE RESERVE THE RIGHT TO CHANGE THE TERMS AND CONDITIONS OF THIS AGREEMENT OR TO MODIFY OR DISCONTINUE THE SERVICES OFFERED BY COMPANY AT ANY TIME. IF WE CHANGE THIS AGREEMENT, WE WILL POST THE REVISED AGREEMENT ON THE APPLICABLE WEBSITE(S) OR APP(S) AND ATTEMPT TO GIVE YOU NOTICE VIA A POSTING ON THE WEBSITE(S) OR APP(S) AND/OR BY SENDING YOU AN EMAIL AT THE ADDRESS YOU HAVE PROVIDED (IF ANY). THOSE CHANGES WILL GO INTO EFFECT ON THE EFFECTIVE DATE SHOWN IN THE REVISED AGREEMENT.\n\nBY CONTINUING TO USE ANY WEBSITES OR TO PURCHASE OR USE ANY SERVICES FROM COMPANY AFTER THE NEW EFFECTIVE DATE, YOU AGREE TO BE BOUND BY SUCH CHANGES.\n\nEligibility. If requested from you, you agree to provide us with complete and current account registration information. Persons under 13 are prohibited from providing personal information on our Websites or via our Apps. If you are under 18, you may only use our Websites and Apps with the supervision of a parent or guardian 18 years of age or older.\n\nAcceptable Use. You are responsible for your use of the Websites and Services, and for any use of the Websites and Services made using your account. Our goal is to create a positive, rewarding, and safe experience in connection with our Websites and Services. To promote this goal, we prohibit certain kinds of conduct that may be harmful to other users, our third-party licensors or to Company. When you use the Websites and Services, you may not:\n\nviolate any law or regulation;\nviolate, infringe, or misappropriate other people's intellectual property, privacy, publicity, or other legal rights;\nremove any proprietary notices from the Websites, Apps or Content (as defined in Section 4 below);\nuse the Websites, Apps or Content for any commercial purpose, or for the benefit of any third party, or charge any person or entity, or receive any compensation for, the use of the Websites, Apps or Content;\npost or share anything that is illegal, abusive, harassing, harmful to reputation, pornographic, indecent, profane, obscene, hateful, racist, or otherwise objectionable;\nsend unsolicited or unauthorized advertising or commercial communications, such as spam (additionally, please read our Anti-Spam Policy in Section 10 below);\nmake any false, misleading or deceptive statement or representation regarding the Company, the Website, the Apps or the Content;\ntransmit any viruses or other computer instructions or technological means whose purpose is to disrupt, damage, or interfere with the use of computers or related systems;\nstalk, harass, or harm another individual;\nimpersonate any person or entity or perform any other similar fraudulent activity, such as phishing;\nuse any means to scrape or crawl any Web pages or Content contained in, on or through the Websites or Apps (although Company may allow operators of public search engines to use spiders to index materials from the Websites for the sole purpose of creating publicly available searchable indices of the materials, and Company reserves the right to revoke these exceptions either generally or in specific cases);\nuse automated methods to use the Websites, Apps or Content;\nattempt to circumvent any technological measure implemented by Company or any of Company's providers or any other third party (including another user) to protect the Websites, Apps or Content;\ntransfer, assign, copy or duplicate any of the source code or software of the Company or of any third-party licensor used to provide or incorporated in the Websites, Apps or Content;\nattempt to decipher, decompile, disassemble, reverse engineer or in any other way derive any source code or software of the Company or of any third-party licensor used to provide or incorporated in the Websites, Apps or Content; or\nadvocate, encourage, or assist any third party in doing any of the foregoing.\n\nIf you elect to download the App, the following also applies: Company grants you a personal, revocable, non-exclusive, non-transferable license (without a right to sublicense) to download, install and use a copy of the App on a single mobile device or computer that you own or control solely for your personal and professional use, subject at all times to this Agreement, including the restrictions on use, the acceptable use provisions and our right to remove your Content at our discretion at any time. Furthermore, with respect to any App accessed through or downloaded from an App Store such as the Android Market or Apple App Store (an \"App Store Sourced Application\"), you will only use the App Store Sourced Application: (i) on a product that runs the operating system for which it was intended and (ii) as permitted by the \"Usage Rules\" set forth in the corresponding App Store. Use of the App from a third party App Store is also subject to the provisions of Section 16.\n\nOwnership & Copyright Restrictions. You acknowledge and agree that the Company, or its third-party licensors, own all right, title and interest in and to the Websites, Apps and Content, including all intellectual property, industrial property and proprietary rights recognized anywhere in the world at any time. The Websites and Apps, including but not limited to software, content, text, photographs, images, graphics, video, audio and the compilation as a whole (\"Content\"), are copyrighted under U.S. copyright and other laws by Company or its third-party licensors, unless otherwise noted. You must abide by all additional copyright notices or restrictions contained in the Websites, Apps, Content or elsewhere. You may not delete any author attributions, legal or proprietary notices in the Websites, Apps, Content or elsewhere.\n\nExcept as noted in Sections 5 and 7 below: (1) the Websites, Apps and Content may not be used, displayed, copied, reproduced, distributed, republished, uploaded, downloaded, posted, transmitted, mirrored, modified, or otherwise, or in any way exploited for personal gain; (2) you may not redistribute, sell, translate, modify, reverse-engineer or reverse-compile or decompile, disassemble or make derivative works of the Websites, Apps or any Content or components that are available in, on or through the Websites or Apps; and (3) you may not make commercial use of any webpage or Services provided by Company, including redistribution or copying by any means; EXCEPT with the prior, express written permission of Company.\n\nYou agree not to interfere or take action that results in interference with or disruption of the Websites, Apps or Content or servers or networks connected to the Websites, Apps or Content. You agree not to attempt to gain unauthorized access to other computer systems or networks connected to the Websites, Apps or Content. Company reserves all other rights. Except as expressly provided herein, nothing on the Websites or as part of the Services will be construed as conferring any license under Companys and/or any third partys (including but not limited to any third-party licensors) intellectual property rights, whether by estoppel, implication or otherwise. Notwithstanding anything herein to the contrary, Company may revoke any of the foregoing rights and/or your access to the Websites, Content and Services, including the Apps, or any part thereof, at any time without prior notice.\n\nCopyright Permission. Permission is granted for viewing the Website pages on the Internet and Content via the Websites and Apps, subject to the terms and conditions of this Agreement. In the event that information is downloaded from the Websites or Apps, the information, including any Content, data or files incorporated in or generated by the Websites or Apps are owned by Company and Company retains complete title to the information and Content and all property rights therein. All other rights are reserved.\n\nTrademarks. All Content, product names, trademarks, service marks and logos on the Websites, Apps or as part of the Services, unless otherwise noted, are wholly owned or validly licensed by Company. Trademarks, service marks and logos owned by third parties remain the property of such third parties.\n\nEmbedding Content. The Company may from time to time provide you with the capability to embed Content from the Websites or Apps on your own personal site. To the extent the Company provides such capability, you are hereby granted a limited, non-exclusive, revocable right and license to use the HTML or other code made available by the Company to embed the applicable Content and to display such Content in the form provided by the Company on your own personal site, in each case, for your own personal and non-commercial use. You agree not to license, create derivative works from, transfer, assign, reproduce, sell or re-sell any information, Content, materials, data or services obtained from or delivered through the use of the embedding code. Unless otherwise set forth in a written agreement between you and the Company, you must adhere to the Companys embedding policy as follows: (a) the appearance, position and other aspects of the Content made available via the embedding code or its display may not be such as to damage or dilute the goodwill associated with the Company or its third-party licensors names and trademarks; (b) the appearance, position and other aspects of the Content made available via the embedding code or its display may not create the false appearance that you or your organization is sponsored by, endorsed by, affiliated with, or associated with the Company or its third-party licensors; (c) when selected by a user on your site, the Content made available via the embedding code must be displayed in the form and format provided by Company via the embedding code, and may not be altered, abridged, expanded, or otherwise modified; and (d) the appearance, position and other aspects of the Content made available via the embedding code or its display may not in any way violate any other terms of this Agreement. For the avoidance of doubt, the Company expressly prohibits the embedding of Content on any sites that could be viewed as offensive, unlawful, harmful to minors, obscene, defamatory, libelous, threatening, pornographic, harassing, hateful, racially or ethnically offensive, or that encourages conduct that would be considered a criminal offense, gives rise to civil liability, violates any law or is otherwise objectionable. The Company reserves the right to revoke its license grant to use the embedding code at any time, for any reason, and in its sole discretion.\n\nIdea Submissions. If you submit any ideas, suggestions or testimonials to Company, we have the right to use your submission without charge in any manner that we deem appropriate, including posting on the Internet. You may only post ideas and material to the Websites if you have obtained appropriate copyright and other permission to post such materials and to permit Company to use such material without restriction. You agree that you will not violate or infringe the rights of third parties, including privacy, publicity and intellectual and proprietary rights, such as copyright or trademark rights.\n\nPrivacy Policy. Company has customer information and privacy policies as set forth in its online Privacy Policy located athttps://www.with.in/privacy, which is fully incorporated herein by reference. You hereby agree to be bound by Company's Privacy Policy. Consistent with these policies, you may not collect, distribute or gather personal or aggregate information, including Internet or e-mail addresses, about Company's customers or other users.\n\nWe respond to notices of claimed copyright infringement in accordance with the Digital Millennium Copyright Act (\"DMCA\"). It is our policy to terminate the account of any user we determine, in our sole discretion, to be a repeat infringer of copyrights. Our full DMCA Copyright Policy page can be found athttps://www.with.in/copyright.\n\nAnti-Spam Policy. Company prohibits the sending of unsolicited bulk email (spam). Spam is defined for this purpose as sending multiple messages similar in content to any persons, entities, newsgroups, forums, email lists, or other groups or lists unless prior authorization has been obtained from the email recipient or unless a business or personal relationship has already been established with the email recipient. Company also prohibits using false headers in emails or falsifying, forging or altering the origin of any email in connection with Company, and/or its products and services. Company prohibits engaging in any of the foregoing activities by using the service of another provider, remailer service, or otherwise.\n\nIF YOU OR ANYONE YOU KNOW IS \"SPAMMED\" BY SOMEONE WHO IS SELLING OR DESCRIBING COMPANY'S PRODUCTS OR SERVICES, PLEASE CONTACT US PROMPTLY SO THAT WE MAY TAKE APPROPRIATE ACTION.\n\nDISCLAIMER. COMPANY DOES NOT MAKE ANY REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, COMPATIBILITY, SECURITY, ACCURACY, OR USEFULNESS WITH RESPECT TO COMPANY'S SERVICES, THE WEBSITES, OR INFORMATION OR CONTENT CONTAINED IN, ON OR THROUGH THE WEBSITES OR APPS.\n\nTHE SERVICES ARE PROVIDED \"AS IS.\" YOU MAY RELY ON THE SERVICES SOLELY AT YOUR OWN RISK. WE DO NOT WARRANT THAT THE SERVICES WILL BE UNINTERRUPTED OR ERROR-FREE, AND THERE MAY BE DELAYS, OMISSIONS, INTERRUPTIONS AND INACCURACIES IN THE INFORMATION OR OTHER MATERIALS THAT ARE AVAILABLE ON OR THROUGH THE SERVICES. YOU ASSUME FULL RESPONSIBILITY AND RISK OF LOSS, INCLUDING LOSS OF DATA, RESULTING FROM YOUR USE OF THE WEBSITES OR THE SERVICES. YOU WILL BE SOLELY RESPONSIBLE FOR MAINTAINING INDEPENDENT ARCHIVAL AND BACKUP COPIES OF ANY INFORMATION MADE AVAILABLE THROUGH THE WEBSITES OR SERVICES. ALTHOUGH WE INTEND TO TAKE REASONABLE STEPS TO PREVENT THE INTRODUCTION OF VIRUSES AND OTHER DESTRUCTIVE MATERIALS TO THE SERVICES, WE DO NOT GUARANTEE OR WARRANT THAT THE SERVICES OR MATERIALS THAT MAY BE DOWNLOADED FROM THE SERVICES DO NOT CONTAIN SUCH DESTRUCTIVE FEATURES. WE ARE NOT LIABLE FOR ANY DAMAGES OR HARM ATTRIBUTABLE TO THE FOREGOING.\n\nLIMITED LIABILITY. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAWS, YOU AGREE THAT COMPANY, ITS AFFILIATES, AGENTS AND THEIR RESPECTIVE OFFICERS, DIRECTORS, EMPLOYEES, AND AGENTS WILL NOT BE LIABLE FOR ANY PERSONAL INJURY OR FOR ANY INDIRECT, CONSEQUENTIAL OR SPECIAL DAMAGES, INCLUDING LOST PROFITS OR OTHERWISE, ARISING OUT OF OR RELATING IN ANY WAY TO THIS AGREEMENT, YOUR USE OF THE WEBSITES OR YOUR PURCHASE OR USE OF COMPANY SERVICES.\n\nTHE CUMULATIVE LIABILITY OF COMPANY TO YOU FOR ALL CLAIMS ARISING FROM OR RELATING TO THIS AGREEMENT, YOUR USE OF THE WEBSITES OR YOUR PURCHASE OR USE OF COMPANY SERVICES, INCLUDING, WITHOUT LIMITATION, ANY CAUSE OF ACTION SOUNDING IN CONTRACT, TORT, OR STRICT LIABILITY, WILL NOT EXCEED THE GREATER OF (A) THE TOTAL AMOUNT PAID TO COMPANY BY YOU DURING THE SIX-MONTH PERIOD PRIOR TO THE ACT, OMISSION OR OCCURRENCE GIVING RISE TO SUCH LIABILITY, OR (B) $100. THIS LIMITATION OF LIABILITY IS INTENDED TO APPLY WITHOUT REGARD TO WHETHER OTHER PROVISIONS OF THIS AGREEMENT HAVE BEEN BREACHED OR HAVE PROVEN INEFFECTIVE OR IF A REMEDY FAILS OF ITS ESSENTIAL PURPOSE. SOME JURISDICTIONS DO NOT ALLOW FOR LIMITED LIABILITY OR EXCLUSION OF IMPLIED WARRANTIES, SO NOT ALL OF THE ABOVE LIMITATIONS MAY APPLY TO YOU. YOU ACKNOWLEDGE AND UNDERSTAND THAT THE DISCLAIMERS, EXCLUSIONS AND LIMITATIONS OF LIABILITY SET FORTH HEREIN FORM AN ESSENTIAL BASIS OF THE AGREEMENT BETWEEN THE PARTIES HERETO, THAT THE PARTIES HAVE RELIED UPON SUCH DISCLAIMERS, EXCLUSIONS AND LIMITATIONS OF LIABILITY, AND THAT ABSENT SUCH DISCLAIMERS, EXCLUSIONS AND LIMITATIONS OF LIABILITY, THE TERMS AND CONDITIONS OF THIS AGREEMENT WOULD BE SUBSTANTIALLY DIFFERENT.\n\nINDEMNIFICATION. YOU AGREE TO INDEMNIFY AND HOLD HARMLESS COMPANY, ITS AFFILIATES, AGENTS, INDEPENDENT CONSULTANTS, AND THEIR RESPECTIVE OFFICERS, DIRECTORS, EMPLOYEES, AND AGENTS FROM ANY AND ALL LIABILITIES, CLAIMS, EXPENSES AND DAMAGES, INCLUDING REASONABLE ATTORNEYS' FEES AND COSTS, ARISING OUT OF OR IN ANY WAY RELATED TO YOUR BREACH OF THIS AGREEMENT, YOUR USE OF THE WEBSITES OR THE SERVICES, OR IN CONNECTION WITH YOUR ACCOUNT OR ANY OTHER PERSON'S USE OR ACCESS TO THE SERVICES BY OR THROUGH YOUR ACCOUNT, WITH OR WITHOUT YOUR PERMISSION, INCLUDING WITHOUT LIMITATION ANY CLAIMS OF LIBEL, DEFAMATION, VIOLATION OF RIGHTS OF PRIVACY OR PUBLICITY, TRESPASS, AND INFRINGEMENT OF INTELLECTUAL OR OTHER PROPRIETARY RIGHTS.\n\nGoverning Law. This Agreement will be governed by and interpreted in accordance with the laws of the State of California without regard to any conflict of laws principles.\n\nArbitration Agreement. Except as provided herein, you and Company agree that we will resolve any disputes between us through binding and final arbitration instead of through court proceedings. All controversies, claims, counterclaims, or other disputes arising between you and Company relating to the Services or this Agreement (each a \"Claim\") shall be submitted for binding arbitration in accordance with the rules of the American Arbitration Association (\"AAA\"). If AAA is not available to arbitrate, the parties shall agree to select an available alternative dispute resolution provider (\"ADR Provider\") and the rules of such provider shall govern all aspects of the arbitration. The arbitration will be heard and determined by a single arbitrator. The arbitrator's decision in any such arbitration will be final and binding upon the parties and may be enforced in any court of competent jurisdiction. The parties agree that the arbitration will be kept confidential and that the existence of the proceeding and any element of it (including, without limitation, any pleadings, briefs, documents, or other evidence submitted or exchanged and any testimony or other oral submissions and awards) will not be disclosed beyond the arbitration proceedings, except as may lawfully be required in judicial proceedings relating to the arbitration or by applicable disclosure rules and regulations of securities regulatory authorities or other governmental agencies.\n\nFor any claim where the total amount of the award sought is $10,000 or less, the AAA, you and Company must abide by the following rules: (a) the arbitration will be conducted solely based on written submissions; and (b) the arbitration will not involve any personal appearance by the parties or witnesses unless otherwise mutually agreed by the parties. If the claim exceeds $10,000, the right to a hearing will be determined by the AAA rules, and the hearing (if any) must take place in Los Angeles County, California.\n\nIf you demonstrate that the costs of arbitration will be prohibitive as compared to the costs of litigation, Company will pay as much of the administrative costs and arbitrator's fees required for the arbitration as the arbitrator deems necessary to prevent the cost of the arbitration from being prohibitive. In the final award, the arbitrator may apportion the costs of arbitration and the compensation of the arbitrator among the parties in such amounts as the arbitrator deems appropriate.\n\nThis arbitration agreement does not preclude you from seeking action by federal, state, or local government agencies. You and Company also have the right to bring qualifying claims in small claims court. In addition, you and Company retain the right to apply to any court of competent jurisdiction for provisional relief, including pre-arbitral attachments or preliminary injunctions, and any such request shall not be deemed incompatible with this Agreement, nor a waiver of the right to have disputes submitted to arbitration as provided in this Agreement.\n\nNeither you nor Company may act as a class representative or private attorney general, nor participate as a member of a class of claimants, with respect to any Claim. Claims may not be arbitrated on a class or representative basis. The arbitrator can decide only your and/or Company's individual Claims. The arbitrator may not consolidate or join the claims of other persons or parties who may be similarly situated.\n\nIf any provision of this Section 15 is found to be invalid or unenforceable, then that specific provision shall be of no force and effect and shall be severed, but the remainder of this Section 15 shall continue in full force and effect. No waiver of any provision of this Section 15 will be effective or enforceable unless recorded in a writing signed by the party waiving such a right or requirement. Such a waiver shall not waive or affect any other portion of this Agreement. This Section 15 will survive the termination of your relationship with Company.\n\nTHIS SECTION LIMITS CERTAIN RIGHTS, INCLUDING THE RIGHT TO MAINTAIN A COURT ACTION OR TO HAVE A TRIAL BY JURY, THE RIGHT TO PARTICIPATE IN ANY FORM OF CLASS OR REPRESENTATIVE CLAIM AND THE RIGHT TO ENGAGE IN DISCOVERY EXCEPT AS PROVIDED IN AAA RULES OR THE RULES OF AN ADR PROVIDER.\n\nApp Store. When you download our Apps, you may do so through a third partys App Store. You acknowledge that the terms of this Agreement are between you and us and not with the owner or operator of the App Store (\"App Store Owner\"). As between the App Store Owner and us, we, and not the App Store Owner, are solely responsible for the Services, including the App, the Content, maintenance, support services, and warranty, and addressing any claims relating thereto (e.g., product liability, legal compliance or intellectual property infringement). In order to use the App, you must have access to a wireless network, and you agree to pay all fees associated with such access. You also agree to pay all fees (if any) charged by the App Store Owner in connection with the Services, including the App. The following applies to any App Store Sourced Application (as such term is defined in Section 3):\n\nYour use of the App Store Sourced Application must comply with the App Stores \"Terms of Service\" or equivalent terms.\n\nYou acknowledge that the App Store Owner has no obligation whatsoever to furnish any maintenance and support services with respect to the App Store Sourced Application.\n\nIn the event of any failure of the App Store Sourced Application to conform to any applicable warranty, you may notify the App Store Owner, and the App Store Owner will refund the purchase price for the App Store Sourced Application to you (if any) and to the maximum extent permitted by applicable law, the App Store Owner will have no other warranty obligation whatsoever with respect to the App Store Sourced Application. As between Company and the App Store Owner, any other claims, losses, liabilities, damages, costs or expenses attributable to any failure to conform to any warranty will be the sole responsibility of Company.\n\nYou and we acknowledge that, as between Company and the App Store Owner, the App Store Owner is not responsible for addressing any claims you have or any claims of any third party relating to the App Store Sourced Application or your possession and use of the App Store Sourced Application, including, but not limited to: (i) product liability claims; (ii) any claim that the App Store Sourced Application fails to conform to any applicable legal or regulatory requirement; and (iii) claims arising under consumer protection or similar legislation.\n\nYou and we acknowledge that, in the event of any third-party claim that the App Store Sourced Application or your possession and use of that App Store Sourced Application infringes that third partys intellectual property rights, as between Company and the App Store Owner, Company, not the App Store Owner, will be solely responsible for the investigation, defense, settlement and discharge of any such intellectual property infringement claim to the extent required by this Agreement.\n\nYou and we acknowledge and agree that the App Store Owner, and the App Store Owners subsidiaries, are third-party beneficiaries of this Agreement as related to your license of the App Store Sourced Application, and that, upon your acceptance of this Agreement, the App Store Owner will have the right (and will be deemed to have accepted the right) to enforce the terms of this Agreement as related to your license of the App Store Sourced Application against you as a third-party beneficiary thereof.\n\nWithout limiting any other terms in this Agreement, you must comply with all applicable third-party terms of agreement when using the App Store Sourced Application.\n\nYou represent and warrant that (i) you are not located in a country that is subject to a U.S. Government embargo, or that has been designated by the U.S. Government as a \"terrorist supporting\" country; and (ii) you are not listed on any U.S. Government list of prohibited or restricted parties.\n\nWaiver. No delay or omission by either party hereto to exercise any right or power occurring upon any noncompliance or default by the other party with respect to any of the terms of this Agreement shall impair any such right or power or be construed to be a waiver thereof. The terms and conditions of this Agreement may be waived or amended only in writing and only by the party that is entitled to the benefits of the term(s) or condition(s) being waived or amended. Unless stated otherwise, all remedies provided for in this Agreement shall be cumulative and in addition to and not in lieu of any other remedies available to either party at law, in equity, or otherwise.\n\nUnenforceability. If any provision of this Agreement or any word, phrase, clause, sentence, or other portion thereof should be held to be unenforceable or invalid for any reason, then such provision or portion thereof shall be modified or deleted in such manner as to render this Agreement as modified legal and enforceable to the maximum extent permitted under applicable laws.\n\nAuthority. The party entering into this Agreement hereby acknowledges, represents and warrants that he or she is expressly and duly authorized to enter into this Agreement and to legally bind said party to this Agreement.\n\nAssignment. This Agreement, and any rights and licenses granted hereunder, may not be transferred or assigned by you, but may be assigned by Company without restriction.\n\nEquitable Remedies. You acknowledge and agree that the Company would be irreparably damaged if the terms of this Agreement were not specifically enforced, and therefore you agree that we shall be entitled without bond, other security, or proof of damages, to appropriate equitable remedies with respect to breach of this Agreement, in addition to such other remedies as we may otherwise have available to us under applicable laws.\n\nNotice to California Users. Under California Civil Code Section 1789.3, users of the Services from California are entitled to the following specific consumer rights notice: The Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs may be contacted in writing at 1625 North Market Blvd., Suite N 112, Sacramento, CA 95834, or by telephone at (916) 445-1254 or (800) 952-5210.\n\nNotices. You may contact us by writing us at the address or email address listed below:\n\nhello@with.in\n\n3760 Motor Avenue Los Angeles, CA 90034\n\nThird-Party Beneficiaries. Our third-party licensors, including licensors of content, software or other technologies that we use to make available the Websites, Apps, Content and other Services, are intended third-party beneficiaries of this Agreement and will have the right to enforce the provisions of this Agreement with respect to their content, software or technologies as if they were original parties hereto.\n\nEntire Agreement. This Agreement, including the documents referenced in this Agreement, constitutes the entire agreement between you and the Company with respect to the use of the Websites, Apps and Content and supersedes any and all prior agreements between you and the Company relating to the Websites, Apps and Content.\n\nPLEASE PRINT A COPY OF THIS AGREEMENT FOR YOUR RECORDS AND PLEASE CHECK BACK FREQUENTLY FOR ANY CHANGES TO THIS AGREEMENT.\n\nCompany\nAbout\nCareers\nContact\nTerms\nPrivacy\nDiscover\nExperiences\nHow to Watch VR\nCreators\nHelp\nPlatforms\niOS\nAndroid\nDaydream\nGear VR\nOculus Rift\nPlayStationVR\nSteamVR\nViveport\nWebVR\nFacebook Twitter Instagram Medium YouTube STAY IN TOUCH", "Space Required": "212.5 MB"}



["5 stars\n50%\n4 stars\n14%\n3 stars\n10%\n2 stars\n10%\n1 star\n17%", "In5an1ty18 days ago\nDecent app\n\nBut I have yet to find a feature in this app, that requires full tracking. Its pretty hot where I live right now and the only time its comfortable to use my VR headset is at night with an open window. So you might see why I might wanna turn my lights off. So all I can do if I wanna watch a certain video in the dark, is check if its also available on YouTube. Which is a shame, because I like within.\n\nHelpful | 2", "NO-AJul 29 at 2:51 PM\nA lot for Free\n\nTons of really interesting VR short Films and experiences. The video quality could be better, but the experience itself isn't affected much.\n\nPersonal recommendation, try as first \"Tokyo Light Odyssey\" out. It's really amazing.\n\nHelpful | 2", "rabksajMay 12 at 10:30 AM\nNothing has changed\n\nI have had this app for a very long time and no real additional content has been added. I frequently visit this app and some videos are fine and interesting but most are just plain boring and everytime after a period of time when I use this app I notice just the same old videos which I have already seen.\n\nHelpful | 10", "ZollantMar 3 at 8:53 PM\nTrading Quality for Experience\n\nI won't harp on the quality of videos too much, as even Oculus's own video apps have terrible compression.\n\nI think this a great curated selection of experiences, especially for those who are new to VR. Unique stories and ideas being explored.\n\nApp controls function well, though I and another person who tried it think the auto turn on the joystick moves waaaay to fast. I appreciate the option, but it's too vertigo inducing right now as is.\n\nHelpful | 41", "cade34Jul 27 at 12:38 AM\n\nPhenomenal content. Please keep producing more.\n\nHelpful | 1", "Sfitz162May 26 at 5:37 AM\nSome great short Videos\n\nDoes have some great Videos hope the keep adding new videos\n\nHelpful | 2", "jeff.clagg.58May 9 at 8:33 AM\nWonderful\n\nFully immersive, a true VR experience\n\nHelpful | 7", "bazwynDec 24 at 2:25 AM\nMixed feelings\n\nA hub for 360 degree experiences, great. The variety is nice and being that I spend a lot of time disconnected from the internet in my line of work it's handy. That said, I've downloaded some of the independant experiences of comparable size in the past and for the same space, the experiences were trimmed down on content in some cases, and definately reduced in graphical quality. I don't know how this app functions in relation to the content on other headsets, but I would recommend the developer experiment with compression going forward, so as to either reduce the size for the content by a paltry amount and/or to improve the presentation during playback. I look forward to seeing this app grow along with the rest of the quest.\n\nHelpful | 37", "Arlander1Jul 23 at 1:51 AM\nDeleted no audio - will try later\n\nDeleted no audio - will try later.\nBeautiful interface search engine not\nresponsive will try again later.\n\nHelpful | 0", "maazomaazoNov 25 at 7:42 AM\nGroundbreaking in 2016. Now, not so much\n\nMuch of the content is dated and extremely low-resolution, whether downloaded to the device or not.\nMight be of interest to individuals brand-new to VR, but technology has advanced in the intervening years and there's no excuse for the quality of Within's video offering not to advance along with it.\nIt's the equivalent of watching old YouTube videos in 240x320 resolution on your 4k television; sure, you can, but why?\n\nHelpful | 28", "EpicGamer58Nov 26 at 2:48 PM\nIt won't go away.\n\nI tried to uninstall this app, as I wasn't happy with it and it was taking up a lot of space. But, when I got uninstall, it continued to stay there for days, and I can't open it or re-install it to try to uninstall it again. It's driving me nuts.\n\nHelpful | 22", "5tvnVrDec 29 at 6:08 AM\nA brilliant experience\n\nI absolutely love this app. Its such a new experience of cinema that I thoroughly enjoy and feel part of the universe set within. I can only hope they continue to upload content. Its phenomenal to just sit down and be immersed in for a short story. Thank you\n\nHelpful | 6", "MaartenZenJan 25 at 10:15 AM\nOne of my best apps\n\nEnriching videos! Sitting among joyful sufi musicians in Pakistan... Incredible.\n\nHelpful | 5", "somethingwitty64Jan 9 at 2:09 PM\nNot connecting to network\n\nI just got Within on my Oculus Quest. However, when I go to open the app, it tells me it does not detect my network. Everything else works. It wouldnt even let me go to the website on my browser. How can I fix this?\n\nHelpful | 1", "lallenloweDec 28 at 6:57 PM\nGreat platform for immersive video.\n\nEasy to use and convenient way of accessing very high quality 360 3D cinematic content. Not a game!\n\nHelpful | 3", "ShadowLord73Dec 6 at 8:50 PM\nIn My Personal Opinion\n\nHonestly, I personally didnt like it. I won't judge others for liking. Not every game is for everybody.\n\nHelpful | 1", "lucy.langford.9699Jul 11, 2019 at 7:37 PM\nNew to VR? Try this for sure.\n\nIf you have no clue where to find other online VR vids, aside from YouTube 360, this app is for you. The vids are often 3dofF, not 6dofF, but regardless there are still really cool things to discover sitting on your couch.\n\nWhen you open it you are presented with a Netflix like menu. You can flip through the available vids, or you can use the menu below to sort them into categories like animated, documentaries, music, etc.\n\nI found stuff I had seen like the award winning animated short Crow which was on rift and go, but not quest. I also tried a vid from the New York Times VR, and many more I want to try.\n\nA word of caution. If you have crappy wifi internet, then I suggest you download the content (each vid) if you find it is grainy. LEGO Batman was in low resolution and really crapy streaming, until I downloaded it. Then it was like Lego Batman was right beside me.\n\nMy only other issue, and this will be on an individual basis, the menu you use to flip feels like it switches too fast so I get a woosh feeling that makes me a little dizzy. If I could slow that down a bit I 100% would.\n\nAll in all, if you are new to VR, if you don't know side loading, and streaming via Virtual Desktop this is for you. If you aren't aware of where to find other content beyond YouTube 360 and the Oculus Broswer I'd give this a go.\n\nHelpful | 83", "gOtHiCm3rCySep 13, 2019 at 3:55 PM\nsurprised by the negativity\n\nIts surprises me how many people give negative comments about thid app. Firstly hey its free, secondly, to get the best out of this I recommend downloading the videos..... if like me you have a very subpar (6mb) internet bandwidth. It does make a BIG difference.... Why I speak positively about this app is.... they acyually DO let you download videos, unlike prime vr, which due to my bad bandwidth, became pretty pointless for me watching blurry blocky video.\nIt would be nice if all 360 videos were a little smaller (it feels like youre a fly watching humans... you know.... like being in an episode of land of the giants).... that in turn would also make the video much sharper. However I wont complain because for people like me with low bandwidth, this is probably the best option for getting a 360 movie experience. For that reason, and the fact its free, it gets a thumbs up for me\n\nHelpful | 8", "lex57ukrOct 19 at 1:32 PM\nInteresting\n\nDownloads take forever (and I am on 150 Mbps down). The app is interesting though. Definitely should try.\n\nHelpful | 3", "olemartinorgJul 11, 2019 at 2:27 PM\nTo all 1-star reviewers\n\nThis is not \"bad quality\" or something that \"should not have passed Oculus curation\". If 3DOF VR video is not exactly what you want it, go play something else. We all get to complain when things we want is not approved, but not here, and don't take it out on innocent Within. This app is great, offers lots of cool content not previously seen on the Quest. If you're having problems streaming, try downloading instead! Keep it civil and Quest on.\n\nHelpful | 272", "mwren64Oct 19 at 7:29 PM\nGreat videos!\n\nFun videos especially to show your friends and family and give them an immersive experience\n\nHelpful | 2", "oysterassassinAug 10, 2019 at 7:43 AM\nCant download\n\nI like the app and i love the concept. Unfortunately my wifi is too slow to stream so i must download. I selected 22 vids to download but they wont actually download unless the quest is on my head and connected. Take it iff and it stops downloading. Ive been downloading like this for days and only have about 4 vids. I really need it to continue downloading the queue even when i take it off. It will take me months at this rate to get the content i want to view. .\n\nHelpful | 9", "mw2357Aug 5, 2019 at 12:15 PM\nGreat for finding VR videos\n\nThis is the best source for VR videos I know. Easy to use and the quality of downloaded movies is great (I always use the Download-feature to get the best possible quality). I like that only professional and high-quality content is offered. Definitely my favourite free Oculus app.\n\nHelpful | 6", "dueddelJul 14, 2019 at 2:25 AM\nNice interface, nice videos\n\nI really don't understand some of the other ratings (1 out of 5 stars!? Why?).\n\nI can't complain at all (like many others calling the app just \"trash\" for no reason). I enjoyed two short movies so far and they both were great: LEGO Batman  Batmersive Experience and Asteroids (see https://www.with.in/watch/the-batmersive-experience and https://www.with.in/watch/asteroids).\n\nI like the simple and lean interface. No \"Schnick-Schnack\" as we would say in Germany.\n\nBy the way, The quality of the videos isn't worse than in the other VR video apps as far as I can say.\n\nAlso, I guess, none of the other VR video apps allows you to download the movies (Youtube 360, do you?). But, this one does!\nWithin even kinda encourages you to do so, the download button is right next to the streaming button. You can't not see it and the download is just a click away.\nThis is a great option! Since the Oculus is a portable device, offline-videos to show-off to your family and friends is the best way of introducing them into the world of VR.\n\nOh, wait. You get Within for free?  Alright, 5 stars! Nothing else to say.\n\nHelpful | 9", "VystreloKSep 4, 2019 at 11:51 PM\nMust be glitched\n\nDownloaded videos are actually really poor quality. It's a free app to watch some cool VR videos but I can't believe all the videos I've tried downloading are so blurry. This must be a glitch or it's only downloading the lowest quality versions.\n\nHelpful | 3", "tuismJul 15, 2019 at 5:35 AM\nGood, free content, limited to 360 vids\n\nSome of the best contents in VR 360 videos are on Within. You can see it all online, but being able to download the massive video files without having to stream is a great feature.\n\nThe downside is that they're 360 non-interactive videos, and a bit more compressed than they could have been, but I'm sure then each file might have exceeded 2Gb per. So it's all reasonable tradeoffs.\n\nHelpful | 1", "TheToothFairy1Aug 23, 2019 at 1:10 PM\nLow quality\n\nEven after downloaded the videos on the quest, they are grainy and horrible quality. Is there a way to fix this? It seems like none of the content was designed for this revolution. After download still looks like its from a 1980 vhs\n\nHelpful | 3", "poetic_is_hereJul 12, 2019 at 9:41 AM\n90p Quality\n\nThe quality of these videos are not 1080, not 720, and not even 360. How are the videos on the Quest version less than the Go? And yes, I'm talking about the downloaded videos. I don't ever stream them.\n\nHelpful | 18", "Archon05KnightAug 12, 2019 at 8:54 PM\nLots of fun videos but trade offs\n\nThe app has alot of fun videos. I gave it two stars because I had to download the videos for seamless play back (which is not the issue) it's the fact that unless I missed something you have to stay in the app for the videos to download it seemed like if you watched a downloaded video the download stopped.\n\nHelpful | 0", "PalomedesJul 11, 2019 at 1:24 PM\nEssential App\n\nI am so glad this experience is now on the quest. This is an essential download for anyone like me who enjoys watching VR documentaries and experiences.\n\nHelpful | 14", "AgniusmJul 13, 2019 at 2:02 PM\n\nPROS:\nContent is good, many genres to choose, from comedy to horror\nRegularly updated\nNo ads\nFree\n\nCONS:\nNot so much content\nBad video quality\n\nHelpful | 13", "naterich96Jul 14, 2019 at 3:26 PM\nCool app\n\nThis is pretty neat and I was very happy to see The Legend of the Crow available through this platform. Graphics do leave a little bit to be desired. Anybody know if theres recommendations on settings to optimize this app?\n\nHelpful | 0", "ojuuujoJul 17, 2019 at 11:34 AM\nQuality: 0 - Clearness: 0\n\nAfter purchasing Within you are presented with a very sharp main menu in which you can choose different Videos to Play.\n\nI have started several videos, as for the quality you can imagine sitting in a cinema and watching your Movie in 480p... none of the offered Videos are in High Quality, you are feeling like you are in a very poor quality movie; the pixel literally dancing around you.\n\nHelpful | 10", "SuptruckersJul 14, 2019 at 8:34 PM\nTo All the kids who ae talking trash\n\nShut up go cry to youre mommys and they will call the developers and whine that my son isnt getting a good video quality these people worked hard on this cut then some slack. Also youre moms names are Karen, Vanessa and Jessica probably sipping on their lattes and saying OMG Youre Right Vanessa!\nKent IS his son\n\nHelpful | 4", "ioculusquestJul 13, 2019 at 2:38 PM\nRubbish\n\nPeople giving 4 and 5 reviews ate idiots. Looks like they have a problem with their eye sight. Yes the videos are all crap quality as others have said. Even if you download. Stop misleading others with your stupid reviews\n\nHelpful | 9", "Big_Daddy_KrakenJul 14, 2019 at 11:05 AM\nAmazing Experiences - 3 DOF -\n\nThis app is incredible. #1 it is free and provides a great deal of content and unique experiences.\n\nPeople may be upset because it only provides 3DOF ...the same as the GO or your iPhone; however there is a lot of content from the GO that I can not WAIT to see on the quest..I understand that they will not have 6DOF and I am 100% ok with that!\n\nThis is great to use while sitting down on a plane, in the bedroom or when your simply spent and don't want to be running around jumping up and down. Great content, its for free and it's simply not fair to compare this app to those designed with 6 DOF.\n\nWould buy again and recommend to everybody who has a quest. If you don't enjoy the content you can simply get your money back ANYTIME.\n\nHelpful | 3", "BobbiHereJul 18, 2019 at 11:14 PM\nAbsolutely awesome !\n\nTry for yourself! Its a great experience. I didnt know what to expect.\n\nPretty cool riding in the Batmobile with Batman  LOL. Educational experience and then, took short ride in air balloon.\n\nLooking forward to the collection growing. Thank you.\n\nHelpful | 3", "JWheezyJul 21, 2019 at 9:47 AM\nAnimated and Experimental Are Amazing\n\nThe experiences that focus on more live action realistic video suffer and downloaded or not often just arent sharp enough to be fully enjoyed. On the contrary there are several awesome animated and experimental art and sounds experiments that knock it out of the park. If you havent tried Crow or Inside the Sound (preferably with headphones) you owe it another try. WITHIN is fun!\n\nHelpful | 2", "fthahimJul 14, 2019 at 10:59 AM\nNot up to \"Quest standards\"\n\nThis app is a cool idea but the video quality is crap. I have also downloaded the video as suggested by some and do not see the difference .\nThe fact that Oculus approved this app and have rejected much better quality apps from other developers shows that they really don't care about quality apps as they suggest . You can imaging a first time buyer of the quest downloading this app and watching a video and thinking that is how bad the VR experience is going to be and get disheartened. Not good Oculus , not good\n\nHelpful | 3", "andyphillips99Jul 13, 2019 at 3:54 AM\nFree immersive video\n\nNo idea why people are downvoting this, its a free app with very polished and inspirational videos - well worth downloading for some contemplation time\n\nHelpful | 5", "OogieBoogie0000Jul 13, 2019 at 12:50 PM\nSuper great if you are >20y old\n\nWithin was the first VR experience I had 3y ago on my phone. The video of U2 and some horror hospital story blew my mind. Do love the ambience those videos create. But it is no boom-splash-peng action in it. So maybe nothing if you looking for Robo Recall or Face your fears . Within for me 5 stars anytime!\n\nHelpful | 1", "BioluminescentJul 15, 2019 at 5:08 AM\nGreat but crap\n\nI love the idea and I love the subject matter but what is the reason for such resolution? Everything from the quality of the menu text to the actual content is so so soft and pixelated.\nIt they just fixed the resolution it would get 4-5 stars.\n\nHelpful | 8", "sebrkJul 21, 2019 at 10:29 AM\nJust great!\n\nJust hovering around in the menu of this excelled experience is with it alone. I see great potential while VR movies are getting more and more.\n\nHelpful | 3", "PixaniJul 29, 2019 at 7:25 PM\nStill a Long Way Off\n\nI understand this is free but a great deal of improvement can be done to stand alongside true Quest quality content and be counted as of equal value\n\nHelpful | 3", "arleigh.anchetaJul 31, 2019 at 7:39 AM\n\nShould have better way of announcing the live venues !\n\nHelpful | 0", "DAX_QcAug 30, 2019 at 10:49 AM\nMeh\n\nNot much content\n\nHelpful | 0", "Godislove4uJul 11, 2019 at 9:25 PM\nFree but cool\n\nA better version on the quest.I recall being able to move freely in the gearvr.\n\nHelpful | 3", "DJay_Jul 13, 2019 at 7:39 AM\nBad Video Quality\n\nIdea is good but the videos have a low quality so the experience is gone. Could be a great App but with low quality I cant recommend.\n\nHelpful | 6", "JaksaOculusAug 12, 2019 at 5:59 AM\n\nFully sick bruh.\n\nHelpful | 1", "dingofoxvrfoxNov 26 at 1:26 AM\nNot bad but the video quality\n\nThe video quality is awe full\n\nHelpful | 0", "welshboy1971Jul 11, 2019 at 1:20 PM\nRubbish\n\nSome how this garbage is able to pass the Oculus quality curation process .. laughable and quite sad when they turn away far better products. Avoid or it will turn you away from VR\n\nHelpful | 26", "PoconoPeteAug 3, 2019 at 2:57 AM\nElton John\n\nPlease get the EltonJohn VR video on here\n\nHelpful | 0", "HazeVRJul 30, 2019 at 10:29 AM\nDont waste your time\n\nVery boring and bland stories, and quality of the screen is terrible\n\nHelpful | 1", "sebastian.kurz.583Jul 11, 2019 at 11:49 PM\nBoring\n\nThink this shall fill the gap of not having those VR snippets on the quest. Nevertheless everything else than exciting as already well known over the years.\n\nHelpful | 3", "GayDukeNukemJul 11, 2019 at 6:48 PM\nYoure a fool if u think its good\n\nReally? Seriously??? Theres someone out there whos tried this app and they dont see any of the huge problems and we should just shut up?\n\nSomeone needs to check into an insane assylum!\n\nHelpful | 16", "JrSaintJul 11, 2019 at 1:55 PM\nReally???\n\nI get that its free, but free crap is still crap. Facebook should maintain its curating standards across the board!!\n\nHelpful | 16", "Paper-WillJul 14, 2019 at 6:54 AM\nDoes what it says.\n\nLots of videos. Dunno why reviews are low.\n\nHelpful | 2", "marie.watkins.902Jul 14, 2019 at 12:46 AM\n\nThe best app for watching videos in vr, I love it\n\nHelpful | 1", "KillahKonceptZJul 11, 2019 at 2:17 PM\nNot that great\n\nI expect better out of a Quest app\n\nHelpful | 15", "SirFahad_Jul 11, 2019 at 12:18 PM\nGreat curation oculus\n\nTrash\n\nHelpful | 30", "Ender772Jul 18, 2019 at 3:23 PM\nHorrible\n\nQuality is bad...really really bad.\n\nHelpful | 1"]